#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;

	Организация = Параметры.Организация;
	Склад       = Параметры.Склад;
	Товар       = Параметры.Товар;

	//@skip-check bsl-legacy-check-string-literal
	ТоварРодитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Товар, "Родитель");
	Производитель = Справочники.Производители.НайтиПоНаименованию(Строка(Организация), Истина);

	Если Не ЗначениеЗаполнено(Производитель) Тогда
		ОбщегоНазначения.СообщитьПользователю(Строка(Организация) + " не является производителем продукции.",,,,Отказ);
	КонецЕсли;

	Если Параметры.Склад = AMS_ВызовСервера.Цех4() Тогда
		ФлаконыАМС = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.AMS_Константы.ФлаконыАМС");
		СписокГрупп.Добавить(ФлаконыАМС.Значение);
	
	Иначе
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ВидНоменклатуры", мср.СоответствиеЦехВидНоменклатуры().Получить(Склад));
		Запрос.УстановитьПараметр("Производитель", Производитель);
		Запрос.УстановитьПараметр("НоваяПродукция", Справочники.Номенклатура.НайтиПоКоду("01-0001311"));
		Запрос.УстановитьПараметр("СегментыПродукцияКомпании", AMS_ВызовСервера.СегментыНоменклатурыПродукцияКомпании());

		Запрос.Текст =
		"ВЫБРАТЬ
		|	н.Родитель КАК Родитель
		|ИЗ
		|	РегистрСведений.НоменклатураСегмента КАК т
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК н
		|		ПО т.Номенклатура = н.Ссылка
		|ГДЕ
		|	т.Сегмент = &СегментыПродукцияКомпании
		|	И н.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
		|	И н.ВидНоменклатуры В (&ВидНоменклатуры)
		|	И НЕ н.Родитель = &НоваяПродукция
		|	И н.Производитель = &Производитель
		|
		|СГРУППИРОВАТЬ ПО
		|	н.Родитель
		|
		|УПОРЯДОЧИТЬ ПО
		|	н.Родитель.Наименование";

		СписокГрупп.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Родитель"));

		Нашел = Ложь;
		НомерСтроки    = 0;
		Для Каждого Элем Из СписокГрупп Цикл
			НомерСтроки = НомерСтроки + 1;
			Если Элем.Значение = ТоварРодитель Тогда
				Нашел = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;

		Если Нашел Тогда
			Элементы.СписокГрупп.ТекущаяСтрока = НомерСтроки - 1;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокГрупп

&НаКлиенте
Процедура СписокГруппПриАктивизацииСтроки(Элемент)
	ТекущиеДанные = Элементы.СписокГрупп.ТекущиеДанные;

	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	НовРодитель = ТекущиеДанные.Значение;

	Если Родитель <> НовРодитель Тогда
		Родитель = НовРодитель;
		ПодключитьОбработчикОжидания("ЗаполнитьТаблицуНоменклатурыПриАктивизацииСтроки", 0.1, Истина);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаНоменклатуры

&НаКлиенте
Процедура ТаблицаНоменклатурыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ЗакрытьЭтуФорму();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	ЗакрытьЭтуФорму();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьТаблицуНоменклатурыПриАктивизацииСтроки()
	ЗаполнитьТаблицуНоменклатуры();
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьТаблицуНоменклатуры()
	Запрос = Новый Запрос;

	Если Склад = AMS_ВызовСервера.Цех4() Тогда
		ВидНоменклатуры = AMS_ВызовСервера.ВидНоменклатурыМатериал();
	Иначе
		ВидНоменклатуры = мср.СоответствиеЦехВидНоменклатуры().Получить(Склад)
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Производитель", Производитель);
	Запрос.УстановитьПараметр("Родитель", Родитель);
	Запрос.УстановитьПараметр("ВидНоменклатуры", ВидНоменклатуры);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Ссылка КАК Номенклатура,
	|	т._Фабрикат КАК Фабрикат
	|ПОМЕСТИТЬ тов
	|ИЗ
	|	Справочник.Номенклатура КАК т
	|ГДЕ
	|	НЕ т.ПометкаУдаления
	|	И НЕ т.ЭтоГруппа
	|	И т.Родитель = &Родитель
	|	И т.ВидНоменклатуры В (&ВидНоменклатуры)
	|	И т.Производитель = &Производитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Владелец КАК Номенклатура,
	|	т.Ссылка КАК СпецификацияПродукции
	|ПОМЕСТИТЬ прод
	|ИЗ
	|	Справочник._ВариантыСпецификацийНоменклатуры КАК т
	|ГДЕ
	|	НЕ т.ПометкаУдаления
	|	И т.Статус = ЗНАЧЕНИЕ(Перечисление._СтатусыСпецификаций.Действует)
	|	И т.Основной
	|	И т.Владелец В
	|			(ВЫБРАТЬ
	|				т.Номенклатура КАК Номенклатура
	|			ИЗ
	|				тов КАК т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Владелец КАК Фабрикат,
	|	т.Ссылка КАК СпецификацияФабриката
	|ПОМЕСТИТЬ фабр
	|ИЗ
	|	Справочник._ВариантыСпецификацийНоменклатуры КАК т
	|ГДЕ
	|	НЕ т.ПометкаУдаления
	|	И т.Статус = ЗНАЧЕНИЕ(Перечисление._СтатусыСпецификаций.Действует)
	|	И т.Основной
	|	И т.Владелец В
	|			(ВЫБРАТЬ
	|				тов.Фабрикат КАК Фабрикат
	|			ИЗ
	|				тов КАК тов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тов.Номенклатура КАК Номенклатура,
	|	прод.СпецификацияПродукции КАК СпецификацияПродукции,
	|	тов.Фабрикат КАК Фабрикат,
	|	фабр.СпецификацияФабриката КАК СпецификацияФабриката
	|ИЗ
	|	тов КАК тов
	|		ЛЕВОЕ СОЕДИНЕНИЕ прод КАК прод
	|		ПО тов.Номенклатура = прод.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ фабр КАК фабр
	|		ПО тов.Фабрикат = фабр.Фабрикат";

	Результат = Запрос.Выполнить();

	Табл = РеквизитФормыВЗначение("ТаблицаНоменклатуры");

	Табл.Очистить();

	Выборка = Результат.Выбрать();

	Индекс      = 0;
	НомерСтроки = 0;
	Пока Выборка.Следующий() Цикл
		НомерСтроки = НомерСтроки + 1;

		Стр = Табл.Добавить();
		ЗаполнитьЗначенияСвойств(Стр, Выборка);
		Стр.НомерСтроки = НомерСтроки;

		Если Стр.Номенклатура = Товар Тогда
			Индекс = НомерСтроки - 1;
		КонецЕсли;
	КонецЦикла;

	ЗначениеВРеквизитФормы(Табл, "ТаблицаНоменклатуры");

	Элементы.ТаблицаНоменклатуры.ТекущаяСтрока = Индекс;
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьЭтуФорму()
	Стр = Элементы.ТаблицаНоменклатуры.ТекущиеДанные;

	Если Стр = Неопределено Тогда
		Закрыть();

	Иначе
		Отказ = Ложь;

		Данные = Новый Структура;
		Данные.Вставить("НомерСтроки", Стр.НомерСтроки);
		Данные.Вставить("Номенклатура", Стр.Номенклатура);
		Данные.Вставить("СпецификацияПродукции", Стр.СпецификацияПродукции);
		Данные.Вставить("Фабрикат", Стр.Фабрикат);
		Данные.Вставить("СпецификацияФабриката", Стр.СпецификацияФабриката);

		ВыполнитьПроверкуДанныхВыбора(Данные, Отказ);

		Если Не Отказ Тогда
			Закрыть(Данные);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПроверкуДанныхВыбора(Данные, Отказ)
	Если Не ЗначениеЗаполнено(Данные.СпецификацияПродукции) Тогда
		Текст = НСтр("ru = 'Для выбранной продукции ""%НазваниеТовара%"" не назначена спецификация.'");
		Текст = СтрЗаменить(Текст, "%НазваниеТовара%", Данные.Номенклатура);
		Поле  = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ТаблицаНоменклатуры", Данные.НомерСтроки,
			"СпецификацияПродукции");

		ОбщегоНазначения.СообщитьПользователю(Текст, , Поле, , Отказ);
	КонецЕсли; 	
	
	//@skip-check bsl-legacy-check-string-literal
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Данные.Номенклатура, "_ИспользуетФабрикат") Тогда
		Если Не ЗначениеЗаполнено(Данные.Фабрикат) Тогда
			Текст = НСтр("ru = 'Для выбранной продукции ""%НазваниеТовара%"" не назначен фабрикат.'");
			Текст = СтрЗаменить(Текст, "%НазваниеТовара%", Данные.Номенклатура);
			Поле  = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ТаблицаНоменклатуры", Данные.НомерСтроки,
				"Фабрикат");

			ОбщегоНазначения.СообщитьПользователю(Текст, , Поле, , Отказ);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти