#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПериодОтчета.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
	
	ПериодОтчета.ДатаОкончания = КонецМесяца(НачалоМесяца(ТекущаяДатаСеанса()) - 3600);
	ПериодОтчета.ДатаНачала    = НачалоМесяца(ПериодОтчета.ДатаОкончания - 3600*24*63);
	
	AX = 2; AY = 1.5; AZ = 1; CZ = 0.5; Кфц_MIN_MAX = 4;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьТаблицуЗапасов();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьЗапасыВРегистрТоварныеОграничения();
	
	Оповестить("Запись_РегистрТоварныеОграничения");
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ЗаполнитьТаблицуЗапасов();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицуЗапасов()
	НомерСтроки = 0;

	Товары.Очистить();
	
 	ПараметрыЗапроса = Новый Структура();
	
	ПараметрыЗапроса.Вставить("НачалоПериода", ПериодОтчета.ДатаНачала);
	ПараметрыЗапроса.Вставить("КонецПериода", ПериодОтчета.ДатаОкончания);
	ПараметрыЗапроса.Вставить("AX", AX);
	ПараметрыЗапроса.Вставить("AY", AY);
	ПараметрыЗапроса.Вставить("AZ", AZ);
	ПараметрыЗапроса.Вставить("CZ", CZ);
	
	Табл = AMS_Сервер.ПолучитьДанныеДляРасчетаТоварныхЗапасов(ПараметрыЗапроса);
	
	Табл.Сортировать("Сумма Убыв");
	
	Для Каждого Стр Из Табл Цикл
		НомерСтроки = НомерСтроки + 1;
		
		НовСтр = Товары.Добавить();
		НовСтр.НомерСтроки  = НомерСтроки;
		НовСтр.Артикул      = Стр.Артикул;		
		НовСтр.Номенклатура = Стр.Номенклатура;
		НовСтр.MAX          = Стр.ОстФактУпак;
		НовСтр.MIN          = НовСтр.MAX / Кфц_MIN_MAX;
		
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьЗапасыВРегистрТоварныеОграничения()
	УстановитьПривилегированныйРежим(Истина);

	Склад = AMS_ВызовСервера.СкладПродукции();
	
	Попытка
	
	НачатьТранзакцию();
	
	МенеджерЗаписи = РегистрыСведений.ТоварныеОграничения.СоздатьМенеджерЗаписи();
	Для Каждого Стр Из Товары Цикл
		Номенклатура = Стр.Номенклатура;
		Кфц = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "КоэффициентЕдиницыДляОтчетов");
		
		МенеджерЗаписи.Склад        = Склад;
		МенеджерЗаписи.Номенклатура = Номенклатура;
		
		МенеджерЗаписи.Прочитать();
		
		Если Не МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.Склад        = Склад;
			МенеджерЗаписи.Номенклатура = Номенклатура;
		КонецЕсли;
 
        МенеджерЗаписи.МинимальноеКоличествоЗапаса            = Стр.MIN * Кфц;
        МенеджерЗаписи.МаксимальноеКоличествоЗапаса           = Стр.MAX * Кфц;
        МенеджерЗаписи.МетодОбеспеченияПотребностей           = Перечисления.МетодыОбеспеченияПотребностей.ПоддержаниеЗапасаМинМакс;
        МенеджерЗаписи.ОбеспечениеЗаказовПриПоддержанииЗапаса = Перечисления.ОбеспечениеЗаказовПриПоддержанииЗапаса.ЗаСчетЗапасов;
		    
		МенеджерЗаписи.Записать(Истина);
    КонецЦикла;				
			
	ЗафиксироватьТранзакцию();  
	    
    Исключение
		ОтменитьТранзакцию();
			  
		ТекстОшибки = НСтр("ru = 'AMS_Сводка.ФормаТоварныеЗапасы.Ошибка: Не удалось записать MIN и MAX запасы'");
		ЗаписьЖурналаРегистрации(ТекстОшибки, УровеньЖурналаРегистрации.Ошибка,,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
    КонецПопытки;
КонецПроцедуры

#КонецОбласти

