#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
//	Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СкладПродукции"));
//    Параметр.Значение = AMS_ВызовСервера.СкладПродукции();
//    Параметр.Использование = Истина;
//
//	Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Дата"));
//    Параметр.Значение = ТекущаяДатаСеанса();
//    Параметр.Использование = Истина;
КонецПроцедуры

#КонецОбласти

#КонецЕсли