#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	//Вывести время отчета и автора в колонтитул
	Колонтитул = ДокументРезультат.НижнийКолонтитул;
	Колонтитул.ТекстСлева  = Формат(ТекущаяДатаСеанса(),"ДФ=""дд ММММ гггг 'г.' ЧЧ:мм""");
	Колонтитул.ТекстСправа = Пользователи.ТекущийПользователь();
	Колонтитул.Выводить    = Истина;
КонецПроцедуры

#КонецОбласти

#КонецЕсли