#Область ОписаниеПеременных

&НаКлиенте
Перем КэшированныеЗначения;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	ПолучитьДокументыПроизводстваФабриката();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыФабрикаты

&НаКлиенте
Процедура ФабрикатыПриИзменении(Элемент)
	Стр = Элементы.Фабрикаты.ТекущиеДанные;

	Если Стр = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Стр.Номенклатура) И ЗначениеЗаполнено(Стр.Спецификация) И Стр.Количество > 0 Тогда
		ЗаполнитьТоварыПоСпецификации();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДокументыПроизводства

&НаКлиенте
Процедура ДокументыПроизводстваВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;

	Стр = Элемент.ТекущиеДанные;

	Если Стр = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ПоказатьЗначение(, Стр.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПроизводстваПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("ДокументыПроизводстваПриАктивизацииСтрокиОбработчикОжидания", 0.1, Истина);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТоварыПоСпецификации()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Фабрикаты", Объект.Фабрикаты.Выгрузить());

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.Спецификация КАК Спецификация,
	|	т.Количество КАК КоличествоФабриката
	|ПОМЕСТИТЬ Фабрикаты
	|ИЗ
	|	&Фабрикаты КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Фабрикаты.Номенклатура КАК Фабрикат,
	|	Фабрикаты.КоличествоФабриката КАК КоличествоФабриката,
	|	СпецТовары.Номенклатура КАК Номенклатура,
	|	СпецТовары.Количество * Фабрикаты.КоличествоФабриката / СпецТовары.Ссылка.Количество КАК КоличествоМатериала
	|ПОМЕСТИТЬ Материалы
	|ИЗ
	|	Фабрикаты КАК Фабрикаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры.Товары КАК СпецТовары
	|		ПО Фабрикаты.Спецификация = СпецТовары.Ссылка.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Материалы.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(Закупки.Период) КАК Период
	|ПОМЕСТИТЬ ПоследЗакупка
	|ИЗ
	|	Материалы КАК Материалы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Закупки КАК Закупки
	|		ПО Материалы.Номенклатура = Закупки.АналитикаУчетаНоменклатуры.Номенклатура
	|СГРУППИРОВАТЬ ПО
	|	Материалы.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоследЗакупка.Номенклатура КАК Номенклатура,
	|	Закупки.Сумма / Закупки.Количество КАК Цена
	|ПОМЕСТИТЬ ЦеныМат
	|ИЗ
	|	ПоследЗакупка КАК ПоследЗакупка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Закупки КАК Закупки
	|		ПО ПоследЗакупка.Номенклатура = Закупки.АналитикаУчетаНоменклатуры.Номенклатура
	|		И ПоследЗакупка.Период = Закупки.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Материалы.Фабрикат КАК Фабрикат,
	|	СУММА(ЦеныМат.Цена * Материалы.КоличествоМатериала) КАК СуммаМатериала
	|ПОМЕСТИТЬ СуммаМат
	|ИЗ
	|	Материалы КАК Материалы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЦеныМат КАК ЦеныМат
	|		ПО Материалы.Номенклатура = ЦеныМат.Номенклатура
	|СГРУППИРОВАТЬ ПО
	|	Материалы.Фабрикат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Фабрикаты.Номенклатура КАК Номенклатура,
	|	Фабрикаты.Спецификация КАК Спецификация,
	|	Фабрикаты.КоличествоФабриката КАК Количество,
	|	СуммаМат.СуммаМатериала / Фабрикаты.КоличествоФабриката КАК Цена
	|ИЗ
	|	Фабрикаты КАК Фабрикаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ СуммаМат КАК СуммаМат
	|		ПО Фабрикаты.Номенклатура = СуммаМат.Фабрикат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Материалы.Фабрикат КАК Фабрикат,
	|	Материалы.Номенклатура КАК Номенклатура,
	|	Материалы.КоличествоМатериала КАК Количество,
	|	ЦеныМат.Цена КАК Цена
	|ИЗ
	|	Материалы КАК Материалы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЦеныМат КАК ЦеныМат
	|		ПО Материалы.Номенклатура = ЦеныМат.Номенклатура";
	
	Пакет = Запрос.ВыполнитьПакет();
	Объект.Фабрикаты.Загрузить(Пакет[5].Выгрузить());
	Объект.МатериалыФабриката.Загрузить(Пакет[6].Выгрузить());
КонецПроцедуры

&НаСервере
Процедура ПолучитьДокументыПроизводстваФабриката()
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Табл = AMS_Сервер.ПолучитьДокументыПроизводстваФабриката(Объект.Ссылка);
		ДокументыПроизводства.Загрузить(Табл);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПроизводстваПриАктивизацииСтрокиОбработчикОжидания()
	ТекущиеДанные = Элементы.ДокументыПроизводства.ТекущиеДанные;

	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьТоварыДокументыПроизводства(ТекущиеДанные.Ссылка, ТекущиеДанные.Операция);
КонецПроцедуры

&НаСервере
Процедура ПоказатьТоварыДокументыПроизводства(Ссылка, Операция)
	ИмяСсылка = Ссылка.Метаданные().Имя;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка); 
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.НомерСтроки КАК НомерСтроки,
	|	т.Номенклатура КАК Номенклатура,
	|	т.Номенклатура.ЕдиницаИзмерения КАК Ед,
	|	т.Количество КАК Количество,
	|	т.Количество / т.Номенклатура.КоэффициентЕдиницыДляОтчетов КАК КоличествоУпаковок,
	|	ВЫБОР
	|		КОГДА т.Номенклатура._Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА т.Номенклатура.ЕдиницаДляОтчетов
	|		ИНАЧЕ т.Номенклатура._Упаковка
	|	КОНЕЦ КАК Упаковка
	|ИЗ
	|	Документ." + ИмяСсылка + ".Товары КАК т
	|ГДЕ
	|	т.Ссылка = &Ссылка"; 
	
	ДокументыПроизводстваТовары.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

#КонецОбласти
