#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ЗаписатьДокументСписаниеНедостачТоваров(Отказ, РежимЗаписи);
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Организация = AMS_ВызовСервера.ПолучитьОсновнуюОрганизацию();
	Менеджер    = ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	СписаниеНедостачТоваров = Документы.СписаниеНедостачТоваров.ПустаяСсылка();
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	док.Дата КАК Период,
	|	док.Партнер КАК Партнер,
	|	док.Контрагент КАК Контрагент,
	|	тов.Номенклатура КАК Номенклатура,
	|	тов.Количество КАК Количество
	|ИЗ
	|	Документ._ПоступлениеИзПереработки КАК док
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ._ПоступлениеИзПереработки.Товары КАК тов
	|		ПО док.Ссылка = тов.Ссылка
	|ГДЕ
	|	док.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	тов.НомерСтроки";
	Рез = Запрос.Выполнить();

	Если Рез.Пустой() Тогда
		Возврат;
	КонецЕсли;

	Движения._ТоварыПереданные.Записывать = Истина;
	Движения._ТоварыПереданные.Загрузить(Рез.Выгрузить());
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьДокументСписаниеНедостачТоваров(Отказ, РежимЗаписи)
	КолСтр = Товары.Количество();

	Если КолСтр = 0 Тогда
		Если ЗначениеЗаполнено(СписаниеНедостачТоваров) Тогда
			мср.УстановитьПометкуУдаленияДокументу(СписаниеНедостачТоваров, Истина, Отказ);
			СписаниеНедостачТоваров = Неопределено;
		КонецЕсли;

	Иначе
		Если Не ЗначениеЗаполнено(СписаниеНедостачТоваров) Тогда
			Док = Документы.СписаниеНедостачТоваров.СоздатьДокумент();

		Иначе
			Док = СписаниеНедостачТоваров.ПолучитьОбъект();
			
			//Проверить пометку удаления
			Если Док.ПометкаУдаления <> ПометкаУдаления Тогда
				мср.УстановитьПометкуУдаленияДокументу(Док, ПометкаУдаления, Отказ);

				Если ПометкаУдаления Тогда
					Возврат;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		//ЗАПОЛНИТЬ ШАПКУ
		Док.Дата                              = Дата + 60;
		Док.АналитикаРасходов                 = Партнер;
		Док.Комментарий                       = Комментарий;
		Док.Организация                       = Организация;
		Док.Ответственный                     = Менеджер;
		Док.Подразделение                     = Подразделение;
		Док.Склад                             = Склад;
		Док.СтатьяРасходов                    = ПланыВидовХарактеристик.СтатьиРасходов.НайтиПоКоду("01-000025");
		Док.ВидЦены                           = Справочники.ВидыЦен.НайтиПоНаименованию("Цена поступления", Истина);
		Док.ИсточникИнформацииОЦенахДляПечати = Перечисления.ИсточникиИнформацииОЦенахДляПечати.ПоВидуЦен;
		ОтветственныеЛицаСервер.ПриИзмененииСвязанныхРеквизитовДокумента(Док);

		Док.Товары.Загрузить(Товары.Выгрузить());

		мср.ЗаписатьДокумент(Док, РежимЗаписи, Отказ);
		СписаниеНедостачТоваров = Док.Ссылка;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецЕсли