
#Область ОписаниеПеременных

&НаКлиенте
Перем МеСтатус;

&НаКлиенте
Перем МеМодифицированность;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Дата = мср.ПолучитьРабочийДень(1);
	КонецЕсли;
	
	Элементы.Организация.СписокВыбора.Добавить(AMS_ВызовСервера.ПолучитьОсновнуюОрганизацию());
	
	Элементы.СтрТЧ.Видимость = AMS_ВызовСервера.ЭтоKhors();

	УстановитьУсловноеОформление();

	ДоставкаТоваровКлиентСервер.ЗаполнитьСписокВыбораПоляВремени(Элементы.ЗаданияВремяЗагрузкиФакт);
	ДоставкаТоваровКлиентСервер.ЗаполнитьСписокВыбораПоляВремени(Элементы.ЗаданияОтправлено);

	ПоменятьЗаказыНаРеализации();
	ПоказатьТранспортКЗагрузке();
	ПоказатьДокументыКЗагрузке();
	ПоказатьЗадания();
	ПоказатьДополнительноеВремя();
	ПоказатьНарушенияДоговора();
	ПоказатьПретензии();

	НастройкаФормы();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "Запись_ТранспортноеСредство" Тогда
		ПоказатьТранспортКЗагрузке();

	ИначеЕсли ИмяСобытия = "Запись_ЗаказКлиента" Или ИмяСобытия = "Запись_РеализацияТоваровУслуг" 
		Или ИмяСобытия = "Запись_ПередачаТоваровХранителю" Или ИмяСобытия = "Запись_AMS_ПередачаВПереработку" 
		Или ИмяСобытия = "Запись_ЗаказПоставщику" Или ИмяСобытия = "Запись_ЗаявкаНаВозвратТоваровОтКлиента" Тогда
		
		ДатаОтгрузки = ПолучитьДатуОтгрузки(ИмяСобытия, Источник);
	
		Если ДеньГода(Объект.Дата) = ДеньГода(ДатаОтгрузки) Тогда
			Прочитать();
			ПоказатьДокументыКЗагрузке();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Запись_ЛогистическийЛист", ПараметрыЗаписи, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.Статус = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление._СтатусыДоставки.План") Тогда
		Если Объект.Проведен Тогда
			ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения;
		Иначе
			ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Запись;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ПоказатьДокументыКЗагрузке();
КонецПроцедуры

&НаКлиенте
Процедура СтатусНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	МеСтатус             = Объект.Статус;
	МеМодифицированность = Модифицированность;
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	Если Объект.Статус = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление._СтатусыДоставки.Погрузка") Тогда
		Отказ = Ложь;
	
		ПроверитьРаспоряженияПогрузка(Отказ);
	
		Если Отказ Тогда
			Объект.Статус = МеСтатус;
	
			Если Не МеМодифицированность Тогда
				Объект.Статус = МеСтатус;
				Модифицированность = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
		
	НастройкаФормы();
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница = Элементы.СтрДоставка Тогда
		ПоказатьТранспортКЗагрузке();
		ПоказатьДокументыКЗагрузке();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТранспорт

&НаКлиенте
Процедура ТранспортВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если AMS_ВызовСервера.ДоступнаРоль("AMS_Диспетчер") Тогда
		Если Поле.Имя = "ТранспортМетка" Тогда
			Возврат;
		КонецЕсли;

		Стр = ТекущийЭлемент.ТекущиеДанные;

		Если Стр.Метка Тогда
			СтандартнаяОбработка = Ложь;
			ОткрытьФормуПодборДокументовВТранспорт(Новый Структура("Авто, УПД",	Стр.ТранспортноеСредство, Неопределено));
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТранспортМеткаПриИзменении(Элемент)
	Стр = ТекущийЭлемент.ТекущиеДанные;

	ТранспортноеСредство = Стр.ТранспортноеСредство;

	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, ТранспортноеСредство);
	ПоказатьВопрос(Оповещение, "Транспортному средству " + ТранспортноеСредство
		+ " будет установлен стасут ""Не работает"". Продолжить выполнение операции?", РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРаспоряжения

&НаКлиенте
Процедура РаспоряженияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если AMS_ВызовСервера.ДоступнаРоль("AMS_Диспетчер") Или AMS_ВызовСервера.ЭтоKhors() Тогда
		Стр = ТекущийЭлемент.ТекущиеДанные;

		Если Поле.Имя = "РаспоряженияРасстояние" Тогда
			Парам = Новый Структура;
			Парам.Вставить("ЗонаДоставки", Стр.ЗонаДоставки);
			Парам.Вставить("Партнер", Стр.Партнер);
			Парам.Вставить("АдресДоставки", Стр.АдресДоставки);
			Парам.Вставить("ИндексСтроки", ВыбраннаяСтрока - 1);

			Оповещение = Новый ОписаниеОповещения("ПослеВводаРасстояния", ЭтотОбъект, Парам);
			ПоказатьВводЧисла(Оповещение, Стр.Расстояние, "Введите расстояние", 10, 0);

		Иначе
			ПоказатьЗначение( , Стр.Распоряжение);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗадания

&НаКлиенте
Процедура ЗаданияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Имя = Поле.Имя;
	Стр = Элемент.ТекущиеДанные;

	Авто  = Стр.ТранспортноеСредство;
	Док   = Стр.Распоряжение;
	Адрес = Стр.АдресДоставки;

	Если AMS_ВызовСервера.ДоступнаРоль("_БухгалтерСклада") И ЗначениеЗаполнено(Док) И Не AMS_ВызовСервера.ЭтоKhors() Тогда
		ПоказатьЗначение( , Док);
		Возврат;
	КонецЕсли;

	Если Не AMS_ВызовСервера.ДоступнаРоль("AMS_Диспетчер") Тогда
		Возврат;
	КонецЕсли;

	Если Имя = "ЗаданияТранспортНомер" И Не ПустаяСтрока(Адрес) Тогда
		Если Объект.Статус = ПредопределенноеЗначение("Перечисление._СтатусыДоставки.Отправлено") Тогда
			ПоказатьЗначение( , Док);
		Иначе
			УправлениеКонтактнойИнформациейКлиент.ПоказатьАдресНаКарте(Адрес, "Яндекс.Карты");
		КонецЕсли;
		
	ИначеЕсли Объект.Статус = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление._СтатусыДоставки.Погрузка")
		И (Имя = "ЗаданияДатаЗагрузкиФакт" Или Имя = "ЗаданияВремяЗагрузкиФакт" Или Имя = "ЗаданияОтправлено") Тогда
		// Производим ввод данных

	ИначеЕсли Объект.Статус = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление._СтатусыДоставки.Отправлено")
		И (Имя = "ЗаданияЕстьЧек" Или Имя = "ЗаданияЕстьНарушениеДоговора" Или Имя = "ЗаданияЕстьПретензия") Тогда
		// Производим ввод данных

	ИначеЕсли Имя = "ЗаданияПеревозчик" Тогда
		Если ЗначениеЗаполнено(Стр.Перевозчик) Тогда
			ПоказатьЗначение( , Стр.Перевозчик);

		ИначеЕсли ЗначениеЗаполнено(Стр.Партнер) Тогда
			ПоказатьЗначение( , Стр.Партнер);
		КонецЕсли;

	ИначеЕсли Объект.Статус = ПредопределенноеЗначение("Перечисление._СтатусыДоставки.План")
		И ЗначениеЗаполнено(Авто) И Не ЗначениеЗаполнено(Док) Тогда

		Если ПолучитьКоличествоЗагруженныхУПД(Авто) = 1 Тогда
			Док = ПолучитьУПД(Авто);
		Иначе
			Док = Неопределено;
		КонецЕсли;

		ОткрытьФормуПодборДокументовВТранспорт(Новый Структура("Авто, УПД", Авто, Док));

	ИначеЕсли ЗначениеЗаполнено(Док) Тогда
		ПоказатьЗначение( , Док);

	ИначеЕсли ЗначениеЗаполнено(Авто) Тогда
		ПоказатьЗначение( , Авто);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаданияПриИзменении(Элемент)
	ТекДанные = Элемент.ТекущиеДанные;
	ТекПоле   = Элемент.ТекущийЭлемент.Имя;

	Авто = ТекДанные.ТранспортноеСредство;
	УПД  = ТекДанные.Распоряжение;

	Если ТекПоле = "ЗаданияДатаЗагрузкиФакт" Тогда
		УстановитьДатаЗагрузкиФакт(Авто, ТекДанные.ДатаЗагрузкиФакт);

	ИначеЕсли ТекПоле = "ЗаданияВремяЗагрузкиФакт" Тогда
		УстановитьВремяЗагрузкиФакт(Авто, ТекДанные.ВремяЗагрузкиФакт);

	ИначеЕсли ТекПоле = "ЗаданияОтправлено" Тогда
		УстановитьОтправлено(Авто, ТекДанные.Отправлено);

	ИначеЕсли ТекПоле = "ЗаданияЕстьЧек" Тогда
		УстановитьЕстьЧек(УПД, ТекДанные.ЕстьЧек);

	ИначеЕсли ТекПоле = "ЗаданияЕстьНарушениеДоговора" Тогда
		УстановитьЕстьНарушениеДоговора(УПД, ТекДанные.ЕстьНарушениеДоговора);

	ИначеЕсли ТекПоле = "ЗаданияЕстьПретензия" Тогда
		УстановитьЕстьПретензия(УПД, ТекДанные.ЕстьПретензия);

	ИначеЕсли ТекПоле = "ЗаданияЕстьУПД" Тогда
		УстановитьЕстьУПД(УПД, ТекДанные.ЕстьУПД);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДополнительноеВремя

&НаКлиенте
Процедура ДополнительноеВремяСтоимостьЧекаПриИзменении(Элемент)
	ТекДанные = ТекущийЭлемент.ТекущиеДанные;

	Авто           = ТекДанные.ТранспортноеСредство;
	УПД            = ТекДанные.Распоряжение;
	СтоимостьЧека  = ТекДанные.СтоимостьЧека;

	УстановитьСтоимостьЧека(Авто, УПД, СтоимостьЧека);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНарушенияДоговора

&НаКлиенте
Процедура НарушенияДоговораПунктДоговораПриИзменении(Элемент)
	ТекДанные = ТекущийЭлемент.ТекущиеДанные;

	Авто          = ТекДанные.ТранспортноеСредство;
	УПД           = ТекДанные.Распоряжение;
	ПунктДоговора = ТекДанные.ПунктДоговора;

	УстановитьПунктДоговора(Авто, УПД, ПунктДоговора);
КонецПроцедуры
&НаКлиенте
Процедура НарушенияДоговораСуммаШтрафаПриИзменении(Элемент)
	ТекДанные = ТекущийЭлемент.ТекущиеДанные;

	Авто        = ТекДанные.ТранспортноеСредство;
	УПД         = ТекДанные.Распоряжение;
	СуммаШтрафа = ТекДанные.СуммаШтрафа;

	УстановитьСуммаШтрафа(Авто, УПД, СуммаШтрафа);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПретензии

&НаКлиенте
Процедура ПретензииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекПоле = Поле.Имя;

	Если ТекПоле = "ПретензииСодержаниеПретензии" Тогда
		ТекДанные = Элемент.ТекущиеДанные;

		Подсказка = "Содержание претензии";
		Оповещение = Новый ОписаниеОповещения("ПослеВводаСодержания", ЭтотОбъект,
			Новый Структура("ТранспортноеСредство,Распоряжение", ТекДанные.ТранспортноеСредство,
			ТекДанные.Распоряжение));
		СодержаниеПретензии = ТекДанные.СодержаниеПретензии;

		ПоказатьВводСтроки(Оповещение, СодержаниеПретензии, Подсказка, , Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПретензииСуммаПретензииПриИзменении(Элемент)
	ТекДанные = ТекущийЭлемент.ТекущиеДанные;

	Авто = ТекДанные.ТранспортноеСредство;
	УПД  = ТекДанные.Распоряжение;

	СуммаПретензии = ТекДанные.СуммаПретензии;

	УстановитьСуммаПретензии(Авто, УПД, СуммаПретензии);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область ПодменюПечать

&НаКлиенте
Процедура ПечатьЛогистическийЛист(Команда)
	Если Модифицированность Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо предварительно записать изменения.");
		Возврат;
	КонецЕсли;

	Массив = Новый Массив;
	Массив.Добавить(Объект.Ссылка);

	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.AMS_Продажи", "ЛогистическийЛист", Массив, Неопределено,
		Новый Структура("Доставка", Неопределено));
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЛогистическийЛистДоставка(Команда)
	Если Модифицированность Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо предварительно записать изменения.");
		Возврат;
	КонецЕсли;

	Массив = Новый Массив;
	Массив.Добавить(Объект.Ссылка);

	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.AMS_Продажи", "ЛогистическийЛистДоставка", Массив,
		Неопределено, Новый Структура("Доставка", Истина));
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЛогистическийЛистПодвоз(Команда)
	Если Модифицированность Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо предварительно записать изменения.");
		Возврат;
	КонецЕсли;

	Массив = Новый Массив;
	Массив.Добавить(Объект.Ссылка);

	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.AMS_Продажи", "ЛогистическийЛистПодвоз", Массив,
		Неопределено, Новый Структура("Доставка", Ложь));
КонецПроцедуры

&НаКлиенте
Процедура ПечатьМаршрутныйЛист(Команда)
	МассивОбъектов       = Новый Массив;
	МассивОбъектов.Добавить(Объект.Ссылка);

	ТабличныеДокументы = Новый СписокЗначений;

	Парам = Новый Структура("Лист,Дата,Номер", Объект.Ссылка, Объект.Дата, Объект.Номер);
	Парам.Вставить("Перевозчик");
	
	МассивПеревозчиков = ПолучитьМассивПеревозчиков();
	
	Для Каждого Перевозчик Из МассивПеревозчиков Цикл
		Парам.Перевозчик = Перевозчик;
	
		ПечатнаяФорма = AMS_ВызовСервера.СформироватьМаршрутныйЛист(Парам);

		ТабличныеДокументыДляПечати(ТабличныеДокументы, ПечатнаяФорма);
		
	КонецЦикла;
	
	УправлениеПечатьюКлиент.РаспечататьТабличныеДокументы(ТабличныеДокументы, МассивОбъектов, Ложь, 1);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьМаршрутныйЛистExcel(Команда)
	Состояние("Создание файлов EXCEL.");

	МассивПеревозчиков = ПолучитьМассивПеревозчиков();

	Парам = Новый Структура("Лист,Дата,Номер", Объект.Ссылка, Объект.Дата, Объект.Номер);
	Парам.Вставить("Перевозчик");

	Для Каждого Перевозчик Из МассивПеревозчиков Цикл
		Парам.Перевозчик = Перевозчик;

		ТабДок = AMS_ВызовСервера.СформироватьМаршрутныйЛист(Парам);
		
		//ТабДок.Показать();

		ИмяКаталогаЛогиста   = "\\AMSSERVN\disk_y\ОТДЕЛ ПРОДАЖ\Логист\ЗАЯВКИ НА ТРАНСПОРТ\";
		ПапкаКаталогаЛогиста = Новый Файл(ИмяКаталогаЛогиста);

		Если Не ПапкаКаталогаЛогиста.Существует() Тогда
			ИмяКаталогаЛогиста  = "F:\arhiv\";
		КонецЕсли;

		ИмяКаталога = СокрЛП(ИмяКаталогаЛогиста + Формат(Объект.Дата, "ДФ=""гггг'_'ММ'_'дд""") + " - "
			+ ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Объект.Номер));
		ФайлКаталога = Новый Файл(ИмяКаталога);
		
		Если Не ФайлКаталога.Существует() Тогда
			СоздатьКаталог(ИмяКаталога);
		КонецЕсли;

		ПолныйПутьКФайлу = ИмяКаталога + "\" + ?(ЗначениеЗаполнено(Перевозчик), Перевозчик, "Неизвестно") + ".XLSX";

		Попытка
			ТабДок.Записать(ПолныйПутьКФайлу, ТипФайлаТабличногоДокумента.XLSX);
			ОбщегоНазначенияКлиент.СообщитьПользователю("Записан новый файл " + ПолныйПутьКФайлу);
		Исключение
			ОбщегоНазначенияКлиент.СообщитьПользователю(ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;

	Состояние();
КонецПроцедуры

&НаКлиенте
Процедура ПечатьКомплектДокументов(Команда)
	ОткрытьФорму("Документ.AMS_ЛогистическийЛист.Форма.ФормаПечать", Новый Структура("ЛогистическийЛист", Объект.Ссылка));
КонецПроцедуры

&НаКлиенте
Процедура ПечатьТН_Лист(Команда)
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(Объект.Ссылка);

	Парам = Новый Структура("ТранспортноеСредство,Распоряжение,Образец", Неопределено, Неопределено, Ложь);

	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.AMS_Продажи", "ТН", МассивОбъектов, Неопределено, Парам);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьТН_Авто(Команда)
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(Объект.Ссылка);

	ТекущиеДанные = Элементы.Задания.ТекущиеДанные;
	ТранспортноеСредство = ТекущиеДанные.ТранспортноеСредство;
	Распоряжение         = ТекущиеДанные.Распоряжение;

	Парам = Новый Структура("ТранспортноеСредство,Распоряжение,Образец", ТранспортноеСредство, Распоряжение, Ложь);

	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.AMS_Продажи", "ТН", МассивОбъектов, Неопределено, Парам);
КонецПроцедуры

#КонецОбласти

#Область ПодменюСправочники

&НаКлиенте
Процедура ОткрытьСправочникТранспортныеСредства(Команда)
	ОткрытьФорму("Справочник.ТранспортныеСредства.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникФизическиеЛица(Команда)
	ОткрытьФорму("Справочник.ФизическиеЛица.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникЗоныДоставки(Команда)
	ОткрытьФорму("Справочник.ЗоныДоставки.ФормаСписка");
КонецПроцедуры

#КонецОбласти

#Область ПодменюОтчеты

&НаКлиенте
Процедура ДвижениеДокумента(Команда)
	СсылкаНаОбъект = Объект.Ссылка;
	Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ВидимостьКомандВариантовОтчетов", Ложь);
		ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
		ПараметрыФормы.Вставить("ПараметрКоманды", СсылкаНаОбъект);

		ОткрытьФорму("Отчет.ДвиженияДокумента.Форма", ПараметрыФормы, ЭтотОбъект, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеДокументы(Команда)
	МенюОтчетыУТКлиент.СтруктураПодчиненности(Объект.Ссылка, Неопределено);
КонецПроцедуры

#КонецОбласти

#Область КнопкиФормы

&НаКлиенте
Процедура Обновить(Команда)
	ПоменятьЗаказыНаРеализации();
	ПоказатьТранспортКЗагрузке();
	ПоказатьДокументыКЗагрузке();
	ПоказатьЗадания();
	РазвернутьЗадания(Ложь);
КонецПроцедуры

#КонецОбласти

#Область КомандыТаблицыФормыЗадания

&НаКлиенте
Процедура ЗаданияСвернуть(Команда)
	СвернутьЗадания(Задания.ПолучитьЭлементы());
КонецПроцедуры

&НаКлиенте
Процедура ЗаданияРазвернуть(Команда)
	РазвернутьЗадания(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗаданияРазвернутьПолностью(Команда)
	РазвернутьЗадания(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьДоставку(Команда)
	Стр = Элементы.Задания.ТекущиеДанные;

	ОткрытьФорму("Документ.AMS_ЛогистическийЛист.Форма.ФормаОтменаДоставки", ПолучитьДанныеДляОтменыДоставки(
		Стр.ТранспортноеСредство, Стр.Распоряжение), , , , , Новый ОписаниеОповещения("ОтменитьДоставкуЗавершение",
		ЭтотОбъект, Стр), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ВозвратТовара(Команда)
	Стр = Элементы.Задания.ТекущиеДанные;

	ОткрытьФорму("Документ.AMS_ЛогистическийЛист.Форма.ФормаОтменаДоставки", ПолучитьДанныеДляВозвратаТовара(
		Стр.ТранспортноеСредство, Стр.Распоряжение), , , , , Новый ОписаниеОповещения("ВозвратТовараЗавершение",
		ЭтотОбъект, Стр), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПроцедурыИсполненияКомандФормы

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;

	УстановитьСтатусНеРаботает(Параметры);
	ПоказатьТранспортКЗагрузке();
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивПеревозчиков()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Авто._Перевозчик КАК Перевозчик
	|ИЗ
	|	Документ.AMS_ЛогистическийЛист.Рейсы КАК Рейсы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТранспортныеСредства КАК Авто
	|		ПО Рейсы.ТранспортноеСредство = Авто.Ссылка
	|ГДЕ
	|	Рейсы.Ссылка = &Ссылка";
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Перевозчик");
КонецФункции

&НаСервере
Процедура ТабличныеДокументыДляПечати(ТабличныеДокументы, ПечатнаяФорма)
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ТабличныйДокумент.Вывести(ПечатнаяФорма);
	
	ЗаполнитьЗначенияСвойств(ТабличныйДокумент, ПечатнаяФорма,
		"АвтоМасштаб,Вывод,ВысотаСтраницы,ДвусторонняяПечать,Защита,ИмяПринтера,КодЯзыкаМакета,КоличествоЭкземпляров,МасштабПечати,ОриентацияСтраницы,ПолеСверху,ПолеСлева,ПолеСнизу,ПолеСправа,РазборПоКопиям,РазмерКолонтитулаСверху,РазмерКолонтитулаСнизу,РазмерСтраницы,ТочностьПечати,ЧерноБелаяПечать,ШиринаСтраницы,ЭкземпляровНаСтранице");
	
	ТабличныйДокумент.КоличествоЭкземпляров = 1;

	ТабличныеДокументы.Добавить(ТабличныйДокумент);
КонецПроцедуры

&НаКлиенте
Процедура СвернутьЗадания(Коллекция)
	Для Каждого Стр Из Коллекция Цикл
		ЭлементыСтр = Стр.ПолучитьЭлементы();
		Элементы.Задания.Свернуть(Стр.ПолучитьИдентификатор());
		СвернутьЗадания(ЭлементыСтр);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьЗадания(Полностью)
	Коллекция = Задания.ПолучитьЭлементы();
	Для Каждого Стр Из Коллекция Цикл
		ИдентификаторСтроки = Стр.ПолучитьИдентификатор();
		Элементы.Задания.Развернуть(ИдентификаторСтроки, Полностью);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьДоставкуЗавершение(Результат, Стр) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Модифицированность = Истина;

	ОформитьОтменуДоставки(Результат);
КонецПроцедуры

&НаСервере
Процедура ОформитьОтменуДоставки(Результат)
	МассивРаспоряжений = Результат.МассивРаспоряжений;

	Для Каждого Док Из МассивРаспоряжений Цикл
		Стр = Объект.ОтменыДоставки.Добавить();

		ЗаполнитьЗначенияСвойств(Стр, Результат);
		ЗаполнитьЗначенияСвойств(Стр, Док);

		МассивСтрок = Объект.Распоряжения.НайтиСтроки(Новый Структура("Распоряжение", Док.Распоряжение));
		Если МассивСтрок.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		Объект.Распоряжения.Удалить(МассивСтрок[0].НомерСтроки - 1);

	КонецЦикла;

	МассивСтрок = Объект.Распоряжения.НайтиСтроки(Новый Структура("ТранспортноеСредство",
		Результат.ТранспортноеСредство));

	Если МассивСтрок.Количество() = 0 Тогда
		МассивСтрок = Объект.Рейсы.НайтиСтроки(Новый Структура("ТранспортноеСредство", Результат.ТранспортноеСредство));
		Объект.Рейсы.Удалить(МассивСтрок[0].НомерСтроки - 1);
	КонецЕсли;

	ПоказатьЗадания();
КонецПроцедуры

&НаКлиенте
Процедура ВозвратТовараЗавершение(Результат, Стр) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Модифицированность = Истина;

	ОформитьВозвратТовара(Результат);
КонецПроцедуры

&НаСервере
Процедура ОформитьВозвратТовара(Результат)
	МассивРаспоряжений = Результат.МассивРаспоряжений;

	Для Каждого Док Из МассивРаспоряжений Цикл
		Стр = Объект.ВозвратыТоваров.Добавить();

		ЗаполнитьЗначенияСвойств(Стр, Результат);
		ЗаполнитьЗначенияСвойств(Стр, Док);

		МассивСтрок = Объект.Распоряжения.НайтиСтроки(Новый Структура("Распоряжение", Док.Распоряжение));
		Если МассивСтрок.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		Объект.Распоряжения.Удалить(МассивСтрок[0].НомерСтроки - 1);
	КонецЦикла;

	ПоказатьЗадания();
КонецПроцедуры

&НаКлиенте
Функция ПолучитьДанныеДляОтменыДоставки(ТранспортноеСредство, Распоряжение)
	Если Распоряжение = Неопределено Тогда
		СтрДок = Объект.Распоряжения.НайтиСтроки(Новый Структура("ТранспортноеСредство", ТранспортноеСредство));
	Иначе
		СтрДок = Объект.Распоряжения.НайтиСтроки(Новый Структура("Распоряжение", Распоряжение));
	КонецЕсли;

	МассивРаспоряжений = Новый Массив;

	Для Каждого Стр Из СтрДок Цикл
		МассивРаспоряжений.Добавить(Стр.Распоряжение);
	КонецЦикла;

	СтрРейсы = Объект.Рейсы.НайтиСтроки(Новый Структура("ТранспортноеСредство", ТранспортноеСредство))[0];

	Парам = Новый Структура;
	Парам.Вставить("ВыполнитьДействие", "Отменить доставку");
	Парам.Вставить("ТранспортноеСредство", ТранспортноеСредство);
	Парам.Вставить("Водитель", СтрРейсы.Водитель);
	Парам.Вставить("СтоимостьДоставки", СтрРейсы.СтоимостьДоставки);
	Парам.Вставить("МассивРаспоряжений", МассивРаспоряжений);

	Возврат Парам;
КонецФункции

&НаКлиенте
Функция ПолучитьДанныеДляВозвратаТовара(ТранспортноеСредство, Распоряжение)
	Если Не ЗначениеЗаполнено(ТранспортноеСредство) Тогда
		ТранспортноеСредство = Объект.Распоряжения.НайтиСтроки(Новый Структура("Распоряжение",
			Распоряжение))[0].ТранспортноеСредство;
	КонецЕсли;

	СтрДок = Объект.Распоряжения.НайтиСтроки(Новый Структура("ТранспортноеСредство", ТранспортноеСредство));

	МассивРаспоряжений = Новый Массив;

	Для Каждого Стр Из СтрДок Цикл
		Данные = Новый Структура;
		Данные.Вставить("Распоряжение", Стр.Распоряжение);
		Данные.Вставить("СтоимостьЧека", Стр.СтоимостьЧека);
		Данные.Вставить("ПунктДоговора", Стр.ПунктДоговора);
		Данные.Вставить("СуммаШтрафа", Стр.СуммаШтрафа);
		Данные.Вставить("СодержаниеПретензии", Стр.СодержаниеПретензии);
		Данные.Вставить("СуммаПретензии", Стр.СуммаПретензии);

		ДанДок = ОбщегоНазначенияУТВызовСервера.ЗначенияРеквизитовОбъекта(Стр.Распоряжение,
			"Организация,Партнер,СуммаДокумента,AMS_КоличествоПалет,AMS_Вес");
		Данные.Вставить("ОрганизацияЗаказа", ДанДок.Организация);
		Данные.Вставить("Партнер", ДанДок.Партнер);
		Данные.Вставить("СуммаДокумента", ДанДок.СуммаДокумента);
		Данные.Вставить("Вес", ДанДок._Вес);
		Данные.Вставить("КоличествоПалет", ДанДок._КоличествоПалет);

		МассивРаспоряжений.Добавить(Данные);
	КонецЦикла;

	СтрРейсы = Объект.Рейсы.НайтиСтроки(Новый Структура("ТранспортноеСредство", ТранспортноеСредство))[0];

	Парам = Новый Структура;
	Парам.Вставить("ВыполнитьДействие", "Возврат товара");
	Парам.Вставить("Организация", Объект.Организация);
	Парам.Вставить("ТранспортноеСредство", ТранспортноеСредство);
	Парам.Вставить("Водитель", СтрРейсы.Водитель);
	Парам.Вставить("СтоимостьДоставки", СтрРейсы.СтоимостьДоставки);
	Парам.Вставить("МассивРаспоряжений", МассивРаспоряжений);

	Возврат Парам;
КонецФункции

&НаСервере
Процедура ПоменятьЗаказыНаРеализации()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЛогистическийЛист", Объект.Ссылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Распоряжение КАК ЗаказКлиента,
	|	Реал.Ссылка КАК Реализация
	|ИЗ
	|	Документ.AMS_ЛогистическийЛист.Распоряжения КАК т
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК Реал
	|		ПО т.Распоряжение.Номер = Реал.AMS_ЗаказКлиентаНомер
	|ГДЕ
	|	т.Ссылка = &ЛогистическийЛист
	|	И т.Распоряжение ССЫЛКА Документ.ЗаказКлиента
	|	И НЕ Реал.Ссылка ЕСТЬ NULL";
	
	Рез = Запрос.Выполнить(); Выб = Рез.Выбрать();
	
	Пока Выб.Следующий() Цикл
		Стр = Объект.Распоряжения.НайтиСтроки(Новый Структура("Распоряжение", Выб.ЗаказКлиента))[0];
		Стр.Распоряжение = Выб.Реализация;
		Модифицированность = Истина;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиТаблицыФормыТранспорт

&НаСервере
Процедура ПоказатьТранспортКЗагрузке()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Запрос.УстановитьПараметр("Рейсы", Объект.Рейсы.Выгрузить( , "ТранспортноеСредство"));

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.ТранспортноеСредство КАК ТранспортноеСредство
	|ПОМЕСТИТЬ УжеТут
	|ИЗ
	|	&Рейсы КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИСТИНА КАК Метка,
	|	т.Ссылка КАК ТранспортноеСредство,
	|	т._Водитель КАК Водитель,
	|	т.AMS_КоличествоПалет КАК КоличествоПалет,
	|	т.ГрузоподъемностьВТоннах КАК ГрузоподъемностьВТоннах
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	Справочник.ТранспортныеСредства КАК т
	|ГДЕ
	|	т._Статус = ЗНАЧЕНИЕ(Перечисление._СтатусыТранспортныхСредств.Работает)
	|	И НЕ т.Ссылка В
	|		(ВЫБРАТЬ
	|			т.ТранспортноеСредство КАК ТранспортноеСредство
	|		ИЗ
	|			УжеТут КАК т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.Метка КАК Метка,
	|	вт.ТранспортноеСредство КАК ТранспортноеСредство,
	|	вт.Водитель КАК Водитель
	|ИЗ
	|	вт КАК вт
	|
	|УПОРЯДОЧИТЬ ПО
	|	вт.КоличествоПалет УБЫВ,
	|	вт.ТранспортноеСредство.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(вт.КоличествоПалет) КАК КоличествоПалет,
	|	СУММА(вт.ГрузоподъемностьВТоннах) КАК ГрузоподъемностьВТоннах
	|ИЗ
	|	вт КАК вт";

	Пакет = Запрос.ВыполнитьПакет();

	Транспорт.Загрузить(Пакет[2].Выгрузить());

	Выб = Пакет[3].Выбрать();
	Выб.Следующий();
	ПалетАвто = Выб.КоличествоПалет;
	ВесАвто = Выб.ГрузоподъемностьВТоннах;

	Элементы.Транспорт.ТекущаяСтрока = 0;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПодборДокументовВТранспорт(ДопПараметры)
	ПараметрыФормы = ПолучитьПараметрыДляПодбораРаспоряжений(ДопПараметры.Авто);
	
	ОткрытьФорму("Документ.AMS_ЛогистическийЛист.Форма.ПодборДокументовВТранспорт", ПараметрыФормы, , , , , 
		Новый ОписаниеОповещения("ОткрытьФормуПодборДокументовВТранспортЗавершение", ЭтотОбъект, ДопПараметры),
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПодборДокументовВТранспортЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Модифицированность = Истина;

	ЗаписатьРезультатПодбораУПД(Результат, ДополнительныеПараметры.Авто);
	ПоказатьТранспортКЗагрузке();
	ПоказатьДокументыКЗагрузке();
	ОбновитьДеревоЗаданий(ДополнительныеПараметры);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДеревоЗаданий(Парам)
	ПоказатьЗадания();

	ИдентификаторСтроки = 0;
	ПрекратитьПоиск     = Ложь;
	НайтиСтрокуДерева(Задания.ПолучитьЭлементы(), Парам.Авто, Парам.УПД, ИдентификаторСтроки, ПрекратитьПоиск);
	Элементы.Задания.ТекущаяСтрока = ИдентификаторСтроки;
КонецПроцедуры

&НаКлиенте
Процедура НайтиСтрокуДерева(КоллекцияЭлементовДерева, Авто, УПД, ИдентификаторСтроки, ПрекратитьПоиск)
	Если ЗначениеЗаполнено(УПД) Тогда
		НайтиСтрокуДереваУПД(КоллекцияЭлементовДерева, УПД, ИдентификаторСтроки, ПрекратитьПоиск);

		Если ИдентификаторСтроки = 0 Тогда
			НайтиСтрокуДереваАвто(КоллекцияЭлементовДерева, Авто, ИдентификаторСтроки, ПрекратитьПоиск);
		КонецЕсли;

	Иначе
		НайтиСтрокуДереваАвто(КоллекцияЭлементовДерева, Авто, ИдентификаторСтроки, ПрекратитьПоиск);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НайтиСтрокуДереваУПД(КоллекцияЭлементовДерева, УПД, ИдентификаторСтроки, ПрекратитьПоиск)
	Для Каждого СтрокаДерева Из КоллекцияЭлементовДерева Цикл
		Если ПрекратитьПоиск Тогда
			Возврат;
		КонецЕсли;

		Если СтрокаДерева.Распоряжение = УПД Тогда
			ИдентификаторСтроки = СтрокаДерева.ПолучитьИдентификатор();
			ПрекратитьПоиск = Истина;
			Возврат;
		КонецЕсли;

		КоллекцияЭлементов = СтрокаДерева.ПолучитьЭлементы();

		Если КоллекцияЭлементов.Количество() > 0 Тогда
			НайтиСтрокуДереваУПД(КоллекцияЭлементов, УПД, ИдентификаторСтроки, ПрекратитьПоиск);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура НайтиСтрокуДереваАвто(КоллекцияЭлементовДерева, Авто, ИдентификаторСтроки, ПрекратитьПоиск)
	Если ПрекратитьПоиск Тогда
		Возврат;
	КонецЕсли;

	Для Каждого СтрокаДерева Из КоллекцияЭлементовДерева Цикл
		Если ПрекратитьПоиск Тогда
			Возврат;
		КонецЕсли;

		Если СтрокаДерева.ТранспортноеСредство = Авто Тогда
			ИдентификаторСтроки = СтрокаДерева.ПолучитьИдентификатор();
			ПрекратитьПоиск = Истина;
			Возврат;
		КонецЕсли;

		КоллекцияЭлементов = СтрокаДерева.ПолучитьЭлементы();

		Если КоллекцияЭлементов.Количество() > 0 Тогда
			НайтиСтрокуДереваАвто(КоллекцияЭлементов, Авто, ИдентификаторСтроки, ПрекратитьПоиск);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
&НаСервере
Процедура УстановитьСтатусНеРаботает(ТранспортноеСредство)
	Авто = ТранспортноеСредство.ПолучитьОбъект();
	Авто._Статус = Перечисления._СтатусыТранспортныхСредств.НеРаботает;
	Авто.Записать();
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыДляПодбораРаспоряжений(ТранспортноеСредство)
	Табл = Объект.Рейсы.Выгрузить();

	Стр = Табл.Найти(ТранспортноеСредство, "ТранспортноеСредство");	

	Если Стр = Неопределено Тогда
		Рейс = Неопределено;	
	Иначе
		Рейс = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Стр);
		Табл.Удалить(Стр);
	КонецЕсли;
	
	МассивЗагрузок = Новый Массив;
	Для Каждого Стр Из Табл Цикл
		МассивЗагрузок.Добавить(Стр.ВремяЗагрузки);
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Распоряжения", Объект.Распоряжения.Выгрузить(, "ТранспортноеСредство, ПорядокВМаршруте, Распоряжение"));
	Запрос.УстановитьПараметр("ТранспортноеСредство", ТранспортноеСредство);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.ТранспортноеСредство КАК ТранспортноеСредство,
	|	т.ПорядокВМаршруте КАК ПорядокВМаршруте,
	|	т.Распоряжение КАК Распоряжение
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	&Распоряжения КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	т.ПорядокВМаршруте КАК ПорядокВМаршруте,
	|	т.Распоряжение КАК Распоряжение
	|ИЗ
	|	вт КАК т
	|ГДЕ
	|	т.ТранспортноеСредство = &ТранспортноеСредство
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорядокВМаршруте";

	РаспоряженияДляАвто = Запрос.Выполнить().Выгрузить();

	Парам = Новый Структура;
	Парам.Вставить("Дата", Объект.Дата);
	Парам.Вставить("ТранспортноеСредство", ТранспортноеСредство);
	Парам.Вставить("РаспоряженияДляПобдора", РеквизитФормыВЗначение("Распоряжения"));
	Парам.Вставить("Рейс", Рейс);
	Парам.Вставить("РаспоряженияДляАвто", РаспоряженияДляАвто);
	Парам.Вставить("МассивЗагрузок", МассивЗагрузок);

	Возврат Новый Структура("АдресДанных", ПоместитьВоВременноеХранилище(Парам));
КонецФункции

&НаСервере
Процедура ЗаписатьРезультатПодбораУПД(Результат, Авто)
	ВремяЗагрузкиФакт = '00010101';
	Отправлено        = '00010101';

	Рейс      = Результат.Рейс;
	МассивУПД = Результат.МассивУПД;

	Рейсы = Объект.Рейсы;
	Докты = Объект.Распоряжения;

	Строки = Рейсы.НайтиСтроки(Новый Структура("ТранспортноеСредство", Авто));
	Для Каждого Стр Из Строки Цикл
		ВремяЗагрузкиФакт = Стр.ВремяЗагрузкиФакт;
		Отправлено        = Стр.Отправлено;

		Рейсы.Удалить(Рейсы.Индекс(Стр));
	КонецЦикла;

	Строки = Докты.НайтиСтроки(Новый Структура("ТранспортноеСредство", Авто));
	Для Каждого Стр Из Строки Цикл
		Докты.Удалить(Докты.Индекс(Стр));
	КонецЦикла;

	Если МассивУПД.Количество() > 0 Тогда
		Стр = Рейсы.Добавить();

		ЗаполнитьЗначенияСвойств(Стр, Рейс);

		Если ВремяЗагрузкиФакт = '00010101' Тогда
			Стр.ВремяЗагрузкиФакт = НачалоДня(Стр.ВремяЗагрузки);
		Иначе
			Стр.ВремяЗагрузкиФакт = ВремяЗагрузкиФакт;
		КонецЕсли;

		Стр.Отправлено = Отправлено;
	КонецЕсли;

	Для Каждого Стр Из МассивУПД Цикл
		Распоряжение = Стр.Распоряжение;

		НовСтр = Докты.Добавить();
		НовСтр.ТранспортноеСредство = Авто;
		НовСтр.ПорядокВМаршруте     = Стр.ПорядокВМаршруте;
		НовСтр.Распоряжение         = Распоряжение;
		НовСтр.АдресДоставки        = Стр.АдресДоставки;
		НовСтр.Расстояние           = Стр.Расстояние;
		НовСтр.Подвоз               = Стр.Подвоз;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиТаблицыФормыРаспоряжения

&НаСервере
Процедура ПоказатьДокументыКЗагрузке()
	Коннектор = РеквизитФормыВЗначение("Объект");
	Табл      = РеквизитФормыВЗначение("Распоряжения");
	
	Коннектор.ЗаполнитьТаблицуРаспоряжений(Табл, ПалетРеал, ВесРеал);
	
	ЗначениеВРеквизитФормы(Табл, "Распоряжения");
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаРасстояния(Расстояние, Парам) Экспорт
	Если Расстояние <> Неопределено Тогда
		AMS_ВызовСервера.ЗаписатьРасстояние(Парам.Партнер, Парам.АдресДоставки, Расстояние);
		ПоказатьДокументыКЗагрузке();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиТаблицыФормыЗадания

&НаСервере
Процедура ПоказатьЗадания()
	Задания.ПолучитьЭлементы().Очистить();

	Рез = ПолучитьДанныеЗаданий();

	НомерПП = 0;

	Выб1 = Рез.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выб1.Следующий() Цикл
		Стр1 = Задания.ПолучитьЭлементы().Добавить();

		ЗаполнитьЗначенияСвойств(Стр1, Выб1, , "Пробег,Расстояние");

		НомерПП = НомерПП + 1;

		Стр1.НомерПП        = НомерПП;
		Стр1.ТранспортНомер = "" + Выб1.ТранспортноеСредство + ", " + Выб1.Водитель + ", " + Выб1.Телефон;
		Стр1.АдресДоставки  = "";
		Стр1.Пробег         = Выб1.Пробег;

		Если Стр1.УтвержденаОтгрузка Тогда
			Стр1.КоличествоПалетИнфо = Выб1.КоличествоПалет;
			Стр1.ВесИнфо             = Формат(Выб1.Вес, "ЧДЦ=1");
		
		Иначе
			Стр1.КоличествоПалетИнфо = ?(Выб1.КоличествоПалетПлан = 0 Или Выб1.КоличествоПалетПлан = Выб1.КоличествоПалет, 
				Строка(Выб1.КоличествоПалет), 
				Строка(Выб1.КоличествоПалетПлан) + "/" + Строка(Выб1.КоличествоПалет));
				
			Стр1.ВесИнфо = ?(Выб1.ВесПлан = 0 Или Выб1.ВесПлан = Выб1.Вес, 
				Формат(Выб1.Вес, "ЧДЦ=1"),
				Формат(Выб1.ВесПлан, "ЧДЦ=1") + "/" + Формат(Выб1.Вес, "ЧДЦ=1"));
		КонецЕсли;

		Стр1.ДатаЗагрузки     = Выб1.ВремяЗагрузки;
		Стр1.ДатаЗагрузкиФакт = Выб1.ВремяЗагрузкиФакт;
		Стр1.ВремяДоставки    = Формат(Выб1.ВремяДоставкиС, "ДФ=""ЧЧ:мм""") + "-" + Формат(Выб1.ВремяДоставкиПо, "ДФ=""ЧЧ:мм""");
		Стр1.Менеджер         = Неопределено;

		Выб2 = Выб1.Выбрать();
		Пока Выб2.Следующий() Цикл
			Стр2 = Стр1.ПолучитьЭлементы().Добавить();

			ЗаполнитьЗначенияСвойств(Стр2, Выб2, , "Пробег,Расстояние");

			Стр2.Расстояние = Выб2.Расстояние;

			Стр2.Емкость       = 0;
			Стр2.Тоннаж        = 0;
			Стр2.ВремяЗагрузки = Неопределено;
			Стр2.ВремяДоставки = Неопределено;
			Стр2.Перевозчик    = Неопределено;

			Если Стр2.УтвержденаОтгрузка Тогда
				Стр2.КоличествоПалетИнфо = Выб2.КоличествоПалет;
				Стр2.ВесИнфо             = Формат(Выб2.Вес, "ЧДЦ=1");
			Иначе
				Стр2.КоличествоПалетИнфо = ?(Выб2.КоличествоПалетПлан = 0 Или Выб2.КоличествоПалетПлан = Выб2.КоличествоПалет, 
					Строка(Выб2.КоличествоПалет), Строка(Выб2.КоличествоПалетПлан) + "/" + Строка(Выб2.КоличествоПалет));
					
				Стр2.ВесИнфо = ?(Выб2.ВесПлан = 0 Или Выб2.ВесПлан = Выб2.Вес, 
					Формат(Выб2.Вес,"ЧДЦ=1"), Формат(Выб2.ВесПлан,"ЧДЦ=1") + "/" + Формат(Выб2.Вес,"ЧДЦ=1"));
			КонецЕсли;

			Стр2.ВремяДоставки = Формат(Выб2.ВремяДоставкиС, "ДФ=""ЧЧ:мм""") + "-" + Формат(Выб2.ВремяДоставкиПо, "ДФ=""ЧЧ:мм""");
			
			Стр2.ПоказатьФлагЕсть    = Истина;
			Стр2.Номер               = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выб2.Номер);
			Стр2.Дата                = Формат(Выб2.Дата, "ДЛФ=Д");
			Стр2.СтоимостьДоставки   = Выб2.СуммаДокумента;
		КонецЦикла;
	КонецЦикла;

	КоличествоМаршрутов = НомерПП;

	ЗаполнитьКоличествоПалетВес();
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеЗаданий()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Запрос.УстановитьПараметр("Рейсы", Объект.Рейсы.Выгрузить());
	Запрос.УстановитьПараметр("Распоряжения", Объект.Распоряжения.Выгрузить());

	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	т.ТранспортноеСредство КАК ТранспортноеСредство,
	|	т.Водитель КАК Водитель,
	|	т.ВремяЗагрузки КАК ВремяЗагрузки,
	|	т.ВремяЗагрузкиФакт КАК ВремяЗагрузкиФакт,
	|	т.СтоимостьДоставки КАК СтоимостьДоставки,
	|	т.Пробег КАК Пробег,
	|	т.Отправлено КАК Отправлено
	|ПОМЕСТИТЬ рейсы
	|ИЗ
	|	&Рейсы КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	т.ТранспортноеСредство КАК ТранспортноеСредство,
	|	т.ПорядокВМаршруте КАК ПорядокВМаршруте,
	|	т.Распоряжение КАК Распоряжение,
	|	т.ЕстьЧек КАК ЕстьЧек,
	|	т.СтоимостьЧека КАК СтоимостьЧека,
	|	т.ЕстьНарушениеДоговора КАК ЕстьНарушениеДоговора,
	|	т.ПунктДоговора КАК ПунктДоговора,
	|	т.СуммаШтрафа КАК СуммаШтрафа,
	|	т.ЕстьПретензия КАК ЕстьПретензия,
	|	т.СодержаниеПретензии КАК СодержаниеПретензии,
	|	т.СуммаПретензии КАК СуммаПретензии
	|ПОМЕСТИТЬ упд
	|ИЗ
	|	&Распоряжения КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	рейсы.ТранспортноеСредство КАК ТранспортноеСредство,
	|	Авто.Наименование КАК НаименованиеАвто,
	|	рейсы.Водитель КАК Водитель,
	|	рейсы.ВремяЗагрузки КАК ВремяЗагрузки,
	|	рейсы.ВремяЗагрузкиФакт КАК ВремяЗагрузкиФакт,
	|	рейсы.СтоимостьДоставки КАК СтоимостьДоставки,
	|	рейсы.Пробег КАК Пробег,
	|	рейсы.Отправлено КАК Отправлено,
	|	Авто._Перевозчик КАК Перевозчик,
	|	Авто.AMS_КоличествоПалет КАК Емкость,
	|	Авто.ГрузоподъемностьВТоннах КАК Тоннаж,
	|	Физ.Представление КАК Телефон,
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(рейсы.ВремяЗагрузки, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЗагрузкаРаньше
	|ПОМЕСТИТЬ рейсы1
	|ИЗ
	|	рейсы КАК рейсы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТранспортныеСредства КАК Авто
	|		ПО рейсы.ТранспортноеСредство = Авто.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.КонтактнаяИнформация КАК Физ
	|		ПО рейсы.Водитель = Физ.Ссылка
	|		И Физ.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонМобильныйФизическиеЛица)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упд.ТранспортноеСредство КАК ТранспортноеСредство,
	|	упд.ПорядокВМаршруте КАК ПорядокВМаршруте,
	|	ЗаказКлиента.AMS_КоличествоПалет КАК КоличествоПалет,
	|	ЗаказКлиента.AMS_КоличествоПалетПлан КАК КоличествоПалетПлан,
	|	ЗаказКлиента.AMS_Вес КАК Вес,
	|	ЗаказКлиента.AMS_ВесПлан КАК ВесПлан,
	|	ЗаказКлиента.ВремяДоставкиС КАК ВремяДоставкиС,
	|	ЗаказКлиента.ВремяДоставкиПо КАК ВремяДоставкиПо,
	|	ЗаказКлиента.Номер КАК Номер,
	|	ЗаказКлиента.Дата КАК Дата,
	|	ЛОЖЬ КАК ЕстьУПД,
	|	ЗаказКлиента.СуммаДокумента КАК СуммаДокумента,
	|	ЗаказКлиента.Партнер КАК Партнер,
	|	ЗаказКлиента.Автор КАК Менеджер,
	|	ЛОЖЬ КАК Подвоз,
	|	ЗаказКлиента.Ссылка КАК Распоряжение,
	|	ЗаказКлиента.ЗонаДоставки КАК ЗонаДоставки,
	|	ВЫБОР
	|		КОГДА ЗаказКлиента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу)
	|			ТОГДА ЗаказКлиента.АдресДоставкиПеревозчика
	|		ИНАЧЕ ЗаказКлиента.АдресДоставки
	|	КОНЕЦ КАК АдресДоставки,
	|	упд.ЕстьЧек КАК ЕстьЧек,
	|	упд.ЕстьНарушениеДоговора КАК ЕстьНарушениеДоговора,
	|	упд.ЕстьПретензия КАК ЕстьПретензия,
	|	ЛОЖЬ КАК УтвержденаОтгрузка,
	|	ЗаказКлиента.ПеревозчикПартнер КАК ПеревозчикПартнер,
	|	1 КАК Порядок
	|ПОМЕСТИТЬ упд1
	|ИЗ
	|	упд КАК упд
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
	|		ПО упд.Распоряжение = ЗаказКлиента.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	упд.ТранспортноеСредство,
	|	упд.ПорядокВМаршруте,
	|	Реал.AMS_КоличествоПалет,
	|	Реал.AMS_КоличествоПалетПлан,
	|	Реал.AMS_Вес,
	|	Реал.AMS_ВесПлан,
	|	Реал.ВремяДоставкиС,
	|	Реал.ВремяДоставкиПо,
	|	Реал.Номер,
	|	Реал.Дата,
	|	ВЫБОР
	|		КОГДА НЕ Реал.AMS_СтатусРеализации В (ЗНАЧЕНИЕ(Перечисление.AMS_СтатусыРеализаций.Заказ),
	|			ЗНАЧЕНИЕ(Перечисление.AMS_СтатусыРеализаций.Стикерование), ЗНАЧЕНИЕ(Перечисление.AMS_СтатусыРеализаций.КОтгрузке),
	|			ЗНАЧЕНИЕ(Перечисление.AMS_СтатусыРеализаций.Отгружено))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	Реал.СуммаДокумента,
	|	Реал.Партнер,
	|	Реал.Автор,
	|	ЛОЖЬ,
	|	Реал.Ссылка,
	|	Реал.ЗонаДоставки,
	|	ВЫБОР
	|		КОГДА Реал.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу)
	|			ТОГДА Реал.АдресДоставкиПеревозчика
	|		ИНАЧЕ Реал.АдресДоставки
	|	КОНЕЦ,
	|	упд.ЕстьЧек,
	|	упд.ЕстьНарушениеДоговора,
	|	упд.ЕстьПретензия,
	|	Реал.AMS_УтвержденаОтгрузка,
	|	Реал.ПеревозчикПартнер,
	|	2
	|ИЗ
	|	упд КАК упд
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК Реал
	|		ПО упд.Распоряжение = Реал.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	упд.ТранспортноеСредство,
	|	упд.ПорядокВМаршруте,
	|	Отгрузка.AMS_КоличествоПалет,
	|	Отгрузка.AMS_КоличествоПалетПлан,
	|	Отгрузка.AMS_Вес,
	|	Отгрузка.AMS_ВесПлан,
	|	Отгрузка.ВремяДоставкиС,
	|	Отгрузка.ВремяДоставкиПо,
	|	Отгрузка.Номер,
	|	Отгрузка.Дата,
	|	ЛОЖЬ,
	|	Отгрузка.СуммаДокумента,
	|	Отгрузка.Партнер,
	|	Отгрузка.Автор,
	|	ЛОЖЬ,
	|	Отгрузка.Ссылка,
	|	Отгрузка.ЗонаДоставки,
	|	ВЫБОР
	|		КОГДА Отгрузка.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу)
	|			ТОГДА Отгрузка.АдресДоставкиПеревозчика
	|		ИНАЧЕ Отгрузка.АдресДоставки
	|	КОНЕЦ,
	|	упд.ЕстьЧек,
	|	упд.ЕстьНарушениеДоговора,
	|	упд.ЕстьПретензия,
	|	ЛОЖЬ,
	|	Отгрузка.ПеревозчикПартнер,
	|	3
	|ИЗ
	|	упд КАК упд
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтгрузкаТоваровКлиенту КАК Отгрузка
	|		ПО упд.Распоряжение = Отгрузка.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	упд.ТранспортноеСредство,
	|	упд.ПорядокВМаршруте,
	|	Маркетплейс.AMS_КоличествоПалет,
	|	Маркетплейс.AMS_КоличествоПалет,
	|	Маркетплейс.AMS_Вес,
	|	Маркетплейс.AMS_Вес,
	|	Маркетплейс.ВремяДоставкиС,
	|	Маркетплейс.ВремяДоставкиПо,
	|	Маркетплейс.Номер,
	|	Маркетплейс.Дата,
	|	ЛОЖЬ,
	|	Маркетплейс.СуммаДокумента,
	|	Маркетплейс.Партнер,
	|	Маркетплейс.Автор,
	|	ЛОЖЬ,
	|	Маркетплейс.Ссылка,
	|	Маркетплейс.ЗонаДоставки,
	|	Маркетплейс.АдресДоставки,
	|	упд.ЕстьЧек,
	|	упд.ЕстьНарушениеДоговора,
	|	упд.ЕстьПретензия,
	|	ИСТИНА,
	|	Маркетплейс.ПеревозчикПартнер,
	|	4
	|ИЗ
	|	упд КАК упд
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю КАК Маркетплейс
	|		ПО упд.Распоряжение = Маркетплейс.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	упд.ТранспортноеСредство,
	|	упд.ПорядокВМаршруте,
	|	Перераб.AMS_КоличествоПалет,
	|	Перераб.AMS_КоличествоПалет,
	|	Перераб.AMS_Вес,
	|	Перераб.AMS_Вес,
	|	Перераб.ВремяДоставкиС,
	|	Перераб.ВремяДоставкиПо,
	|	Перераб.Номер,
	|	Перераб.Дата,
	|	ЛОЖЬ,
	|	Перераб.СуммаДокумента,
	|	Перераб.Партнер,
	|	Перераб.Ответственный,
	|	ЛОЖЬ,
	|	Перераб.Ссылка,
	|	Перераб.ЗонаДоставки,
	|	Перераб.АдресДоставки,
	|	упд.ЕстьЧек,
	|	упд.ЕстьНарушениеДоговора,
	|	упд.ЕстьПретензия,
	|	ИСТИНА,
	|	Перераб.Партнер,
	|	5
	|ИЗ
	|	упд КАК упд
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.AMS_ПередачаВПереработку КАК Перераб
	|		ПО упд.Распоряжение = Перераб.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	упд.ТранспортноеСредство,
	|	упд.ПорядокВМаршруте,
	|	Заказ.AMS_КоличествоПалет,
	|	Заказ.AMS_КоличествоПалет,
	|	Заказ.AMS_Вес,
	|	Заказ.AMS_Вес,
	|	Заказ.ВремяДоставкиС,
	|	Заказ.ВремяДоставкиПо,
	|	Заказ.Номер,
	|	Заказ.Дата,
	|	ЛОЖЬ,
	|	Заказ.СуммаДокумента,
	|	Заказ.Партнер,
	|	Заказ.Автор,
	|	ИСТИНА,
	|	Заказ.Ссылка,
	|	Заказ.ЗонаДоставки,
	|	Заказ.АдресДоставки,
	|	упд.ЕстьЧек,
	|	упд.ЕстьНарушениеДоговора,
	|	упд.ЕстьПретензия,
	|	ЛОЖЬ,
	|	Заказ.ПеревозчикПартнер,
	|	6
	|ИЗ
	|	упд КАК упд
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК Заказ
	|		ПО упд.Распоряжение = Заказ.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	упд.ТранспортноеСредство,
	|	упд.ПорядокВМаршруте,
	|	Заявка.AMS_КоличествоПалет,
	|	Заявка.AMS_КоличествоПалет,
	|	Заявка.AMS_Вес,
	|	Заявка.AMS_Вес,
	|	Заявка.ВремяДоставкиС,
	|	Заявка.ВремяДоставкиПо,
	|	Заявка.Номер,
	|	Заявка.Дата,
	|	ЛОЖЬ,
	|	Заявка.СуммаДокумента,
	|	Заявка.Партнер,
	|	Заявка.Автор,
	|	ИСТИНА,
	|	Заявка.Ссылка,
	|	Заявка.ЗонаДоставки,
	|	Заявка.АдресДоставки,
	|	упд.ЕстьЧек,
	|	упд.ЕстьНарушениеДоговора,
	|	упд.ЕстьПретензия,
	|	ЛОЖЬ,
	|	Заявка.ПеревозчикПартнер,
	|	7
	|ИЗ
	|	упд КАК упд
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаВозвратТоваровОтКлиента КАК Заявка
	|		ПО упд.Распоряжение = Заявка.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	рейсы1.ТранспортноеСредство КАК ТранспортноеСредство,
	|	упд1.Распоряжение КАК Распоряжение,
	|	рейсы1.Водитель КАК Водитель,
	|	рейсы1.Телефон КАК Телефон,
	|	упд1.АдресДоставки КАК АдресДоставки,
	|	рейсы1.Пробег КАК Пробег,
	|	рейсы1.Емкость КАК Емкость,
	|	упд1.КоличествоПалет КАК КоличествоПалет,
	|	упд1.КоличествоПалетПлан КАК КоличествоПалетПлан,
	|	упд1.Вес КАК Вес,
	|	упд1.ВесПлан КАК ВесПлан,
	|	рейсы1.ВремяЗагрузки КАК ВремяЗагрузки,
	|	рейсы1.ВремяЗагрузкиФакт КАК ВремяЗагрузкиФакт,
	|	рейсы1.Отправлено КАК Отправлено,
	|	упд1.ВремяДоставкиС КАК ВремяДоставкиС,
	|	упд1.ВремяДоставкиПо КАК ВремяДоставкиПо,
	|	упд1.Номер КАК Номер,
	|	упд1.Дата КАК Дата,
	|	упд1.ЕстьУПД КАК ЕстьУПД,
	|	рейсы1.СтоимостьДоставки КАК СтоимостьДоставки,
	|	упд1.СуммаДокумента КАК СуммаДокумента,
	|	рейсы1.Перевозчик КАК Перевозчик,
	|	упд1.Партнер КАК Партнер,
	|	рейсы1.ЗагрузкаРаньше КАК ЗагрузкаРаньше,
	|	упд1.ЕстьЧек КАК ЕстьЧек,
	|	упд1.ЕстьНарушениеДоговора КАК ЕстьНарушениеДоговора,
	|	упд1.ЕстьПретензия КАК ЕстьПретензия,
	|	упд1.Менеджер КАК Менеджер,
	|	упд1.УтвержденаОтгрузка КАК УтвержденаОтгрузка,
	|	упд1.Подвоз КАК Подвоз,
	|	рейсы1.Тоннаж КАК Тоннаж,
	|	рейсы1.НаименованиеАвто КАК НаименованиеАвто,
	|	упд1.ПорядокВМаршруте КАК ПорядокВМаршруте,
	|	упд1.Порядок КАК Порядок
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	рейсы1 КАК рейсы1
	|		ЛЕВОЕ СОЕДИНЕНИЕ упд1 КАК упд1
	|		ПО рейсы1.ТранспортноеСредство = упд1.ТранспортноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.Распоряжение КАК Распоряжение,
	|	МАКСИМУМ(Адреса.Расстояние) КАК Расстояние
	|ПОМЕСТИТЬ км
	|ИЗ
	|	вт КАК вт
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.AMS_АдресаДоставки КАК Адреса
	|		ПО вт.АдресДоставки = Адреса.Наименование
	|ГДЕ
	|	Адреса.Расстояние > 0
	|СГРУППИРОВАТЬ ПО
	|	вт.Распоряжение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.ТранспортноеСредство КАК ТранспортноеСредство,
	|	вт.Распоряжение КАК Распоряжение,
	|	вт.Водитель КАК Водитель,
	|	вт.Телефон КАК Телефон,
	|	вт.АдресДоставки КАК АдресДоставки,
	|	вт.Пробег КАК Пробег,
	|	вт.Емкость КАК Емкость,
	|	вт.КоличествоПалет КАК КоличествоПалет,
	|	вт.КоличествоПалетПлан КАК КоличествоПалетПлан,
	|	вт.Вес КАК Вес,
	|	вт.ВесПлан КАК ВесПлан,
	|	вт.ВремяЗагрузки КАК ВремяЗагрузки,
	|	вт.ВремяЗагрузкиФакт КАК ВремяЗагрузкиФакт,
	|	вт.Отправлено КАК Отправлено,
	|	вт.ВремяДоставкиС КАК ВремяДоставкиС,
	|	вт.ВремяДоставкиПо КАК ВремяДоставкиПо,
	|	вт.Номер КАК Номер,
	|	вт.Дата КАК Дата,
	|	вт.ЕстьУПД КАК ЕстьУПД,
	|	вт.СтоимостьДоставки КАК СтоимостьДоставки,
	|	вт.СуммаДокумента КАК СуммаДокумента,
	|	вт.Перевозчик КАК Перевозчик,
	|	вт.Партнер КАК Партнер,
	|	вт.ЗагрузкаРаньше КАК ЗагрузкаРаньше,
	|	вт.ЕстьЧек КАК ЕстьЧек,
	|	вт.ЕстьНарушениеДоговора КАК ЕстьНарушениеДоговора,
	|	вт.ЕстьПретензия КАК ЕстьПретензия,
	|	вт.Менеджер КАК Менеджер,
	|	вт.УтвержденаОтгрузка КАК УтвержденаОтгрузка,
	|	вт.Подвоз КАК Подвоз,
	|	вт.Тоннаж КАК Тоннаж,
	|	вт.НаименованиеАвто КАК НаименованиеАвто,
	|	вт.ПорядокВМаршруте КАК ПорядокВМаршруте,
	|	км.Расстояние КАК Расстояние,
	|	вт.Порядок КАК Порядок
	|ИЗ
	|	вт КАК вт
	|		ЛЕВОЕ СОЕДИНЕНИЕ км КАК км
	|		ПО вт.Распоряжение = км.Распоряжение
	|
	|УПОРЯДОЧИТЬ ПО
	|	Емкость УБЫВ,
	|	НаименованиеАвто,
	|	ПорядокВМаршруте
	|ИТОГИ
	|	МАКСИМУМ(Водитель),
	|	МАКСИМУМ(Телефон),
	|	МАКСИМУМ(АдресДоставки),
	|	МАКСИМУМ(Пробег),
	|	МАКСИМУМ(Емкость),
	|	МАКСИМУМ(КоличествоПалет),
	|	МАКСИМУМ(КоличествоПалетПлан),
	|	СУММА(Вес),
	|	СУММА(ВесПлан),
	|	МАКСИМУМ(ВремяЗагрузки),
	|	МАКСИМУМ(ВремяЗагрузкиФакт),
	|	МАКСИМУМ(Отправлено),
	|	МАКСИМУМ(ВремяДоставкиС),
	|	МАКСИМУМ(ВремяДоставкиПо),
	|	МАКСИМУМ(СтоимостьДоставки),
	|	СУММА(СуммаДокумента),
	|	МАКСИМУМ(Перевозчик),
	|	МАКСИМУМ(Партнер),
	|	МИНИМУМ(ЗагрузкаРаньше),
	|	МАКСИМУМ(ЕстьЧек),
	|	МАКСИМУМ(ЕстьНарушениеДоговора),
	|	МАКСИМУМ(ЕстьПретензия),
	|	МАКСИМУМ(Менеджер),
	|	МИНИМУМ(УтвержденаОтгрузка),
	|	МАКСИМУМ(Тоннаж),
	|	МАКСИМУМ(ПорядокВМаршруте),
	|	МАКСИМУМ(Расстояние),
	|	МАКСИМУМ(НаименованиеАвто) КАК НаименованиеАвто
	|ПО
	|	ТранспортноеСредство";

	Возврат Запрос.Выполнить();
КонецФункции

&НаСервере
Функция ПолучитьКоличествоЗагруженныхУПД(Авто)
	Возврат Объект.Распоряжения.НайтиСтроки(Новый Структура("ТранспортноеСредство", Авто)).Количество();
КонецФункции
&НаСервере
Функция ПолучитьУПД(Авто)
	Возврат Объект.Распоряжения.НайтиСтроки(Новый Структура("ТранспортноеСредство", Авто))[0].Распоряжение;
КонецФункции

&НаСервере
Процедура УстановитьДатаЗагрузкиФакт(Авто, ДатаЗагрузкиФакт)
	Строки = Объект.Рейсы.НайтиСтроки(Новый Структура("ТранспортноеСредство", Авто));

	Для Каждого Стр Из Строки Цикл
		Стр.ВремяЗагрузкиФакт = ДатаЗагрузкиФакт + (Стр.ВремяЗагрузкиФакт - НачалоДня(Стр.ВремяЗагрузкиФакт));
	КонецЦикла;

	Модифицированность = Истина;
КонецПроцедуры
&НаСервере
Процедура УстановитьВремяЗагрузкиФакт(Авто, ВремяЗагрузкиФакт)
	Строки = Объект.Рейсы.НайтиСтроки(Новый Структура("ТранспортноеСредство", Авто));

	Для Каждого Стр Из Строки Цикл
		Стр.ВремяЗагрузкиФакт = НачалоДня(Стр.ВремяЗагрузкиФакт) + (ВремяЗагрузкиФакт - НачалоДня(ВремяЗагрузкиФакт));
	КонецЦикла;

	Модифицированность = Истина;
КонецПроцедуры
&НаСервере
Процедура УстановитьОтправлено(Авто, Отправлено)
	Строки = Объект.Рейсы.НайтиСтроки(Новый Структура("ТранспортноеСредство", Авто));

	Для Каждого Стр Из Строки Цикл
		Стр.Отправлено = Отправлено;
	КонецЦикла;
	
	Модифицированность = Истина;
КонецПроцедуры
&НаСервере
Процедура УстановитьЕстьЧек(Распоряжение, ЕстьЧек)
	Строки = Объект.Распоряжения.НайтиСтроки(Новый Структура("Распоряжение", Распоряжение));

	Для Каждого Стр Из Строки Цикл
		Стр.ЕстьЧек = ЕстьЧек;

		Если Не ЕстьЧек Тогда
			Стр.СтоимостьЧека = 0;
		КонецЕсли;
	КонецЦикла;

	ПоказатьДополнительноеВремя();

	Модифицированность = Истина;
КонецПроцедуры
&НаСервере
Процедура УстановитьЕстьНарушениеДоговора(Распоряжение, ЕстьНарушениеДоговора)
	Строки = Объект.Распоряжения.НайтиСтроки(Новый Структура("Распоряжение", Распоряжение));

	Для Каждого Стр Из Строки Цикл
		Стр.ЕстьНарушениеДоговора = ЕстьНарушениеДоговора;

		Если Не ЕстьНарушениеДоговора Тогда
			Стр.ПунктДоговора = Неопределено;
			Стр.СуммаШтрафа   = 0;
		КонецЕсли;
	КонецЦикла;

	ПоказатьНарушенияДоговора();

	Модифицированность = Истина;
КонецПроцедуры
&НаСервере
Процедура УстановитьЕстьПретензия(Распоряжение, ЕстьПретензия)
	Строки = Объект.Распоряжения.НайтиСтроки(Новый Структура("Распоряжение", Распоряжение));

	Для Каждого Стр Из Строки Цикл
		Стр.ЕстьПретензия = ЕстьПретензия;

		Если Не ЕстьПретензия Тогда
			Стр.СодержаниеПретензии  = "";
			Стр.СуммаПретензии       = 0;
		КонецЕсли;
	КонецЦикла;

	ПоказатьПретензии();

	Модифицированность = Истина;
КонецПроцедуры
&НаСервере
Процедура УстановитьЕстьУПД(Распоряжение, ЕстьУПД)
	Строки = Объект.Распоряжения.НайтиСтроки(Новый Структура("Распоряжение", Распоряжение));

	Для Каждого Стр Из Строки Цикл
		Стр.ЕстьУПД = ЕстьУПД;
	КонецЦикла;

	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиТаблицыФормыДополнительноеВремя

&НаСервере
Процедура ПоказатьДополнительноеВремя()
	ДополнительноеВремя.Очистить();

	Строки = Объект.Распоряжения.НайтиСтроки(Новый Структура("ЕстьЧек", Истина));

	НомерСтроки = 0;
	Для Каждого Стр Из Строки Цикл
		НомерСтроки = НомерСтроки + 1;
		НовСтр = ДополнительноеВремя.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Стр);
		НовСтр.НомерСтроки = НомерСтроки;
	КонецЦикла;

	КоличествоДопВремя = ДополнительноеВремя.Количество();
КонецПроцедуры

&НаСервере
Процедура УстановитьСтоимостьЧека(Авто, УПД, СтоимостьЧека)
	Строки = Объект.Распоряжения.НайтиСтроки(Новый Структура("ТранспортноеСредство,Распоряжение", Авто, УПД));

	Для Каждого Стр Из Строки Цикл
		Стр.СтоимостьЧека = СтоимостьЧека;
	КонецЦикла;

	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиТаблицыФормыНарушенияДоговора

&НаСервере
Процедура ПоказатьНарушенияДоговора()
	НарушенияДоговора.Очистить();

	Строки = Объект.Распоряжения.НайтиСтроки(Новый Структура("ЕстьНарушениеДоговора", Истина));

	НомерСтроки = 0;
	Для Каждого Стр Из Строки Цикл
		НомерСтроки = НомерСтроки + 1;
		НовСтр = НарушенияДоговора.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Стр);
		НовСтр.НомерСтроки = НомерСтроки;
	КонецЦикла;

	КоличествоНарушений = НарушенияДоговора.Количество();
КонецПроцедуры

&НаСервере
Процедура УстановитьПунктДоговора(Авто, УПД, ПунктДоговора)
	Строки = Объект.Распоряжения.НайтиСтроки(Новый Структура("ТранспортноеСредство,Распоряжение", Авто, УПД));

	Для Каждого Стр Из Строки Цикл
		Стр.ПунктДоговора = ПунктДоговора;
	КонецЦикла;

	Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Процедура УстановитьСуммаШтрафа(Авто, УПД, СуммаШтрафа)
	Строки = Объект.Распоряжения.НайтиСтроки(Новый Структура("ТранспортноеСредство,Распоряжение", Авто, УПД));

	Для Каждого Стр Из Строки Цикл
		Стр.СуммаШтрафа = СуммаШтрафа;
	КонецЦикла;

	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиТаблицыФормыПретензии

&НаКлиенте
Процедура ПослеВводаСодержания(Строка, Парам) Экспорт
	Если Не Строка = Неопределено Тогда
		УстановитьСодержаниеПретензии(Строка, Парам);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьСодержаниеПретензии(Строка, Парам)
	Строки = Объект.Распоряжения.НайтиСтроки(Новый Структура("ТранспортноеСредство,Распоряжение",
		Парам.ТранспортноеСредство, Парам.Распоряжение));
	Для Каждого Стр Из Строки Цикл
		Стр.СодержаниеПретензии = Строка;
	КонецЦикла;

	Строки = Претензии.НайтиСтроки(Новый Структура("ТранспортноеСредство,Распоряжение", Парам.ТранспортноеСредство,
		Парам.Распоряжение));
	Для Каждого Стр Из Строки Цикл
		Стр.СодержаниеПретензии = Строка;
	КонецЦикла;

	Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Процедура УстановитьСуммаПретензии(Авто, УПД, СуммаПретензии)
	Строки = Объект.Распоряжения.НайтиСтроки(Новый Структура("ТранспортноеСредство,Распоряжение", Авто, УПД));

	Для Каждого Стр Из Строки Цикл
		Стр.СуммаПретензии = СуммаПретензии;
	КонецЦикла;

	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область ДополнительныеПроцедурыФункции

&НаСервере
Процедура НастройкаФормы()
	ЭтоKhors     = AMS_ВызовСервера.ЭтоKhors();
	ЭтоЛогист    = Пользователи.РолиДоступны("AMS_Диспетчер") Или ЭтоKhors;
	ЭтоСклад     = Пользователи.РолиДоступны("_НачальникСклада");
	ЭтоМенеджер  = (Пользователи.РолиДоступны("_СтаршийМенеджер, AMS_МенеджерПродаж") 
						Или Не ПравоДоступа("Изменение", Метаданные.Документы.AMS_ЛогистическийЛист))
					И Не ЭтоKhors;
	ЭтоБухСклада = Пользователи.РолиДоступны("_БухгалтерСклада");

	План       = Объект.Статус = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление._СтатусыДоставки.План");
	Погрузка   = Объект.Статус = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление._СтатусыДоставки.Погрузка");
	Отправлено = Объект.Статус = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление._СтатусыДоставки.Отправлено");

	Элементы.Номер.ТолькоПросмотр = Истина;
	Элементы.Дата.ТолькоПросмотр  = Не План;

	Элементы.ОтменыДоставки.ТолькоПросмотр  = Не ЭтоKhors;
	Элементы.ВозвратыТоваров.ТолькоПросмотр = Не ЭтоKhors;

	Элементы.ФормаПечатьМаршрутныйЛистExcel.Доступность = ЭтоЛогист;

	Элементы.ФормаПечатьКомплектДокументов.Видимость   = ЭтоБухСклада Или ЭтоKhors;
	Элементы.ФормаПечатьКомплектДокументов.Доступность = Погрузка Или Отправлено;

	Элементы.ГруппаПлан.Видимость = Не Отправлено;

	Элементы.ЗаданияГруппаЕсть.Видимость = Отправлено И ЭтоЛогист;

	ТолькоПросмотр = Не (ЭтоЛогист Или ЭтоСклад);

	Если ЭтоЛогист Тогда 
		// Ничего не делаем (Логист может быть и Менеджером)
	ИначеЕсли ЭтоСклад Или ЭтоМенеджер Тогда
		Элементы.ЗаданияУдалитьДоставку.Видимость = Ложь;
		Элементы.ЗаданияВозвратТовара.Видимость   = Ложь;

		Если ЭтоСклад Тогда
			Элементы.ДополнительноеВремя.Видимость = Ложь;
			Элементы.НарушенияДоговора.Видимость   = Ложь;
			Элементы.Претензии.Видимость           = Ложь;
	
		ИначеЕсли ЭтоМенеджер Тогда
			Элементы.ТранспортМетка.Доступность = Ложь;
	
			Элементы.ТранспортВодитель.ТолькоПросмотр         = Истина;
			Элементы.ЗаданияГруппаЗагрузкаФакт.ТолькоПросмотр = Истина;
			Элементы.ЗаданияОтправлено.ТолькоПросмотр         = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
//	ЭтоМенеджер  = Пользователи.РолиДоступны("AMS_МенеджерПродаж");

	УсловноеОформление.Элементы.Очистить();
	
	//Транспорт
	//Изменить цвет текста, если транспорт не участвует в рейсе - снята Метка
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Транспорт.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Транспорт.Метка");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЗаблокированныйРеквизитЦвет);
	
	//Распоряжения: Заказ клиента - цвет фона розовый
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Распоряжения.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Распоряжения.Порядок");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 1;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ФонПодписьНеверна);
	
	//Распоряжения: Загрузка утверждена менеджером - цвет фона зеленый
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Распоряжения.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Распоряжения.УтвержденаОтгрузка");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветТекстаКонтрагентаДействующего);
	
	//Распоряжения: Зона не указана - вывести текст <зона не указана>
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РаспоряженияЗонаДоставки.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Распоряжения.ЗонаДоставки");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Справочники.ЗоныДоставки.ПустаяСсылка();

	//@skip-check new-font
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(, , , Истина));
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<зона не указана>'"));
	
	//Распоряжения: Подвоз товаров на наш склад
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Распоряжения.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Распоряжения.Подвоз");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Хаки);
	
	//Задания: Заказ клиента - цвет фона розовый
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Задания.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Задания.Порядок");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 1;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ФонПодписьНеверна);

	//Задания: Загрузка утверждена менеджером - цвет фона зеленый
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Задания.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Задания.УтвержденаОтгрузка");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветТекстаКонтрагентаДействующего);
	
	//Задания - Транспорт жирный
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Задания.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Задания.ТранспортНомер");
	ОтборЭлемента.ВидСравнения  = ВидСравненияКомпоновкиДанных.Заполнено;

	//@skip-check new-font
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(, , Истина));
	
	//Задания - Подвоз
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Задания.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Задания.Подвоз");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Хаки);
	
	//Задания - загрузку раньше выделить
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗаданияДатаЗагрузки.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Задания.ЗагрузкаРаньше");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ДобавленныйРеквизитФон);
	
	//ЗаданияВремяЗагрузки
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗаданияВремяЗагрузки.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Задания.ЗагрузкаРаньше");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ДобавленныйРеквизитФон);
	
	//ЗаданияДатаЗагрузкиФакт
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗаданияДатаЗагрузкиФакт.Имя);

	ГруппаИ = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;

	ОтборЭлемента = ГруппаИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Задания.ТранспортНомер");
	ОтборЭлемента.ВидСравнения  = ВидСравненияКомпоновкиДанных.Заполнено;

	ОтборЭлемента = ГруппаИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.Статус");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления._СтатусыДоставки.Погрузка;

	ОтборЭлемента = ГруппаИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЭтоМенеджер");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветФонаПоля);
	
	//ЗаданияВремяЗагрузкиФакт
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗаданияВремяЗагрузкиФакт.Имя);

	ГруппаИ = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;

	ОтборЭлемента = ГруппаИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Задания.ТранспортНомер");
	ОтборЭлемента.ВидСравнения  = ВидСравненияКомпоновкиДанных.Заполнено;

	ОтборЭлемента = ГруппаИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.Статус");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления._СтатусыДоставки.Погрузка;

	ОтборЭлемента = ГруппаИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЭтоМенеджер");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветФонаПоля);
	
	//ЗаданияОтправлено
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗаданияОтправлено.Имя);

	ГруппаИ = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;

	ОтборЭлемента = ГруппаИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Задания.ТранспортНомер");
	ОтборЭлемента.ВидСравнения  = ВидСравненияКомпоновкиДанных.Заполнено;

	ОтборЭлемента = ГруппаИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.Статус");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления._СтатусыДоставки.Погрузка;

	ОтборЭлемента = ГруппаИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЭтоМенеджер");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветФонаПоля);
	
	//Дополнительное время - ЗаданияЕстьЧек
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗаданияЕстьЧек.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Задания.ПоказатьФлагЕсть");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветФонаШапкиТаблицы);
	
	//ЗаданияЕстьНарушениеДоговора
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗаданияЕстьНарушениеДоговора.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Задания.ПоказатьФлагЕсть");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветФонаШапкиТаблицы);
	
	//ЗаданияЕстьПретензия
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗаданияЕстьПретензия.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Задания.ПоказатьФлагЕсть");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветФонаШапкиТаблицы);
КонецПроцедуры

&НаСервере
Процедура ПроверитьРаспоряженияПогрузка(Отказ = Ложь)
	Для Каждого Стр Из Объект.Распоряжения Цикл
		Док = Стр.Распоряжение;

		Если ТипЗнч(Док) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
			ДатаРейса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Док, "ДатаОтгрузки");
		ИначеЕсли ТипЗнч(Док) = Тип("ДокументСсылка.ЗаказПоставщику") Или ТипЗнч(Док) = Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента") Тогда
			ДатаРейса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Док, "ДатаПоступления");
		Иначе
			ДатаРейса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Док, "Дата");
		КонецЕсли;
	
		Если НачалоДня(Объект.Дата) <> НачалоДня(ДатаРейса) Тогда
			Текст = "Дата отгрузки/поступления " + Док + " не соответствует дате логистического листа.";
			ОбщегоНазначения.СообщитьПользователю(Текст, , , , Отказ);
		КонецЕсли;
	
		ПометкаУдаления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Док, "ПометкаУдаления");
		
		Если ПометкаУдаления Тогда
			Текст = "Документ " + Док + " помечен на удаление.";
			ОбщегоНазначения.СообщитьПользователю(Текст, , , , Отказ);
		КонецЕсли;
	КонецЦикла;

	Для Каждого Стр Из Объект.Рейсы Цикл
		Если Стр.Пробег = 0 Тогда
			Текст = "Для автомобиля " + Стр.ТранспортноеСредство + " не заполнено поле ""Расстояние""";
			ОбщегоНазначения.СообщитьПользователю(Текст, , , , Отказ);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКоличествоПалетВес()
	ПалетДоставка  = 0;
	ВесДоставка    = 0;
	ВесДоставка    = 0;

	Таб1 = Задания.ПолучитьЭлементы();
	Для Каждого Стр1 Из Таб1 Цикл
		Палет1 = 0;
		ПалетПлан1 = 0;
		Вес1 = 0;
		ВесПлан1 = 0;

		Таб2 = Стр1.ПолучитьЭлементы();
		Для Каждого Стр2 Из Таб2 Цикл
			Палет1     = Палет1 + Стр2.КоличествоПалет;
			ПалетПлан1 = ПалетПлан1 + ?(Стр2.КоличествоПалетПлан = 0, Стр2.КоличествоПалет, Стр2.КоличествоПалетПлан);
			Вес1       = Вес1 + Стр2.Вес;
			ВесПлан1   = ВесПлан1 + ?(Стр2.ВесПлан = 0, Стр2.Вес, Стр2.ВесПлан);
		КонецЦикла;

		Стр1.КоличествоПалетИнфо = ?(ПалетПлан1 = Палет1, Строка(Палет1), Строка(ПалетПлан1) + "/" + Строка(Палет1));
		Стр1.ВесИнфо = ?(ВесПлан1 = Вес1, Формат(Вес1, "ЧДЦ=1"), Формат(ВесПлан1, "ЧДЦ=1") + "/" + Формат(Вес1, "ЧДЦ=1"));

		ПалетДоставка = ПалетДоставка + Палет1;
		ВесДоставка   = ВесДоставка + Вес1;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПоказатьПретензии()
	Претензии.Очистить();

	Строки = Объект.Распоряжения.НайтиСтроки(Новый Структура("ЕстьПретензия", Истина));

	НомерСтроки = 0;
	Для Каждого Стр Из Строки Цикл
		НомерСтроки = НомерСтроки + 1;
		НовСтр = Претензии.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Стр);
		НовСтр.НомерСтроки = НомерСтроки;
	КонецЦикла;

	КоличествоПретензий = Претензии.Количество();
КонецПроцедуры

&НаСервере
Функция ПолучитьДатуОтгрузки(ИмяСобытия, Источник)
	Если ИмяСобытия = "Запись_ЗаказКлиента" Тогда
		//@skip-check bsl-legacy-check-string-literal
		ДатаОтгрузки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник, "ДатаОтгрузки");
	
	ИначеЕсли ИмяСобытия = "Запись_РеализацияТоваровУслуг" Или ИмяСобытия = "Запись_ПередачаТоваровХранителю" Или ИмяСобытия = "Запись_AMS_ПередачаВПереработку" Тогда 
		//@skip-check bsl-legacy-check-string-literal
		ДатаОтгрузки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник, "Дата");
	
	ИначеЕсли ИмяСобытия = "Запись_ЗаказПоставщику" Или ИмяСобытия = "Запись_ЗаявкаНаВозвратТоваровОтКлиента" Тогда
		//@skip-check bsl-legacy-check-string-literal
		ДатаОтгрузки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник, "ДатаПоступления");
	КонецЕсли;
	
	Возврат	ДатаОтгрузки;
КонецФункции

#КонецОбласти

#КонецОбласти