
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Договор = Параметры.Договор;
	Заголовок = "Приложения к " + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор,"НаименованиеДляПечати");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	т.Номер КАК Номер,
		|	т.Дата КАК Дата,
		|	т.ВидПриложения КАК ВидПриложения,
		|	т.Договор КАК Договор,
		|	т.Описание
		|ИЗ
		|	РегистрСведений._ПриложенияКДоговорам КАК т
		|ГДЕ
		|	т.Договор = &Договор
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата";
	
	Табл.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьЗакрыть(Команда)
	ЗаписатьПриложения();
	Закрыть(Истина);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаписатьПриложения()
	Набор = РегистрыСведений._ПриложенияКДоговорам.СоздатьНаборЗаписей();
	Набор.Отбор.Договор.Установить(Договор);
	
	Для каждого Стр Из Табл Цикл
		Запись = Набор.Добавить();
		ЗаполнитьЗначенияСвойств(Запись,Стр);
		Запись.Договор = Договор;
	КонецЦикла;
	
	Набор.Записать();
КонецПроцедуры

#КонецОбласти
