#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НастройкаФормы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЦехПриИзменении(Элемент)
	НастройкаФормы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	Если Не ЗначениеЗаполнено(Объект.Склад) Тогда
		ПоказатьПредупреждение( , "Не заполнено поле ""Склад"".");
	КонецЕсли;

	Если Объект.Товары.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, "Таблица товаров будет очищена. Продолжить выполнение операции?",
			РежимДиалогаВопрос.ДаНет);

	Иначе
		ЗаполнитьТовары();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДвижениеДокумента(Команда)
	СсылкаНаОбъект = Объект.Ссылка;
	Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ВидимостьКомандВариантовОтчетов", Ложь);
		ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
		ПараметрыФормы.Вставить("ПараметрКоманды", СсылкаНаОбъект);

		ОткрытьФорму("Отчет.ДвиженияДокумента.Форма", ПараметрыФормы, ЭтотОбъект, Истина);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;

	ЗаполнитьТовары();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТовары()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Сегмент", мср.СоответствиеСегментНоменклатурыОтЦеха().Получить(Объект.Склад));

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ тов
	|ИЗ
	|	РегистрСведений.НоменклатураСегмента КАК т
	|ГДЕ
	|	т.Сегмент = &Сегмент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦеныФасовки.Номенклатура КАК Номенклатура,
	|	ЦеныФасовки.Цена КАК Цена
	|ПОМЕСТИТЬ ц
	|ИЗ
	|	РегистрСведений._ЦеныФасовкиПродукции.СрезПоследних(&Дата, ) КАК ЦеныФасовки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тов.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ц.Цена, 100) КАК Цена
	|ИЗ
	|	тов КАК тов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ц КАК ц
	|		ПО тов.Номенклатура = ц.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	тов.Номенклатура.Наименование";

	Объект.Товары.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

&НаСервере
Процедура НастройкаФормы()
	Элементы.СтраницаТовары.Видимость = Не (Объект.Склад = AMS_ВызовСервера.СкладПродукции());
КонецПроцедуры

#КонецОбласти