
#Область ПрограммныйИнтерфейс

// ОБЩИЕ

Функция ПолучитьТекущуюДату() Экспорт
	
	Попытка
		ЧасовойПоясСервера = ЧасовойПояс(); 
		ТекущаяДатаСервера = ТекущаяДата(); 
		ЧасовойПоясИнформационнойБазы = ПолучитьЧасовойПоясИнформационнойБазы();  
		УниверсальнаяДата = УниверсальноеВремя(ТекущаяДатаСервера, ЧасовойПоясСервера);  
		ТекущаяДатаИнформационнойБазы = МестноеВремя(УниверсальнаяДата, ЧасовойПоясИнформационнойБазы); 
	Исключение       
		ТекущаяДатаИнформационнойБазы = ТекущаяДата();
	КонецПопытки; 
	
	Возврат ТекущаяДатаИнформационнойБазы;
	
КонецФункции	

Функция ЕстьМаркировка() Экспорт
	
	ЕстьМаркировка = Ложь;	
	Попытка
		Если Метаданные.ОбщиеМодули.ИнтерфейсИСМП.Имя = "ИнтерфейсИСМП" Тогда
			ЕстьМаркировка = Истина;
		КонецЕсли;
	Исключение	
	КонецПопытки;
	
	Возврат ЕстьМаркировка;
	
КонецФункции

Функция ЕстьЕГАИС() Экспорт
	
	ЕстьЕГАИС = Ложь;
	
	Попытка
		Если Метаданные.РегистрыСведений.АкцизныеМаркиЕГАИС.Имя = "АкцизныеМаркиЕГАИС" Тогда
			ЕстьЕГАИС = Истина;
		КонецЕсли;
	Исключение		
	КонецПопытки;
	
	Возврат ЕстьЕГАИС;
	
КонецФункции

Функция ЕстьМДЛП() Экспорт
	
	ЕстьМДЛП = Ложь;	
	Попытка
		Если Метаданные.ОбщиеМодули.ИнтеграцияМДЛП.Имя = "ИнтеграцияМДЛП" Тогда
			ЕстьМДЛП = Истина;
		КонецЕсли;
	Исключение	
	КонецПопытки;
	
	Возврат ЕстьМДЛП;
	
КонецФункции

Функция ЕстьАСТ() Экспорт
	
	Возврат Метаданные.Справочники.Найти("астМаркиЕГАИС") <> Неопределено и Метаданные.Справочники.Найти("астНоменклатураЕГАИС") <> Неопределено;
	
КонецФункции	

Функция Есть115() Экспорт
	
	Есть115 = Ложь;
	
	Попытка
		Если Лев(Метаданные.Версия, 4) = "11.5" Или Лев(Метаданные.Версия, 3) = "2.5" Тогда
			Есть115 = Истина;
		КонецЕсли;
	Исключение		
	КонецПопытки;
	
	Попытка
		Если Метаданные.РегистрыСведений.ЦеныНоменклатуры25.Имя = "ЦеныНоменклатуры25" Тогда
			Есть115 = Истина;
		КонецЕсли;
	Исключение		
	КонецПопытки;
	
	Возврат Есть115;
	
КонецФункции

Функция ЕстьКТ2000() Экспорт
	
	Возврат Метаданные.Справочники.Найти("алкКлассификаторАлкогольнойПродукцииЕГАИС") <> Неопределено;
	
КонецФункции

Функция Ценообразование25() Экспорт
	
	Результат = Ложь;
	
	Попытка
		Если Метаданные.РегистрыСведений.ЦеныНоменклатуры25.Имя = "ЦеныНоменклатуры25" Тогда
			Если Константы.ИспользуетсяЦенообразование25.Получить() Тогда
				Результат = Истина;
			КонецЕсли;
		КонецЕсли;
	Исключение	КонецПопытки;
	
	Возврат Результат; 
	
КонецФункции

Функция ЕстьРегистрНакопления(ИмяРегистра) Экспорт
	
	ЕстьРегистр = Ложь;
	
	Попытка
		Если Метаданные.РегистрыНакопления[ИмяРегистра].Имя = ИмяРегистра Тогда
			ЕстьРегистр = Истина;
		КонецЕсли;
	Исключение		
	КонецПопытки;
	
	Возврат ЕстьРегистр;
	
КонецФункции

Функция ПроверкаИмениКонфигурации(ИмяКонфигурации) Экспорт
	
	Если СокрЛП(Метаданные.Имя) = ИмяКонфигурации Тогда 
		Возврат Истина;	
	Иначе
		Возврат Ложь;
	КонецЕсли;	
		
КонецФункции

Функция ОбщийМодуль(Имя) Экспорт
	
	Если Метаданные.ОбщиеМодули.Найти(Имя) <> Неопределено Тогда		
		Модуль = Вычислить(Имя);
	Иначе
		Модуль = Неопределено;
	КонецЕсли;
	
	Возврат Модуль;
	
КонецФункции

Функция СтарыйРежимСовместимости() Экспорт
	
	СтарыйРежимСовместимости = Ложь;
	
	Попытка
		Если Метаданные.РежимСовместимости = Метаданные.СвойстваОбъектов.РежимСовместимости.Версия8_3_6 Тогда
			СтарыйРежимСовместимости = Истина;
		КонецЕсли;	
	Исключение		
	КонецПопытки;
	
	Возврат СтарыйРежимСовместимости;
	
КонецФункции	

Процедура ДатаМобайл_Автообработка() Экспорт
	
	// Автообработка в фоне 
	ЗапросАвтообработкаВФоне = Новый Запрос;
	ЗапросАвтообработкаВФоне.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДатаМобайл_ШаблоныДокументов.Ссылка
	|ИЗ
	|	Справочник.ДатаМобайл_ШаблоныДокументов КАК ДатаМобайл_ШаблоныДокументов
	|ГДЕ
	|	(ДатаМобайл_ШаблоныДокументов.ФоноваяАвтовыгрузка
	|			ИЛИ ДатаМобайл_ШаблоныДокументов.ФоноваяАвтозагрузка
	|			ИЛИ ДатаМобайл_ШаблоныДокументов.ФоновоеАвтоудаление)
	|	И НЕ ДатаМобайл_ШаблоныДокументов.ПометкаУдаления";
	
	Результат = ЗапросАвтообработкаВФоне.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		Попытка
			АвтообработкаВФоне();
		Исключение
		КонецПопытки;   
	КонецЕсли;	

	// ОЧИСТКА ЛОГОВ
	Попытка 
		ОчисткаЛогов();
	Исключение 
	КонецПопытки;	
	
	// АВТОУДАЛЕНИЕ
	ЗапросШаблоновУдаление = Новый Запрос();
	ЗапросШаблоновУдаление.Текст = 
	"ВЫБРАТЬ
	|	ДатаМобайл_ШаблоныДокументов.УсловиеВыгрузки КАК УсловиеВыгрузки,
	|	ДатаМобайл_ШаблоныДокументов.ВидДокумента КАК ВидДокумента,
	|	ДатаМобайл_ШаблоныДокументов.Ссылка КАК Ссылка,
	|	ДатаМобайл_ШаблоныДокументов.УдалениеСтарыхДокументов КАК УдалениеСтарыхДокументов
	|ИЗ
	|	Справочник.ДатаМобайл_ШаблоныДокументов КАК ДатаМобайл_ШаблоныДокументов
	|ГДЕ
	|	НЕ ДатаМобайл_ШаблоныДокументов.УдалениеСтарыхДокументов = 0
	|	И НЕ ДатаМобайл_ШаблоныДокументов.ФоновоеАвтоудаление";
	
	ШаблоныУдаление = ЗапросШаблоновУдаление.Выполнить().Выгрузить();
	
	Для каждого ШаблонУдаление Из ШаблоныУдаление Цикл	
		ЗапросДокументовУдаление = Новый Запрос();
		ЗапросДокументовУдаление.Текст ="ВЫБРАТЬ &ПЕРВЫЕ
		|	ДатаМобайл_ДокументыТСД.Ссылка КАК Ссылка,
		|	ДатаМобайл_ДокументыТСД.ИсходныйДокумент.Дата КАК ИсходныйДокументДата,
		|	ДатаМобайл_ДокументыТСД.ДатаЗавершения КАК ДатаЗавершения
		|ИЗ
		|	Справочник.ДатаМобайл_ДокументыТСД КАК ДатаМобайл_ДокументыТСД
		|ГДЕ
		|	ДатаМобайл_ДокументыТСД.Шаблон = &Шаблон
		|	И ДатаМобайл_ДокументыТСД.ДатаЗавершения > ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)";
		ЗапросДокументовУдаление.УстановитьПараметр("Шаблон", ШаблонУдаление.Ссылка);
		
		Первые = ШаблонУдаление.Ссылка.АвтоудалениеКоличество;
		
		Если Первые = 0 Тогда
			ЗапросДокументовУдаление.Текст = СтрЗаменить(ЗапросДокументовУдаление.Текст, "&ПЕРВЫЕ", "");
		Иначе	
			ЗапросДокументовУдаление.Текст = СтрЗаменить(ЗапросДокументовУдаление.Текст, "&ПЕРВЫЕ", "ПЕРВЫЕ " + Формат(Первые, "ЧГ="));
		КонецЕсли;	
		
		ДокументыУдаление = ЗапросДокументовУдаление.Выполнить().Выгрузить();
		
		Для каждого ДокументУдаление Из ДокументыУдаление Цикл
			СекундыНаДни =  ШаблонУдаление.УдалениеСтарыхДокументов * 86400;
			
			Если ДокументУдаление.ИсходныйДокументДата = Null Тогда
				ДатаУдаления = ДокументУдаление.ДатаЗавершения + СекундыНаДни;						
			Иначе
				ДатаУдаления = ДокументУдаление.ИсходныйДокументДата + СекундыНаДни;
			КонецЕсли;
			
			ДатаСегодня = ПолучитьТекущуюДату();
			
			Если ДатаСегодня >= ДатаУдаления Тогда
				Попытка 
					ДокументУдаление.Ссылка.ПолучитьОбъект().Удалить();
				Исключение 
					ДокументУдаление.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;    
		
	// АВТОЗАГРУЗКА	
	ЗапросДокументовАвтозагрузка = Новый Запрос();
	ЗапросДокументовАвтозагрузка.Текст = "ВЫБРАТЬ
	|	ДатаМобайл_ДокументыТСД.Ссылка КАК Ссылка,
	|	ДатаМобайл_ДокументыТСД.ПланРавноФакт КАК ПланРавноФакт,
	|	ДатаМобайл_ДокументыТСД.Шаблон.ОбрабатыватьРоботомПланРавноФакт КАК ОбрабатыватьРоботомПланРавноФакт
	|ИЗ
	|	Справочник.ДатаМобайл_ДокументыТСД КАК ДатаМобайл_ДокументыТСД
	|ГДЕ
	|	ДатаМобайл_ДокументыТСД.Шаблон.ОбрабатыватьРоботом
	|	И НЕ ДатаМобайл_ДокументыТСД.ПометкаУдаления
	|	И ДатаМобайл_ДокументыТСД.ДатаЗавершенияСбора <> ДАТАВРЕМЯ(1, 1, 1)
	|	И ДатаМобайл_ДокументыТСД.ДатаЗавершения = ДАТАВРЕМЯ(1, 1, 1)
	|	И НЕ ДатаМобайл_ДокументыТСД.ОшибкаПриАвтозагрузке
	|	И НЕ ДатаМобайл_ДокументыТСД.Шаблон.ФоноваяАвтозагрузка";
	
	ДокументыАвтозагрузка = ЗапросДокументовАвтозагрузка.Выполнить().Выбрать();

	Пока ДокументыАвтозагрузка.Следующий() Цикл	 
		
		Если ДокументыАвтозагрузка.ОбрабатыватьРоботомПланРавноФакт Тогда
			Если Не ДокументыАвтозагрузка.ПланРавноФакт Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;

		Об = ДокументыАвтозагрузка.Ссылка.ПолучитьОбъект();
		Об.ДатаПриемкиОператором = ПолучитьТекущуюДату();
		Об.ОшибкаПриАвтозагрузкеОписание = "";
		Об.Записать();
		СтрокаОшибок = "";
		
		Попытка 
			Док = Обработки.ДатаМобайл_АРМДиспетчера.ВнестиДокументВБазу(Об, СтрокаОшибок);
		Исключение
			СтрокаОшибок = ОписаниеОшибки();
		КонецПопытки;	
		
		Если СтрокаОшибок <> "" Тогда
			Модуль_ОбщегоНазначенияКлиентСервер = ОбщийМодуль("ОбщегоНазначенияКлиентСервер");
			
			ИмяСобытия = НСтр("ru = 'Документ DataMobile'", Модуль_ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
			
			ТекстСообщения = НСтр("ru = 'Не удалось загрузить документ DataMobile: %Справочник% по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Справочник%", ДокументыАвтозагрузка.Ссылка);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", " " + СтрокаОшибок);
			ЗаписьЖурналаРегистрации(ИмяСобытия,
			УровеньЖурналаРегистрации.Ошибка,
			Справочники.ДатаМобайл_ДокументыТСД,
			ДокументыАвтозагрузка.Ссылка,
			ТекстСообщения);
			Если Об.Шаблон.НеОстанавливатьАвтозагрузкуДокументаПриОшибках Тогда
			Иначе	
				Об.ОшибкаПриАвтозагрузке 			= Истина;
				Об.ОшибкаПриАвтозагрузкеОписание 	= СтрокаОшибок;
				Об.ДатаЗавершения 					= Неопределено;
				Об.Записать();
			КонецЕсли;
		Иначе
			Обработки.ДатаМобайл_АРМДиспетчера.ЗаполнениеПроверкиИПодбораДокументаЕГАИС(Об.Ссылка, Док);	
		КонецЕсли;	
	КонецЦикла;
		
	// АВТОВЫГРУЗКА	
	ЗапросШаблоновАвтовыгрузка = Новый Запрос();
	ЗапросШаблоновАвтовыгрузка.Текст = "ВЫБРАТЬ
	|	ДатаМобайл_ШаблоныДокументов.УсловиеВыгрузки КАК УсловиеВыгрузки,
	|	ДатаМобайл_ШаблоныДокументов.ВидДокумента КАК ВидДокумента,
	|	ДатаМобайл_ШаблоныДокументов.Ссылка КАК Ссылка,
	|	ДатаМобайл_ШаблоныДокументов.ИмяТабличнойЧастиПодбор КАК ИмяТабличнойЧастиПодбор,
	|	ДатаМобайл_ШаблоныДокументов.УдалениеСтарыхДокументов КАК УдалениеСтарыхДокументов,
	|	ДатаМобайл_ШаблоныДокументов.МаркировкаВыгружатьРоботом КАК МаркировкаВыгружатьРоботом
	|ИЗ
	|	Справочник.ДатаМобайл_ШаблоныДокументов КАК ДатаМобайл_ШаблоныДокументов
	|ГДЕ
	|	НЕ ДатаМобайл_ШаблоныДокументов.ПометкаУдаления И (ДатаМобайл_ШаблоныДокументов.ВыгружатьРоботом ИЛИ ДатаМобайл_ШаблоныДокументов.МаркировкаВыгружатьРоботом)
	|	И НЕ ДатаМобайл_ШаблоныДокументов.ФоноваяАвтовыгрузка";
	ШаблоныАвтовыгрузка = ЗапросШаблоновАвтовыгрузка.Выполнить().Выгрузить();
	
	Для каждого ШаблонАвтовыгрузка Из ШаблоныАвтовыгрузка Цикл
		ЗапросДокументовАвтовыгрузка = Новый Запрос();
		ЗапросДокументовАвтовыгрузка.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
		|	Документ1С.Ссылка КАК ИсходныйДокумент
		|ПОМЕСТИТЬ ВТ_Документы		
		|ИЗ
		|	Документ.ПриобретениеТоваровУслуг КАК Документ1С		
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДатаМобайл_ДокументыТСД КАК ДатаМобайл_ДокументыТСД
		|		ПО Документ1С.Ссылка = ДатаМобайл_ДокументыТСД.ИсходныйДокумент
		|		И ДатаМобайл_ДокументыТСД.Шаблон = &Шаблон
		|		И 3=3
		|ГДЕ
		|	НЕ Документ1С.ПометкаУдаления
		|   И 2=2	
		|	И ДатаМобайл_ДокументыТСД.Ссылка ЕСТЬ NULL
		|	И (&УсловиеВключения)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|";
		
		ЗапросДокументовАвтовыгрузка.Текст = СтрЗаменить(ЗапросДокументовАвтовыгрузка.Текст, "ПриобретениеТоваровУслуг", ШаблонАвтовыгрузка.ВидДокумента);
		ЗапросДокументовАвтовыгрузка.Текст = СтрЗаменить(ЗапросДокументовАвтовыгрузка.Текст, "&УсловиеВключения", ?(СокрЛП(ШаблонАвтовыгрузка.УсловиеВыгрузки) = "", "1=1", ШаблонАвтовыгрузка.УсловиеВыгрузки));
		
		Если ШаблонАвтовыгрузка.УдалениеСтарыхДокументов <> 0 Тогда
			ЗапросДокументовАвтовыгрузка.Текст = СтрЗаменить(ЗапросДокументовАвтовыгрузка.Текст, "2=2", "Документ1С.Ссылка.Дата > &ДатаУдаления");
			ЗапросДокументовАвтовыгрузка.УстановитьПараметр("ДатаУдаления", ПолучитьТекущуюДату() - ШаблонАвтовыгрузка.УдалениеСтарыхДокументов * 86400);				
		КонецЕсли;                                                              
		ЗапросДокументовАвтовыгрузка.УстановитьПараметр("Шаблон", ШаблонАвтовыгрузка.Ссылка);
			
		Если ШаблонАвтовыгрузка.ВидДокумента = "ЗаказКлиента" И Найти(ШаблонАвтовыгрузка.УсловиеВыгрузки, "&СостоянияЗаказовКлиентов") > 0 Тогда
			СкорректироватьЗапросАвтовыгрузкиЗаказКлиента(ЗапросДокументовАвтовыгрузка.Текст);
		Иначе
			ЗапросДокументовАвтовыгрузка.Текст = СтрЗаменить(ЗапросДокументовАвтовыгрузка.Текст, "ПОМЕСТИТЬ ВТ_Документы", "");	
		КонецЕсли;
		
		Для каждого СтрПараметра Из ШаблонАвтовыгрузка.Ссылка.ПараметрыУсловияВыгрузки Цикл
			ЗапросДокументовАвтовыгрузка.УстановитьПараметр(СтрПараметра.ИмяПараметра, СтрПараметра.ЗначениеПараметра);
		КонецЦикла;
		
		Если ШаблонАвтовыгрузка.Ссылка.ПараметрыУсловияВыгрузкиТЧ.Количество() > 0 Тогда
			Если Не ШаблонАвтовыгрузка.Ссылка.ИспользоватьПодбор И ШаблонАвтовыгрузка.Ссылка.ИспользоватьПриемку Тогда
				ИмяТЧ = ШаблонАвтовыгрузка.Ссылка.ИмяТабличнойЧастиПриемка;
			Иначе
				ИмяТЧ = ШаблонАвтовыгрузка.Ссылка.ИмяТабличнойЧастиПодбор;
			КонецЕсли;
			
			ЗапросДокументовАвтовыгрузка.Текст = СтрЗаменить(ЗапросДокументовАвтовыгрузка.Текст, "И 3=3", "
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ." + ШаблонАвтовыгрузка.ВидДокумента + "." +  ИмяТЧ + " КАК Документ1СТЧ
			|			ПО Документ1С.Ссылка = Документ1СТЧ.Ссылка");
			
			Для каждого СтрПараметра Из ШаблонАвтовыгрузка.Ссылка.ПараметрыУсловияВыгрузкиТЧ Цикл
				ЗапросДокументовАвтовыгрузка.УстановитьПараметр(СтрПараметра.ИмяПараметра, СтрПараметра.ЗначениеПараметра);
			КонецЦикла;
		КонецЕсли;
		
		Если Найти(ШаблонАвтовыгрузка.УсловиеВыгрузки, "&ТекущаяДата") > 0 Тогда
			ЗапросДокументовАвтовыгрузка.УстановитьПараметр("ТекущаяДата", ПолучитьТекущуюДату()); // ПараметрПоУмолчанию
		КонецЕсли;
		
		ДокументыАвтовыгрузка = ЗапросДокументовАвтовыгрузка.Выполнить().Выбрать();
		Пока ДокументыАвтовыгрузка.Следующий() Цикл		
			Если ШаблонАвтовыгрузка.МаркировкаВыгружатьРоботом Тогда
				ВидПродукцииИСДокумента = ДатаМобайл_Маркировка.ПолучитьВидПродукцииИСДокумента(ДокументыАвтовыгрузка.ИсходныйДокумент, ШаблонАвтовыгрузка.ИмяТабличнойЧастиПодбор);
				Если Не ЗначениеЗаполнено(ВидПродукцииИСДокумента) Тогда 
					Продолжить;
				КонецЕсли; 
				
				Если ТипЗнч(ВидПродукцииИСДокумента) = Тип("Массив") Тогда
					Если ВидПродукцииИСДокумента.Количество() > 0 Тогда
						Если Не ЗначениеЗаполнено(ВидПродукцииИСДокумента[0]) Тогда
							Продолжить;
						КонецЕсли; 		
					Иначе
						Продолжить;
					КонецЕсли;	
				КонецЕсли; 	
			КонецЕсли; 	
			
			ДокТСД = Справочники.ДатаМобайл_ДокументыТСД.СоздатьЭлемент();
			ДокТСД.ИсходныйДокумент = ДокументыАвтовыгрузка.ИсходныйДокумент;
			ДокТСД.Шаблон = ШаблонАвтовыгрузка.Ссылка;
			ДокТСД.Записать();			
		КонецЦикла;
	КонецЦикла;
		
	// АВТОЗАВЕРШЕНИЕ ГРУППОВОГО ДОКУМЕНТА ПРИ СОВПАДЕНИИ ПЛАН С ФАКТОМ
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДатаМобайл_ДокументыТСД.Ссылка КАК Ссылка,
	|	ДатаМобайл_ДокументыТСД.ИсходныйДокумент КАК ИсходныйДокумент
	|ИЗ
	|	Справочник.ДатаМобайл_ДокументыТСД КАК ДатаМобайл_ДокументыТСД
	|ГДЕ
	|	ДатаМобайл_ДокументыТСД.Шаблон.ВыгружатьВыполненныйНаТСДДокументАвтоматически = ИСТИНА
	|	И ДатаМобайл_ДокументыТСД.Шаблон.ГрупповаяРабота = ИСТИНА 
	// ++ исключаем родительский документ с распределением на устройстве
	|	И (ДатаМобайл_ДокументыТСД.Шаблон.РаспределениеТоваров <> 2 
	|	ИЛИ (ДатаМобайл_ДокументыТСД.Шаблон.РаспределениеТоваров = 2 
	|	И НЕ ДатаМобайл_ДокументыТСД.РодительскийДокумент = ЗНАЧЕНИЕ(Справочник.ДатаМобайл_ДокументыТСД.ПустаяСсылка)))  
	// --   
	|	И ДатаМобайл_ДокументыТСД.ДатаНачалаСбора <> ДАТАВРЕМЯ(1, 1, 1)
	|	И ДатаМобайл_ДокументыТСД.ДатаЗавершенияСбора = ДАТАВРЕМЯ(1, 1, 1)
	|	И ДатаМобайл_ДокументыТСД.ПометкаУдаления = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Обработки.ДатаМобайл_АРМДиспетчера.ПланРавноФакт(Выборка.Ссылка, Выборка.ИсходныйДокумент,,Истина) Тогда
			СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
			СправочникОбъект.ПланРавноФакт = Истина;
			СправочникОбъект.ДатаЗавершенияСбора = ПолучитьТекущуюДату();
			СправочникОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
	
	// Очистка полного КМ и GS1 в ТЧ документа тсд
	ЗапросШаблоновПолногоКМ = Новый Запрос();
	ЗапросШаблоновПолногоКМ.Текст = "ВЫБРАТЬ
	|	ДатаМобайл_ШаблоныДокументов.УсловиеВыгрузки КАК УсловиеВыгрузки,
	|	ДатаМобайл_ШаблоныДокументов.ВидДокумента КАК ВидДокумента,
	|	ДатаМобайл_ШаблоныДокументов.Ссылка КАК Ссылка,
	|	ДатаМобайл_ШаблоныДокументов.МаркировкаОчищатьПолныеКМ КАК ОчищатьПолныеКМ
	|ИЗ
	|	Справочник.ДатаМобайл_ШаблоныДокументов КАК ДатаМобайл_ШаблоныДокументов
	|ГДЕ
	|	НЕ ДатаМобайл_ШаблоныДокументов.МаркировкаОчищатьПолныеКМ = 0";
	
	ШаблоныПолногоКМ = ЗапросШаблоновПолногоКМ.Выполнить().Выгрузить();
	
	Для каждого ШаблонПолногоКМ Из ШаблоныПолногоКМ Цикл	
		ЗапросДокументовПолногоКМ = Новый Запрос();
		ЗапросДокументовПолногоКМ.Текст = "ВЫБРАТЬ
		|	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ДатаМобайл_ДокументыТСД.СобранныеДанныеПодбор КАК ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор
		|ГДЕ
		|	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.Дата < &ДатаОтсчета
		|	И (ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.ПолныйКодМаркировки <> """"
		|			ИЛИ ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.GS1 <> """")
		|
		|СГРУППИРОВАТЬ ПО
		|	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.Ссылка";
		
		ДатаОтсчета = ПолучитьТекущуюДату() - ШаблонПолногоКМ.ОчищатьПолныеКМ * 86400;
		
		ЗапросДокументовПолногоКМ.УстановитьПараметр("Шаблон"		, ШаблонПолногоКМ.Ссылка);
		ЗапросДокументовПолногоКМ.УстановитьПараметр("ДатаОтсчета"	, ДатаОтсчета);
		
		ДокументыПолногоКМ = ЗапросДокументовПолногоКМ.Выполнить().Выгрузить();
		
		Для каждого ДокументПолногоКМ Из ДокументыПолногоКМ Цикл
			ДокументОбъект = ДокументПолногоКМ.Ссылка.ПолучитьОбъект();
			СобранныеДанные = ДокументОбъект.СобранныеДанныеПодбор;
			
			Для каждого СтрокаТЧ Из СобранныеДанные Цикл
				СтрокаТЧ.ПолныйКодМаркировки = "";
				СтрокаТЧ.GS1                 = "";
			КонецЦикла;
			ДокументОбъект.Записать();
		КонецЦикла;
	КонецЦикла;
	
	// Очистка идентификатора задания, если типовое задание отработало
	ЗапросИдентификаторЗадания = Новый Запрос;
	ЗапросИдентификаторЗадания.Текст = "ВЫБРАТЬ
	|	ДатаМобайл_ДокументыТСД.Ссылка КАК Ссылка,
	|	ДатаМобайл_ДокументыТСД.ИдентификаторФоновогоЗадания КАК ИдентификаторФоновогоЗадания,
	|	ДатаМобайл_ДокументыТСД.ИсходныйДокумент КАК ИсходныйДокумент
	|ИЗ
	|	Справочник.ДатаМобайл_ДокументыТСД КАК ДатаМобайл_ДокументыТСД
	|ГДЕ
	|	НЕ ДатаМобайл_ДокументыТСД.ПометкаУдаления
	|	И ДатаМобайл_ДокументыТСД.Шаблон.МаркировкаСоздаватьВФоне
	|	И ДатаМобайл_ДокументыТСД.ИдентификаторФоновогоЗадания <> """"";
	
	ВыборкаИдентификаторЗадания = ЗапросИдентификаторЗадания.Выполнить().Выбрать();
	
	Модуль_ДлительныеОперации = ДатаМобайл_ОбщийМодуль.ОбщийМодуль("ДлительныеОперации");
	
	Пока ВыборкаИдентификаторЗадания.Следующий() Цикл
		Если Не ЗначениеЗаполнено(ВыборкаИдентификаторЗадания.ИсходныйДокумент) Тогда Продолжить; КонецЕсли; 
		
		Попытка   
			Если Модуль_ДлительныеОперации.ЗаданиеВыполнено(Новый УникальныйИдентификатор(ВыборкаИдентификаторЗадания.ИдентификаторФоновогоЗадания)) Тогда
				ДокументТСДОбъект = ВыборкаИдентификаторЗадания.Ссылка.ПолучитьОбъект();
				ДокументТСДОбъект.ИдентификаторФоновогоЗадания = "";
				
				Попытка
					ДокументТСДОбъект.Записать();
				Исключение 
					ДатаМобайл_ОбщийМодуль.ОбработатьИсключение(0, "ДатаМобайл_Автообработка", ОписаниеОшибки());
				КонецПопытки;
			КонецЕсли;
		Исключение 
			// Если фоновое задание было выполнено и удалено
			ДокументТСДОбъект = ВыборкаИдентификаторЗадания.Ссылка.ПолучитьОбъект();
			ДокументТСДОбъект.ИдентификаторФоновогоЗадания = "";
			
			Попытка
				ДокументТСДОбъект.Записать();
			Исключение 
				ДатаМобайл_ОбщийМодуль.ОбработатьИсключение(0, "ДатаМобайл_Автообработка", ОписаниеОшибки());
			КонецПопытки;
		КонецПопытки;	
	КонецЦикла;
	
	// ФИКСАЦИЯ ПЛАН-ФАКТ
	ЗапросПланФакт = Новый Запрос;
	ЗапросПланФакт.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 200
	|	ДокументыТСД.Ссылка,
	|	ЕСТЬNULL(ДокументыТСД.ИсходныйДокумент, NULL) КАК ИсходныйДокумент,
	|	ДокументыТСД.ПланРавноФакт КАК ПланРавноФакт
	|ИЗ
	|	Справочник.ДатаМобайл_ДокументыТСД КАК ДокументыТСД
	|ГДЕ
	|	НЕ ДокументыТСД.ПометкаУдаления
	|	И ДокументыТСД.ДатаЗавершения = ДАТАВРЕМЯ(1, 1, 1)
	|	И НЕ ДокументыТСД.ДатаЗавершенияСбора = ДАТАВРЕМЯ(1, 1, 1)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДокументыТСД.ДатаЗавершенияСбора УБЫВ";
	
	ВыборкаПланФакт = ЗапросПланФакт.Выполнить().Выбрать();
	
	Пока ВыборкаПланФакт.Следующий() Цикл
		Если Не ЗначениеЗаполнено(ВыборкаПланФакт.ИсходныйДокумент) Тогда Продолжить; КонецЕсли;
		ПланРавноФакт = Обработки.ДатаМобайл_АРМДиспетчера.ПланРавноФакт(ВыборкаПланФакт.Ссылка, ВыборкаПланФакт.ИсходныйДокумент); 
		
		Если Не ПланРавноФакт = ВыборкаПланФакт.ПланРавноФакт Тогда
			докОб = ВыборкаПланФакт.Ссылка.ПолучитьОбъект();
			докОб.ПланРавноФакт = ПланРавноФакт;
			
			Попытка
				докОб.Записать();
			Исключение КонецПопытки;
		КонецЕсли;
	КонецЦикла;

	// ЕГАИС ОПТ
	ДатаМобайл_Автообработка_ЕГАИС_ОПТ();
	
КонецПроцедуры

Функция ПолучитьСписокЗаказовЗаданияНаПеревозку(ДокументДляОтправки) Экспорт
	
	//ВЫБЕРЕМ ЗАКАЗЫ В ЗАДАНИИ НА ПЕРЕВОЗКУ
	//ЗАКАЗЫ, РЕАЛИЗАЦИИ, ПОРУЧЕНИЕ ЭКСПЕДИТОРУ 
	ЗапросРаспоряженийЗаказов = Новый Запрос();
	ЗапросРаспоряженийЗаказов.Текст = "ВЫБРАТЬ
	|	ДокументЗадания.Распоряжение КАК Распоряжение
	|ПОМЕСТИТЬ ТаблицаРаспоряжений
	|ИЗ
	|	Документ.ЗаданиеНаПеревозку.Распоряжения КАК ДокументЗадания
	|ГДЕ
	|	ДокументЗадания.Ссылка = &ДокументВыгрузкиСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗаказы.Распоряжение КАК Распоряжение
	|ИЗ
	|	ТаблицаРаспоряжений КАК ТаблицаЗаказы
	|ГДЕ
	|	ТаблицаЗаказы.Распоряжение ССЫЛКА Документ.ЗаказКлиента
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ТаблицаРеализации.Распоряжение.ЗаказКлиента
	|ИЗ
	|	ТаблицаРаспоряжений КАК ТаблицаРеализации
	|ГДЕ
	|	ТаблицаРеализации.Распоряжение.ЗаказКлиента ССЫЛКА Документ.ЗаказКлиента
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ПорученияЭкспедитору.Основание.ЗаказКлиента
	|ИЗ
	|	ТаблицаРаспоряжений КАК ТаблицаПорученияЭкспедитору
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоручениеЭкспедитору.Основания КАК ПорученияЭкспедитору
	|		ПО (ПорученияЭкспедитору.Ссылка = ТаблицаПорученияЭкспедитору.Распоряжение)
	|ГДЕ
	|	ПорученияЭкспедитору.Основание.ЗаказКлиента ССЫЛКА Документ.ЗаказКлиента
	|	И НЕ ПорученияЭкспедитору.Основание.ЗаказКлиента ЕСТЬ NULL
	|	И ПорученияЭкспедитору.Основание.ЗаказКлиента <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ПорученияЭкспедитору.Основание
	|ИЗ
	|	ТаблицаРаспоряжений КАК ТаблицаПорученияЭкспедитору
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоручениеЭкспедитору.Основания КАК ПорученияЭкспедитору
	|		ПО (ПорученияЭкспедитору.Ссылка = ТаблицаПорученияЭкспедитору.Распоряжение)
	|ГДЕ
	|	ПорученияЭкспедитору.Основание ССЫЛКА Документ.ЗаказКлиента
	|	И ПорученияЭкспедитору.Основание <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)";  
	
	ЗапросРаспоряженийЗаказов.УстановитьПараметр("ДокументВыгрузкиСсылка", ДокументДляОтправки);
	МассивЗаказов = ЗапросРаспоряженийЗаказов.Выполнить().Выгрузить().ВыгрузитьКолонку("Распоряжение");
		
	Возврат МассивЗаказов;
	
КонецФункции

Функция ПолучитьВерсиюАРМ(ПроцедураВызова = "") Экспорт
	
	ВерсияАРМ = "";
	
	Попытка
		
		ВерсияАРМ = СокрЛП(Метаданные.Обработки.ДатаМобайл_АРМДиспетчера.Синоним);
		
		Если СтрНайти(ВерсияАРМ, "v") = 0 Тогда 
			ВерсияАРМ = СокрЛП(Метаданные.Обработки.ДатаМобайл_АРМДиспетчера.Формы.Управляемая.Синоним);
		КонецЕсли; 
		
		Если ПроцедураВызова = "Login" Тогда
		
			ВерсияАРМ = СтрЗаменить(ВерсияАРМ, "DataMobile: АРМ диспетчера (", "");
			ВерсияАРМ = СтрЗаменить(ВерсияАРМ, ") v.3", "");
			
		КонецЕсли;

	Исключение 
		
	КонецПопытки;
	
	Возврат ВерсияАРМ;
	
КонецФункции

Процедура СкорректироватьЗапросАвтовыгрузкиЗаказКлиента(ТекстЗапроса) Экспорт
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Документ1с.СостоянияЗаказовКлиентов = &СостоянияЗаказовКлиентов", "3=3");
	
	ТекстЗапроса = ТекстЗапроса +
	"ВЫБРАТЬ
	|	СостоянияЗаказовКлиентов.Заказ КАК ИсходныйДокумент
	|ИЗ
	|	РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
	|ГДЕ
	|	СостоянияЗаказовКлиентов.Состояние = &СостоянияЗаказовКлиентов
	|	И СостоянияЗаказовКлиентов.Заказ В
	|			(ВЫБРАТЬ
	|				ВТ_Документы.ИсходныйДокумент КАК ИсходныйДокумент
	|			ИЗ
	|				ВТ_Документы КАК ВТ_Документы)";
	
КонецПроцедуры

Функция ЭтоКонфигурацияДляУзбекистана() Экспорт
	
	ЭтоКонфигурацияДляУзбекистана = Ложь;
	
	Попытка
		
		Если Метаданные.Имя = "УправлениеТорговлейДляУзбекистана" Тогда
			ЭтоКонфигурацияДляУзбекистана = Истина;
		КонецЕсли;
		
	Исключение
		ДатаМобайл_ОбщийМодуль.ОбработатьИсключение(0, "ЭтоКонфигурацияДляУзбекистана", ОписаниеОшибки());
	КонецПопытки;
	
	Возврат ЭтоКонфигурацияДляУзбекистана;	
	
КонецФункции

Процедура СообщитьПользователю(Текст) Экспорт 
	
	Попытка
		Модуль_ОбщегоНазначенияКлиентСервер = ОбщийМодуль("ОбщегоНазначенияКлиентСервер");
		Модуль_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
	Исключение		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = Текст;
		Сообщение.Сообщить();
	КонецПопытки;
	
КонецПроцедуры

Функция ВерсияЧислом(Знач ВерсияПО) Экспорт
	
	МаскаВерсии = "##.##.###"; // маска	
	ВерсияПОЧислом = "";
	
	СтрокаПоВерсии = СтрЗаменить(ВерсияПО, ".", Символы.ПС);; 
	СтрокаПоМаске  = СтрЗаменить(МаскаВерсии, ".", Символы.ПС);
	
	// разбор по маске
	Для Сч = 1 По СтрЧислоСтрок(СтрокаПоМаске) Цикл
		ЧастьБлокаМаски  = СтрПолучитьСтроку(СтрокаПоМаске, Сч);
		ЧастьБлокаВерсии = "";
		КолСимволовБлока = СтрДлина(ЧастьБлокаМаски);
		
		Попытка
			ЧастьБлокаВерсии = СтрПолучитьСтроку(СтрокаПоВерсии, Сч);
			
			РазницаПоДлине = КолСимволовБлока - СтрДлина(ЧастьБлокаВерсии);
			РазницаПоДлине = ?(РазницаПоДлине <=0, 0, РазницаПоДлине);
			
			ЧастьБлокаВерсии = ДобавитьНули(ЧастьБлокаВерсии, РазницаПоДлине, Истина);  
		Исключение
			ЧастьБлокаВерсии = ДобавитьНули(ЧастьБлокаВерсии, КолСимволовБлока, Истина);
		КонецПопытки;
		
		ВерсияПОЧислом = ВерсияПОЧислом + ЧастьБлокаВерсии;
	КонецЦикла;
	
	// в числовой формат
	Попытка
		ВерсияПОЧислом = Число(ВерсияПОЧислом);
	Исключение
		ВерсияПОЧислом = 0;
	КонецПопытки;
	
	Возврат ВерсияПОЧислом;
	
КонецФункции

// ТСД И ГРУППОВАЯ РАБОТА

Процедура ЛогированиеДействий(Операция, УзелПО, СсылкаНаДок, СтрокаДокумента, UserName, Уникальность) Экспорт
	
	СтруктураСтроки = Новый Структура;
	СтруктураСтроки.Вставить("Дата", ПолучитьТекущуюДату());	
	СтруктураСтроки.Вставить("Операция", Операция);	
	СтруктураСтроки.Вставить("ТСД", УзелПО);
	СтруктураСтроки.Вставить("ДокументТСД", СсылкаНаДок);
	СтруктураСтроки.Вставить("Уникальность", Уникальность);	
	
	//ЗАПИСЬ ДАННЫХ
	Запись = РегистрыСведений.ДатаМобайл_Логирование.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись, СтруктураСтроки);
	Запись.Записать(Истина);		
	
КонецПроцедуры
Функция ИспользоватьЛогирование() Экспорт
		
	Возврат Ложь;
	
КонецФункции 
Процедура ЛогированиеДействий_ОПТ(Операция, УзелПО, СсылкаНаДок, СтрокаДокумента, UserName, Отказ, СтрокВДокументе = 0) Экспорт
	
	СтруктураСтроки = Новый Структура;
	Попытка СтруктураСтроки.Вставить("Дата", ПолучитьТекущуюДату()); Исключение КонецПопытки;	
	Попытка СтруктураСтроки.Вставить("Операция", Операция); Исключение КонецПопытки;	
	Попытка СтруктураСтроки.Вставить("ТСД", УзелПО); Исключение КонецПопытки;
	Попытка СтруктураСтроки.Вставить("ДокументТСД", СсылкаНаДок); Исключение КонецПопытки;
	Попытка СтруктураСтроки.Вставить("ИдентификаторСтроки", Число(СтрокаДокумента.DMRowID)); Исключение КонецПопытки;
	Попытка СтруктураСтроки.Вставить("Уникальность", Новый УникальныйИдентификатор); Исключение КонецПопытки;
	
	Попытка СтруктураСтроки.Вставить("КодТовара", СтрокаДокумента.DMArtID); Исключение КонецПопытки;
	Попытка СтруктураСтроки.Вставить("КодТовараЕГАИС", СтрокаДокумента.DMArtEgaisID); Исключение КонецПопытки;
	Попытка СтруктураСтроки.Вставить("НазваниеТовара", СтрокаДокумента.DMArtName); Исключение КонецПопытки;
	Попытка СтруктураСтроки.Вставить("Штрихкод",СтрокаДокумента.DMBarcode); Исключение КонецПопытки;
	Попытка СтруктураСтроки.Вставить("Пользователь", UserName); Исключение КонецПопытки;
	Попытка СтруктураСтроки.Вставить("Количество", СтрокаДокумента.DMQuant); Исключение КонецПопытки;
	Попытка СтруктураСтроки.Вставить("ДатаТСД", СтрокаДокумента.DMDate); Исключение КонецПопытки;	
	Попытка СтруктураСтроки.Вставить("ОтказЗаписи", Отказ); Исключение КонецПопытки;
	
	Попытка СтруктураСтроки.Вставить("УпаковочныйЛист", СтрокаДокумента.DMPackID); Исключение КонецПопытки;
	Попытка СтруктураСтроки.Вставить("Короб", СтрокаДокумента.DMBoxPackID); Исключение КонецПопытки;
	Попытка СтруктураСтроки.Вставить("Короб", СтрокаДокумента.DMPalletID); Исключение КонецПопытки;
	Попытка СтруктураСтроки.Вставить("ЕгаисПолныйКод", СтрокаДокумента.DMPDFBarcode); Исключение КонецПопытки;	
	Попытка СтруктураСтроки.Вставить("СтрокВДокументе", СтрокВДокументе); Исключение КонецПопытки;
	
	//ЗАПИСЬ ДАННЫХ
	Запись = РегистрыСведений.ДатаМобайл_Логирование.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись, СтруктураСтроки);
	Запись.Записать(Истина);		
	
КонецПроцедуры
Процедура ЗаписьФлаговОбменаТСД(УзелПО, ТипФлага, Значение) Экспорт
	
	МенеджерЗаписиТСД = РегистрыСведений.ДатаМобайл_ФлагиДляОбменаТСД.СоздатьМенеджерЗаписи();
	МенеджерЗаписиТСД.ТСД = УзелПО;
	МенеджерЗаписиТСД.ТипФлага = ТипФлага;
	МенеджерЗаписиТСД.Значение = Значение;
	МенеджерЗаписиТСД.Записать(Истина);
	
КонецПроцедуры
Функция ЧтениеФлаговОбменаТСД(УзелПО, ТипФлага) Экспорт
	
	Запрос = Новый Запрос;	
	Запрос.УстановитьПараметр("УзелПО", УзелПО);
	Запрос.УстановитьПараметр("ТипФлага", ТипФлага);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	|	ДатаМобайл_ФлагиДляОбменаТСД.Значение
	|ИЗ
	|	РегистрСведений.ДатаМобайл_ФлагиДляОбменаТСД КАК ДатаМобайл_ФлагиДляОбменаТСД
	|ГДЕ
	|	ДатаМобайл_ФлагиДляОбменаТСД.ТСД = &УзелПО
	|	И ДатаМобайл_ФлагиДляОбменаТСД.ТипФлага = &ТипФлага";
	
	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	Если ВыборкаЗапроса.Следующий() Тогда
		Возврат ВыборкаЗапроса.Значение;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции
Процедура ОчиститьЗаписиГрупповогоДокумента(ДокументТСД) Экспорт
	
	СтруктураОтбора = Новый Структура("ДокументТСД", ДокументТСД);
	
	ВыборкаЗаписейСтрок = РегистрыСведений.ДатаМобайл_СтрокиГрупповыхДокументов.Выбрать(СтруктураОтбора);
	Пока ВыборкаЗаписейСтрок.Следующий() Цикл
		ВыборкаЗаписейСтрок.ПолучитьМенеджерЗаписи().Удалить();
	КонецЦикла;	
	
КонецПроцедуры
Процедура ОчиститьЗаписиТСДГрупповогоДокумента(ДокументТСД, ТСД = Неопределено) Экспорт
	
	СтруктураОтбора = Новый Структура("ДокументТСД", ДокументТСД);
	
	ВыборкаЗаписейТСД = РегистрыСведений.ДатаМобайл_ТСДГрупповыхДокументов.Выбрать(СтруктураОтбора);
	Пока ВыборкаЗаписейТСД.Следующий() Цикл
		Если ТСД = Неопределено Тогда
			ВыборкаЗаписейТСД.ПолучитьМенеджерЗаписи().Удалить();
		Иначе
			Если ВыборкаЗаписейТСД.ПолучитьМенеджерЗаписи().ТСД = ТСД Тогда
				ВыборкаЗаписейТСД.ПолучитьМенеджерЗаписи().Удалить();
			КонецЕсли;            
		КонецЕсли;
	КонецЦикла;
	
	Если ДокументТСД.Шаблон.РаспределениеТоваров = 2 Тогда
		Для каждого СтрокаДочернийДокумент Из ДокументТСД.СписокДокументов Цикл
			Если ЗначениеЗаполнено(СтрокаДочернийДокумент.ДокументТСД) Тогда
				ОчиститьЗаписиТСДГрупповогоДокумента(СтрокаДочернийДокумент.ДокументТСД);				
			КонецЕсли;	
		КонецЦикла;			
	КонецЕсли;
	
КонецПроцедуры
Процедура СоздатьЗаписиГрупповогоДокумента(СтруктураСтроки) Экспорт
	
	//ЗАПИСЬ ДАННЫХ
	Запись = РегистрыСведений.ДатаМобайл_СтрокиГрупповыхДокументов.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись, СтруктураСтроки);
	Запись.ДатаЗаписи = ПолучитьТекущуюДату();
	Запись.Записать(Истина);	
	
КонецПроцедуры
Функция ПолучитьДатуГрупповогоДокумента(КодУзла, ДокументТСД, ДатаПолучения) Экспорт
		
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("КодУзла", КодУзла);
	Запрос.УстановитьПараметр("ДокументТСД", ДокументТСД);
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	|	ДатаМобайл_ТСДГрупповыхДокументов.ДатаНачалаСбора,
	|	ДатаМобайл_ТСДГрупповыхДокументов.ДатаЗавершенияСбора
	|ИЗ
	|	РегистрСведений.ДатаМобайл_ТСДГрупповыхДокументов КАК ДатаМобайл_ТСДГрупповыхДокументов
	|ГДЕ
	|	ДатаМобайл_ТСДГрупповыхДокументов.ТСД.Код = &КодУзла
	|	И ДатаМобайл_ТСДГрупповыхДокументов.ДокументТСД = &ДокументТСД";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаЗапроса = РезультатЗапроса.Выбрать();
	Пока ВыборкаЗапроса.Следующий() Цикл
		Попытка 
			Возврат ВыборкаЗапроса[ДатаПолучения];	
		Исключение
			Возврат Неопределено;
		КонецПопытки;
	КонецЦикла;
	
КонецФункции
Процедура СоздатьНачальнуюЗаписьТСДГрупповыхДокументов(КодУзла, ДокументТСД, Пользователь) Экспорт
	
	Если ДокументТСД.СписокТерминалов.Количество() > 0 Тогда			
		Для каждого стр Из ДокументТСД.СписокТерминалов Цикл
			МенеджерЗаписиТСД = РегистрыСведений.ДатаМобайл_ТСДГрупповыхДокументов.СоздатьМенеджерЗаписи();
			МенеджерЗаписиТСД.ТСД = стр.ТСД;
			МенеджерЗаписиТСД.ДокументТСД = ДокументТСД;
			МенеджерЗаписиТСД.ДатаНачалаСбора = ПолучитьТекущуюДату();
			МенеджерЗаписиТСД.Пользователь = Пользователь;
			МенеджерЗаписиТСД.Записать(Истина);
		КонецЦикла;
		Возврат;
	КонецЕсли;
	
	МенеджерЗаписиТСД = РегистрыСведений.ДатаМобайл_ТСДГрупповыхДокументов.СоздатьМенеджерЗаписи();
	МенеджерЗаписиТСД.ТСД = ПланыОбмена.ДатаМобайл_СписокТСД.НайтиПоКоду(КодУзла);
	МенеджерЗаписиТСД.ДокументТСД = ДокументТСД;
	МенеджерЗаписиТСД.ДатаНачалаСбора = ПолучитьТекущуюДату();
	МенеджерЗаписиТСД.Пользователь = Пользователь;
	МенеджерЗаписиТСД.Записать(Истина);
	
КонецПроцедуры
Функция ПроверитьЗавершенностьГрупповогоДокумента(ДокументТСД) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументТСД", ДокументТСД);
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДатаМобайл_ТСДГрупповыхДокументов.ДатаЗавершенияСбора
	|ИЗ
	|	РегистрСведений.ДатаМобайл_ТСДГрупповыхДокументов КАК ДатаМобайл_ТСДГрупповыхДокументов
	|ГДЕ
	|	ДатаМобайл_ТСДГрупповыхДокументов.ДокументТСД = &ДокументТСД
	|	И ДатаМобайл_ТСДГрупповыхДокументов.ДатаЗавершенияСбора = ДАТАВРЕМЯ(1, 1, 1)";
	
	Если Запрос.Выполнить().Пустой() Тогда
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;	
	
КонецФункции
Процедура ОбновитьЗаписьТСДГрупповогоДокумента(КодУзла, ДокументТСД, ДатаЗавершенияСбора) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументТСД", ДокументТСД);
	Запрос.Текст = "ВЫБРАТЬ
	|	ДатаМобайл_ТСДГрупповыхДокументов.ТСД,
	|	ДатаМобайл_ТСДГрупповыхДокументов.ДокументТСД,
	|	ДатаМобайл_ТСДГрупповыхДокументов.ДатаНачалаСбора,
	|	ДатаМобайл_ТСДГрупповыхДокументов.Пользователь
	|ИЗ
	|	РегистрСведений.ДатаМобайл_ТСДГрупповыхДокументов КАК ДатаМобайл_ТСДГрупповыхДокументов
	|ГДЕ
	|	ДатаМобайл_ТСДГрупповыхДокументов.ТСД = &ТСД И
	|	ДатаМобайл_ТСДГрупповыхДокументов.ДокументТСД = &ДокументТСД";
	
	Если ЗначениеЗаполнено(КодУзла) Тогда
		Запрос.УстановитьПараметр("ТСД", ПланыОбмена.ДатаМобайл_СписокТСД.НайтиПоКоду(КодУзла));
	Иначе
		// Разблокировка документа из АРМ
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ДатаМобайл_ТСДГрупповыхДокументов.ТСД = &ТСД И","");	
	КонецЕсли; 	
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	Пока Выборка.Следующий() Цикл
		МенеджерЗаписи = РегистрыСведений.ДатаМобайл_ТСДГрупповыхДокументов.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);
		МенеджерЗаписи.ДатаЗавершенияСбора = ДатаЗавершенияСбора;
		МенеджерЗаписи.Записать(Истина);
	КонецЦикла;		
	
КонецПроцедуры
Функция ЗаписьЗначенийУзлаОбменаТСД(УзелПО, ТипЗн, Значение) Экспорт
	
	МенеджерЗаписиТСД = РегистрыСведений.ДатаМобайл_ЗначенияУзлаОбменаТСД.СоздатьМенеджерЗаписи();
	МенеджерЗаписиТСД.ТСД         = УзелПО;
	МенеджерЗаписиТСД.ТипЗначения = ТипЗн;
	МенеджерЗаписиТСД.Значение    = Значение;
	
	Попытка
		МенеджерЗаписиТСД.Записать(Истина);
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции
Функция ЧтениеЗначенийУзлаОбменаТСД(УзелПО, ТипЗн) Экспорт
	
	Запрос = Новый Запрос;	
	Запрос.УстановитьПараметр("УзелПО", УзелПО);
	Запрос.УстановитьПараметр("ТипЗн", ТипЗн);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	|	ЗначенияУзлаОбменаТСД.Значение
	|ИЗ
	|	РегистрСведений.ДатаМобайл_ЗначенияУзлаОбменаТСД КАК ЗначенияУзлаОбменаТСД
	|ГДЕ
	|	ЗначенияУзлаОбменаТСД.ТСД = &УзелПО
	|	И ЗначенияУзлаОбменаТСД.ТипЗначения = &ТипЗн";
	
	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	Если ВыборкаЗапроса.Следующий() Тогда
		Возврат ВыборкаЗапроса.Значение;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции
Функция ВерсияПланаОбмена(УзелПО, ВерсияПО = Неопределено) Экспорт
	
	Если ВерсияПО = Неопределено тогда
		ВерсияПО = ЧтениеЗначенийУзлаОбменаТСД(УзелПО, "ВерсияПО");
	КонецЕсли;
	
	Попытка
		ВерсияПланаОбмена = ДатаМобайл_HTTP_Логика.GetVersion(ВерсияПО); 
		Возврат ВерсияПланаОбмена.Result.data;
	Исключение 
		Возврат Ложь;
	КонецПопытки; 
	
КонецФункции

// ДОПОЛНИТЕЛЬНЫЕ ФУНКЦИИ
Функция ПолучитьЯчейкуПоКодуИлиШтрихкоду(Штрихкод, СсылкаНаДок = Неопределено) Экспорт
	
	ТекущаяЯчейка = Справочники.СкладскиеЯчейки.ПустаяСсылка();
	
	Попытка ТекущаяЯчейка = ПолучитьЯчейкуПоШтрихкоду(Штрихкод); Исключение КонецПопытки;
	
	Если Не ЗначениеЗаполнено(ТекущаяЯчейка.Наименование) И Не ЗначениеЗаполнено(ТекущаяЯчейка.Код) Тогда
		Если СсылкаНаДок = Неопределено Тогда
			ТекущаяЯчейка = Справочники.СкладскиеЯчейки.НайтиПоКоду(Штрихкод);
		Иначе
			Если Не ЗначениеЗаполнено(СсылкаНаДок.Склад) Тогда
				ТекущаяЯчейка = Справочники.СкладскиеЯчейки.НайтиПоКоду(Штрихкод);
			Иначе
				ТекущаяЯчейка = Справочники.СкладскиеЯчейки.НайтиПоКоду(Штрихкод,,, СсылкаНаДок.Склад);
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	
	Возврат ТекущаяЯчейка;
		
КонецФункции	
Функция ПолучитьЯчейкуПоШтрихкоду(Штрихкод10) Экспорт
	
	Попытка
		Штрихкод16 = ПреобразоватьДесятичноеЧислоВШестнадцатиричнуюСистемуСчисления(Штрихкод10);
		
		Если СтрДлина(Штрихкод16) < 32 Тогда
			
			Пока СтрДлина(Штрихкод16) < 32 Цикл
				Штрихкод16 = Строка("0") + Штрихкод16;
			КонецЦикла;
			
		КонецЕсли;
		
		ГУИД = Сред(Штрихкод16, 1,  8)
		+ "-" + Сред(Штрихкод16, 9,  4)
		+ "-" + Сред(Штрихкод16, 13, 4)
		+ "-" + Сред(Штрихкод16, 17, 4)
		+ "-" + Сред(Штрихкод16, 21, 12);
	Исключение
		
		Возврат Справочники.СкладскиеЯчейки.ПустаяСсылка();
		
	Конецпопытки;
	
	Попытка
		
		СсылкаСкладскиеЯчейки = Справочники.СкладскиеЯчейки.ПолучитьСсылку(Новый УникальныйИдентификатор(ГУИД));	
		
		Если СсылкаСкладскиеЯчейки.Код = "" Тогда
			Возврат Справочники.СкладскиеЯчейки.ПустаяСсылка();
		Иначе
			Возврат СсылкаСкладскиеЯчейки;
		КонецЕсли;
		
	Исключение
		
		Возврат Справочники.СкладскиеЯчейки.ПустаяСсылка();
		
	КонецпопыткИ;
	
КонецФункции
Функция ПреобразоватьДесятичноеЧислоВШестнадцатиричнуюСистемуСчисления(Знач ДесятичноеЧисло) Экспорт
	
	Результат = "";    
	Если ДесятичноеЧисло <> "" Тогда
		Пока Число(ДесятичноеЧисло) > 0 Цикл
			ОстатокОтДеления = ДесятичноеЧисло % 16;
			ДесятичноеЧисло  = (ДесятичноеЧисло - ОстатокОтДеления) / 16;
			Результат        = Сред("0123456789abcdef", ОстатокОтДеления + 1, 1) + Результат;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
Функция ЧистаяСтрока(Знач ГрязнаяСтрока) Экспорт
	
	ГрязнаяСтрока = СтрЗаменить(ГрязнаяСтрока, "'", "-");
	ГрязнаяСтрока = СтрЗаменить(ГрязнаяСтрока, Символы.ВК, " ");
	ГрязнаяСтрока = СтрЗаменить(ГрязнаяСтрока, Символы.ПС, "-");
	ГрязнаяСтрока = СтрЗаменить(ГрязнаяСтрока, Символы.НПП, " ");
	ГрязнаяСтрока = СтрЗаменить(ГрязнаяСтрока, ";", "");
	ГрязнаяСтрока = СтрЗаменить(ГрязнаяСтрока, """", "''");
	ГрязнаяСтрока = СтрЗаменить(ГрязнаяСтрока, "%", "");
	ГрязнаяСтрока = СтрЗаменить(ГрязнаяСтрока, "&", "");
	ГрязнаяСтрока = СтрЗаменить(ГрязнаяСтрока, "<", "[");
	ГрязнаяСтрока = СтрЗаменить(ГрязнаяСтрока, ">", "]");
	
	Возврат Грязнаястрока;
	
КонецФункции	
Функция ПолучитьСерию(ШтрихкодСерии) Экспорт
	
	Серия = Справочники.СерииНоменклатуры.ПустаяСсылка();
	ЗапросСерий = Новый Запрос;
	ЗапросСерий.Текст = "ВЫБРАТЬ
	|	СерииНоменклатуры.Ссылка
	|ИЗ
	|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|ГДЕ
	|	СерииНоменклатуры.Номер = &ШК";
	ЗапросСерий.УстановитьПараметр("ШК", ШтрихкодСерии);
	Выборка = ЗапросСерий.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл	
		Серия = Выборка.Ссылка;			
	КонецЦикла;
	
	Возврат Серия;
	
КонецФункции
Процедура ДатаМобайлСозданиеНоменклатурыОбработкаЗаполнения(Источник, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(Источник, ДанныеЗаполнения);
		Справочники.Номенклатура.ЗаполнитьРеквизитыПоВидуНоменклатуры(Источник, Источник.ВидНоменклатуры);
		Если Не ЗначениеЗаполнено(Источник.ЕдиницаИзмерения) Тогда
			Попытка
				Если Не ДанныеЗаполнения.ЭтоГруппа Тогда
					Источник.ЕдиницаИзмерения = ДанныеЗаполнения.ЕдиницаИзмерения;
				КонецЕсли;
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
Функция РазложитьСтрокуВМассивЧисловыхПодстрокДМ(Знач Строка, Знач Разделитель = ",") Экспорт
	
	Результат = Новый Массив;
	
	Позиция = Найти(Строка, Разделитель);
	Пока Позиция > 0 Цикл
		Подстрока = Лев(Строка, Позиция - 1);
		Если Не ПустаяСтрока(Подстрока) Тогда
			Попытка Результат.Добавить(Число(Подстрока)); Исключение КонецПопытки;
		КонецЕсли;
		Строка = Сред(Строка, Позиция + СтрДлина(Разделитель));
		Позиция = Найти(Строка, Разделитель);
	КонецЦикла;
	
	Если Не ПустаяСтрока(Строка) Тогда
		Попытка Результат.Добавить(Число(Строка)); Исключение КонецПопытки;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
Функция DM_ПолучитьРазделительПути() Экспорт
	
	РазделительПути = "\";  //Windows
	СистемнаяИнформация = Новый СистемнаяИнформация;
	
	ЭтоLinuxКлиент = СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86
	Или СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86_64;
	
	Если ЭтоLinuxКлиент Тогда
		РазделительПути = "/"; // Linux
	КонецЕсли;	
	
	Возврат РазделительПути;
	
КонецФункции
Функция ПолучитьСкладВведенныхЯчеек(ТабЧастьДок) Экспорт
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	|	ТЧ.ЯчейкаСсылка КАК ЯчейкаСсылка
	|ПОМЕСТИТЬ втТЧ
	|ИЗ
	|	&ТЧ КАК ТЧ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(Ячейки.Ссылка.Владелец) КАК Склад
	|ИЗ
	|	втТЧ КАК втТЧ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СкладскиеЯчейки КАК Ячейки
	|		ПО втТЧ.ЯчейкаСсылка = Ячейки.Ссылка";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ТЧ", ТабЧастьДок);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Склад;
	Иначе
		Возврат Справочники.Склады.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции
Функция ПолучитьСкладВведенныхЯчеекГрупповаяРабота(ДокТСД) Экспорт
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	|	МАКСИМУМ(Ячейки.Ссылка.Владелец) КАК Склад
	|ИЗ
	|	РегистрСведений.ДатаМобайл_СтрокиГрупповыхДокументов КАК СтрокиТЧ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СкладскиеЯчейки КАК Ячейки
	|		ПО СтрокиТЧ.ЯчейкаСсылка = Ячейки.Ссылка
	|ГДЕ
	|	СтрокиТЧ.ДокументТСД = &Док";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Док", ДокТСД);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Склад;
	Иначе
		Возврат Справочники.Склады.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции
Функция ДобавитьНули(ИсходнаяСтрока, ЧислоСимволов, ВНачало = Истина) Экспорт
	
	РезультатФункции = ИсходнаяСтрока;
	
	Для Сч = 1 По ЧислоСимволов Цикл
		Если ВНачало Тогда
			РезультатФункции = "0" + РезультатФункции;
		Иначе
			РезультатФункции = "" + РезультатФункции + "0";
		КонецЕсли;
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции
Процедура СкорректироватьЗапросЕслиЭтоКАДляКазахстана(ТекстЗапроса, ИмяФункции) Экспорт
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.ПодконтрольнаяПродукцияВЕТИС)"	, "ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.ПустаяСсылка)");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.ОрганизациейПродавцом)"		, "ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.ПустаяСсылка)");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.ОрганизациейПоАгентскойСхеме)"	, "ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.ПустаяСсылка)");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.Партнером)"					, "ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.ПустаяСсылка)");
	
КонецПроцедуры
Функция ОбработатьИсключение(ВариантОповещения, НазваниеПроцедуры, ТекстИсключения) Экспорт
	
	//запись в журнал регистрации:
	
	Если ВариантОповещения = 1 Тогда
		
		ПодробноеПредставлениеОшибки = ТекстИсключения;
		ИмяСобытияЖурналРегистрации = НазваниеПроцедуры;
		ЗаписьЖурналаРегистрации(ИмяСобытияЖурналРегистрации, УровеньЖурналаРегистрации.Ошибка,,, ТекстИсключения);
		
	КонецЕсли;	
		
КонецФункции

// Функция удаляет регистрацию документа ТСД в текущем плане обмена/на всех планах обмена
//
// Параметры:
//	ДокументТСД - ДокументОбъект.ДатаМобайл_ДокументыТСД - элемент спр-ка ДатаМобайл_ДокументыТСД
//	ТолькоЗакрытые - Булево - признак удаления регистрации только у закрытых документов
//	ВсеУстройства - Булево - признак очищения регистрации на всех узлах
// 
// Возвращаемое значение:
//   Булево
//
Функция УдалитьРегистрациюОбъекта(ДокументТСД, ТолькоЗакрытые = Ложь, ВсеУстройства = Ложь) Экспорт
	
	Если Не ЗначениеЗаполнено(ДокументТСД.Ссылка) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ТолькоЗакрытые И Не ЗначениеЗаполнено(ДокументТСД.ДатаЗавершения) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ВсеУстройства Тогда
		ВыборкаПлановОбмена = ПланыОбмена.ДатаМобайл_СписокТСД.Выбрать();
		
		Результат = Истина;
		
		Пока ВыборкаПлановОбмена.Следующий() Цикл 
			Если ВыборкаПлановОбмена.ЭтотУзел Тогда Продолжить; КонецЕсли;
			
			Попытка
				ДокументТСД.ОбменДанными.Получатели.Удалить(ВыборкаПлановОбмена.Ссылка);
				ПланыОбмена.УдалитьРегистрациюИзменений(ВыборкаПлановОбмена.Ссылка, ДокументТСД.Ссылка);
			Исключение
				Результат = Ложь;
			КонецПопытки;
		КонецЦикла;
		
		Возврат Результат;
	Иначе
		Попытка
			ДокументТСД.ОбменДанными.Получатели.Удалить(ДокументТСД.ТСД);
			ПланыОбмена.УдалитьРегистрациюИзменений(ДокументТСД.ТСД, ДокументТСД.Ссылка);
			Возврат Истина;
		Исключение
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;
	
КонецФункции

// ПЕЧАТЬ
Функция ШтрихкодОперацииПечати(УзелПО, ШК) Экспорт
	
	СтруктураНастроек = Новый Структура;
	Ответ = Неопределено;
	
	СтруктураНастроек.Вставить("Печать", "");
	СтруктураНастроекТСД = ПланыОбмена.ДатаМобайл_СписокТСД.ПолучитьНастройкиТабличныхЧастейТСД(УзелПО, СтруктураНастроек);
	
	Если СтруктураНастроекТСД.ШтрихкодыОперации.Количество() Тогда

		НаборЗаписейРегистраШК = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьНаборЗаписей();
		НаборЗаписейРегистраШК.Отбор.Штрихкод.Установить(ШК);
		НаборЗаписейРегистраШК.Прочитать(); 
	
		Если НаборЗаписейРегистраШК.Количество() = 0 Тогда
			
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("ШтрихкодОперации", ШК);
			
			МассивСтрок = СтруктураНастроекТСД.ШтрихкодыОперации.НайтиСтроки(СтруктураПоиска);
			
			Если МассивСтрок.Количество() Тогда
				
				ДанныеСтроки = МассивСтрок[0];
				
				НаборЗаписейРегистра = РегистрыСведений.ДатаМобайл_ВыборОперацииПечати.СоздатьНаборЗаписей();
				НаборЗаписейРегистра.Отбор.ТСД.Установить(УзелПО); 
				НаборЗаписейРегистра.Отбор.ОперацияПечати.Установить(ДанныеСтроки.ТипОперации);
				НаборЗаписейРегистра.Прочитать(); 
				НаборЗаписейРегистра.Очистить();
				
				НоваяЗаписьРегистра = НаборЗаписейРегистра.Добавить();
				НоваяЗаписьРегистра.ТСД = УзелПО;
				НоваяЗаписьРегистра.ОперацияПечати = ДанныеСтроки.ТипОперации;
				НоваяЗаписьРегистра.Штрихкод = ШК;  
				
				НаборЗаписейРегистра.Записать(Истина);  
				
				СтруктураОтвета = Новый Структура;
				СтруктураОтвета.Вставить("description", "");
				СтруктураОтвета.Вставить("title", "Операция """ + ДанныеСтроки.ТипОперации + """ была применена.");
				Ответ = ДатаМобайл_HTTP_Логика.ПодготовитьОтветJSON(СтруктураОтвета);  
				
			КонецЕсли;	
		
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

// ЕГАИС
Функция ПолучитьНоменклатуруПоЕГАИС(НоменклатураЕГАИС) Экспорт    	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
	|	МАКСИМУМ(СоответствиеНоменклатурыЕГАИС.Номенклатура) КАК Номенклатура
	|ИЗ
	|	РегистрСведений.СоответствиеНоменклатурыЕГАИС КАК СоответствиеНоменклатурыЕГАИС
	|ГДЕ
	|	СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция = &НоменклатураЕГАИС
	|
	|СГРУППИРОВАТЬ ПО
	|	СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция";
	
	// аст 
	Если ЕстьАСТ() Тогда
		астЗаменитьРегистрНоменклатурыЕГАИС(Запрос.Текст);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НоменклатураЕГАИС", НоменклатураЕГАИС);
	ТаблицаСоответствий = Запрос.Выполнить().Выгрузить();
	
	Если ТаблицаСоответствий.Количество() > 0 Тогда
		Возврат ТаблицаСоответствий[0].Номенклатура;
	Иначе
		алкЗаменитьРегистрНоменклатурыЕГАИС(Запрос.Текст);
		
		Запрос.УстановитьПараметр("НоменклатураЕГАИС", НоменклатураЕГАИС);
		ТаблицаСоответствий = Запрос.Выполнить().Выгрузить();
		Если ТаблицаСоответствий.Количество() > 0 Тогда
			Возврат ТаблицаСоответствий[0].Номенклатура;
		Иначе
			Возврат Справочники.Номенклатура.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;			
	
КонецФункции
Функция ПолучитьЕГАИСПоНоменклатуре(Номенклатура) Экспорт    	
	
	Если Не ЕстьАСТ() Тогда		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СоответствиеНоменклатурыЕГАИС.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция) КАК АлкогольнаяПродукция
		|ИЗ
		|	РегистрСведений.СоответствиеНоменклатурыЕГАИС КАК СоответствиеНоменклатурыЕГАИС
		|ГДЕ
		|	СоответствиеНоменклатурыЕГАИС.Номенклатура = &Номенклатура
		|СГРУППИРОВАТЬ ПО
		|	СоответствиеНоменклатурыЕГАИС.Номенклатура";
		
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		
		ТаблицаСоответствий = Запрос.Выполнить().Выгрузить();
		Если ТаблицаСоответствий.Количество() > 0 Тогда
			Возврат ТаблицаСоответствий[0].АлкогольнаяПродукция;
		Иначе
			Возврат Справочники.КлассификаторАлкогольнойПродукцииЕГАИС.ПустаяСсылка();
		КонецЕсли;		
	Иначе				
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СоответствиеНоменклатурыЕГАИС.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция) КАК АлкогольнаяПродукция
		|ИЗ
		|	РегистрСведений.СоответствиеНоменклатурыЕГАИС КАК СоответствиеНоменклатурыЕГАИС
		|ГДЕ
		|	СоответствиеНоменклатурыЕГАИС.Номенклатура = &Номенклатура
		|СГРУППИРОВАТЬ ПО
		|	СоответствиеНоменклатурыЕГАИС.Номенклатура";
		// аст
		астЗаменитьРегистрНоменклатурыЕГАИС(Запрос.Текст);
		
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		
		ТаблицаСоответствий = Запрос.Выполнить().Выгрузить();
		Если ТаблицаСоответствий.Количество() > 0 Тогда
			Возврат ТаблицаСоответствий[0].АлкогольнаяПродукция;
		Иначе
			Возврат Справочники.КлассификаторАлкогольнойПродукцииЕГАИС.ПустаяСсылка();
		КонецЕсли;		
	КонецЕсли;
	
КонецФункции
Функция ПолучитьНоменклатуруПоМарке(СтруктураСтроки) Экспорт
	
	МаркаСсылка = Справочники.ШтрихкодыУпаковокТоваров.НайтиПоРеквизиту("ЗначениеШтрихкода",СтруктураСтроки.ЕгаисПолныйКод);
	Если ЗначениеЗаполнено(МаркаСсылка) Тогда
		СтруктураСтроки.Номенклатура = МаркаСсылка.Номенклатура;
		СтруктураСтроки.ХарактеристикаНоменклатуры = МаркаСсылка.Характеристика;
		СтруктураСтроки.СерияСсылка = МаркаСсылка.Серия;
	КонецЕсли;
	
КонецФункции
Функция ПолучитьМаркиВходящейТТН_ЕГАИС(ДокументВыгрузки) Экспорт
		
	Если Не ЕстьАСТ() Тогда	
		ТЗМарок = Новый ТаблицаЗначений;
		ТЗМарок.Колонки.Добавить("АлкогольнаяПродукция");
		ТЗМарок.Колонки.Добавить("Марка");
		ТЗМарок.Колонки.Добавить("Короб");
		ТЗМарок.Колонки.Добавить("Палета");
		ТЗМарок.Колонки.Добавить("Номенклатура");
		ТЗМарок.Колонки.Добавить("Характеристика");
		ТЗМарок.Колонки.Добавить("Серия");
		ТЗМарок.Колонки.Добавить("Справка2");
		ТЗМарок.Колонки.Добавить("ТипУпаковки");
						
		ДанныеПроверяемогоДокумента = Документы.ТТНВходящаяЕГАИС.ВходящееДеревоУпаковок(ДокументВыгрузки);
		
		//ПЕРВЫЙ УРОВЕНЬ
		ТекущаяПалета = "";
		ТекущийКороб = "";
		Для каждого СтрокаПоДаннымДокументаПервыйУровень Из ДанныеПроверяемогоДокумента.ДеревоУпаковок.Строки Цикл			
			Попытка 
				ИмяКолонкиШтрихкода = "ЗначениеШтрихкода";
				ТекущийШтрихкодПервыйУровень = СтрокаПоДаннымДокументаПервыйУровень[ИмяКолонкиШтрихкода];
			Исключение
				ИмяКолонкиШтрихкода = "Штрихкод";
				ТекущийШтрихкодПервыйУровень = СтрокаПоДаннымДокументаПервыйУровень[ИмяКолонкиШтрихкода];
			КонецПопытки;
			Если СтрДлина(ТекущийШтрихкодПервыйУровень) = 68 Или СтрДлина(ТекущийШтрихкодПервыйУровень) = 150 Тогда
				СтрокаМарки = ТЗМарок.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаМарки, СтрокаПоДаннымДокументаПервыйУровень);
				СтрокаМарки.Марка = ТекущийШтрихкодПервыйУровень;
				СтрокаМарки.Короб = ТекущийКороб;
				СтрокаМарки.Палета = ТекущаяПалета;
			Иначе
				//ВТОРОЙ УРОВЕНЬ       
				ТекущаяПалета = "";
				ТекущийКороб = ТекущийШтрихкодПервыйУровень;
				
				Для каждого СтрокаПоДаннымДокументаВторойУровень Из СтрокаПоДаннымДокументаПервыйУровень.Строки Цикл					
					Попытка 
						ИмяКолонкиШтрихкода = "ЗначениеШтрихкода";
						ТекущийШтрихкодВторойУровень = СтрокаПоДаннымДокументаВторойУровень[ИмяКолонкиШтрихкода];
					Исключение
						ИмяКолонкиШтрихкода = "Штрихкод";
						ТекущийШтрихкодВторойУровень = СтрокаПоДаннымДокументаВторойУровень[ИмяКолонкиШтрихкода];
					КонецПопытки;
					
					Если СтрДлина(ТекущийШтрихкодВторойУровень) = 68 Или СтрДлина(ТекущийШтрихкодВторойУровень) = 150 Тогда
						СтрокаМарки = ТЗМарок.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаМарки, СтрокаПоДаннымДокументаВторойУровень);
						СтрокаМарки.Марка = ТекущийШтрихкодВторойУровень;
						СтрокаМарки.Короб = ТекущийКороб;
						СтрокаМарки.Палета = ТекущаяПалета;
					Иначе
						//ТРЕТИЙ УРОВЕНЬ
						ТекущаяПалета = ТекущийШтрихкодПервыйУровень;
						ТекущийКороб = ТекущийШтрихкодВторойУровень;	
						Для каждого СтрокаПоДаннымДокументаТретийУровень Из СтрокаПоДаннымДокументаВторойУровень.Строки Цикл							
							Попытка 
								ИмяКолонкиШтрихкода = "ЗначениеШтрихкода";
								ТекущийШтрихкодТретийУровень = СтрокаПоДаннымДокументаТретийУровень[ИмяКолонкиШтрихкода];
							Исключение
								ИмяКолонкиШтрихкода = "Штрихкод";
								ТекущийШтрихкодТретийУровень = СтрокаПоДаннымДокументаТретийУровень[ИмяКолонкиШтрихкода];
							КонецПопытки;
													
							Если СтрДлина(ТекущийШтрихкодТретийУровень) = 68 Или СтрДлина(ТекущийШтрихкодТретийУровень) = 150 Тогда
								СтрокаМарки = ТЗМарок.Добавить();
								ЗаполнитьЗначенияСвойств(СтрокаМарки, СтрокаПоДаннымДокументаТретийУровень);
								СтрокаМарки.Марка = ТекущийШтрихкодТретийУровень;
								СтрокаМарки.Короб = ТекущийКороб;
								СтрокаМарки.Палета = ТекущаяПалета;
							Иначе
								//ДАЛЕЕ ВЛОЖЕННОСТЬ НЕ УЧИТЫВАЕМ
								Продолжить;
							КонецЕсли;
						КонецЦикла;	
					КонецЕсли;	
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
				
		Возврат ТЗМарок;		
	Иначе				
		ТЗМарок = Новый ТаблицаЗначений;
		ТЗМарок.Колонки.Добавить("АлкогольнаяПродукция");
		ТЗМарок.Колонки.Добавить("Марка");
		ТЗМарок.Колонки.Добавить("Короб");
		ТЗМарок.Колонки.Добавить("Палета");
		ТЗМарок.Колонки.Добавить("Номенклатура");
		ТЗМарок.Колонки.Добавить("Характеристика");
		ТЗМарок.Колонки.Добавить("Серия");
		ТЗМарок.Колонки.Добавить("Справка2");
		ТЗМарок.Колонки.Добавить("ТипУпаковки");
		
		// получим таблицу марок
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	астТоварноТранспортныеНакладныеИзЕГАИСМарки.Марка,
		|	астТоварноТранспортныеНакладныеИзЕГАИСМарки.СправкаБ,
		|	астТоварноТранспортныеНакладныеИзЕГАИСМарки.НомерСтроки,
		|	астТоварноТранспортныеНакладныеИзЕГАИСМарки.Марка.ГрупповаяТара КАК Упаковка,
		|	астТоварноТранспортныеНакладныеИзЕГАИСМарки.Марка.ГрупповаяТара.КодУпаковки КАК КодУпаковки
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Документ.астТоварноТранспортныеНакладныеИзЕГАИС.Марки КАК астТоварноТранспортныеНакладныеИзЕГАИСМарки
		|ГДЕ
		|	астТоварноТранспортныеНакладныеИзЕГАИСМарки.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Марка.Наименование КАК Марка,
		|	ВТ.Марка.НоменклатураЕГАИС КАК АлкогольнаяПродукция,
		|	ВТ.СправкаБ,
		|	ВТ.Упаковка,
		|	ЕСТЬNULL(ВТ.КодУпаковки, """") КАК Короб,
		|	МАКСИМУМ(ЕСТЬNULL(астГрупповаяТараЕГАИСУпаковки.Ссылка.КодУпаковки, """")) КАК Палета
		|ИЗ
		|	ВТ КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.астГрупповаяТараЕГАИС.Упаковки КАК астГрупповаяТараЕГАИСУпаковки
		|		ПО ВТ.Марка.ГрупповаяТара = астГрупповаяТараЕГАИСУпаковки.ГрупповаяТара
		|			И (ВТ.Марка.ГрупповаяТара <> ЗНАЧЕНИЕ(Документ.астГрупповаяТараЕГАИС.ПустаяСсылка))
		|			И (НЕ астГрупповаяТараЕГАИСУпаковки.Ссылка.ПометкаУдаления)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ.Марка,
		|	ВТ.СправкаБ,
		|	ВТ.Упаковка,
		|	ВТ.КодУпаковки,
		|	ВТ.НомерСтроки,
		|	ВТ.Марка.НоменклатураЕГАИС
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВТ.НомерСтроки";	
		
		Запрос.УстановитьПараметр("Ссылка", ДокументВыгрузки);
		
		Результат = Запрос.Выполнить();
		ВыборкаМарокТТН = Результат.Выбрать();
		
		Пока ВыборкаМарокТТН.Следующий() Цикл
			СтрокаМарки = ТЗМарок.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаМарки, ВыборкаМарокТТН);
			
			// данные по номенклатуре хранятся в товарах
			ПоискСтрокиТТН = ДокументВыгрузки.Товары.Найти(ВыборкаМарокТТН.СправкаБ, "ИдСправкиБ");
			Если ПоискСтрокиТТН <> Неопределено Тогда
				СтрокаМарки.Номенклатура = ПоискСтрокиТТН.Номенклатура;
				СтрокаМарки.Характеристика = ПоискСтрокиТТН.ХарактеристикаНоменклатуры;
				СтрокаМарки.Серия = ПоискСтрокиТТН.СерияНоменклатуры;
				СтрокаМарки.Справка2 = ПоискСтрокиТТН.ИдСправкиБ;
			КонецЕсли;
		КонецЦикла;	
		
		Возврат ТЗМарок;
	КонецЕсли;
	
КонецФункции
Функция СформироватьСписокНепроверяемыхМарокЕГАИС() Экспорт
	
	СписокМарок = Новый СписокЗначений();                                                                     
	
	СписокМарок.Добавить(Справочники.ВидыАлкогольнойПродукции.НайтиПоКоду("261")); //261 Сидр 
	СписокМарок.Добавить(Справочники.ВидыАлкогольнойПродукции.НайтиПоКоду("2611")); //2611 Сидр
	СписокМарок.Добавить(Справочники.ВидыАлкогольнойПродукции.НайтиПоКоду("2612")); //2612 Сидр
	СписокМарок.Добавить(Справочники.ВидыАлкогольнойПродукции.НайтиПоКоду("2613")); //2613 Сидр
	СписокМарок.Добавить(Справочники.ВидыАлкогольнойПродукции.НайтиПоКоду("262")); //262 Пуаре
	СписокМарок.Добавить(Справочники.ВидыАлкогольнойПродукции.НайтиПоКоду("263")); //263 Медовуха                                                                               
	СписокМарок.Добавить(Справочники.ВидыАлкогольнойПродукции.НайтиПоКоду("500")); //500 Пиво с содержанием объемной доли этилового спирта свыше 0,5% и до 8,6% включительно                                                                               
	СписокМарок.Добавить(Справочники.ВидыАлкогольнойПродукции.НайтиПоКоду("510")); //510 Пиво с содержанием объемной доли этилового спирта свыше 8,6%                                                                               
	СписокМарок.Добавить(Справочники.ВидыАлкогольнойПродукции.НайтиПоКоду("520")); //520 Напитки, изготавливаемые на основе пива     
		
	Возврат СписокМарок;
	
КонецФункции	

// АСТ
Процедура астЗаменитьРегистрНоменклатурыЕГАИС(ТекстЗапроса) Экспорт
	
	Если ЕстьАСТ() Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "СоответствиеНоменклатурыЕГАИС.Номенклатура", "СоответствиеНоменклатурыЕГАИС.Номенклатура1С");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "СоответствиеНоменклатурыЕГАИС.Характеристика", "СоответствиеНоменклатурыЕГАИС.ХарактеристикаНоменклатуры");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция", "СоответствиеНоменклатурыЕГАИС.НоменклатураЕГАИС");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "СоответствиеНоменклатурыЕГАИС", "астСоответствиеНоменклатурыИНоменклатурыЕГАИС"); 
	КонецЕсли;	
	
КонецПроцедуры	
Функция ПолучитьСправкиПоМарке(Знач мТранспортныйМодуль, Знач мШК) Экспорт
	
	СтруктураДанных = Новый Структура();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	астПартииТоваровПоМаркамЕГАИСОстатки.ШтрихкодМарки,
	|	астПартииТоваровПоМаркамЕГАИСОстатки.КоличествоОстаток,
	|	астПартииТоваровПоМаркамЕГАИСОстатки.СправкаА,
	|	астПартииТоваровПоМаркамЕГАИСОстатки.СправкаБ
	|ИЗ
	|	РегистрНакопления.астПартииТоваровПоМаркамЕГАИС.Остатки(
	|			,
	|			ТранспортныйМодуль = &ТранспортныйМодуль
	|				И ШтрихкодМарки = &ШтрихкодМарки) КАК астПартииТоваровПоМаркамЕГАИСОстатки";
	
	Запрос.УстановитьПараметр("ТранспортныйМодуль", мТранспортныйМодуль);
	Запрос.УстановитьПараметр("ШтрихкодМарки", мШК);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	НетОстатка = Ложь;
	Если Не Выборка.Следующий() Тогда
		НетОстатка = Истина;
		
		СтруктураДанных.Вставить("СправкаА", Справочники.астСправкиАиБ_ЕГАИС.ПустаяСсылка());
		СтруктураДанных.Вставить("СправкаБ", Справочники.астСправкиАиБ_ЕГАИС.ПустаяСсылка());
	Иначе
		Если Выборка.КоличествоОстаток <= 0 Тогда
			НетОстатка = Истина;
		КонецЕсли;
		
		СтруктураДанных.Вставить("СправкаА", Выборка.СправкаА);
		СтруктураДанных.Вставить("СправкаБ", Выборка.СправкаБ);
	КонецЕсли;	
	
	СтруктураДанных.Вставить("НетОстатка", НетОстатка);
	
	Возврат СтруктураДанных;
	
КонецФункции
Функция ПолучитьТаблицуУпакованныхМарокАСТ(ИдентификаторУпаковки = "") Экспорт
	
	Запрос = Новый Запрос;	
	Запрос.УстановитьПараметр("ИдентификаторУпаковки", ИдентификаторУпаковки);		
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|ВЫБОР 
	|	КОГДА ДокументастГрупповаяТараЕГАИС.ВидУпаковки = ЗНАЧЕНИЕ (Перечисление.астВидыУпаковокЕГАИС.Короб) 
	|			ИЛИ ДокументастГрупповаяТараЕГАИС.ВидУпаковки = ЗНАЧЕНИЕ (Перечисление.астВидыУпаковокЕГАИС.СборныйКороб) 
	|		ТОГДА ИСТИНА
	|	ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ЭтоКороб
	|ИЗ 
	|Документ.астГрупповаяТараЕГАИС КАК ДокументастГрупповаяТараЕГАИС
	|ГДЕ 
	|ДокументастГрупповаяТараЕГАИС.КодУпаковки = &ИдентификаторУпаковки"; 
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если Выборка.ЭтоКороб Тогда
			
			Запрос = Новый Запрос;	
			Запрос.УстановитьПараметр("ИдентификаторУпаковки", ИдентификаторУпаковки);
			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|ДокументастГрупповаяТараЕГАИС.Ссылка КАК Ссылка
			|ПОМЕСТИТЬ ДокументУпаковки
			|ИЗ 
			|Документ.астГрупповаяТараЕГАИС КАК ДокументастГрупповаяТараЕГАИС
			|ГДЕ 
			|ДокументастГрупповаяТараЕГАИС.КодУпаковки = &ИдентификаторУпаковки 
			|;
			|ВЫБРАТЬ 
			|ДокументастГрупповаяТараЕГАИСМарки.Марка КАК Ссылка,
			|ДокументастГрупповаяТараЕГАИСМарки.Марка.Наименование КАК Марка,
			|ДокументастГрупповаяТараЕГАИСМарки.Марка.СправкаА КАК СправкаА,
			|ДокументастГрупповаяТараЕГАИСМарки.Марка.СправкаБ КАК СправкаБ,
			|ДокументастГрупповаяТараЕГАИСМарки.Марка.НоменклатураЕГАИС КАК АлкогольнаяПродукция
			|ИЗ
			|ДокументУпаковки КАК ДокументУпаковки
			|ЛЕВОЕ СОЕДИНЕНИЕ Документ.астГрупповаяТараЕГАИС.Марки КАК ДокументастГрупповаяТараЕГАИСМарки
			|ПО ДокументУпаковки.Ссылка = ДокументастГрупповаяТараЕГАИСМарки.Ссылка
			|ГДЕ
			|ЕСТЬNULL(ДокументастГрупповаяТараЕГАИСМарки.Марка.НоменклатураЕГАИС, ЗНАЧЕНИЕ(Справочник.астНоменклатураЕГАИС.ПустаяСсылка))<> ЗНАЧЕНИЕ(Справочник.астНоменклатураЕГАИС.ПустаяСсылка)";			
			
			Возврат Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.Прямой);
			
		Иначе //Палета
			
			Запрос = Новый Запрос;	
			Запрос.УстановитьПараметр("ИдентификаторУпаковки", ИдентификаторУпаковки);
			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|ДокументастГрупповаяТараЕГАИС.Ссылка КАК Ссылка
			|ПОМЕСТИТЬ ДокументУпаковки
			|ИЗ 
			|Документ.астГрупповаяТараЕГАИС КАК ДокументастГрупповаяТараЕГАИС
			|ГДЕ 
			|ДокументастГрупповаяТараЕГАИС.КодУпаковки = &ИдентификаторУпаковки 
			|;
			|ВЫБРАТЬ
			|ДокументастГрупповаяТараЕГАИСУпаковки.ГрупповаяТара КАК Ссылка
			|ПОМЕСТИТЬ ДокументыКоробов
			|ИЗ 
			|ДокументУпаковки КАК ДокументУпаковки
			|ЛЕВОЕ СОЕДИНЕНИЕ Документ.астГрупповаяТараЕГАИС.Упаковки КАК ДокументастГрупповаяТараЕГАИСУпаковки
			|ПО ДокументУпаковки.Ссылка = ДокументастГрупповаяТараЕГАИСУпаковки.Ссылка
			|;
			|ВЫБРАТЬ 
			|ДокументастГрупповаяТараЕГАИСМарки.Марка КАК Ссылка,
			|ДокументастГрупповаяТараЕГАИСМарки.Марка.Наименование КАК Марка,
			|ДокументастГрупповаяТараЕГАИСМарки.Марка.СправкаА КАК СправкаА,
			|ДокументастГрупповаяТараЕГАИСМарки.Марка.СправкаБ КАК СправкаБ,
			|ДокументастГрупповаяТараЕГАИСМарки.Марка.НоменклатураЕГАИС КАК АлкогольнаяПродукция
			|ИЗ
			|ДокументыКоробов КАК ДокументыКоробов
			|ЛЕВОЕ СОЕДИНЕНИЕ Документ.астГрупповаяТараЕГАИС.Марки КАК ДокументастГрупповаяТараЕГАИСМарки
			|ПО ДокументыКоробов.Ссылка = ДокументастГрупповаяТараЕГАИСМарки.Ссылка
			|ГДЕ
			|ЕСТЬNULL(ДокументастГрупповаяТараЕГАИСМарки.Марка.НоменклатураЕГАИС, ЗНАЧЕНИЕ(Справочник.астНоменклатураЕГАИС.ПустаяСсылка))<> ЗНАЧЕНИЕ(Справочник.астНоменклатураЕГАИС.ПустаяСсылка)"; 
			
			Возврат Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.Прямой);
			
		КонецЕсли;	
	Иначе
		
		Возврат Новый ТаблицаЗначений;
		
	КонецЕсли;
	
КонецФункции
Функция ПолучитьТаблицуУпакованногоТовараАСТ(ИдентификаторУпаковки = "") Экспорт
	
	Запрос = Новый Запрос;	
	Запрос.УстановитьПараметр("ИдентификаторУпаковки", ИдентификаторУпаковки);		
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|ВЫБОР 
	|	КОГДА ДокументастГрупповаяТараЕГАИС.ВидУпаковки = ЗНАЧЕНИЕ (Перечисление.астВидыУпаковокЕГАИС.Короб) 
	|			ИЛИ ДокументастГрупповаяТараЕГАИС.ВидУпаковки = ЗНАЧЕНИЕ (Перечисление.астВидыУпаковокЕГАИС.СборныйКороб) 
	|		ТОГДА ИСТИНА
	|	ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ЭтоКороб
	|ИЗ 
	|Документ.астГрупповаяТараЕГАИС КАК ДокументастГрупповаяТараЕГАИС
	|ГДЕ 
	|ДокументастГрупповаяТараЕГАИС.КодУпаковки = &ИдентификаторУпаковки"; 
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если Выборка.ЭтоКороб Тогда
			
			Запрос = Новый Запрос;	
			Запрос.УстановитьПараметр("ИдентификаторУпаковки", ИдентификаторУпаковки);
			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|ДокументастГрупповаяТараЕГАИС.Ссылка КАК Ссылка
			|ПОМЕСТИТЬ ДокументУпаковки
			|ИЗ 
			|Документ.астГрупповаяТараЕГАИС КАК ДокументастГрупповаяТараЕГАИС
			|ГДЕ 
			|ДокументастГрупповаяТараЕГАИС.КодУпаковки = &ИдентификаторУпаковки 
			|;
			|ВЫБРАТЬ 
			|ДокументастГрупповаяТараЕГАИСМарки.Марка КАК Ссылка,
			|ДокументастГрупповаяТараЕГАИСМарки.Марка.Наименование КАК Марка,
			|ДокументастГрупповаяТараЕГАИСМарки.Марка.СправкаА КАК СправкаА,
			|ДокументастГрупповаяТараЕГАИСМарки.Марка.СправкаБ КАК СправкаБ,
			|ДокументастГрупповаяТараЕГАИСМарки.Марка.НоменклатураЕГАИС КАК АлкогольнаяПродукция,
			|1 КАК Количество
			|ПОМЕСТИТЬ ОбщиеДанные
			|ИЗ
			|ДокументУпаковки КАК ДокументУпаковки
			|ЛЕВОЕ СОЕДИНЕНИЕ Документ.астГрупповаяТараЕГАИС.Марки КАК ДокументастГрупповаяТараЕГАИСМарки
			|ПО ДокументУпаковки.Ссылка = ДокументастГрупповаяТараЕГАИСМарки.Ссылка
			|ГДЕ
			|ЕСТЬNULL(ДокументастГрупповаяТараЕГАИСМарки.Марка.НоменклатураЕГАИС, ЗНАЧЕНИЕ(Справочник.астНоменклатураЕГАИС.ПустаяСсылка))<> ЗНАЧЕНИЕ(Справочник.астНоменклатураЕГАИС.ПустаяСсылка)
			|;
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ОбщиеДанные.АлкогольнаяПродукция,
			|	СУММА(ОбщиеДанные.Количество) КАК Количество
			|ИЗ
			|	ОбщиеДанные КАК ОбщиеДанные
			|СГРУППИРОВАТЬ ПО
			|	ОбщиеДанные.АлкогольнаяПродукция";
									
			Возврат Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.Прямой);
			
		Иначе //Палета
			
			Запрос = Новый Запрос;	
			Запрос.УстановитьПараметр("ИдентификаторУпаковки", ИдентификаторУпаковки);
			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|ДокументастГрупповаяТараЕГАИС.Ссылка КАК Ссылка
			|ПОМЕСТИТЬ ДокументУпаковки
			|ИЗ 
			|Документ.астГрупповаяТараЕГАИС КАК ДокументастГрупповаяТараЕГАИС
			|ГДЕ 
			|ДокументастГрупповаяТараЕГАИС.КодУпаковки = &ИдентификаторУпаковки 
			|;
			|ВЫБРАТЬ
			|ДокументастГрупповаяТараЕГАИСУпаковки.ГрупповаяТара КАК Ссылка
			|ПОМЕСТИТЬ ДокументыКоробов
			|ИЗ 
			|ДокументУпаковки КАК ДокументУпаковки
			|ЛЕВОЕ СОЕДИНЕНИЕ Документ.астГрупповаяТараЕГАИС.Упаковки КАК ДокументастГрупповаяТараЕГАИСУпаковки
			|ПО ДокументУпаковки.Ссылка = ДокументастГрупповаяТараЕГАИСУпаковки.Ссылка
			|;
			|ВЫБРАТЬ 
			|ДокументастГрупповаяТараЕГАИСМарки.Марка КАК Ссылка,
			|ДокументастГрупповаяТараЕГАИСМарки.Марка.Наименование КАК Марка,
			|ДокументастГрупповаяТараЕГАИСМарки.Марка.СправкаА КАК СправкаА,
			|ДокументастГрупповаяТараЕГАИСМарки.Марка.СправкаБ КАК СправкаБ,
			|ДокументастГрупповаяТараЕГАИСМарки.Марка.НоменклатураЕГАИС КАК АлкогольнаяПродукция,
			|1 КАК Количество
			|ПОМЕСТИТЬ ОбщиеДанные
			|ИЗ
			|ДокументыКоробов КАК ДокументыКоробов
			|ЛЕВОЕ СОЕДИНЕНИЕ Документ.астГрупповаяТараЕГАИС.Марки КАК ДокументастГрупповаяТараЕГАИСМарки
			|ПО ДокументыКоробов.Ссылка = ДокументастГрупповаяТараЕГАИСМарки.Ссылка
			|ГДЕ
			|ЕСТЬNULL(ДокументастГрупповаяТараЕГАИСМарки.Марка.НоменклатураЕГАИС, ЗНАЧЕНИЕ(Справочник.астНоменклатураЕГАИС.ПустаяСсылка))<> ЗНАЧЕНИЕ(Справочник.астНоменклатураЕГАИС.ПустаяСсылка)
			|;
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ОбщиеДанные.АлкогольнаяПродукция,
			|	СУММА(ОбщиеДанные.Количество) КАК Количество
			|ИЗ
			|	ОбщиеДанные КАК ОбщиеДанные
			|СГРУППИРОВАТЬ ПО
			|	ОбщиеДанные.АлкогольнаяПродукция";
						
			Возврат Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.Прямой);
			
		КонецЕсли;	
	Иначе		
		Возврат Новый ТаблицаЗначений;		
	КонецЕсли;
	
КонецФункции

//алк
Процедура алкЗаменитьРегистрНоменклатурыЕГАИС(ТекстЗапроса);

	Если ЕстьКТ2000() Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "СоответствиеНоменклатурыЕГАИС КАК СоответствиеНоменклатурыЕГАИС", "алкСоответствияАлкогольнойПродукцииЕГАИСИНоменклатуры КАК СоответствиеНоменклатурыЕГАИС");	
	КонецЕсли;	
	
КонецПроцедуры

// SSCC
Функция ПолучитьНовыйUPL() Экспорт
	
	Запрос = Новый Запрос;	
	ТекстЗапроса = "ВЫБРАТЬ   
	| ЕстьNULL(Максимум(Коды.ВнутреннийНомер),0) КАК Номер
	| ИЗ
	| Документ.ДатаМобайл_УпаковочныйЛист КАК Коды
	|ГДЕ
	| Коды.ВнутреннийНомер<> """"
	|";
	
	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		НомерUPL = 0;
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		НомерUPL = Выборка.Номер;
	КонецЕсли; 	
	
	НомерUPL = НомерUPL + 1 ;
	Если НомерUPL < 1 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат НомерUPL;
	
КонецФункции
Функция МаксимальныйSSCC() Экспорт
	
	Запрос = Новый Запрос;
	
	ТекстЗапроса = "ВЫБРАТЬ   
	| ЕстьNULL(Максимум(Коды.IDSSCC),0) КАК IDSSCC
	|ИЗ
	| Документ.ДатаМобайл_УпаковочныйЛист КАК Коды
	|ГДЕ
	| Коды.IDSSCC<> """"
	|";
	
	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат  0;
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ДелениеНаОснову = (Выборка.IDSSCC + 1) / 10000000;
		Если (Цел(ДелениеНаОснову) = ДелениеНаОснову) И Цел(ДелениеНаОснову) > 0 Тогда  //избежать нулевых SSCC 
			Возврат Выборка.IDSSCC + 1; 
		Иначе
			Возврат Выборка.IDSSCC;
		КонецЕсли; 
	КонецЕсли; 	
	
КонецФункции
Функция КонтрольноеЧислоSSCC(СтрБазаКода) Экспорт
	
	Сумма = 0;
	
	Для НомПоз = 1 По СтрДлина(СтрБазаКода) Цикл
		
		Симв = Сред(СтрБазаКода, НомПоз, 1); 
		
		ЧислСимв = 0;
		Попытка
			ЧислСимв = Число(Симв);
		Исключение
			Возврат Неопределено;
		КонецПопытки; 
		
		Если НомПоз / 2 = Цел(НомПоз / 2) Тогда // чет
			Сумма = Сумма + ЧислСимв;
		Иначе  // нечет
			Сумма = Сумма + ЧислСимв * 3;
		КонецЕсли; 
		
	КонецЦикла; 
	
	Цел10  =  Цел(Сумма / 10) * 10;
	Если Цел10 < Сумма Тогда
		БольшееКратноеДесяти = Цел10 + 10;
	Иначе
		БольшееКратноеДесяти = Цел10;		
	КонецЕсли; 
	КЧ = БольшееКратноеДесяти - Сумма;
	
	Если (КЧ > 9) Или (КЧ < 0) Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	Возврат СокрЛП(КЧ);
	
КонецФункции
Функция ПолучитьНовыйSSCC(Префикс) Экспорт
	
	НовыйНомер = МаксимальныйSSCC() + 1 ;
	Если НовыйНомер < 1 Тогда
		Возврат Неопределено;
	КонецЕсли;
	Попытка
		ЧислПрефикс =  Число(Префикс);
	Исключение
		Возврат Неопределено;
	КонецПопытки; 
	СтрПрефикс = Формат(ЧислПрефикс, "ЧЦ=9; ЧДЦ=; ЧВН=; ЧГ=0");
	СтрНовыйНомер =  Формат(НовыйНомер, "ЧЦ=8; ЧДЦ=; ЧВН=; ЧГ=0");
	ЦифраРасш = Лев(СтрНовыйНомер, 1);
	Остальное = Прав(СтрНовыйНомер, 7);
	СтрБазаКода = ЦифраРасш + СтрПрефикс + Остальное;
	КС = КонтрольноеЧислоSSCC(СтрБазаКода);
	Если КС = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	Результат = Новый Структура("SSCC,IDSSCC");
	Результат.SSCC = "00" + СтрБазаКода + КС;
	Результат.IDSSCC = НовыйНомер;
	
	Возврат Результат;
	
КонецФункции
Функция ПолучитьКодSSCC(Префикс, УпаковочныйЛист, ТЗ) Экспорт
	
	Если Не ЗначениеЗаполнено(Префикс) Тогда
		Возврат Неопределено;
	КонецЕсли; 
		
	НачатьТранзакцию();
	НовыйSSCC = ПолучитьНовыйSSCC(Префикс);
	
	Если НовыйSSCC  = Неопределено Тогда	
		ОтменитьТранзакцию();
		Возврат Неопределено;	
	КонецЕсли; 
	
	НоваяЗапись = УпаковочныйЛист.ПолучитьОбъект();
	НоваяЗапись.IDSSCC = НовыйSSCC.IDSSCC;
	НоваяЗапись.ВнешнийНомер = НовыйSSCC.SSCC;
	
	Для каждого CтрокаCборки Из ТЗ Цикл
		Если CтрокаCборки.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = НоваяЗапись.Товары.Добавить();        
		НоваяСтрока.Штрихкод = CтрокаCборки.Штрихкод;
		НоваяСтрока.Номенклатура = CтрокаCборки.Номенклатура;
		НоваяСтрока.Количество  = CтрокаCборки.Количество;
		НоваяСтрока.ЕГАИС_Номенклатура = CтрокаCборки.НоменклатураЕГАИС;
		НоваяСтрока.Марка = CтрокаCборки.ЕгаисПолныйКод;
		НоваяСтрока.Короб = CтрокаCборки.Короб;
	КонецЦикла;	
		
	Попытка
		НоваяЗапись.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ОтменитьТранзакцию();
		Возврат Неопределено;
	КонецПопытки; 
	
	ЗафиксироватьТранзакцию();
	
	Возврат НовыйSSCC.SSCC;
	
КонецФункции 
Функция ПолучитьКодGS1(Штрихкод, УпаковочныйЛист, ТЗ) Экспорт
	
	Если Не ЗначениеЗаполнено(Штрихкод) Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	НачатьТранзакцию();
	Если СтрДлина(Штрихкод) = 13 Тогда 
		Barcode =  "01" + "0" + Штрихкод + "UPL" + Формат(УпаковочныйЛист.ВнутреннийНомер, "ЧЦ=8; ЧДЦ=; ЧВН=; ЧГ=0");
	ИначеЕсли СтрДлина(Штрихкод) = 14 Тогда 
		Штрихкод = Сред(Штрихкод, 2, 12);
		Штрихкод = Штрихкод + КонтрольныйСимволEAN(Штрихкод, 13);
		Barcode =  "01" + "0" + Штрихкод + "UPL" + Формат(УпаковочныйЛист.ВнутреннийНомер, "ЧЦ=8; ЧДЦ=; ЧВН=; ЧГ=0");
	Иначе
		ОтменитьТранзакцию();
		Возврат Неопределено;	
	КонецЕсли;	
	
	НоваяЗапись = УпаковочныйЛист.ПолучитьОбъект();
	НоваяЗапись.ВнешнийНомер = Barcode;
	
	Для каждого CтрокаCборки Из ТЗ Цикл
		Если CтрокаCборки.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = НоваяЗапись.Товары.Добавить();        
		НоваяСтрока.Штрихкод = CтрокаCборки.Штрихкод;
		НоваяСтрока.Номенклатура = CтрокаCборки.Номенклатура;
		НоваяСтрока.Количество  = CтрокаCборки.Количество;
		НоваяСтрока.ЕГАИС_Номенклатура = CтрокаCборки.НоменклатураЕГАИС;
		НоваяСтрока.Марка = CтрокаCборки.ЕгаисПолныйКод;
		НоваяСтрока.Короб = CтрокаCборки.Короб;
	КонецЦикла;	
	
	Попытка
		НоваяЗапись.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ОтменитьТранзакцию();
		Возврат Неопределено;
	КонецПопытки; 
	
	Возврат Barcode;
	
КонецФункции
Функция КонтрольныйСимволEAN(ШтрихКод, Тип) Экспорт
	
	Четн   = 0;
	Нечетн = 0;
	
	КоличествоИтераций = ?(Тип = 13, 6, 4);
	
	Для Индекс = 1 По КоличествоИтераций Цикл
		Если (Тип = 8) И (Индекс = КоличествоИтераций) Тогда
		Иначе
			Четн = Четн + Сред(ШтрихКод, 2 * Индекс, 1);
		КонецЕсли;
		Нечетн = Нечетн + Сред(ШтрихКод, 2 * Индекс - 1, 1);
	КонецЦикла;
	
	Если Тип = 13 Тогда
		Четн = Четн * 3;
	Иначе
		Нечетн = Нечетн * 3;
	КонецЕсли;
	
	КонтЦифра = 10 - (Четн + Нечетн) % 10;
	
	Возврат ?(КонтЦифра = 10, "0", Строка(КонтЦифра));
	
КонецФункции // КонтрольныйСимволEAN()

// ФОТО
Функция ПолучитьДвоичныеДанныеКартинки(ГУИДТовара) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(Сред(ГУИДТовара, 4, 36)));
	
	Выборка = ПолучитьПрисоединенныеФайлы(Номенклатура);
	Если Выборка.Следующий() Тогда	
		ДанныеКартинки = ПолучитьИзвременногоХранилища(ДанныеФайла(Выборка.Файл, Новый УникальныйИдентификатор).СсылкаНаДвоичныеДанныеФайла);	
		Возврат ДанныеКартинки;	
	КонецЕсли;
	
	ПустаяКартинка = Новый Картинка;
	Возврат ПустаяКартинка.ПолучитьДвоичныеДанные();
	
КонецФункции

Функция ПолучитьПрисоединенныеФайлы(Номенклатура)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.Текст = "ВЫБРАТЬ 
	|	Номенклатура.ФайлКартинки КАК ФайлКартинки
	|ПОМЕСТИТЬ ВременнаяТаблицаОсновныеИзображения
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка = &Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФайлКартинки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Файлы.ВладелецФайла КАК Номенклатура,
	|	Файлы.Ссылка КАК Файл,
	|	Файлы.Наименование КАК Наименование,
	|	Файлы.Описание КАК Описание,
	|	Файлы.Том КАК Том,
	|	Файлы.Расширение КАК Расширение,
	|	Файлы.ПутьКФайлу КАК ПутьКФайлу
	|ИЗ
	|	Справочник.НоменклатураПрисоединенныеФайлы КАК Файлы
	|ГДЕ
	|	Файлы.ВладелецФайла = &Номенклатура
	|	И Файлы.Ссылка В
	|			(ВЫБРАТЬ
	|				ВременнаяТаблицаОсновныеИзображения.ФайлКартинки
	|			ИЗ
	|				ВременнаяТаблицаОсновныеИзображения КАК ВременнаяТаблицаОсновныеИзображения)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура";
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Функция ДанныеФайла(Знач ПрисоединенныйФайл,
	Знач ИдентификаторФормы = Неопределено,
	Знач ПолучатьСсылкуНаДвоичныеДанные = Истина,
	Знач ДляРедактирования = Ложь) Экспорт
	
	Модуль_РаботаСФайлами = ОбщийМодуль("РаботаСФайлами");
	Модуль_РаботаСФайламиСлужебный = ОбщийМодуль("РаботаСФайламиСлужебный");
	Модуль_СтроковыеФункцииКлиентСервер = ОбщийМодуль("СтроковыеФункцииКлиентСервер");
	Модуль_ОбщегоНазначенияКлиентСервер = ОбщийМодуль("ОбщегоНазначенияКлиентСервер");
	
	Модуль_ОбщегоНазначенияКлиентСервер.ПроверитьПараметр("РаботаСФайлами.ДанныеФайла", "ПрисоединенныйФайл", 
	ПрисоединенныйФайл, Метаданные.ОпределяемыеТипы.ПрисоединенныйФайл.Тип);
	
	ФайлОбъект = ПрисоединенныйФайл.ПолучитьОбъект();
	Модуль_ОбщегоНазначенияКлиентСервер.Проверить(ФайлОбъект <> Неопределено, 
	Модуль_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Не найден присоединенный файл ""%1"" (%2)'"),
	Строка(ПрисоединенныйФайл), ПрисоединенныйФайл.Метаданные()));
	
	Если ДляРедактирования И Не ЗначениеЗаполнено(ФайлОбъект.Редактирует) Тогда
		ФайлОбъект.Заблокировать();
		Модуль_РаботаСФайламиСлужебный.ЗанятьФайлДляРедактированияСервер(ФайлОбъект);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	СсылкаНаДвоичныеДанныеФайла = Неопределено;
	
	Если ПолучатьСсылкуНаДвоичныеДанные Тогда
		Если ПрисоединенныйФайл.ХранитьВерсии И ЗначениеЗаполнено(ПрисоединенныйФайл.ТекущаяВерсия) Тогда
			ДвоичныеДанные = Модуль_РаботаСФайлами.ДвоичныеДанныеФайла(ПрисоединенныйФайл.ТекущаяВерсия);
		Иначе
			ДвоичныеДанные = Модуль_РаботаСФайлами.ДвоичныеДанныеФайла(ПрисоединенныйФайл);
		КонецЕсли;
		Если ТипЗнч(ИдентификаторФормы) = Тип("УникальныйИдентификатор") Тогда
			СсылкаНаДвоичныеДанныеФайла = ПоместитьВоВременноеХранилище(ДвоичныеДанные, ИдентификаторФормы);
		Иначе
			СсылкаНаДвоичныеДанныеФайла = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
		КонецЕсли;
		
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Ссылка",                       ПрисоединенныйФайл);
	Результат.Вставить("СсылкаНаДвоичныеДанныеФайла",  СсылкаНаДвоичныеДанныеФайла);
	Результат.Вставить("ДатаМодификацииУниверсальная", ФайлОбъект.ДатаМодификацииУниверсальная);
	Результат.Вставить("ИмяФайла",                     ФайлОбъект.Наименование + "." + ФайлОбъект.Расширение);
	Результат.Вставить("Наименование",                 ФайлОбъект.Наименование);
	Результат.Вставить("Расширение",                   ФайлОбъект.Расширение);
	Результат.Вставить("Размер",                       ФайлОбъект.Размер);
	Результат.Вставить("Редактирует",                  ФайлОбъект.Редактирует);
	Результат.Вставить("ПодписанЭП",                   ФайлОбъект.ПодписанЭП);
	Результат.Вставить("Зашифрован",                   ФайлОбъект.Зашифрован);
	Результат.Вставить("ХранитьВерсии",                ФайлОбъект.ХранитьВерсии);
	Результат.Вставить("ПометкаУдаления",              ФайлОбъект.ПометкаУдаления);
	Результат.Вставить("ДатаЗаема",                    ФайлОбъект.ДатаЗаема);
	Результат.Вставить("Владелец",                     ФайлОбъект.ВладелецФайла);
	Результат.Вставить("АвторТекущейВерсии",           ФайлОбъект.Изменил);
	Результат.Вставить("НавигационнаяСсылка", ПолучитьНавигационнуюСсылку(ПрисоединенныйФайл));
	
	Возврат Результат;
	
КонецФункции

Функция ДобавитьФайл(ПараметрыФайла,
	Знач АдресФайлаВоВременномХранилище,
	Знач АдресВременногоХранилищаТекста = "",
	Знач Описание = "",
	Знач НоваяСсылкаНаФайл = Неопределено) Экспорт
	
	Модуль_РаботаСФайламиСлужебный = ОбщийМодуль("РаботаСФайламиСлужебный");
	Модуль_РаботаСФайламиВТомахСлужебный = ОбщийМодуль("РаботаСФайламиВТомахСлужебный");
	Модуль_СтроковыеФункцииКлиентСервер = ОбщийМодуль("СтроковыеФункцииКлиентСервер");
	Модуль_ОбщегоНазначенияКлиентСервер = ОбщийМодуль("ОбщегоНазначенияКлиентСервер");
	
	Автор =              ПараметрыФайла.Автор;
	ВладелецФайлов =     ПараметрыФайла.ВладелецФайлов;
	ИмяБезРасширения  =  ПараметрыФайла.ИмяБезРасширения;
	РасширениеБезТочки = ПараметрыФайла.РасширениеБезТочки;
	ГруппаФайлов = Неопределено;
	Если ПараметрыФайла.Свойство("ГруппаФайлов") 
		И ЗначениеЗаполнено(ПараметрыФайла.ГруппаФайлов)
		И Не Модуль_РаботаСФайламиСлужебный.ЭтоПапкаФайлов(ВладелецФайлов) Тогда
		ГруппаФайлов = ПараметрыФайла.ГруппаФайлов;
	КонецЕсли;
	ВремяИзмененияУниверсальное = ПараметрыФайла.ВремяИзмененияУниверсальное;
	
	Если РасширениеБезТочки = Неопределено Тогда
		ЧастиИмениФайла = СтрРазделить(ИмяБезРасширения, ".", Ложь);
		Если ЧастиИмениФайла.Количество() > 1 Тогда
			РасширениеБезТочки = ЧастиИмениФайла[ЧастиИмениФайла.Количество() - 1];
			ИмяБезРасширения = Лев(ИмяБезРасширения, СтрДлина(ИмяБезРасширения) - (СтрДлина(РасширениеБезТочки) + 1));
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВремяИзмененияУниверсальное)
		Или ВремяИзмененияУниверсальное > ТекущаяУниверсальнаяДата() Тогда
		ВремяИзмененияУниверсальное = ТекущаяУниверсальнаяДата();
	КонецЕсли;
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайлаВоВременномХранилище);
	
	ЗаголовокОшибки = НСтр("ru = 'Ошибка при добавлении присоединенного файла.'");
	
	Если НоваяСсылкаНаФайл = Неопределено Тогда
		ИмяСправочника = Модуль_РаботаСФайламиСлужебный.ИмяСправочникаХраненияФайлов(ВладелецФайлов, "", ЗаголовокОшибки,
		НСтр("ru = 'В этом случае параметр ""НоваяСсылкаНаФайл"" должен быть указан.'"));
		
		НоваяСсылкаНаФайл = Справочники[ИмяСправочника].ПолучитьСсылку();
	Иначе
		Если Не Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(НоваяСсылкаНаФайл))
			Или Не ЗначениеЗаполнено(НоваяСсылкаНаФайл) Тогда
			
			ВызватьИсключение НСтр("ru = 'Ошибка при добавлении присоединенного файла.
			|Ссылка на новый файл не заполнена.'");
		КонецЕсли;
		
		ИмяСправочника = Модуль_РаботаСФайламиСлужебный.ИмяСправочникаХраненияФайлов(
		ВладелецФайлов, НоваяСсылкаНаФайл.Метаданные().Имя, ЗаголовокОшибки);
	КонецЕсли;
	
	ПрисоединенныйФайл = Справочники[ИмяСправочника].СоздатьЭлемент();
	ПрисоединенныйФайл.УстановитьСсылкуНового(НоваяСсылкаНаФайл);
	
	ПрисоединенныйФайл.ВладелецФайла                = ВладелецФайлов;
	ПрисоединенныйФайл.ДатаМодификацииУниверсальная = ВремяИзмененияУниверсальное;
	ПрисоединенныйФайл.ДатаСоздания                 = ПолучитьТекущуюДату();
	ПрисоединенныйФайл.Описание                     = Описание;
	ПрисоединенныйФайл.Наименование                 = ИмяБезРасширения;
	ПрисоединенныйФайл.Расширение                   = РасширениеБезТочки;
	ТипХраненияФайла = Модуль_РаботаСФайламиСлужебный.ТипХраненияФайлов();
	ПрисоединенныйФайл.ТипХраненияФайла             = ТипХраненияФайла;
	ПрисоединенныйФайл.Размер                       = ДвоичныеДанные.Размер();
	Если ГруппаФайлов <> Неопределено Тогда
		ПрисоединенныйФайл.Родитель = ГруппаФайлов;
	КонецЕсли;
	
	ПрисоединенныйФайл.Записать();
	Если ТипХраненияФайла = Перечисления.ТипыХраненияФайлов.ВИнформационнойБазе Тогда
		
		ПрисоединенныйФайл.ТипХраненияФайла = ТипХраненияФайла;
		
		// передается ссылка
		Модуль_РаботаСФайламиСлужебный.ЗаписатьФайлВИнформационнуюБазу(ПрисоединенныйФайл.Ссылка, ДвоичныеДанные);
		
	Иначе
		
		ПрисоединенныйФайл.Том = Неопределено;
		ПрисоединенныйФайл.ПутьКФайлу = Неопределено;
		ПрисоединенныйФайл.ТипХраненияФайла = Неопределено;
		
		// передается объект
		Модуль_РаботаСФайламиВТомахСлужебный.ДобавитьФайл(ПрисоединенныйФайл, ДвоичныеДанные);
		
	КонецЕсли;
	ПрисоединенныйФайл.Записать();
		
	Возврат ПрисоединенныйФайл.Ссылка;
	
КонецФункции

Функция ДобавитьФайл_old(ПараметрыФайла,
	Знач АдресФайлаВоВременномХранилище,
	Знач АдресВременногоХранилищаТекста = "",
	Знач Описание = "",
	Знач НоваяСсылкаНаФайл = Неопределено) Экспорт
	
	Модуль_РаботаСФайламиСлужебный = ОбщийМодуль("РаботаСФайламиСлужебный");
	Модуль_СтроковыеФункцииКлиентСервер = ОбщийМодуль("СтроковыеФункцииКлиентСервер");
	Модуль_ОбщегоНазначенияКлиентСервер = ОбщийМодуль("ОбщегоНазначенияКлиентСервер");
	
	Автор =              ПараметрыФайла.Автор;
	ВладелецФайлов =     ПараметрыФайла.ВладелецФайлов;
	ИмяБезРасширения  =  ПараметрыФайла.ИмяБезРасширения;
	РасширениеБезТочки = ПараметрыФайла.РасширениеБезТочки;
	ГруппаФайлов = Неопределено;
	Если ПараметрыФайла.Свойство("ГруппаФайлов") 
		И ЗначениеЗаполнено(ПараметрыФайла.ГруппаФайлов)
		И Не Модуль_РаботаСФайламиСлужебный.ЭтоПапкаФайлов(ВладелецФайлов) Тогда
		ГруппаФайлов = ПараметрыФайла.ГруппаФайлов;
	КонецЕсли;
	ВремяИзмененияУниверсальное = ПараметрыФайла.ВремяИзмененияУниверсальное;
	
	Если РасширениеБезТочки = Неопределено Тогда
		ЧастиИмениФайла = СтрРазделить(ИмяБезРасширения, ".", Ложь);
		Если ЧастиИмениФайла.Количество() > 1 Тогда
			РасширениеБезТочки = ЧастиИмениФайла[ЧастиИмениФайла.Количество() - 1];
			ИмяБезРасширения = Лев(ИмяБезРасширения, СтрДлина(ИмяБезРасширения) - (СтрДлина(РасширениеБезТочки) + 1));
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВремяИзмененияУниверсальное)
		Или ВремяИзмененияУниверсальное > ТекущаяУниверсальнаяДата() Тогда
		ВремяИзмененияУниверсальное = ТекущаяУниверсальнаяДата();
	КонецЕсли;
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайлаВоВременномХранилище);
	
	ЗаголовокОшибки = НСтр("ru = 'Ошибка при добавлении присоединенного файла.'");
	
	Если НоваяСсылкаНаФайл = Неопределено Тогда
		ИмяСправочника = Модуль_РаботаСФайламиСлужебный.ИмяСправочникаХраненияФайлов(ВладелецФайлов, "", ЗаголовокОшибки,
		НСтр("ru = 'В этом случае параметр ""НоваяСсылкаНаФайл"" должен быть указан.'"));
		
		НоваяСсылкаНаФайл = Справочники[ИмяСправочника].ПолучитьСсылку();
	Иначе
		Если Не Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(НоваяСсылкаНаФайл))
			Или Не ЗначениеЗаполнено(НоваяСсылкаНаФайл) Тогда
			
			ВызватьИсключение НСтр("ru = 'Ошибка при добавлении присоединенного файла.
			|Ссылка на новый файл не заполнена.'");
		КонецЕсли;
		
		ИмяСправочника = Модуль_РаботаСФайламиСлужебный.ИмяСправочникаХраненияФайлов(
		ВладелецФайлов, НоваяСсылкаНаФайл.Метаданные().Имя, ЗаголовокОшибки);
	КонецЕсли;
	
	ПрисоединенныйФайл = Справочники[ИмяСправочника].СоздатьЭлемент();
	ПрисоединенныйФайл.УстановитьСсылкуНового(НоваяСсылкаНаФайл);
	
	ПрисоединенныйФайл.ВладелецФайла                = ВладелецФайлов;
	ПрисоединенныйФайл.ДатаМодификацииУниверсальная = ВремяИзмененияУниверсальное;
	ПрисоединенныйФайл.ДатаСоздания                 = ПолучитьТекущуюДату();
	ПрисоединенныйФайл.Описание                     = Описание;
	ПрисоединенныйФайл.Наименование                 = ИмяБезРасширения;
	ПрисоединенныйФайл.Расширение                   = РасширениеБезТочки;
	ПрисоединенныйФайл.ТипХраненияФайла             = Модуль_РаботаСФайламиСлужебный.ТипХраненияФайлов();
	ПрисоединенныйФайл.Размер                       = ДвоичныеДанные.Размер();
	Если ГруппаФайлов <> Неопределено Тогда
		ПрисоединенныйФайл.Родитель = ГруппаФайлов;
	КонецЕсли;
		
	Если ПрисоединенныйФайл.ТипХраненияФайла = Перечисления.ТипыХраненияФайлов.ВИнформационнойБазе Тогда
		НачатьТранзакцию();
		Попытка
			СвояТранзакцияОткрыта = Истина;
			Модуль_РаботаСФайламиСлужебный.ЗаписатьФайлВИнформационнуюБазу(НоваяСсылкаНаФайл, ДвоичныеДанные);
			ПрисоединенныйФайл.Том = Справочники.ТомаХраненияФайлов.ПустаяСсылка();
			ПрисоединенныйФайл.ПутьКФайлу = "";
			
			СтатусИзвлеченияТекста = Перечисления.СтатусыИзвлеченияТекстаФайлов.НеИзвлечен;
			ИзвлеченныйТекст = "";
			
			Если ЭтоАдресВременногоХранилища(АдресВременногоХранилищаТекста) Тогда
				ИзвлеченныйТекст = Модуль_РаботаСФайламиСлужебный.ПолучитьСтрокуИзВременногоХранилища(АдресВременногоХранилищаТекста);
				СтатусИзвлеченияТекста = Перечисления.СтатусыИзвлеченияТекстаФайлов.Извлечен;
				
			ИначеЕсли Не Модуль_РаботаСФайламиСлужебный.ИзвлекатьТекстыФайловНаСервере() Тогда
				// Тексты извлекаются сразу, а не в фоновом задании.
				ИзвлеченныйТекст = Модуль_РаботаСФайламиСлужебный.ИзвлечьТекст(АдресВременногоХранилищаТекста, ДвоичныеДанные, ПрисоединенныйФайл.Расширение);
				СтатусИзвлеченияТекста = Перечисления.СтатусыИзвлеченияТекстаФайлов.Извлечен;
			КонецЕсли;
			
			ПрисоединенныйФайл.СтатусИзвлеченияТекста = СтатусИзвлеченияТекста;
			ПрисоединенныйФайл.ТекстХранилище = Новый ХранилищеЗначения(ИзвлеченныйТекст);
			
			ПрисоединенныйФайл.Автор = Автор;
						
			ПрисоединенныйФайл.Записать();
			
			ЗафиксироватьТранзакцию();			
		Исключение
			ОтменитьТранзакцию();
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			
			ШаблонСообщения = НСтр("ru = 'Ошибка при добавлении присоединенного файла ""%1"":
			|%2'");
			КомментарийЖурналаРегистрации = Модуль_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонСообщения,
			ИмяБезРасширения + "." + РасширениеБезТочки,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
			
			ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Файлы.Добавление присоединенного файла'",
			Модуль_ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			КомментарийЖурналаРегистрации);
			
			ВызватьИсключение Модуль_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонСообщения,
			ИмяБезРасширения + "." + РасширениеБезТочки,
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке));
		КонецПопытки;
	Иначе
		Попытка
			// Добавление в один из томов (где есть свободное место).
			СведенияОФайле = Модуль_РаботаСФайламиСлужебный.ДобавитьФайлВТом(ДвоичныеДанные, ВремяИзмененияУниверсальное,
			ИмяБезРасширения, РасширениеБезТочки, , ПрисоединенныйФайл.Зашифрован);
			ПрисоединенныйФайл.Том = СведенияОФайле.Том;
			ПрисоединенныйФайл.ПутьКФайлу = СведенияОФайле.ПутьКФайлу;
			
			СтатусИзвлеченияТекста = Перечисления.СтатусыИзвлеченияТекстаФайлов.НеИзвлечен;
			ИзвлеченныйТекст = "";
			
			Если ЭтоАдресВременногоХранилища(АдресВременногоХранилищаТекста) Тогда
				ИзвлеченныйТекст = Модуль_РаботаСФайламиСлужебный.ПолучитьСтрокуИзВременногоХранилища(АдресВременногоХранилищаТекста);
				СтатусИзвлеченияТекста = Перечисления.СтатусыИзвлеченияТекстаФайлов.Извлечен;
				
			ИначеЕсли Не Модуль_РаботаСФайламиСлужебный.ИзвлекатьТекстыФайловНаСервере() Тогда
				// Тексты извлекаются сразу, а не в фоновом задании.
				ИзвлеченныйТекст = Модуль_РаботаСФайламиСлужебный.ИзвлечьТекст(АдресВременногоХранилищаТекста, ДвоичныеДанные, ПрисоединенныйФайл.Расширение);
				СтатусИзвлеченияТекста = Перечисления.СтатусыИзвлеченияТекстаФайлов.Извлечен;
			КонецЕсли;
			
			ПрисоединенныйФайл.СтатусИзвлеченияТекста = СтатусИзвлеченияТекста;
			ПрисоединенныйФайл.ТекстХранилище = Новый ХранилищеЗначения(ИзвлеченныйТекст);
			ПрисоединенныйФайл.Автор = Автор;
			
			ПрисоединенныйФайл.Записать();			
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			
			ШаблонСообщения = НСтр("ru = 'Ошибка при добавлении присоединенного файла ""%1"":
			|%2'");
			КомментарийЖурналаРегистрации = Модуль_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонСообщения,
			ИмяБезРасширения + "." + РасширениеБезТочки,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
			
			ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Файлы.Добавление присоединенного файла'",
			Модуль_ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			КомментарийЖурналаРегистрации);
			
			ВызватьИсключение Модуль_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонСообщения,
			ИмяБезРасширения + "." + РасширениеБезТочки,
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке));
		КонецПопытки;
	КонецЕсли;
	
	Возврат ПрисоединенныйФайл.Ссылка;
	
КонецФункции

Функция ПолучитьУжатуюКартинку(Картинка, ВысотаКартинки, ШиринаКартинки, НоваяВысотаКартинки, НоваяШиринаКартинки, ИзображениеЛандшафт) 
		
	Если ИзображениеЛандшафт Тогда
		УжатьДо = НоваяШиринаКартинки;
		ТекущееЗначениеИзмерения = ШиринаКартинки;
		Коэффициент = ШиринаКартинки / НоваяШиринаКартинки;
	Иначе
		УжатьДо = НоваяВысотаКартинки;
		ТекущееЗначениеИзмерения = ВысотаКартинки;
		Коэффициент = ВысотаКартинки / НоваяВысотаКартинки;
	КонецЕсли;	
	
	Крт_ = Картинка;  
	
	КртШирина = Картинка.Ширина();
	КртВысота = Картинка.Высота();			
	
	НоваяШирина = Окр(КртШирина / Коэффициент, 0);
	НоваяВысота = Окр(КртВысота / Коэффициент, 0);
	
	ОбрКрт = Новый ОбрабатываемаяКартинка(Картинка, Истина);
	ОбрКрт.УстановитьРазмер(НоваяШирина, НоваяВысота);
	Крт_ = ОбрКрт.ПолучитьКартинку();
	
	Возврат Крт_;  
	
КонецФункции

Процедура СжатьИзображения(СтруктураПараметров, ПараметрыВыполнения) Экспорт 
	
	Модуль_РаботаСФайлами = ОбщийМодуль("РаботаСФайлами");
	
	РП = ДатаМобайл_ОбщийМодуль.DM_ПолучитьРазделительПути(); 	
	
	ПутьХранения = СтруктураПараметров.ПутьХранения;
	Если Прав(ПутьХранения, 1) = РП Тогда
		ПутьХранения = Лев(ПутьХранения, СтрДлина(ПутьХранения) - 1);	
	КонецЕсли;	
	
	Если СтруктураПараметров.Свойство("ПолнаяВыгрузка") Тогда
		Если СтруктураПараметров.ПолнаяВыгрузка Тогда
			УдалитьФайлы(ПутьХранения + РП + "images");
			УдалитьФайлы(ПутьХранения + РП + "previews");
		КонецЕсли;
	КонецЕсли;	
		
	Запрос = Новый Запрос; 		    
	Запрос.Текст =      
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Файлы.Ссылка КАК ОбъектВыгрузки,
	|	Файлы.ВладелецФайла КАК Номенклатура,
	|	Файлы.Расширение КАК Расширение
	|ПОМЕСТИТЬ	СписокИзображений
	|ИЗ
	|	Справочник.НоменклатураПрисоединенныеФайлы КАК Файлы
	|ГДЕ
	|	НЕ Файлы.ПометкаУдаления
	|	И НЕ Файлы.ВладелецФайла.ЭтоГруппа
	|	И (Файлы.ВладелецФайла.Ссылка В ИЕРАРХИИ (&СписокТоваров) ИЛИ &ВсеТовары)
	|	&Условие1
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////		
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.Пустаяссылка)) КАК Характеристика
	|ПОМЕСТИТЬ СписокТоваровОбщий
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ПО (ХарактеристикиНоменклатуры.Владелец = Номенклатура.Ссылка)
	|			И (Номенклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры))
	|			И (НЕ ХарактеристикиНоменклатуры.ПометкаУдаления)
	|ГДЕ
	|	НЕ ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.Пустаяссылка)) = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.Пустаяссылка)
	|	И
	|	Номенклатура.Ссылка В
	|			(ВЫБРАТЬ
	|				СписокИзображений.Номенклатура
	|			ИЗ
	|				СписокИзображений КАК СписокИзображений)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура.Ссылка,
	|	ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.Пустаяссылка))
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ПО (ХарактеристикиНоменклатуры.Владелец = Номенклатура.ВидНоменклатуры)
	|			И (Номенклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры))
	|			И (НЕ ХарактеристикиНоменклатуры.ПометкаУдаления)
	|ГДЕ
	|	Номенклатура.Ссылка В
	|			(ВЫБРАТЬ
	|				СписокИзображений.Номенклатура
	|			ИЗ
	|				СписокИзображений КАК СписокИзображений)
	|	И НЕ ХарактеристикиНоменклатуры.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура.Ссылка,
	|	ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.Пустаяссылка))
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ПО (ХарактеристикиНоменклатуры.Владелец = Номенклатура.ВладелецХарактеристик)
	|			И (Номенклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеСДругимВидомНоменклатуры))
	|			И (НЕ ХарактеристикиНоменклатуры.ПометкаУдаления)
	|ГДЕ
	|	Номенклатура.Ссылка В
	|			(ВЫБРАТЬ
	|				СписокИзображений.Номенклатура
	|			ИЗ
	|				СписокИзображений КАК СписокИзображений)
	|	И НЕ ХарактеристикиНоменклатуры.Ссылка ЕСТЬ NULL 
	|	
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СписокИзображений.Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|ИЗ  
	|	СписокИзображений КАК СписокИзображений
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|	ПО СписокИзображений.Номенклатура = СпрНоменклатура.Ссылка
	|		
	|ГДЕ
	|	СпрНоменклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ           
	|	СписокИзображений.ОбъектВыгрузки КАК ОбъектВыгрузки,
	|	СписокИзображений.Номенклатура КАК Номенклатура,
	|	СписокИзображений.Расширение КАК Расширение,
	|	ЕСТЬNULL(СписокТоваровОбщий.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.Пустаяссылка)) КАК Характеристика
	|ПОМЕСТИТЬ СписокИзображенийИтог
	|ИЗ
	|	СписокТоваровОбщий КАК СписокТоваровОбщий
	|		ЛЕВОЕ СОЕДИНЕНИЕ СписокИзображений КАК СписокИзображений
	|		ПО СписокТоваровОбщий.Номенклатура = СписокИзображений.Номенклатура
	|
	|ГДЕ
	|	1 = 1	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СписокИзображенийИтог.ОбъектВыгрузки КАК ОбъектВыгрузки,
	|	СписокИзображенийИтог.Номенклатура КАК Номенклатура, 
	|	СписокИзображенийИтог.Расширение КАК Расширение,
	|	СписокИзображенийИтог.Характеристика КАК Характеристика
	|ИЗ
	|	СписокИзображенийИтог КАК СписокИзображенийИтог
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура
	|ИТОГИ ПО
	|	Номенклатура";              
	
	Если СтруктураПараметров.Свойство("Номенклатура") Тогда                                                 
		МассивТоваров = Новый Массив;
		МассивТоваров.Добавить(СтруктураПараметров.Номенклатура);
		                      		
		Запрос.УстановитьПараметр("СписокТоваров", МассивТоваров);
		Запрос.УстановитьПараметр("ВсеТовары", МассивТоваров.Количество() = 0); 
	Иначе	
		Запрос.УстановитьПараметр("СписокТоваров", СтруктураПараметров.УзелПО.ДоступныеГруппыТоваров.ВыгрузитьКолонку("Номенклатура"));
		Запрос.УстановитьПараметр("ВсеТовары", СтруктураПараметров.УзелПО.ДоступныеГруппыТоваров.Количество() = 0); 
	КонецЕсли; 
	
	Если СтруктураПараметров.Свойство("Характеристика") Тогда
		Запрос.УстановитьПараметр("Характеристика", СтруктураПараметров.Характеристика);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "СписокТоваровОбщий.Характеристика = &Характеристика");
	КонецЕсли;
		
	// вызов из SetArtPhoto:
	Если СтруктураПараметров.Свойство("ПрисоединенныйФайл") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Условие1", "И Файлы.Ссылка = &ПрисоединенныйФайл");
		Запрос.УстановитьПараметр("ПрисоединенныйФайл", СтруктураПараметров.ПрисоединенныйФайл);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Условие1", "");
	КонецЕсли;	
	
	Результат = Запрос.Выполнить();   
	
	МассивРасширений = Новый Массив;
	МассивРасширений.Добавить("jpg");
	МассивРасширений.Добавить("jpeg");
	МассивРасширений.Добавить("bmp");
	МассивРасширений.Добавить("png");
	
	Если Не Результат.Пустой() Тогда	
				
		КаталогНаДискеImages = Новый Файл(ПутьХранения + РП + "images");
		
		Если Не КаталогНаДискеImages.Существует() Тогда
			СоздатьКаталог(ПутьХранения + РП + "images");
		КонецЕсли;
		
		КаталогНаДискеPreviews = Новый Файл(ПутьХранения + РП + "previews");
		
		Если Не КаталогНаДискеPreviews.Существует() Тогда
			СоздатьКаталог(ПутьХранения + РП + "previews");
		КонецЕсли;
		
		Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока Выборка.Следующий() Цикл            
			
			Если Выборка.Номенклатура = Неопределено Тогда
				Продолжить;
			КонецЕсли;	 
			
			ВыборкаДетальныеЗаписи = Выборка.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл   
				
				ГУИД_Товара = XMLСтрока(ВыборкаДетальныеЗаписи.Номенклатура) + XMLСтрока(ВыборкаДетальныеЗаписи.Характеристика);
				
				Если МассивРасширений.Найти(НРег(ВыборкаДетальныеЗаписи.Расширение)) = Неопределено Тогда
					Продолжить;	
				КонецЕсли;                
				
				// 1. Получаем исходное изображение и сохраняем его:  
				
				Попытка 
					ДвоичныеДанные = Модуль_РаботаСФайлами.ДвоичныеДанныеФайла(ВыборкаДетальныеЗаписи.ОбъектВыгрузки, Ложь);
				Исключение
					ДвоичныеДанные = Модуль_РаботаСФайлами.ДвоичныеДанныеФайла(ВыборкаДетальныеЗаписи.ОбъектВыгрузки); //Старые конфы
				КонецПопытки;
				
				Если ДвоичныеДанные = Неопределено Тогда
					Продолжить;
				КонецЕсли;	
				
				ПолныйПутьКИсходномуИзображению = ПутьХранения + РП + "images" + РП + Строка(ГУИД_Товара) +  "." + ВыборкаДетальныеЗаписи.Расширение; 				
				Попытка
					ДвоичныеДанные.Записать(ПолныйПутьКИсходномуИзображению);
				Исключение
					Продолжить;
				КонецПопытки;	
				
				Попытка
					Картинка = Новый Картинка(ПолныйПутьКИсходномуИзображению);  
					ВысотаКартинки = Картинка.Высота();
					ШиринаКартинки = Картинка.Ширина(); 
				Исключение
					ВысотаКартинки = Неопределено;
				КонецПопытки;			
				
				Если ДвоичныеДанные = Неопределено Тогда
					Продолжить;		
				КонецЕсли;   						  
				
				// 2. Формирование изображений image:      
				
				ГУИД_ТовараСтрока = "8U-" + Строка(ГУИД_Товара);    			
				НаименованиеИзображения = "8i-" + XMLСтрока(ВыборкаДетальныеЗаписи.ОбъектВыгрузки);        			
				КаталогНаДискеКИзмененномуИзображению = Новый Файл(ПутьХранения + РП + "images" + РП + ГУИД_ТовараСтрока);    	
				Если Не КаталогНаДискеКИзмененномуИзображению.Существует() Тогда
					СоздатьКаталог(ПутьХранения + РП + "images" + РП + ГУИД_ТовараСтрока);
				КонецЕсли;    
				ПолныйПутьКИзмененномуИзображению = ПутьХранения + РП + "images" + РП + ГУИД_ТовараСтрока +  РП + НаименованиеИзображения +  "." + ВыборкаДетальныеЗаписи.Расширение; 		
				
				Если ВысотаКартинки = Неопределено Тогда
					Попытка
						ДвоичныеДанные.Записать(ПолныйПутьКИзмененномуИзображению);
					Исключение
						Продолжить;
					КонецПопытки;	
				Иначе	
					Попытка
						Картинка = Новый Картинка(ПолныйПутьКИсходномуИзображению);
						ВысотаКартинки = Картинка.Высота();
						ШиринаКартинки = Картинка.Ширина();
						Если ВысотаКартинки < ШиринаКартинки Тогда
							ИзображениеЛандшафт = Истина;	
						Иначе
							ИзображениеЛандшафт = Ложь;
						КонецЕсли;	
						
					Исключение
						ВысотаКартинки = Неопределено;
					КонецПопытки;	
					
					Если Не ВысотаКартинки = Неопределено Тогда					
						Если ВысотаКартинки > 800 Или ШиринаКартинки > 800 Тогда
							// Размер 480х800 
							НоваяВысотаКартинки = 480;
							НоваяШиринаКартинки = 800;
							Попытка
								НоваяКартинка = ПолучитьУжатуюКартинку(Картинка, ВысотаКартинки, ШиринаКартинки, НоваяВысотаКартинки, НоваяШиринаКартинки, ИзображениеЛандшафт);															
								НоваяКартинка.Записать(ПолныйПутьКИзмененномуИзображению);
							Исключение
								Продолжить;
							КонецПопытки;		
						Иначе
							Картинка.Записать(ПолныйПутьКИзмененномуИзображению);
						КонецЕсли;	
					Иначе
						Попытка
							Картинка.Записать(ПолныйПутьКИзмененномуИзображению);
						Исключение
							Продолжить;
						КонецПопытки;		
					КонецЕсли;	 
				КонецЕсли;	
				
				// 3. Формирование изображений preview:      
				
				НаименованиеИзображенияПревью 	= "";
				РасширениеИзображенияПревью = "";
				ФайлКартинкиПревьюСсылка = ПолучитьОсновноеИзображениеДляPreviews(Выборка.Номенклатура, НаименованиеИзображенияПревью, РасширениеИзображенияПревью);		
				Если Не ФайлКартинкиПревьюСсылка = Неопределено Тогда                											
					КаталогНаДискеКИзмененномуИзображениюПревью = Новый Файл(ПутьХранения + РП +"previews" +  РП + ГУИД_ТовараСтрока);		
					Если Не КаталогНаДискеКИзмененномуИзображениюПревью.Существует() Тогда
						СоздатьКаталог(ПутьХранения + РП +"previews" +  РП + ГУИД_ТовараСтрока);
					КонецЕсли;     
					Если ФайлКартинкиПревьюСсылка <> ВыборкаДетальныеЗаписи.ОбъектВыгрузки Тогда
						Попытка 
							ДвоичныеДанныеПревью = Модуль_РаботаСФайлами.ДвоичныеДанныеФайла(ФайлКартинкиПревьюСсылка, Ложь);
						Исключение
							ДвоичныеДанныеПревью = Модуль_РаботаСФайлами.ДвоичныеДанныеФайла(ФайлКартинкиПревьюСсылка); //Старые конфы
						КонецПопытки;
					Иначе
						Попытка 
							ДвоичныеДанныеПревью = Модуль_РаботаСФайлами.ДвоичныеДанныеФайла(ВыборкаДетальныеЗаписи.ОбъектВыгрузки, Ложь);
						Исключение
							ДвоичныеДанныеПревью = Модуль_РаботаСФайлами.ДвоичныеДанныеФайла(ВыборкаДетальныеЗаписи.ОбъектВыгрузки); //Старые конфы
						КонецПопытки; 
					КонецЕсли;
					Если Не ДвоичныеДанныеПревью = Неопределено Тогда  
						// Размер 150х150
						ПолныйПутьКИзмененномуИзображениюПревью = ПутьХранения + РП +"previews" + РП + ГУИД_ТовараСтрока +  РП + НаименованиеИзображенияПревью  + "." + РасширениеИзображенияПревью;
						ДвоичныеДанныеПревью.Записать(ПолныйПутьКИзмененномуИзображениюПревью);
						Если ВысотаКартинки = Неопределено Тогда
							Попытка
								ДвоичныеДанные.Записать(ПолныйПутьКИзмененномуИзображению);
							Исключение
								Продолжить;
							КонецПопытки;		
						Иначе
							НоваяВысотаКартинки = 150;
							НоваяШиринаКартинки = 150; 					
							Картинка = Новый Картинка(ПолныйПутьКИзмененномуИзображениюПревью); 
							ВысотаКартинки = Картинка.Высота();
							ШиринаКартинки = Картинка.Ширина();	
							Попытка
								НоваяКартинка = ПолучитьУжатуюКартинку(Картинка, ВысотаКартинки, ШиринаКартинки, НоваяВысотаКартинки, НоваяШиринаКартинки, ИзображениеЛандшафт); 							 
								НоваяКартинка.Записать(ПолныйПутьКИзмененномуИзображениюПревью);
							Исключение 
								Продолжить;
							КонецПопытки;	
						КонецЕсли;	
					КонецЕсли;
				КонецЕсли;	
				
				Попытка
					УдалитьФайлы(ПолныйПутьКИсходномуИзображению);
				Исключение
				КонецПопытки;	
					
			КонецЦикла;
			
		КонецЦикла;			
		
	КонецЕсли;     	
		
КонецПроцедуры

Функция ПолучитьОсновноеИзображениеДляPreviews(Номенклатура, НаименованиеИзображенияПревью, РасширениеИзображенияПревью) Экспорт
	
	Запрос = Новый Запрос; 	
	Запрос.Текст =   
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	НоменклатураПрисоединенныеФайлы.Ссылка КАК Файл,
	|	2 КАК Порядок,
	|	НоменклатураПрисоединенныеФайлы.Расширение КАК Расширение
	|ПОМЕСТИТЬ ВТ_ОсновныеИзображения
	|ИЗ
	|	Справочник.НоменклатураПрисоединенныеФайлы КАК НоменклатураПрисоединенныеФайлы
	|ГДЕ
	|	НЕ НоменклатураПрисоединенныеФайлы.ПометкаУдаления
	|	И НоменклатураПрисоединенныеФайлы.ВладелецФайла = &ВладелецФайла
	|	И НоменклатураПрисоединенныеФайлы.Ссылка <> ЗНАЧЕНИЕ(Справочник.НоменклатураПрисоединенныеФайлы.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Номенклатура.ФайлКартинки,
	|	1,
	|	Номенклатура.ФайлКартинки.Расширение
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	НЕ Номенклатура.ФайлКартинки = ЗНАЧЕНИЕ(Справочник.НоменклатураПрисоединенныеФайлы.ПустаяСсылка)
	|	И Номенклатура.Ссылка = &ВладелецФайла
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВТ_ОсновныеИзображения.Порядок КАК Порядок,
	|	ВТ_ОсновныеИзображения.Файл КАК Файл,
	|	ВТ_ОсновныеИзображения.Расширение КАК Расширение
	|ИЗ
	|	ВТ_ОсновныеИзображения КАК ВТ_ОсновныеИзображения
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок";    
	
	Запрос.УстановитьПараметр("ВладелецФайла", Номенклатура);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда   	
		НаименованиеИзображенияПревью = "8i-" + XMLСтрока(Выборка.Файл);
		ФайлКартинкиПревьюСсылка = Выборка.Файл;  
		РасширениеИзображенияПревью = Выборка.Расширение;
	Иначе
		ФайлКартинкиПревьюСсылка = Неопределено;   
		РасширениеИзображенияПревью = Неопределено; 	
	КонецЕсли;
	
	Возврат ФайлКартинкиПревьюСсылка;
	
КонецФункции

// ДОПОЛНИТЕЛЬНЫЕ ФОРМЫ
Процедура ДополнительныеШагиПослеУдаления(ИзШапки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДатаМобайл_СвязиДополнительныхФормИШаблонов.Шаблон КАК Шаблон,
	|	ДатаМобайл_СвязиДополнительныхФормИШаблонов.ДополнительнаяФорма КАК ДополнительнаяФорма,
	|	ДатаМобайл_СвязиДополнительныхФормИШаблонов.Порядок КАК Порядок,
	|	ДатаМобайл_СвязиДополнительныхФормИШаблонов.ПодборРазмещение КАК ПодборРазмещение,
	|	ДатаМобайл_СвязиДополнительныхФормИШаблонов.ИспользоватьВПоискеСтрок КАК ИспользоватьВПоискеСтрок
	|ИЗ
	|	РегистрСведений.ДатаМобайл_СвязиДополнительныхФормИШаблонов КАК ДатаМобайл_СвязиДополнительныхФормИШаблонов
	|ГДЕ
	|	(&ВсеДФ
	|			ИЛИ ДатаМобайл_СвязиДополнительныхФормИШаблонов.РеквизитИзШапки = &РеквизитИзШапки)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок
	|ИТОГИ ПО
	|	Шаблон,
	|	РеквизитИзШапки";
	Запрос.УстановитьПараметр("РеквизитИзШапки", ИзШапки);
	Запрос.УстановитьПараметр("ВсеДФ", ИзШапки = Неопределено);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаШаблон = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаШаблон.Следующий() Цикл	
		ВыборкаТип = ВыборкаШаблон.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаТип.Следующий() Цикл
			ВыборкаДетальныеЗаписи = ВыборкаТип.Выбрать();		
			
			ТекПорядок = 1;
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				МенеджерЗаписи = РегистрыСведений.ДатаМобайл_СвязиДополнительныхФормИШаблонов.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(МенеджерЗаписи,ВыборкаДетальныеЗаписи);
				МенеджерЗаписи.Прочитать();
				МенеджерЗаписи.Порядок = ТекПорядок;			
				МенеджерЗаписи.Записать(Истина);
				
				ТекПорядок = ТекПорядок + 1;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры
Функция ПолучитьНомерУдаляемогоШага(ДополнительныйШаг) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ДатаМобайл_СвязиДополнительныхФормИШаблонов.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи,ДополнительныйШаг);
	МенеджерЗаписи.Прочитать();
	Возврат МенеджерЗаписи.Порядок;
	
КонецФункции
Процедура ИзменитьПорядок(ДополнительныйШаг, Позже = Ложь)  Экспорт 
	
	МенеджерЗаписи = РегистрыСведений.ДатаМобайл_СвязиДополнительныхФормИШаблонов.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ДополнительныйШаг);
	МенеджерЗаписи.Прочитать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДатаМобайл_СвязиДополнительныхФормИШаблонов.Шаблон КАК Шаблон,
	|	ДатаМобайл_СвязиДополнительныхФормИШаблонов.ДополнительнаяФорма КАК ДополнительнаяФорма,
	|	ДатаМобайл_СвязиДополнительныхФормИШаблонов.Порядок КАК Порядок,
	|	ДатаМобайл_СвязиДополнительныхФормИШаблонов.РеквизитИзШапки КАК РеквизитИзШапки,
	|	ДатаМобайл_СвязиДополнительныхФормИШаблонов.ПодборРазмещение КАК ПодборРазмещение,
	|	ДатаМобайл_СвязиДополнительныхФормИШаблонов.ЗаполняемыйРеквизит КАК ЗаполняемыйРеквизит,
	|	ДатаМобайл_СвязиДополнительныхФормИШаблонов.ПроверятьЗаполнение КАК ПроверятьЗаполнение,
	|	ДатаМобайл_СвязиДополнительныхФормИШаблонов.ИспользоватьВПоискеСтрок КАК ИспользоватьВПоискеСтрок
	|ИЗ
	|	РегистрСведений.ДатаМобайл_СвязиДополнительныхФормИШаблонов КАК ДатаМобайл_СвязиДополнительныхФормИШаблонов
	|ГДЕ
	|	ДатаМобайл_СвязиДополнительныхФормИШаблонов.Порядок = &ПорядковыйНомер
	|	И ДатаМобайл_СвязиДополнительныхФормИШаблонов.Шаблон = &Шаблон
	|	И ДатаМобайл_СвязиДополнительныхФормИШаблонов.РеквизитИзШапки = &РеквизитИзШапки";
	
	Запрос.УстановитьПараметр("ПорядковыйНомер", ?(Позже, МенеджерЗаписи.Порядок + 1, МенеджерЗаписи.Порядок - 1));
	Запрос.УстановитьПараметр("Шаблон", МенеджерЗаписи.Шаблон);
	Запрос.УстановитьПараметр("РеквизитИзШапки", МенеджерЗаписи.РеквизитИзШапки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выб = РезультатЗапроса.Выбрать();
	
	Если Выб.Следующий() Тогда
		МенеджерВторойЗаписи = РегистрыСведений.ДатаМобайл_СвязиДополнительныхФормИШаблонов.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерВторойЗаписи,Выб);
		МенеджерВторойЗаписи.Прочитать();
		
		МенеджерВторойЗаписи.Порядок = МенеджерЗаписи.Порядок;
		МенеджерЗаписи.Порядок = ?(Позже, МенеджерЗаписи.Порядок + 1, МенеджерЗаписи.Порядок - 1);
		МенеджерЗаписи.Записать(Истина);
		МенеджерВторойЗаписи.Записать(Истина);
	КонецЕсли;
	
КонецПроцедуры
Функция ПолучитьДатуИзСтрокиПоФормату(ДатаСтрокой, Шаблон) Экспорт 
	
	ТекущаяМаска = "DD.MM.YYYY";
	ПараметрДня = ПолучитьМестоИколичествоСимволовПараметраДаты("D", ТекущаяМаска);
	ПараметрМесяца = ПолучитьМестоИколичествоСимволовПараметраДаты("M", ТекущаяМаска);
	ПараметрГода = ПолучитьМестоИколичествоСимволовПараметраДаты("Y", ТекущаяМаска);
	День = Сред(ДатаСтрокой,ПараметрДня.Начало, ПараметрДня.Количество); 
	Месяц = Сред(ДатаСтрокой,ПараметрМесяца.Начало, ПараметрМесяца.Количество); 
	Год = ?(ПараметрГода.Количество = 2, "20", "") + Сред(ДатаСтрокой,ПараметрГода.Начало, ПараметрГода.Количество);
	
	Если СтрДлина(Год) = 2 Тогда
		Год = "20" + Год;	
	КонецЕсли;
	
	Попытка
		ФорматированнаяДата = Дата(Число(Год), Число(Месяц), Число(День));
		Возврат ФорматированнаяДата;
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции
Функция ПолучитьМестоИколичествоСимволовПараметраДаты(Символ, Маска)
	
	МаскаИзменение = Маска;
	КоличествоСимволов = 0;
	ПараметрВремени = Новый Структура;
	ПараметрВремени.Вставить("Начало", 0);
	ПараметрВремени.Вставить("Количество", КоличествоСимволов);
	
	Пока Не СтрНайти(МаскаИзменение,Символ) = 0 Цикл
		КоличествоСимволов = КоличествоСимволов + 1;
		Если КоличествоСимволов = 1 Тогда
			ПараметрВремени.Вставить("Начало", СтрНайти(МаскаИзменение, Символ));
		КонецЕсли;
		ПараметрВремени.Вставить("Количество",КоличествоСимволов);
		МаскаИзменение = Сред(МаскаИзменение, СтрНайти(МаскаИзменение, Символ) + 1);
	КонецЦикла;
	
	Возврат ПараметрВремени;
	
КонецФункции
Процедура ОчиститьЗаписиЗначенийДополнительныхФорм(ДокументТСД) Экспорт
	
	СтруктураОтбора = Новый Структура("Документ", ДокументТСД);
	
	ВыборкаЗаписейСтрок = РегистрыСведений.ДатаМобайл_ЗначенияДополнительныхФорм.Выбрать(СтруктураОтбора);
	Пока ВыборкаЗаписейСтрок.Следующий() Цикл
		ВыборкаЗаписейСтрок.ПолучитьМенеджерЗаписи().Удалить();
	КонецЦикла;	
	
КонецПроцедуры
Процедура УдалитьЗначениеФормыПоСтроке(ДокументТСД, ИдентификаторСтроки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДатаМобайл_ЗначенияДополнительныхФорм.Документ КАК Документ,
	|	ДатаМобайл_ЗначенияДополнительныхФорм.Номенклатура КАК Номенклатура,
	|	ДатаМобайл_ЗначенияДополнительныхФорм.Характеристика КАК Характеристика,
	|	ДатаМобайл_ЗначенияДополнительныхФорм.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ДатаМобайл_ЗначенияДополнительныхФорм.ДополнительнаяФорма КАК ДополнительнаяФорма
	|ИЗ
	|	РегистрСведений.ДатаМобайл_ЗначенияДополнительныхФорм КАК ДатаМобайл_ЗначенияДополнительныхФорм
	|ГДЕ
	|	ДатаМобайл_ЗначенияДополнительныхФорм.Документ = &Документ
	|	И ДатаМобайл_ЗначенияДополнительныхФорм.ИдентификаторСтроки = &ИдентификаторСтроки";
	
	Запрос.УстановитьПараметр("Документ", ДокументТСД);
	Запрос.УстановитьПараметр("ИдентификаторСтроки", ИдентификаторСтроки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗначениеФормы = РегистрыСведений.ДатаМобайл_ЗначенияДополнительныхФорм.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(ЗначениеФормы, ВыборкаДетальныеЗаписи);
		ЗначениеФормы.Прочитать();
		ЗначениеФормы.Удалить();
	КонецЦикла;
	
КонецПроцедуры

// НАСТРОЙКИ
Функция НастройкиПолучить() Экспорт
	
	СтруктураНастройки = Новый Структура;
	СтруктураНастройки.Вставить("ИспользоватьЛогирование", Ложь);
	СтруктураНастройки.Вставить("КаталогХраненияЛогов", "C:\DM\");
	СтруктураНастройки.Вставить("ЛогированиеОчищатьЧерезДней", 0);
	СтруктураНастройки.Вставить("ЛогированиеСохранятьЗаписей", 0);
	СтруктураНастройки.Вставить("ДатаПоследнейОчисткиКаталогаЛогов", Дата(1,1,1));
	СтруктураНастройки.Вставить("ЕГАИС_ОПТ", Ложь);
	
	Хранилище = Константы.ДатаМобайл_Настройки.Получить().Получить();
	Попытка
		ЗаполнитьЗначенияСвойств(СтруктураНастройки, Хранилище); 
	Исключение КонецПопытки;
	
	Возврат СтруктураНастройки; 
	
КонецФункции
Функция НастройкиЗаписать(НастройкиЗначения) Экспорт 
	
	РезультатФункции = Истина;
	
	СтруктураНастройки = НастройкиПолучить();
	Попытка
		ЗаполнитьЗначенияСвойств(СтруктураНастройки, НастройкиЗначения);
		Сжатие = Новый СжатиеДанных(9);
		Хранилище = Новый ХранилищеЗначения(СтруктураНастройки, Сжатие);
		Константы.ДатаМобайл_Настройки.Установить(Хранилище);
	Исключение
		РезультатФункции = Ложь;
	КонецПопытки;	
	
	Возврат РезультатФункции;
	
КонецФункции
Процедура ОчисткаЛогов()
	
	СтруктураНастройки = НастройкиПолучить();
	ИспользоватьЛогирование = СтруктураНастройки.ИспользоватьЛогирование;	
	
	Если Не ИспользоватьЛогирование Тогда Возврат; КонецЕсли;
	
	КаталогХраненияЛогов = СтруктураНастройки.КаталогХраненияЛогов;
	
	ЛогированиеОчищатьЧерезДней = СтруктураНастройки.ЛогированиеОчищатьЧерезДней;
	ЛогированиеСохранятьЗаписей = СтруктураНастройки.ЛогированиеСохранятьЗаписей;
	
	ДатаПоследнейОчисткиКаталогаЛогов = СтруктураНастройки.ДатаПоследнейОчисткиКаталогаЛогов;
	
	// очищаем весь каталог
	ДнейПослеОчистки = (НачалоДня(ПолучитьТекущуюДату()) - ДатаПоследнейОчисткиКаталогаЛогов) / 86400;
	Если Не ЛогированиеОчищатьЧерезДней = 0 И ДнейПослеОчистки > ЛогированиеОчищатьЧерезДней Тогда
		ПолнаяОчисткаКаталога(КаталогХраненияЛогов);
	КонецЕсли; 
	
	// сохарняем последние записи
	Если Не ЛогированиеСохранятьЗаписей = 0 Тогда
		СохранениеПоследнихЗаписей(КаталогХраненияЛогов, ЛогированиеСохранятьЗаписей);
	КонецЕсли;
	
КонецПроцедуры
Процедура ПолнаяОчисткаКаталога(ИмяКаталога) 

	Попытка
		КаталогНаДиске = Новый Файл(ИмяКаталога);
		Если Не КаталогНаДиске.Существует() Тогда Возврат; КонецЕсли;
	
		УдалитьФайлы(ИмяКаталога, "*.log");
		НастройкиЗаписать(Новый Структура("ДатаПоследнейОчисткиКаталогаЛогов", НачалоДня(ПолучитьТекущуюДату())));	
	Исключение
		ЗаписьЖурналаРегистрации("ОчисткаКаталогаЛогов", УровеньЖурналаРегистрации.Ошибка,, ИмяКаталога, "Ошибка очистки каталога логов. " + ОписаниеОшибки()); 
	КонецПопытки;
	
КонецПроцедуры 
Процедура СохранениеПоследнихЗаписей(ИмяКаталога, КоличествоЗаписей)
	
	Попытка
		КаталогНаДиске = Новый Файл(ИмяКаталога);
		Если Не КаталогНаДиске.Существует() Тогда Возврат; КонецЕсли; 
		
		НайденныеФайлы = НайтиФайлы(ИмяКаталога, "*.log");
		Если НайденныеФайлы.Количество() <= КоличествоЗаписей Тогда Возврат; КонецЕсли;
		
		ТаблицаФайлов = Новый ТаблицаЗначений;
		ТаблицаФайлов.Колонки.Добавить("Файл", Новый ОписаниеТипов("Строка"));
		ТаблицаФайлов.Колонки.Добавить("ДатаИзм", Новый ОписаниеТипов("Дата"));
		
		Для каждого нФайл Из НайденныеФайлы Цикл
			ДобСтрока = ТаблицаФайлов.Добавить();
			ДобСтрока.Файл    = нФайл.ПолноеИмя;
			ДобСтрока.ДатаИзм = нФайл.ПолучитьВремяИзменения();
		КонецЦикла;
		
		ТаблицаФайлов.Сортировать("ДатаИзм Убыв"); 
		ЕстьОшибки = Ложь; 
		ТекстОшибки = "";
		
		Для чСтр = КоличествоЗаписей По ТаблицаФайлов.Количество() - 1 Цикл
			Попытка
				УдалитьФайлы(ТаблицаФайлов.Получить(чСтр).Файл);
			Исключение
				ЕстьОшибки = Истина;
				ТекстОшибки = "" + ТекстОшибки + ОписаниеОшибки() + Символы.ПС; 
			КонецПопытки;		
		КонецЦикла;
		
	Исключение
		ЕстьОшибки = Истина;
		ТекстОшибки = "" + ТекстОшибки + ОписаниеОшибки() + Символы.ПС; 
	КонецПопытки;
	Если ЕстьОшибки Тогда
		ЗаписьЖурналаРегистрации("ОчисткаКаталогаЛогов", УровеньЖурналаРегистрации.Ошибка,, ИмяКаталога, "Ошибка сохранения последних n записей логов. " + СокрЛП(ТекстОшибки)); 
	КонецЕсли;
	
КонецПроцедуры

// Индикация кнопки обновления
Функция СформироватьHTTPЗапросКЯндексДиску(ПолучитьИнформациюОФайле = Ложь) Экспорт
	
	СсылкаКФайлу = "/v1/disk/public/resources/download?public_key=https://disk.yandex.ru/d/pc1gUd45_du3WQ&path=%2FDM_Windows_Android/1C/Online/UT11_KA2_ERP_UT3/UT11_KA2_ERP(Rus)_UT3.2(UkrKz).cf";
	Если ПолучитьИнформациюОФайле Тогда
		СсылкаКФайлу = СтрЗаменить(СсылкаКФайлу, "download", "");	
	КонецЕсли; 
	
	SSL = Новый ЗащищенноеСоединениеOpenSSL();
	Яндекс = Новый HTTPСоединение("cloud-api.yandex.net",,,,,, SSL);
	HTTPЗапрос = Новый HTTPЗапрос(СсылкаКФайлу);	
	Ответ = Яндекс.Получить(HTTPЗапрос);                                               
	Если Ответ.КодСостояния = 200 Тогда		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
		СсылкаНаСкачиваниеФайла = ПрочитатьJSON(ЧтениеJSON);
		
		Если ПолучитьИнформациюОФайле Тогда
			Возврат Лев(СсылкаНаСкачиваниеФайла.modified, 10);	
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(СсылкаНаСкачиваниеФайла.href) Тогда
			
			Соединение = Новый HTTPСоединение(СтрЗаменить(СсылкаНаСкачиваниеФайла.href, "https://", ""),,,,,,
			Новый ЗащищенноеСоединениеOpenSSL()
			);
			
			Запрос = Новый HTTPЗапрос("");
			Результат = Соединение.Получить(Запрос);
			Если Результат.КодСостояния = 302 Тогда
				
				Возврат Результат.Заголовки.Получить("Location");
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#Область ФоноваяАвтообработка

Процедура АвтообработкаВФоне() 
	
	Автоудаление();	
	Автозагрузка();
	Автовыгрузка();
	
КонецПроцедуры

Процедура Автоудаление()                             
	
	МодульДлительныеОперации = ДатаМобайл_ОбщийМодуль.ОбщийМодуль("ДлительныеОперации");
	
	ИдентификаторЗадания = Новый УникальныйИдентификатор;
	
	Попытка
		ПараметрыВыполнения = МодульДлительныеОперации.ПараметрыВыполненияФункции(ИдентификаторЗадания);
	Исключение    
		ПараметрыВыполнения = МодульДлительныеОперации.ПараметрыВыполненияВФоне(ИдентификаторЗадания);
	КонецПопытки;
	
	ПараметрыВыполнения.ЗапуститьВФоне = Истина; 
	
	Результат = МодульДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, "РегистрыСведений.ДатаМобайл_ФоновыеЗадания.Автоудаление", 
	ИдентификаторЗадания);  
	
КонецПроцедуры

Процедура Автозагрузка()                             
	
	МодульДлительныеОперации = ДатаМобайл_ОбщийМодуль.ОбщийМодуль("ДлительныеОперации");
	
	ИдентификаторЗадания = Новый УникальныйИдентификатор;
	
	Попытка
		ПараметрыВыполнения = МодульДлительныеОперации.ПараметрыВыполненияФункции(ИдентификаторЗадания);
	Исключение    
		ПараметрыВыполнения = МодульДлительныеОперации.ПараметрыВыполненияВФоне(ИдентификаторЗадания);
	КонецПопытки;
       
	ПараметрыВыполнения.ЗапуститьВФоне = Истина; 
	
	Результат = МодульДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, "РегистрыСведений.ДатаМобайл_ФоновыеЗадания.Автозагрузка", 
	ИдентификаторЗадания);	  
	
КонецПроцедуры

Процедура Автовыгрузка()                             
	
	МодульДлительныеОперации = ДатаМобайл_ОбщийМодуль.ОбщийМодуль("ДлительныеОперации");
	
	ИдентификаторЗадания = Новый УникальныйИдентификатор;
	
	Попытка
		ПараметрыВыполнения = МодульДлительныеОперации.ПараметрыВыполненияФункции(ИдентификаторЗадания);
	Исключение    
		ПараметрыВыполнения = МодульДлительныеОперации.ПараметрыВыполненияВФоне(ИдентификаторЗадания);
	КонецПопытки;
       
	ПараметрыВыполнения.ЗапуститьВФоне = Истина; 
	
	Результат = МодульДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, "РегистрыСведений.ДатаМобайл_ФоновыеЗадания.Автовыгрузка", 
	ИдентификаторЗадания);	  
	
КонецПроцедуры

#КонецОбласти

#Область ЕГАИС_ОПТ 

Функция ЕстьЕГАИСОпт() Экспорт
	
	Попытка
		СтруктураНастройки = НастройкиПолучить();
		РезультатФункции = СтруктураНастройки.ЕГАИС_ОПТ;
	Исключение
		РезультатФункции = Ложь;
	КонецПопытки;
	
	Возврат РезультатФункции;
	
КонецФункции
Процедура ДатаМобайл_Автообработка_ЕГАИС_ОПТ()
	
	Если Не ЕстьЕГАИСОпт() Тогда
		Возврат;
	КонецЕсли;
	
	// АВТОЗАГРУЗКА ЕГАИС документы	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ДатаМобайл_ДокументыТСД.Ссылка КАК ДМСсылка,
	|	ДатаМобайл_ДокументыТСД.Шаблон.ПроводитьРоботом
	|ИЗ
	|	Справочник.ДатаМобайл_ДокументыТСД_ЕГАИС КАК ДатаМобайл_ДокументыТСД
	|ГДЕ
	|	ДатаМобайл_ДокументыТСД.ДатаЗавершенияСбора <> ДАТАВРЕМЯ(1, 1, 1)
	|	И ДатаМобайл_ДокументыТСД.Шаблон.ОбрабатыватьРоботом
	|	И ДатаМобайл_ДокументыТСД.ДатаЗавершения = ДАТАВРЕМЯ(1, 1, 1)");
	Рез = Запрос.Выполнить().Выбрать();
	
	Пока Рез.Следующий() Цикл
		Попытка
			СтрокаОшибок = "";
			
			Об = Рез.ДМссылка.ПолучитьОбъект();
			Об.ДатаПриемкиОператором = ТекущаяДата();
			Об.Записать();
			
			Док = Обработки.ДатаМобайл_АРМДиспетчера.ВнестиДокументВБазу_ЕГАИС(Об,СтрокаОшибок);
			
			Если Док = Неопределено тогда
			Иначе	
				Если Об.Шаблон.ПроводитьРоботом тогда
					ДокОбъект = Док.ПолучитьОбъект();
					ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли;	
			КонецЕсли;
		Исключение
			ИмяСобытия = НСтр("ru = 'Документ DataMobile ЕГАИС'");
			
			ТекстСообщения = НСтр("ru = 'Не удалось загрузить документ DataMobile ЕГАИС: %Справочник% по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Справочник%", Рез.ДМссылка);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())+" "+СтрокаОшибок);
			ЗаписьЖурналаРегистрации(ИмяСобытия,
			УровеньЖурналаРегистрации.Ошибка,
			Справочники.ДатаМобайл_ДокументыТСД_ЕГАИС,
			Рез.ДМссылка,
			ТекстСообщения);
		КонецПопытки;
	КонецЦикла;
	
	// АВТОВЫГРУЗКА ЕГАИС документы
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ДатаМобайл_ДокументыТСД.Ссылка КАК ДМСсылка,
	|	ДатаМобайл_ДокументыТСД.Шаблон.ПроводитьРоботом
	|ИЗ
	|	Справочник.ДатаМобайл_ДокументыТСД_ЕГАИС КАК ДатаМобайл_ДокументыТСД
	|ГДЕ
	|	ДатаМобайл_ДокументыТСД.ДатаЗавершенияСбора <> ДАТАВРЕМЯ(1, 1, 1)
	|	И ДатаМобайл_ДокументыТСД.Шаблон.ОбрабатыватьРоботом
	|	И ДатаМобайл_ДокументыТСД.ДатаЗавершения = ДАТАВРЕМЯ(1, 1, 1)");
	Рез = Запрос.Выполнить().Выбрать();
	
	Пока Рез.Следующий() Цикл
		Об = Рез.ДМссылка.ПолучитьОбъект();
		Об.ДатаПриемкиОператором = ТекущаяДата();
		Об.Записать();
		СтрокаОшибок = "";
		Док = Обработки.ДатаМобайл_АРМДиспетчера.ВнестиДокументВБазу_ЕГАИС(Об, СтрокаОшибок);	
	КонецЦикла;
	
	ЗапросНужныхШаблонов = Новый Запрос("ВЫБРАТЬ
	|	ДатаМобайл_ШаблоныДокументов.УсловиеВыгрузки,
	|	ДатаМобайл_ШаблоныДокументов.ВидДокумента,
	|	ДатаМобайл_ШаблоныДокументов.Ссылка,
	|	ДатаМобайл_ШаблоныДокументов.УдалениеСтарыхДокументов КАК УдалениеСтарыхДокументов,
	|	ДатаМобайл_ШаблоныДокументов.ВыгружатьТолькоПроведенныеДокументы КАК ВыгружатьТолькоПроведенныеДокументы
	|ИЗ
	|	Справочник.ДатаМобайл_ШаблоныДокументов_ЕГАИС КАК ДатаМобайл_ШаблоныДокументов
	|ГДЕ
	|	ДатаМобайл_ШаблоныДокументов.ВыгружатьРоботом");
	Шаблоны = ЗапросНужныхШаблонов.Выполнить().Выгрузить();
	
	Для каждого Шаблон Из Шаблоны Цикл
		ТекстЗапросаПоДокументам = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Документ1С.Ссылка КАК ИсходныйДокумент,
		|	Документ1С.Дата КАК Дата,
		|	Документ1С.Номер КАК Номер,
		|	Документ1С.Комментарий КАК Комментарий
		|ИЗ
		|	Документ.ПриобретениеТоваровУслуг КАК Документ1С
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДатаМобайл_ДокументыТСД_ЕГАИС КАК ДатаМобайл_ДокументыТСД
		|		ПО Документ1С.Ссылка = ДатаМобайл_ДокументыТСД.ИсходныйДокумент
		|ГДЕ
		|	НЕ Документ1С.ПометкаУдаления
		|   И 1=1
		|   И 2=2
		|	И &УсловиеВключения
		|	И ДатаМобайл_ДокументыТСД.Ссылка ЕСТЬ NULL ";
		
		ТекстЗапросаПоДокументам = СтрЗаменить(ТекстЗапросаПоДокументам,"ПриобретениеТоваровУслуг", Шаблон.ВидДокумента);
		ТекстЗапросаПоДокументам = СтрЗаменить(ТекстЗапросаПоДокументам,"&УсловиеВключения", ?(СокрЛП(Шаблон.УсловиеВыгрузки) = "", "1=1", Шаблон.УсловиеВыгрузки));
		
		Если Шаблон.ВыгружатьТолькоПроведенныеДокументы Тогда
			ТекстЗапросаПоДокументам = СтрЗаменить(ТекстЗапросаПоДокументам, "1=1", "Документ1С.Проведен");	
		КонецЕсли; 
		
		ЗапросДокументов = Новый Запрос(); 
		
		Если Шаблон.УдалениеСтарыхДокументов <> 0 Тогда
			ТекстЗапросаПоДокументам = СтрЗаменить(ТекстЗапросаПоДокументам,"2=2", "Документ1С.Дата > &ДатаУдаления");
			ЗапросДокументов.УстановитьПараметр("ДатаУдаления",ТекущаяДата() - Шаблон.УдалениеСтарыхДокументов * 86400);				
		КонецЕсли;  
		
		ЗапросДокументов.УстановитьПараметр("Шаблон", Шаблон.Ссылка);
		
		Для каждого СтрПараметра Из Шаблон.Ссылка.ПараметрыУсловияВыгрузки Цикл
			ЗапросДокументов.УстановитьПараметр(СтрПараметра.ИмяПараметра, СтрПараметра.ЗначениеПараметра);
		КонецЦикла;	 
		
		ЗапросДокументов.Текст = ТекстЗапросаПоДокументам;
		СписокДоков = ЗапросДокументов.Выполнить().Выбрать();
		
		Пока СписокДоков.Следующий() Цикл
			ДокТСД = Справочники.ДатаМобайл_ДокументыТСД_ЕГАИС.СоздатьЭлемент();
			ЗаполнитьЗначенияСвойств(ДокТСД,СписокДоков);
			ДокТСД.Шаблон = Шаблон.Ссылка;
			ДокТСД.Записать();
		КонецЦикла;	
	КонецЦикла;
	
	// ФИКСАЦИЯ ПЛАН-ФАКТ ЕГАИС
	ЗапросПланФакт = Новый Запрос;
	ЗапросПланФакт.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 200
	|	ДокументыТСД.Ссылка,
	|	ДокументыТСД.ПланРавноФакт КАК ПланРавноФакт
	|ИЗ
	|	Справочник.ДатаМобайл_ДокументыТСД_ЕГАИС КАК ДокументыТСД
	|ГДЕ
	|	НЕ ДокументыТСД.ПометкаУдаления
	|	И ДокументыТСД.ДатаЗавершения = ДАТАВРЕМЯ(1, 1, 1)
	|	И НЕ ДокументыТСД.ДатаЗавершенияСбора = ДАТАВРЕМЯ(1, 1, 1)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДокументыТСД.ДатаЗавершенияСбора УБЫВ";
	
	ВыборкаПланФакт = ЗапросПланФакт.Выполнить().Выбрать();
	
	Пока ВыборкаПланФакт.Следующий() Цикл
		ПланРавноФакт = ПланРавноФактЕГАИС(ВыборкаПланФакт.Ссылка); 
		
		Если Не ПланРавноФакт = ВыборкаПланФакт.ПланРавноФакт Тогда
			докОб = ВыборкаПланФакт.Ссылка.ПолучитьОбъект();
			докОб.ПланРавноФакт = ПланРавноФакт;
			
			Попытка
				докОб.Записать();
			Исключение КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
Функция ПолучитьКодУпаковкиРАР(УзелПО, ТипУпаковки, ПроверятьИспользованные = Ложь) Экспорт
	
	НовыйКодУпаковкиРАР = ЗаписатьНовыйКодУпаковкиРАР(УзелПО, ТипУпаковки, ПроверятьИспользованные);		
	Возврат НовыйКодУпаковкиРАР;
	
КонецФункции
Функция ЗаписатьНовыйКодУпаковкиРАР(УзелПО, ТипУпаковки, ПроверятьИспользованные) 
	
	Если Не ЗначениеЗаполнено(ТипУпаковки) Тогда
		Возврат Неопределено;
	Иначе
		ТекущийТипУпаковки = ТипУпаковки; //ТипУпаковки 1-короб, 2 - палета
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(УзелПО.Организация) Тогда
		Возврат Неопределено;
	Иначе
		// Получим код организации РАР
		ЗапросКодЕГАИС = Новый Запрос;
		ЗапросКодЕГАИС.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЕстьNull(алкКодыОбъектовАИС.ЗначениеРеквизитаАИС,"""") КАК ЗначениеРеквизитаАИС
		|ИЗ
		|	РегистрСведений.алкКодыОбъектовАИС КАК алкКодыОбъектовАИС
		|ГДЕ
		//|	алкКодыОбъектовАИС.Объект = &Ссылка
		|	алкКодыОбъектовАИС.Объект.Владелец = &Ссылка
		|	И алкКодыОбъектовАИС.РеквизитАИС = ЗНАЧЕНИЕ(ПланВидовХарактеристик.алкРеквизитыОбъектовАИС.КодЕГАИС)";
		ЗапросКодЕГАИС.УстановитьПараметр("Ссылка",УзелПО.Организация);
		РезультатЗапроса = ЗапросКодЕГАИС.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			ТекущийИдентификаторОрганизации = Выборка.ЗначениеРеквизитаАИС;
			
			Если СтрДлина(ТекущийИдентификаторОрганизации) <> 12 Тогда    
				Возврат Неопределено;
			КонецЕсли;
		Иначе    
			Сообщить("В регистре сведений ""Коды объектов АИС"" не обнаружено записи с заполненным в поле объект ссылкой на карточку организации!");
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(УзелПО.ЛинияРозливаЕГАИС) Тогда
		Возврат Неопределено;
	Иначе
		ТекущаяЛинияРозлива = УзелПО.ЛинияРозливаЕГАИС;
	КонецЕсли;
	
	Если ПроверятьИспользованные тогда
		ПоследнийКодУпаковкиРАР = Неопределено;
		Если ПроверкаНеИспользуетсяПоследнийКодУпаковкиРАР(ТекущийТипУпаковки,ТекущийИдентификаторОрганизации,ТекущаяЛинияРозлива, ПоследнийКодУпаковкиРАР) Тогда
			Возврат ПоследнийКодУпаковкиРАР.КодУпаковки;
		КонецЕсли;
	КонецЕсли;
	
	НачатьТранзакцию();
	НовыйКодУпаковки = ПолучитьНовыйКодУпаковкиРАР(ТекущийТипУпаковки,ТекущийИдентификаторОрганизации,ТекущаяЛинияРозлива);
	
	Если НовыйКодУпаковки  = Неопределено Тогда	
		ОтменитьТранзакцию();
		Возврат Неопределено;
	КонецЕсли; 
	
	НоваяЗаписьРегистра = РегистрыСведений.ДатаМобайл_КодыУпаковок_ЕГАИС.СоздатьМенеджерЗаписи();
	НоваяЗаписьРегистра.ИдентификаторОрганизации = ТекущийИдентификаторОрганизации;
	НоваяЗаписьРегистра.ТипУпаковки = ТекущийТипУпаковки;
	НоваяЗаписьРегистра.ЛинияРозлива = ТекущаяЛинияРозлива;
	НоваяЗаписьРегистра.Счетчик = НовыйКодУпаковки.Счетчик;
	НоваяЗаписьРегистра.Дата = ТекущаяДата();
	НоваяЗаписьРегистра.ТСД = УзелПО;
	НоваяЗаписьРегистра.КодУпаковки = НовыйКодУпаковки.КодУпаковки;
	НоваяЗаписьРегистра.Активность = Истина;
	
	Попытка
		НоваяЗаписьРегистра.Записать();
	Исключение
		ОтменитьТранзакцию();
		Возврат Неопределено;
	КонецПопытки; 
	
	ЗафиксироватьТранзакцию();
	
	Возврат НовыйКодУпаковки.КодУпаковки;
	
КонецФункции 
Функция ПолучитьНовыйКодУпаковкиРАР(ТекущийТипУпаковки,ТекущийИдентификаторОрганизации,ТекущаяЛинияРозлива, ПолучитьНовый = Истина) 
	
	//Штриховой код формата Code-128.  26 символов.
	//
	//Где:
	// 010039994654 – идентификатор организации в ЕГАИС, осуществляющей маркировку групповой тары (FSRAR_ID). (12 знаков) 
	// 1 – тип логистической единицы (1- короб, 2- паллет, 3-сборный короб, 4-сборный паллет). (1 знак)
	// 01 – номер линии розлива. (2 знака). Номер должен настраиваться на каждом устройстве, генерирующем код. 
	// 18 – год, в который производится генерация групповой маркировки. (2 знака) 
	// 000000001 – логистический идентификатор, счетчик, обнуляемый в начале каждого года. (9 знаков).
	
	ЧислНовыйНомер = МаксимальныйКодУпаковки(ТекущийТипУпаковки,ТекущийИдентификаторОрганизации,ТекущаяЛинияРозлива) + ?(ПолучитьНовый, 1, 0);
	Если ЧислНовыйНомер < 1 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		ЧислТекущийТипУпаковки = Число(ТекущийТипУпаковки);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	Попытка
		ЧислТекущаяЛинияРозлива = Число(ТекущаяЛинияРозлива);
	Исключение
		Возврат Неопределено;
	КонецПопытки; 
	
	СтрТекущийТипУпаковки = Формат(ЧислТекущийТипУпаковки,"ЧЦ=1; ЧДЦ=; ЧВН=; ЧГ=0");
	СтрТекущаяЛинияРозлива = Формат(ЧислТекущаяЛинияРозлива,"ЧЦ=2; ЧДЦ=; ЧВН=; ЧГ=0");
	СтрГод = Формат(ТекущаяДата(),"ДФ=гг");
	СтрНовыйНомер = Формат(ЧислНовыйНомер,"ЧЦ=9; ЧДЦ=; ЧВН=; ЧГ=0");
	
	Результат = Новый Структура("Счетчик,КодУпаковки");
	Результат.Счетчик = ЧислНовыйНомер;
	Результат.КодУпаковки = "" + ТекущийИдентификаторОрганизации + СтрТекущийТипУпаковки + СтрТекущаяЛинияРозлива + СтрГод + СтрНовыйНомер;
	
	Возврат Результат; 
	
КонецФункции
Функция МаксимальныйКодУпаковки(ТекущийТипУпаковки,ТекущийИдентификаторОрганизации,ТекущаяЛинияРозлива) 
	
	Запрос = Новый Запрос;	
	ТекстЗапроса = "ВЫБРАТЬ   
	| ЕстьNULL(Максимум(КодыУпаковок.Счетчик),0) Как ID
	|ИЗ
	| РегистрСведений.ДатаМобайл_КодыУпаковок_ЕГАИС Как КодыУпаковок
	|ГДЕ
	| КодыУпаковок.ИдентификаторОрганизации = &ТекущийИдентификаторОрганизации
	| И КодыУпаковок.ТипУпаковки = &ТекущийТипУпаковки
	| И КодыУпаковок.ЛинияРозлива = &ТекущаяЛинияРозлива
	| И КодыУпаковок.Дата МЕЖДУ &НачалоГода и &КонецГода
	|";
	
	Запрос.УстановитьПараметр("ТекущийИдентификаторОрганизации", ТекущийИдентификаторОрганизации);
	Запрос.УстановитьПараметр("ТекущийТипУпаковки",  ТекущийТипУпаковки);
	Запрос.УстановитьПараметр("ТекущаяЛинияРозлива", ТекущаяЛинияРозлива);
	
	Запрос.УстановитьПараметр("НачалоГода", НачалоГода(ТекущаяДата()));
	Запрос.УстановитьПараметр("КонецГода",  КонецГода(ТекущаяДата()));
	
	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат  0;
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.ID;
	КонецЕсли; 	
	
КонецФункции
Функция ПроверкаНеИспользуетсяПоследнийКодУпаковкиРАР(ТекущийТипУпаковки, ТекущийИдентификаторОрганизации, ТекущаяЛинияРозлива, ПоследнийСгенерированныйКод)
	
	ПоследнийСгенерированныйКод = ПолучитьНовыйКодУпаковкиРАР(ТекущийТипУпаковки, ТекущийИдентификаторОрганизации, ТекущаяЛинияРозлива, Ложь);
	
	//++ Романов 09012020
	Если ПоследнийСгенерированныйКод = Неопределено тогда
		Возврат Ложь;
	КонецЕсли;
	//--
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ДатаМобайл_ДокументыТСД_ЕГАИССобранныеДанныеПодбор.УпаковочныйЛист
	|ИЗ
	|	Справочник.ДатаМобайл_ДокументыТСД_ЕГАИС.СобранныеДанныеПодбор КАК ДатаМобайл_ДокументыТСД_ЕГАИССобранныеДанныеПодбор
	|ГДЕ
	|	ДатаМобайл_ДокументыТСД_ЕГАИССобранныеДанныеПодбор.УпаковочныйЛист = &УпаковочныйЛист");
	Запрос.УстановитьПараметр("УпаковочныйЛист", ПоследнийСгенерированныйКод.КодУпаковки);
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Количество() = 0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции // ()
Функция ПечатьУпаковкиРАР(НастройкаПечати, КаталогСохранения, АдресПринтсервера, ПортПринтсервера, ОнлайнСвязьСПринтсервером, КодУпаковки, ВводУпакЛистов, ТЗДанныхПечати) Экспорт
	
	//--------------------------------------------------------------------------------------------------------------
	// Печать упаковки РАР
	//--------------------------------------------------------------------------------------------------------------
	
	ТипУпаковки = ВводУпакЛистов;
	
	//ТипУпаковки - 1 - короб, 2 - палета
	ТипУпаковки = ?(ТипУпаковки = 3,1,ТипУпаковки);
	ТипУпаковки = ?(ТипУпаковки = 4,2,ТипУпаковки);
	ТипУпаковки = ?(ТипУпаковки = 5,1,ТипУпаковки);
	ТипУпаковки = ?(ТипУпаковки = 6,2,ТипУпаковки);
	
	Если НастройкаПечати<>Неопределено Тогда
		
		
		Если КодУпаковки = Неопределено Тогда
			Сообщить("Не удалось сформировать код упаковки");
			Возврат ЛОЖЬ;
		КонецЕсли;
		
		ЗаписьXML = Новый ЗаписьXML;
		
		Если НЕ ОнлайнСвязьСПринтсервером Тогда
			ИмяФайла = ПолучитьНовоеИмяФайла();	
			Попытка
				ЗаписьXML.ОткрытьФайл(КаталогСохранения+ИмяФайла+".xml", "UTF-8");
			Исключение
				Сообщить("Не удалось сохранить файл печати в каталоге: " + КаталогСохранения + " по причине: " + ОписаниеОшибки());	
			КонецПопытки;
		Иначе
			ЗаписьXML.УстановитьСтроку("UTF-8");
		КонецЕсли;	
		
		ЗаписьXML.ЗаписатьОбъявлениеXML();	
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("PrintData");
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("PrinterName");
		ЗаписьXML.ЗаписатьТекст(НастройкаПечати.ИмяПринтера);
		ЗаписьXML.ЗаписатьКонецЭлемента();		
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("TemplateName");
		ЗаписьXML.ЗаписатьТекст(НастройкаПечати.ИмяШаблона);
		ЗаписьXML.ЗаписатьКонецЭлемента();		
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Count");
		ЗаписьXML.ЗаписатьТекст(ЧистаяСтрока(Формат(?(НастройкаПечати.КоличествоКопий = 0,1,НастройкаПечати.КоличествоКопий),"ЧГ = ")));
		ЗаписьXML.ЗаписатьКонецЭлемента();	
		
		
		ТекущееНазваниеТовара = "";
		ТекущаяДатаРозлива = "";
		ТекущаяЕмкость = "";
		ТекущееКоличество = "";
		ТекущийНомерПартии = "";
		ТекущийEANКороба = "";
		
		Если ТЗДанныхПечати.Количество() > 0 И ТипУпаковки = 1 Тогда
			Если не ТЗДанныхПечати[0].Номенклатура.Пустая() Тогда
				ТекущееНазваниеТовара = "" + Лев(ТЗДанныхПечати[0].Номенклатура.Наименование, 150);
				ТекущаяЕмкость = "" + ТЗДанныхПечати[0].Номенклатура.алкЕмкость + " л.";
			КонецЕсли;
			
			Если ТЗДанныхПечати[0].Штрихкод <> "" Тогда
				ТекущийEANКороба = ТЗДанныхПечати[0].Штрихкод;
				КоэффициентКороба = ПолучитьКоэффициентУпаковки(ТЗДанныхПечати[0].Штрихкод);
				
				Если КоэффициентКороба <> 0 Тогда
					ТекущееКоличество = "" + КоэффициентКороба + " шт.";
				КонецЕсли;
			КонецЕсли;
			
			Если Не ТЗДанныхПечати[0].СерияСсылка.Пустая() Тогда
				ТекущаяДатаРозлива = "" + Формат(ТЗДанныхПечати[0].СерияСсылка.алкДатаНачалаРозлива,"ДФ=dd.MM.yyyy"); //из серии
				//ТекущийНомерПартии = "" + ТЗДанныхПечати[0].СерияСсылка.СерийныйНомер; //из серии
				ТекущийНомерПартии = "" + ТЗДанныхПечати[0].СерияСсылка.Наименование; //из серии 
			КонецЕсли;
		КонецЕсли;
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Head");
		
		//--- Название товара
		СтрЗначение = ТекущееНазваниеТовара;
		ЗаписьXML.ЗаписатьНачалоЭлемента("ArtName");
		ЗаписьXML.ЗаписатьТекст(СтрЗначение);
		ЗаписьXML.ЗаписатьКонецЭлемента();	
		
		//--- КодУпаковки
		СтрЗначение = КодУпаковки;
		ЗаписьXML.ЗаписатьНачалоЭлемента("UPL");
		ЗаписьXML.ЗаписатьТекст(СтрЗначение);
		ЗаписьXML.ЗаписатьКонецЭлемента();				
		
		//--- ДатаРозлива
		СтрЗначение = ТекущаяДатаРозлива;
		ЗаписьXML.ЗаписатьНачалоЭлемента("DateBottling");
		ЗаписьXML.ЗаписатьТекст(СтрЗначение);
		ЗаписьXML.ЗаписатьКонецЭлемента();	
		
		//--- Емкость
		СтрЗначение = ТекущаяЕмкость;
		ЗаписьXML.ЗаписатьНачалоЭлемента("Size");
		ЗаписьXML.ЗаписатьТекст(СтрЗначение);
		ЗаписьXML.ЗаписатьКонецЭлемента();	
		
		//--- Количество штук
		СтрЗначение = ТекущееКоличество;
		ЗаписьXML.ЗаписатьНачалоЭлемента("BoxQty");
		ЗаписьXML.ЗаписатьТекст(СтрЗначение);
		ЗаписьXML.ЗаписатьКонецЭлемента();	
		
		//--- Номерпартии
		СтрЗначение = ТекущийНомерПартии;
		ЗаписьXML.ЗаписатьНачалоЭлемента("Part");
		ЗаписьXML.ЗаписатьТекст(СтрЗначение);
		ЗаписьXML.ЗаписатьКонецЭлемента();	
		
		//--- EAN короба
		СтрЗначение = ТекущийEANКороба;
		ЗаписьXML.ЗаписатьНачалоЭлемента("BoxEAN");
		ЗаписьXML.ЗаписатьТекст(СтрЗначение);
		ЗаписьXML.ЗаписатьКонецЭлемента();	
		
		ЗаписьXML.ЗаписатьКонецЭлемента();//Head
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Detail");
		ЗаписьXML.ЗаписатьНачалоЭлемента("Item");
		ЗаписьXML.ЗаписатьКонецЭлемента();//Item
		ЗаписьXML.ЗаписатьКонецЭлемента();//Detail
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Footer");
		Год = Строка(Формат(Год(ТекущаяДата()),"ЧГ="));
		Месяц = Строка(Месяц(ТекущаяДата()));
		День = Строка(День(ТекущаяДата()));
		ДатаСтрока = Год + Строка(Месяц) + Строка(День);
		ЗаписьXML.ЗаписатьНачалоЭлемента("Date");	
		ЗаписьXML.ЗаписатьТекст(ЧистаяСтрока(Год + Месяц + День));
		ЗаписьXML.ЗаписатьКонецЭлемента();//Date
		ЗаписьXML.ЗаписатьКонецЭлемента();//Footer
		
		ЗаписьXML.ЗаписатьКонецЭлемента();//PrintData
		
		Если Не ОнлайнСвязьСПринтсервером Тогда
			ЗаписьXML.Закрыть();
			Сообщить("Данные отправлены на печать");
		Иначе
			СтрокаДляЗапроса = ЗаписьXML.Закрыть();
			ЕстьОшибка = Ложь;
			ОтправитьДанныеНаПринтсервер(АдресПринтсервера, ПортПринтсервера, СтрокаДляЗапроса, ЕстьОшибка);
			
			Если ЕстьОшибка Тогда
				Возврат Ложь;
			Иначе
				Сообщить("Данные отправлены на печать");
			КонецЕсли;	
		КонецЕсли;		
	Иначе
		Возврат Ложь;
	КонецЕсли;	
	
	Возврат Истина;
	
КонецФункции // ()
Процедура ОтправитьДанныеНаПринтсервер(АдресПринтсервера, ПортПринтсервера, СтрокаДляЗапроса, ЕстьОшибка);
	
	Соединение = Новый HTTPСоединение(АдресПринтсервера,ПортПринтсервера,,,,1,);
	
	РесурсНаСервере = "/printFile/";
	HTTPЗапрос = Новый HTTPЗапрос(РесурсНаСервере);
	HTTPЗапрос.Заголовки.Вставить("Content-type", "application/xml");
	HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаДляЗапроса, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	
	ЕстьОшибка = Ложь;
	
	Попытка 
		Результат = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
	Исключение
		ЕстьОшибка = Истина;
		//ТекстОшибки = ОписаниеОшибки();	
		ТекстОшибки = "SendArtToPrint. Ошибка онлайн соединения c сервером печати, проверьте настройки.";
	КонецПопытки;
	
	Соединение = Неопределено;
	
	Если ЕстьОшибка тогда
		Сообщить(ТекстОшибки);
	Иначе
		ТекстСообщения  = "" + Результат.КодСостояния +  " " + Результат.ПолучитьТелоКакСтроку();
		Если СтрНайти(Результат.ПолучитьТелоКакСтроку(),"File Uploaded") > 0 Тогда
			//Успешная отправка данных
		Иначе
			ЕстьОшибка = Истина;
			ТекстОшибки = "SendArtToPrint. Ошибка отправки данных на печать: " + ТекстСообщения + ", проверьте настройки.";
			Сообщить(ТекстОшибки);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
Функция ПолучитьНовоеИмяФайла(ПорядковыйНомер = 0)
	
	ИмяФайла = СтрЗаменить(ТекущаяДата(),":","");
	ИмяФайла = СтрЗаменить(ИмяФайла, ".","");
	ИмяФайла = СтрЗаменить(ИмяФайла, " ","");
	ИмяФайла = СтрЗаменить(ИмяФайла, "/","");
	ИмяФайла = СтрЗаменить(ИмяФайла, "\","");
	
	Генератор = Новый ГенераторСлучайныхЧисел(1);
	ИдентификаторФайла = Генератор.СлучайноеЧисло(1, 1000);
	
	ИмяФайла = ИмяФайла + ИдентификаторФайла + ПорядковыйНомер;
	
	Возврат ИмяФайла;
	
КонецФункции // ()
Функция ПолучитьКоэффициентУпаковки(BarcodeBox) Экспорт
	
	ТекущийКоэффициент = 0;
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	|	Штрихкоды.Упаковка.Числитель КАК Коэффициент
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.Штрихкод = &код");
	
	Запрос.УстановитьПараметр("Код",BarcodeBox);
	Рез = Запрос.Выполнить().Выгрузить();
	
	Если Рез.Количество() > 0 И BarcodeBox <> "" Тогда
		ТекущийКоэффициент = Рез[0].Коэффициент;
	КонецЕсли;
	
	Возврат ТекущийКоэффициент; 
	
КонецФункции
Функция ПолучитьСправкиПоСерии(Серия) Экспорт
	
	ДанныеСправок = Новый Структура("СправкаА,СправкаБ");
	ДанныеСправок.СправкаА = Справочники.алкКлассификаторСправокАиБ.ПустаяСсылка();
	ДанныеСправок.СправкаБ = Справочники.алкКлассификаторСправокАиБ.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Первые 1 
	|	СоответствиеСерийЕГАИС.СправкаА КАК СправкаА,
	|	СоответствиеСерийЕГАИС.СправкаБ КАК СправкаБ
	|ИЗ
	|	РегистрСведений.алкСоответствияСправокАиБЕГАИСИСерий КАК СоответствиеСерийЕГАИС
	|ГДЕ
	|	СоответствиеСерийЕГАИС.СерияНоменклатуры = &Серия";
	Запрос.УстановитьПараметр("Серия", Серия);
	
	Рез = Запрос.Выполнить().Выбрать();
	
	Пока Рез.Следующий() Цикл
		ДанныеСправок.СправкаА = Рез.СправкаА;
		ДанныеСправок.СправкаБ = Рез.СправкаБ;
	КонецЦикла;		
	
	Возврат  ДанныеСправок;
	
КонецФункции
Функция ПолучитьСериюПоСправкам(СправкаБ, ВсеСерииПоСправкеБ = Ложь) Экспорт
	
	СерияНоменклатурыВБазе = Справочники.СерииНоменклатуры.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	СоответствиеСерийЕГАИС.СерияНоменклатуры КАК Серия
	|ИЗ
	|	РегистрСведений.алкСоответствияСправокАиБЕГАИСИСерий КАК СоответствиеСерийЕГАИС
	|ГДЕ
	|	СоответствиеСерийЕГАИС.СправкаБ = &СправкаБ И НЕ СоответствиеСерийЕГАИС.СерияНоменклатуры ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("СправкаБ",СправкаБ);
	
	Если ВсеСерииПоСправкеБ Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВЫБРАТЬ ПЕРВЫЕ 1", "ВЫБРАТЬ");
		Возврат Запрос.Выполнить().Выгрузить();
	Иначе
		Рез = Запрос.Выполнить().Выбрать();
		
		Пока Рез.Следующий() Цикл
			СерияНоменклатурыВБазе = Рез.Серия;
		КонецЦикла;		
		
		Возврат  СерияНоменклатурыВБазе;
	КонецЕсли;
	
КонецФункции
Функция ПолучитьСвободнуюСериюПоСправкамFIFO(СправкаА,СправкаБ,Номенклатура,ДокументЕГАИС) Экспорт
	
	СерияНоменклатурыВБазе = Справочники.СерииНоменклатуры.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ 
	|	СоответствиеСерийЕГАИС.СерияНоменклатуры КАК Серия,
	|	ЕстьNULL(Сумма(ЕстьNULL(ОстаткиТоваров.ВНаличииОстаток,0)),0) КАК КоличествоОстаток
	|ИЗ
	|	РегистрСведений.алкСоответствияСправокАиБЕГАИСИСерий КАК СоответствиеСерийЕГАИС
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки КАК ОстаткиТоваров
	|		ПО ОстаткиТоваров.Серия = СоответствиеСерийЕГАИС.СерияНоменклатуры
	|		И  ОстаткиТоваров.Номенклатура = &Номенклатура 
	|		И  (ОстаткиТоваров.Склад = &Склад ИЛИ &ВсеСклады)
	|		
	|ГДЕ
	|	СоответствиеСерийЕГАИС.СправкаА = &СправкаА 
	|	И СоответствиеСерийЕГАИС.СправкаБ = &СправкаБ
	|
	|СГРУППИРОВАТЬ ПО
	|	СоответствиеСерийЕГАИС.СерияНоменклатуры	
	|	
	|ИМЕЮЩИЕ
	|	ЕстьNULL(Сумма(ЕстьNULL(ОстаткиТоваров.ВНаличииОстаток,0)),0)>0
	|
	|УПОРЯДОЧИТЬ ПО 
	|	СоответствиеСерийЕГАИС.СерияНоменклатуры.Наименование ВОЗР";
	
	
	Запрос.УстановитьПараметр("СправкаА", СправкаА);
	Запрос.УстановитьПараметр("СправкаБ", СправкаБ);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Склад", ДокументЕГАИС.Склад);
	
	Если ДокументЕГАИС.Склад.Пустая() Тогда
		Запрос.УстановитьПараметр("ВсеСклады", Истина);
	Иначе
		Запрос.УстановитьПараметр("ВсеСклады", Ложь);
	КонецЕсли;
	
	Рез = Запрос.Выполнить().Выбрать();
	
	Пока Рез.Следующий() Цикл
		СерияНоменклатурыВБазе = Рез.Серия;
		КоличествоВДокументе = 0;
		
		Для каждого стр из ДокументЕГАИС.Товары Цикл
			Если стр.Серия = СерияНоменклатурыВБазе Тогда
				КоличествоВДокументе = КоличествоВДокументе + стр.Количество;
			КонецЕсли;	
		КонецЦикла;	
		
		Если Рез.КоличествоОстаток>КоличествоВДокументе Тогда
			Прервать;
		Иначе
			СерияНоменклатурыВБазе = Справочники.СерииНоменклатуры.ПустаяСсылка();
			Продолжить;
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат  СерияНоменклатурыВБазе;
	
КонецФункции
Функция ПолучитьПартиюПоСправкамТТН(СправкаА, СправкаБ, Номенклатура, ДокументЕГАИС, ДокументРеализации) Экспорт
	
	СерияНоменклатурыВБазе = Справочники.СерииНоменклатуры.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ 
	|	СоответствиеСерийЕГАИС.СерияНоменклатуры КАК Серия
	|ИЗ
	|	РегистрСведений.алкСоответствияСправокАиБЕГАИСИСерий КАК СоответствиеСерийЕГАИС
	|		
	|ГДЕ
	|	СоответствиеСерийЕГАИС.СправкаА = &СправкаА 
	|	И СоответствиеСерийЕГАИС.СправкаБ = &СправкаБ
	|
	|СГРУППИРОВАТЬ ПО
	|	СоответствиеСерийЕГАИС.СерияНоменклатуры	
	|
	|УПОРЯДОЧИТЬ ПО 
	|	СоответствиеСерийЕГАИС.СерияНоменклатуры ВОЗР";
	
	Запрос.УстановитьПараметр("СправкаА",СправкаА);
	Запрос.УстановитьПараметр("СправкаБ",СправкаБ);
	
	Рез = Запрос.Выполнить().Выбрать();
	
	Пока Рез.Следующий() Цикл
		СерияНоменклатурыВБазе = Рез.Серия;
		КоличествоВДокументе = 0;
		
		Для каждого стр Из ДокументЕГАИС.Товары Цикл
			Если стр.НомерПартии = Строка(СерияНоменклатурыВБазе) Тогда
				КоличествоВДокументе = КоличествоВДокументе + стр.Количество;
			КонецЕсли;	
		КонецЦикла; 
		
		КоличествоВДокументеРеализации = 0;
		
		Для каждого стр Из ДокументРеализации.Товары Цикл
			Если стр.Серия = СерияНоменклатурыВБазе Тогда
				КоличествоВДокументеРеализации = КоличествоВДокументеРеализации + стр.Количество;
			КонецЕсли;	
		КонецЦикла;
		
		Для каждого стр Из ДокументРеализации.Серии Цикл
			Если стр.Серия = СерияНоменклатурыВБазе Тогда
				КоличествоВДокументеРеализации = КоличествоВДокументеРеализации + стр.Количество;
			КонецЕсли;	
		КонецЦикла;
		
		Если КоличествоВДокументеРеализации = 0 Или КоличествоВДокументе = КоличествоВДокументеРеализации Тогда
			Продолжить;
		Иначе
			Прервать;
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат  СерияНоменклатурыВБазе;
	
КонецФункции
Функция ПолучитьСериюПоМарке(Номенклатура, DataMatrix) Экспорт
	
	СерияНоменклатурыВБазе = Справочники.СерииНоменклатуры.ПустаяСсылка();
	
	Если Номенклатура.Пустая() Или DataMatrix = "" Тогда
		Возврат СерияНоменклатурыВБазе;
	КонецЕсли;	
	
	// Определим данные DataMatrix
	ПерваяЦифраМарки = Число(ЛЕВ(DataMatrix,1));
	МаркаСерия = СокрЛП(Сред(DataMatrix, 5, 3));		
	КорректнаяМарка = Истина;
	
	Если ПерваяЦифраМарки = 1 Тогда
		ДлинаНомераМарки = 9;
		МаркаНомер = СокрЛП(Сред(DataMatrix, 8, 9));
	ИначеЕсли ПерваяЦифраМарки = 2 Тогда
		ДлинаНомераМарки = 8;
		МаркаНомер = СокрЛП(Сред(DataMatrix, 8, 8));
	Иначе
		КорректнаяМарка = Ложь;
		Возврат СерияНоменклатурыВБазе;
	КонецЕсли;
	
	Если КорректнаяМарка Тогда
		ТекущаяСерияМарки = МаркаСерия;
		ТекущийНомерМарки = Число(МаркаНомер);
		ТекущаяДлинаНомераМарки = ДлинаНомераМарки;
	КонецЕсли;
	
	// Найдем подходящие серии из регистра
	Запрос = Новый Запрос;
	Запрос.Текст = 	 "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СерииНоменклатуры.Ссылка КАК Серия
	|ИЗ
	|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|  ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алкСоответствияАлкогольнойПродукцииЕГАИСИНоменклатуры КАК РегистрСоответсвия
	|  ПО СерииНоменклатуры.ВидНоменклатуры = РегистрСоответсвия.Номенклатура.ВидНоменклатуры
	|ГДЕ
	|  РегистрСоответсвия.АлкогольнаяПродукция = &АлкогольнаяПродукция";	 
	Запрос.УстановитьПараметр("АлкогольнаяПродукция", Номенклатура);
	
	////Найдем подходящие серии по артикулу
	//Запрос = Новый Запрос;
	//Запрос.Текст = 	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	//               	 |	СерииНоменклатуры.Ссылка КАК Серия
	//               	 |ИЗ
	//               	 |	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	//				 |ГДЕ
	//				 |  СерииНоменклатуры.Владелец.Артикул = &АлкогольнаяПродукцияКод";
	
	//Запрос.УстановитьПараметр("АлкогольнаяПродукцияКод",Строка(Номенклатура.Код));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Перебором найдем вхождение в серию
	Пока Выборка.Следующий() Цикл
		СерияПодходит = Ложь;
		
		// Поиск по первому полю
		СтрокаМарок = Выборка.Серия.алкПредставлениеМарокАкцизных;
		
		Если СтрокаМарок = "" Тогда
			Продолжить;
		КонецЕсли;
		
		Если Сред(СтрокаМарок, 4, 1) <> " " Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаСерия = Лев(СтрокаМарок, 3);
		
		Если СтрокаСерия <> ТекущаяСерияМарки Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаДиапазоны = Сред(СтрокаМарок, 5);
		МассивДапазоны = СтрЗаменить(СтрокаДиапазоны, ",", Символы.ПС);
		
		ПоискМарок = Истина;
		i = 0;
		Пока ПоискМарок Цикл
			i = i + 1;
			ТекущийДиапазон = СокрЛП(СтрПолучитьСтроку(МассивДапазоны, i));
			Если ТекущийДиапазон = "" Тогда
				ПоискМарок = Ложь;
				Прервать;
			КонецЕсли;
			
			ТекущийДиапазон = СтрЗаменить(ТекущийДиапазон, ".", "");
			ТекущийДиапазон = СтрЗаменить(ТекущийДиапазон, "/", "");
			ТекущийДиапазон = СтрЗаменить(ТекущийДиапазон, "\", "");
			ТекущийДиапазон = СтрЗаменить(ТекущийДиапазон, "?", "");
			ПозицияСимвола = Найти(ТекущийДиапазон, "-");
			
			Если ПозицияСимвола = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Если ПозицияСимвола = 9 Тогда
				Если ТекущаяДлинаНомераМарки <> 8 Тогда
					Продолжить;
				КонецЕсли; 
				
				МинимальныйНомер = Число(Лев(ТекущийДиапазон, 8));
				МаксимальныйНомер = Число(Сред(ТекущийДиапазон, 10, 8));
			ИначеЕсли ПозицияСимвола = 10 Тогда
				Если ТекущаяДлинаНомераМарки <> 9 Тогда
					Продолжить;
				КонецЕсли;    
				
				МинимальныйНомер = Число(Лев(ТекущийДиапазон, 9));
				МаксимальныйНомер = Число(Сред(ТекущийДиапазон, 11, 9));
			Иначе
				Продолжить;
			КонецЕсли;	 
			
			Если ТекущийНомерМарки >= МинимальныйНомер И ТекущийНомерМарки <= МаксимальныйНомер Тогда
				СерияПодходит = Истина;
				Прервать;
			КонецЕсли;					
		КонецЦикла;	
		
		// Поиск по второму полю
		Если не СерияПодходит Тогда
			
			СтрокаМарок = Выборка.Серия.алкПредставлениеМарокРСМ;
			
			Если СтрокаМарок="" Тогда
				Продолжить;
			КонецЕсли;
			
			Если Сред(СтрокаМарок, 4, 1) <> " " Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаСерия = Лев(СтрокаМарок, 3);
			
			Если СтрокаСерия <> ТекущаяСерияМарки Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаДиапазоны = Сред(СтрокаМарок, 5);
			МассивДапазоны = СтрЗаменить(СтрокаДиапазоны, ",", Символы.ПС);
			
			ПоискМарок = Истина;
			i = 0;
			Пока ПоискМарок Цикл
				i = i + 1;
				ТекущийДиапазон = СокрЛП(СтрПолучитьСтроку(МассивДапазоны, i));
				
				Если ТекущийДиапазон = "" Тогда
					ПоискМарок = Ложь;
					Прервать;
				КонецЕсли;
				
				ТекущийДиапазон = СтрЗаменить(ТекущийДиапазон, ".", "");
				ТекущийДиапазон = СтрЗаменить(ТекущийДиапазон, "/", "");
				ТекущийДиапазон = СтрЗаменить(ТекущийДиапазон, "\", "");
				ТекущийДиапазон = СтрЗаменить(ТекущийДиапазон, "?", "");
				ПозицияСимвола = Найти(ТекущийДиапазон, "-");
				
				Если ПозицияСимвола = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				Если ПозицияСимвола = 9 Тогда
					Если ТекущаяДлинаНомераМарки <> 8 Тогда
						Продолжить;
					КонецЕсли;
					МинимальныйНомер = Число(Лев(ТекущийДиапазон, 8));
					МаксимальныйНомер = Число(Сред(ТекущийДиапазон, 10, 8));
				ИначеЕсли ПозицияСимвола = 10 Тогда
					Если ТекущаяДлинаНомераМарки <> 9 Тогда
						Продолжить;
					КонецЕсли;
					МинимальныйНомер = Число(Лев(ТекущийДиапазон, 9));
					МаксимальныйНомер = Число(Сред(ТекущийДиапазон, 11, 9));
				Иначе
					Продолжить;
				КонецЕсли;	 
				
				Если ТекущийНомерМарки >= МинимальныйНомер И ТекущийНомерМарки <= МаксимальныйНомер Тогда
					СерияПодходит = Истина;
					Прервать;
				КонецЕсли;					
			КонецЦикла;	
			
		КонецЕсли;
		
		
		// Поиск по третьему полю		
		Если Не СерияПодходит Тогда		
			СтрокаМарок = Выборка.Серия.алкПредставлениеМарокФСМ;
			
			Если СтрокаМарок = "" Тогда
				Продолжить;
			КонецЕсли;
			
			Если Сред(СтрокаМарок, 4, 1) <> " " Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаСерия = Лев(СтрокаМарок, 3);
			
			Если СтрокаСерия <> ТекущаяСерияМарки Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаДиапазоны = Сред(СтрокаМарок, 5);
			МассивДапазоны = СтрЗаменить(СтрокаДиапазоны, ",", Символы.ПС);
			
			ПоискМарок = Истина;
			i = 0; 
			
			Пока ПоискМарок Цикл
				i = i + 1;
				ТекущийДиапазон = СокрЛП(СтрПолучитьСтроку(МассивДапазоны, i));
				Если ТекущийДиапазон = "" Тогда
					ПоискМарок = Ложь;
					Прервать;
				КонецЕсли;
				
				ТекущийДиапазон = СтрЗаменить(ТекущийДиапазон, ".", "");
				ТекущийДиапазон = СтрЗаменить(ТекущийДиапазон, "/", "");
				ТекущийДиапазон = СтрЗаменить(ТекущийДиапазон, "\", "");
				ТекущийДиапазон = СтрЗаменить(ТекущийДиапазон, "?", "");
				ПозицияСимвола = Найти(ТекущийДиапазон, "-");
				
				Если ПозицияСимвола = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				Если ПозицияСимвола = 9 Тогда
					Если ТекущаяДлинаНомераМарки <> 8 Тогда
						Продолжить;
					КонецЕсли;
					
					МинимальныйНомер = Число(Лев(ТекущийДиапазон, 8));
					МаксимальныйНомер = Число(Сред(ТекущийДиапазон, 10, 8));
				ИначеЕсли ПозицияСимвола = 10 Тогда
					Если ТекущаяДлинаНомераМарки <> 9 Тогда
						Продолжить;
					КонецЕсли;   
					
					МинимальныйНомер = Число(Лев(ТекущийДиапазон, 9));
					МаксимальныйНомер = Число(Сред(ТекущийДиапазон, 11, 9));
				Иначе
					Продолжить;
				КонецЕсли;	 
				
				Если ТекущийНомерМарки >= МинимальныйНомер И ТекущийНомерМарки <= МаксимальныйНомер Тогда
					СерияПодходит = Истина;
					Прервать;
				КонецЕсли;					
			КонецЦикла;	
			
		КонецЕсли;
		
		Если СерияПодходит Тогда
			СерияНоменклатурыВБазе = Выборка.Серия;
			Возврат СерияНоменклатурыВБазе;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;	
	
	Возврат СерияНоменклатурыВБазе;
	
КонецФункции
Функция ПолучитьНоменклатуруАкцизнойМарки(ИдентификаторМарки = "", Период = Неопределено) Экспорт
	
	МассивМарок = Новый Массив;
	
	Если ТипЗнч(ИдентификаторМарки) = Тип("Строка") Тогда
		МассивМарок.Добавить(ИдентификаторМарки);
	Иначе
		МассивМарок = ИдентификаторМарки;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивМарок", МассивМарок);
	Запрос.УстановитьПараметр("Период", ?(ЗначениеЗаполнено(Период), Период, Неопределено));
	Запрос.Текст = "ВЫБРАТЬ
	|	алкХранилищеАкцизныхМарокСрезПоследних.Период,
	|	алкХранилищеАкцизныхМарокСрезПоследних.Регистратор,
	|	алкХранилищеАкцизныхМарокСрезПоследних.Марка,
	|	алкХранилищеАкцизныхМарокСрезПоследних.Упаковка,
	|	алкХранилищеАкцизныхМарокСрезПоследних.СправкаБ,
	|	алкХранилищеАкцизныхМарокСрезПоследних.АлкогольнаяПродукция,
	|	алкХранилищеАкцизныхМарокСрезПоследних.Организация,
	|	алкХранилищеАкцизныхМарокСрезПоследних.ПунктРазгрузки,
	|	алкХранилищеАкцизныхМарокСрезПоследних.ОтметкаВыбытия
	|ПОМЕСТИТЬ ТаблицаМарок
	|ИЗ
	|	РегистрСведений.алкХранилищеАкцизныхМарок.СрезПоследних(
	|			&Период,
	|			Марка В (&МассивМарок)
	|				И ОтметкаВыбытия = ЛОЖЬ) КАК алкХранилищеАкцизныхМарокСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаМарок.АлкогольнаяПродукция,
	|	ТаблицаМарок.СправкаБ,
	| 	ЕстьNULL(алкСоответствияСправокАиБЕГАИСИСерий.СерияНоменклатуры,ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)) КАК СерияНоменклатуры,
	| 	ЕстьNULL(алкСоответствияСправокАиБЕГАИСИСерий.СправкаА,ЗНАЧЕНИЕ(Справочник.алкКлассификаторСправокАиБ.ПустаяСсылка)) КАК СправкаА,
	|	ТаблицаМарок.Марка
	|ПОМЕСТИТЬ ВТ_СправкиАИБ
	|ИЗ
	|	ТаблицаМарок КАК ТаблицаМарок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.алкСоответствияСправокАиБЕГАИСИСерий КАК алкСоответствияСправокАиБЕГАИСИСерий
	|		ПО ТаблицаМарок.СправкаБ = алкСоответствияСправокАиБЕГАИСИСерий.СправкаБ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаМарок.Период,
	|	ТаблицаМарок.Регистратор,
	|	ТаблицаМарок.Марка КАК Марка,
	|	ТаблицаМарок.Упаковка,
	|	ТаблицаМарок.СправкаБ КАК СправкаБ,
	|	ТаблицаМарок.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
	|	ТаблицаМарок.Организация,
	|	ТаблицаМарок.ПунктРазгрузки,
	|	ТаблицаМарок.ОтметкаВыбытия,
	|	ЕСТЬNULL(ВТ_СправкиАИБ.СправкаА, ЗНАЧЕНИЕ(Справочник.алкКлассификаторСправокАиБ.ПустаяСсылка)) КАК СправкаА,
	|	ЕСТЬNULL(ВТ_СправкиАИБ.СерияНоменклатуры, ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)) КАК СерияНоменклатуры,
	|	ЕСТЬNULL(ВТ_СправкиАИБ.СерияНоменклатуры.алкВладелец, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура	
	|ИЗ
	|	ТаблицаМарок КАК ТаблицаМарок
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СправкиАИБ КАК ВТ_СправкиАИБ
	|		ПО ТаблицаМарок.Марка = ВТ_СправкиАИБ.Марка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Марка,
	|	АлкогольнаяПродукция,
	|	Номенклатура,
	|	СправкаА,
	|	СправкаБ,
	|	СерияНоменклатуры";
	
	Возврат Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.Прямой);
	
КонецФункции
Функция ПолучитьНоменклатуруАкцизнойМарки_Приемка(ИдентификаторМарки = "", СсылкаНаДок) Экспорт
	
	НоменклатураЕГАИС = Справочники.алкКлассификаторАлкогольнойПродукцииЕГАИС.ПустаяСсылка();
	
	ЗапросЕГАИС = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЕстьNULL(ЕГАИС_Номенклатура.АлкогольнаяПродукция,ЗНАЧЕНИЕ(Справочник.алкКлассификаторАлкогольнойПродукцииЕГАИС.ПустаяСсылка)) КАК Ссылка,
	|	ЕстьNULL(ЕГАИС_Номенклатура.АлкогольнаяПродукция.Код, """")  КАК Алкокод,
	|	ЕСТЬNULL(ЕГАИС_Номенклатура.АлкогольнаяПродукция.Наименование, """") КАК ArtName,
	|	ЕСТЬNULL(ЕГАИС_Номенклатура.АлкогольнаяПродукция.Производитель.Наименование, """") КАК Manufacturer,
	//|	ЕСТЬNULL(ЕГАИС_Номенклатура.Импортер.Наименование, """") КАК Importer,
	|	"""" КАК Importer,
	|	ЕСТЬNULL(ЕГАИС_Номенклатура.АлкогольнаяПродукция.Объем, 0) КАК Capacity,
	|	ЕСТЬNULL(ЕГАИС_Номенклатура.АлкогольнаяПродукция.Крепость, 0) КАК PercentAlco,
	|	ЕСТЬNULL(ЕГАИС_Номенклатура.АлкогольнаяПродукция.ВидПродукции.Наименование, """") КАК TypeAlco			
	|ИЗ
	|	Документ.алкТоварноТранспортнаяНакладнаяЕГАИС.АкцизныеМарки КАК ЕГАИС_Марки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.алкТоварноТранспортнаяНакладнаяЕГАИС.Товары КАК ЕГАИС_Номенклатура
	|		ПО ЕГАИС_Марки.КлючСвязи = ЕГАИС_Номенклатура.КлючСвязи
	|		И ЕГАИС_Марки.Ссылка = ЕГАИС_Номенклатура.Ссылка
	|ГДЕ
	|   ЕГАИС_Марки.Ссылка = &СсылкаНаТТН И ЕГАИС_Номенклатура.Ссылка = &СсылкаНаТТН 
	|   И ЕГАИС_Марки.КодАкцизнойМарки = &Код
	|   И НЕ ЕГАИС_Номенклатура.АлкогольнаяПродукция ЕСТЬ NULL");
	
	ЗапросЕГАИС.УстановитьПараметр("Код", ИдентификаторМарки);
	ЗапросЕГАИС.УстановитьПараметр("СсылкаНаТТН", СсылкаНаДок.ИсходныйДокумент); 
	
	
	ВыборкаЕГАИС = ЗапросЕГАИС.Выполнить().Выбрать();
	
	Если ВыборкаЕГАИС.Следующий() Тогда		
		НоменклатураЕГАИС = ВыборкаЕГАИС.Ссылка;
	КонецЕсли;	
	
	Возврат НоменклатураЕГАИС;
	
КонецФункции
Функция ПроверитьУпаковочныйлистЭтоКороб(УпаковочныйЛист, Период=Неопределено) Экспорт
	
	Если ПустаяСтрока(УпаковочныйЛист) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Упаковка", УпаковочныйЛист);
	Запрос.УстановитьПараметр("Период", ?(ЗначениеЗаполнено(Период), Период, Неопределено));
	Запрос.Текст = "ВЫБРАТЬ
	|	алкХранилищеУпаковокСрезПоследних.Упаковка,
	|	алкХранилищеУпаковокСрезПоследних.ИерархияУпаковки
	|ИЗ
	|	РегистрСведений.алкХранилищеУпаковок.СрезПоследних(&Период, ИерархияУпаковки = &Упаковка) КАК алкХранилищеУпаковокСрезПоследних";
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции
Функция НайтиПалетуКороба(ИдентификаторУпаковки, Период=Неопределено) Экспорт
	
	ЗапросУпаковок = Новый Запрос;
	ЗапросУпаковок.УстановитьПараметр("Период", ?(ЗначениеЗаполнено(Период), Период, Неопределено));
	ЗапросУпаковок.УстановитьПараметр("Упаковка", ИдентификаторУпаковки);
	ЗапросУпаковок.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	алкХранилищеУпаковокСрезПоследних.Регистратор,
	|	алкХранилищеУпаковокСрезПоследних.Упаковка
	|ПОМЕСТИТЬ ДанныеУпаковки	
	|ИЗ
	|	РегистрСведений.алкХранилищеУпаковок.СрезПоследних(&Период, Упаковка = &Упаковка) КАК алкХранилищеУпаковокСрезПоследних
	|ГДЕ
	|	алкХранилищеУпаковокСрезПоследних.ИерархияУпаковки <> """"
	|;
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	алкХранилищеУпаковокСрезПоследних.Регистратор,
	|	алкХранилищеУпаковокСрезПоследних.ИерархияУпаковки,
	|	ДанныеУпаковки.Регистратор,
	|	ДанныеУпаковки.Упаковка
	|ИЗ
	|	РегистрСведений.алкХранилищеУпаковок.СрезПоследних(&Период, Упаковка = &Упаковка) КАК алкХранилищеУпаковокСрезПоследних
	|	ЛЕВОЕ СОЕДИНЕНИЕ ДанныеУпаковки КАК ДанныеУпаковки
	|	ПО ДанныеУпаковки.Регистратор = алкХранилищеУпаковокСрезПоследних.Регистратор
	|ГДЕ
	|	алкХранилищеУпаковокСрезПоследних.Упаковка <> """"
	|	И ДанныеУпаковки.Регистратор=алкХранилищеУпаковокСрезПоследних.Регистратор
	|	И НЕ ДанныеУпаковки.Регистратор ЕСТЬ NULL И НЕ ДанныеУпаковки.Регистратор ЕСТЬ NULL"; 
	
	Выборка = ЗапросУпаковок.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ИерархияУпаковки;
	Иначе
		Возврат "";
	КонецЕсли;	
	
КонецФункции
Функция НайтиКоробаПалеты(ИдентификаторУпаковки, Период=Неопределено) Экспорт
	
	ЗапросУпаковок = Новый Запрос;
	ЗапросУпаковок.УстановитьПараметр("Период", ?(ЗначениеЗаполнено(Период), Период, Неопределено));
	ЗапросУпаковок.УстановитьПараметр("Упаковка", ИдентификаторУпаковки);
	ЗапросУпаковок.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	алкХранилищеУпаковокСрезПоследних.Регистратор,
	|	алкХранилищеУпаковокСрезПоследних.Упаковка
	|ПОМЕСТИТЬ ДанныеУпаковки	
	|ИЗ
	|	РегистрСведений.алкХранилищеУпаковок.СрезПоследних(&Период, Упаковка = &Упаковка) КАК алкХранилищеУпаковокСрезПоследних
	|ГДЕ
	|	алкХранилищеУпаковокСрезПоследних.ИерархияУпаковки = """"
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	алкХранилищеУпаковокСрезПоследних.Регистратор,
	|	алкХранилищеУпаковокСрезПоследних.Упаковка,
	|	ДанныеУпаковки.Регистратор,
	|	ДанныеУпаковки.Упаковка
	|ИЗ
	|	РегистрСведений.алкХранилищеУпаковок.СрезПоследних(&Период, ИерархияУпаковки = &Упаковка) КАК алкХранилищеУпаковокСрезПоследних
	|	ЛЕВОЕ СОЕДИНЕНИЕ ДанныеУпаковки КАК ДанныеУпаковки
	|	ПО ДанныеУпаковки.Регистратор = алкХранилищеУпаковокСрезПоследних.Регистратор
	|ГДЕ
	|	алкХранилищеУпаковокСрезПоследних.Упаковка <> """"
	|	И ДанныеУпаковки.Регистратор=алкХранилищеУпаковокСрезПоследних.Регистратор
	|	И НЕ ДанныеУпаковки.Регистратор ЕСТЬ NULL И НЕ ДанныеУпаковки.Регистратор ЕСТЬ NULL"; 
	
	МассивКоробов = ЗапросУпаковок.Выполнить().Выгрузить().ВыгрузитьКолонку("Упаковка");
	Возврат МассивКоробов;
	
КонецФункции
Функция НайтиМаркиУпаковки(Упаковка, НоменклатураЕГАИС=Неопределено, Период=Неопределено) Экспорт
	
	МассивМарок = Новый Массив;
	Если Упаковка = "" тогда
		Возврат МассивМарок;
	КонецЕсли;
	
	ЭтоКороб = ПроверитьУпаковочныйлистЭтоКороб(Упаковка);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", ?(ЗначениеЗаполнено(Период), Период, Неопределено));
	Запрос.УстановитьПараметр("Упаковка", Упаковка);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	алкХранилищеУпаковокСрезПоследних.Регистратор,
	|	алкХранилищеУпаковокСрезПоследних.Упаковка	
	|ИЗ
	|	РегистрСведений.алкХранилищеУпаковок.СрезПоследних(&Период, Упаковка = &Упаковка) КАК алкХранилищеУпаковокСрезПоследних";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Регистратор = Выборка.Регистратор;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Период", ?(ЗначениеЗаполнено(Период), Период, Неопределено));
		Запрос.УстановитьПараметр("Упаковка", Упаковка);
		Запрос.УстановитьПараметр("Регистратор", Регистратор);	
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	алкХранилищеАкцизныхМарокСрезПоследних.Марка КАК Марка,
		|	алкХранилищеАкцизныхМарокСрезПоследних.Упаковка КАК Упаковка
		|ИЗ
		|	РегистрСведений.алкХранилищеАкцизныхМарок.СрезПоследних(&Период, Упаковка = &Упаковка И Регистратор = &Регистратор) КАК алкХранилищеАкцизныхМарокСрезПоследних
		|ГДЕ
		|	алкХранилищеАкцизныхМарокСрезПоследних.ОтметкаВыбытия = ЛОЖЬ
		|	И алкХранилищеАкцизныхМарокСрезПоследних.АлкогольнаяПродукция <> ЗНАЧЕНИЕ(Справочник.алкКлассификаторАлкогольнойПродукцииЕГАИС.ПустаяСсылка)"; 
		
		Если НоменклатураЕГАИС <> Неопределено Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"Упаковка = &Упаковка И Регистратор = &Регистратор","Упаковка = &Упаковка И АлкогольнаяПродукция = &НоменклатураЕГАИС И Регистратор = &Регистратор");	
			Запрос.УстановитьПараметр("НоменклатураЕГАИС", НоменклатураЕГАИС);
		КонецЕсли;
		
		МассивМарок = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Марка");
	КонецЕсли;	
	
	
	Если МассивМарок.Количество() > 0 Тогда
	Иначе
		Если ЭтоКороб Тогда
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Период", ?(ЗначениеЗаполнено(Период), Период, Неопределено));
			Запрос.УстановитьПараметр("Упаковка", Упаковка);
			Запрос.УстановитьПараметр("НоменклатураЕГАИС", НоменклатураЕГАИС);
			
			Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	алкХранилищеАкцизныхМарокСрезПоследних.Марка КАК Марка,
			|	алкХранилищеАкцизныхМарокСрезПоследних.Упаковка КАК Упаковка
			|ИЗ
			|	РегистрСведений.алкХранилищеАкцизныхМарок.СрезПоследних(&Период, Упаковка = &Упаковка) КАК алкХранилищеАкцизныхМарокСрезПоследних
			|ГДЕ
			|	алкХранилищеАкцизныхМарокСрезПоследних.ОтметкаВыбытия = ЛОЖЬ
			|	И алкХранилищеАкцизныхМарокСрезПоследних.АлкогольнаяПродукция <> ЗНАЧЕНИЕ(Справочник.алкКлассификаторАлкогольнойПродукцииЕГАИС.ПустаяСсылка)"; 
			
			Если НоменклатураЕГАИС <> Неопределено Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст,"Упаковка = &Упаковка","Упаковка = &Упаковка И АлкогольнаяПродукция = &НоменклатураЕГАИС");	
				Запрос.УстановитьПараметр("НоменклатураЕГАИС", НоменклатураЕГАИС);
			КонецЕсли;
			
			МассивМарок = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Марка");
		КонецЕсли;	
	КонецЕсли;
	
	Возврат МассивМарок;
	
КонецФункции
Функция ПолучитьТаблицуУпакованныхМарок(ИдентификаторУпаковки = "", Период = Неопределено, ЭтоВыборочнаяПроверка = Ложь) Экспорт
	
	ТЗМарок = Новый Массив;
	ТЗУпаковок = Новый Массив;
	
	Если ИдентификаторУпаковки = "" Тогда
		Возврат ТЗМарок;
	Иначе
		ТЗУпаковок.Добавить(ИдентификаторУпаковки);
	КонецЕсли;
	
	ЭтоКороб = ПроверитьУпаковочныйлистЭтоКороб(ИдентификаторУпаковки);
	
	// Получим упаковки палеты
	Если Не ЭтоКороб Тогда	
		ЗапросУпаковок = Новый Запрос;
		ЗапросУпаковок.УстановитьПараметр("Период", ?(ЗначениеЗаполнено(Период), Период, Неопределено));
		ЗапросУпаковок.УстановитьПараметр("Упаковка", ИдентификаторУпаковки);
		ЗапросУпаковок.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	алкХранилищеУпаковокСрезПоследних.Регистратор,
		|	алкХранилищеУпаковокСрезПоследних.Упаковка
		|ПОМЕСТИТЬ ДанныеУпаковки	
		|ИЗ
		|	РегистрСведений.алкХранилищеУпаковок.СрезПоследних(&Период, Упаковка = &Упаковка) КАК алкХранилищеУпаковокСрезПоследних
		|ГДЕ
		|	алкХранилищеУпаковокСрезПоследних.ИерархияУпаковки = """"
		|;
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	алкХранилищеУпаковокСрезПоследних.Регистратор,
		|	алкХранилищеУпаковокСрезПоследних.Упаковка
		|ИЗ
		|	РегистрСведений.алкХранилищеУпаковок.СрезПоследних(&Период, ИерархияУпаковки = &Упаковка) КАК алкХранилищеУпаковокСрезПоследних
		|	ЛЕВОЕ СОЕДИНЕНИЕ ДанныеУпаковки КАК ДанныеУпаковки
		|	ПО ДанныеУпаковки.Регистратор = алкХранилищеУпаковокСрезПоследних.Регистратор
		|ГДЕ
		|	алкХранилищеУпаковокСрезПоследних.Упаковка <> """"
		|	И НЕ ДанныеУпаковки.Регистратор ЕСТЬ NULL И НЕ ДанныеУпаковки.Регистратор ЕСТЬ NULL"; 
		
		Выборка = ЗапросУпаковок.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ТЗУпаковок.Добавить(Выборка.Упаковка);	
		КонецЦикла;	
	КонецЕсли;	
	
	ТЗМарок = Новый ТаблицаЗначений();
	ТЗМарок.Колонки.Добавить("Период");	
	ТЗМарок.Колонки.Добавить("Регистратор");
	ТЗМарок.Колонки.Добавить("Марка");	
	ТЗМарок.Колонки.Добавить("СправкаБ");
	ТЗМарок.Колонки.Добавить("АлкогольнаяПродукция");
	ТЗМарок.Колонки.Добавить("Организация");
	ТЗМарок.Колонки.Добавить("ПунктРазгрузки");
	ТЗМарок.Колонки.Добавить("ОтметкаВыбытия");
	ТЗМарок.Колонки.Добавить("Упаковка");
	ТЗМарок.Колонки.Добавить("ЭтоУпаковка");
	ТЗМарок.Колонки.Добавить("Наименование");
	
	Если ЭтоВыборочнаяПроверка Тогда
		ТЗМарок.Колонки.Добавить("Количество");	
	КонецЕсли;
	
	//Получим список марок	
	Для каждого Упаковка Из ТЗУпаковок Цикл
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Период", ?(ЗначениеЗаполнено(Период), Период, Неопределено));
		Запрос.УстановитьПараметр("Упаковка", Упаковка);
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	алкХранилищеУпаковокСрезПоследних.Регистратор,
		|	алкХранилищеУпаковокСрезПоследних.Упаковка	
		|ИЗ
		|	РегистрСведений.алкХранилищеУпаковок.СрезПоследних(&Период, Упаковка = &Упаковка) КАК алкХранилищеУпаковокСрезПоследних";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Регистратор = Выборка.Регистратор;
		Иначе
			Возврат ТЗМарок;
		КонецЕсли;	
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Период", ?(ЗначениеЗаполнено(Период), Период, Неопределено));
		Запрос.УстановитьПараметр("Упаковка", Упаковка);
		Запрос.УстановитьПараметр("Регистратор", Регистратор);	
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	алкХранилищеАкцизныхМарокСрезПоследних.Период,
		|	алкХранилищеАкцизныхМарокСрезПоследних.Регистратор,
		|	алкХранилищеАкцизныхМарокСрезПоследних.Марка КАК Марка,
		|	алкХранилищеАкцизныхМарокСрезПоследних.СправкаБ,
		|	алкХранилищеАкцизныхМарокСрезПоследних.АлкогольнаяПродукция,
		|	алкХранилищеАкцизныхМарокСрезПоследних.Организация,
		|	алкХранилищеАкцизныхМарокСрезПоследних.ПунктРазгрузки,
		|	алкХранилищеАкцизныхМарокСрезПоследних.ОтметкаВыбытия,
		|	алкХранилищеАкцизныхМарокСрезПоследних.Упаковка,
		|	алкХранилищеАкцизныхМарокСрезПоследних.Упаковка КАК Наименование
		|ИЗ
		|	РегистрСведений.алкХранилищеАкцизныхМарок.СрезПоследних(&Период, Упаковка = &Упаковка И Регистратор = &Регистратор) КАК алкХранилищеАкцизныхМарокСрезПоследних
		|ГДЕ
		|	алкХранилищеАкцизныхМарокСрезПоследних.ОтметкаВыбытия = ЛОЖЬ"; 
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = ТЗМарок.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			
			Если ЭтоВыборочнаяПроверка Тогда
				НоваяСтрока.Количество = 1;
			КонецЕсли;
		КонецЦикла;	
	КонецЦикла;
	
	Если ТЗМарок.Количество() > 0 Тогда
	Иначе
		Если ЭтоКороб Тогда
			// Информация об упаковках в регистре марок
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Период", ?(ЗначениеЗаполнено(Период), Период, Неопределено));
			Запрос.УстановитьПараметр("Упаковка", ИдентификаторУпаковки);
			
			Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	алкХранилищеАкцизныхМарокСрезПоследних.Период,
			|	алкХранилищеАкцизныхМарокСрезПоследних.Регистратор,
			|	алкХранилищеАкцизныхМарокСрезПоследних.Марка КАК Марка,
			|	алкХранилищеАкцизныхМарокСрезПоследних.СправкаБ,
			|	алкХранилищеАкцизныхМарокСрезПоследних.АлкогольнаяПродукция,
			|	алкХранилищеАкцизныхМарокСрезПоследних.Организация,
			|	алкХранилищеАкцизныхМарокСрезПоследних.ПунктРазгрузки,
			|	алкХранилищеАкцизныхМарокСрезПоследних.ОтметкаВыбытия,
			|	алкХранилищеАкцизныхМарокСрезПоследних.Упаковка,
			|	алкХранилищеАкцизныхМарокСрезПоследних.Упаковка КАК Наименование
			|ИЗ
			|	РегистрСведений.алкХранилищеАкцизныхМарок.СрезПоследних(&Период, Упаковка = &Упаковка) КАК алкХранилищеАкцизныхМарокСрезПоследних
			|ГДЕ
			|	алкХранилищеАкцизныхМарокСрезПоследних.ОтметкаВыбытия = ЛОЖЬ"; 
			
			ТЗМарок = Запрос.Выполнить().Выгрузить();
		КонецЕсли;	
	КонецЕсли;	
	
	Возврат ТЗМарок;
	
КонецФункции
Функция ПолучитьТаблицуУпакованногоТовара(ИдентификаторУпаковки = "", Период = Неопределено,ПроверкаЗадания) Экспорт
	
	ТЗМарок = Новый Массив;
	ТЗУпаковок = Новый Массив;
	
	Если ИдентификаторУпаковки = "" тогда
		Возврат ТЗМарок;
	Иначе
		ТЗУпаковок.Добавить(ИдентификаторУпаковки);
	КонецЕсли;
	
	ЭтоКороб = ПроверитьУпаковочныйлистЭтоКороб(ИдентификаторУпаковки);
	
	// Получим упаковки палеты
	Если Не ЭтоКороб тогда	
		ЗапросУпаковок = Новый Запрос;
		ЗапросУпаковок.УстановитьПараметр("Период", ?(ЗначениеЗаполнено(Период), Период, Неопределено));
		ЗапросУпаковок.УстановитьПараметр("Упаковка", ИдентификаторУпаковки);
		ЗапросУпаковок.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	алкХранилищеУпаковокСрезПоследних.Регистратор,
		|	алкХранилищеУпаковокСрезПоследних.Упаковка
		|ПОМЕСТИТЬ ДанныеУпаковки	
		|ИЗ
		|	РегистрСведений.алкХранилищеУпаковок.СрезПоследних(&Период, Упаковка = &Упаковка) КАК алкХранилищеУпаковокСрезПоследних
		|ГДЕ
		|	алкХранилищеУпаковокСрезПоследних.ИерархияУпаковки = """"
		|;
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	алкХранилищеУпаковокСрезПоследних.Регистратор,
		|	алкХранилищеУпаковокСрезПоследних.Упаковка
		|ИЗ
		|	РегистрСведений.алкХранилищеУпаковок.СрезПоследних(&Период, ИерархияУпаковки = &Упаковка) КАК алкХранилищеУпаковокСрезПоследних
		|	ЛЕВОЕ СОЕДИНЕНИЕ ДанныеУпаковки КАК ДанныеУпаковки
		|	ПО ДанныеУпаковки.Регистратор = алкХранилищеУпаковокСрезПоследних.Регистратор
		|ГДЕ
		|	алкХранилищеУпаковокСрезПоследних.Упаковка <> """"
		|	И алкХранилищеУпаковокСрезПоследних.Регистратор=алкХранилищеУпаковокСрезПоследних.Регистратор
		|	И НЕ ДанныеУпаковки.Регистратор ЕСТЬ NULL И НЕ ДанныеУпаковки.Регистратор ЕСТЬ NULL"; 
		
		Выборка = ЗапросУпаковок.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ТЗУпаковок.Добавить(Выборка.Упаковка);	
		КонецЦикла;	
	КонецЕсли;			
	
	ТЗМарок = Новый ТаблицаЗначений();
	ТЗМарок.Колонки.Добавить("АлкогольнаяПродукция");
	ТЗМарок.Колонки.Добавить("СправкаБ");
	ТЗМарок.Колонки.Добавить("Количество");
	
	// Получим список марок	
	Для каждого Упаковка Из ТЗУпаковок Цикл
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Период", ?(ЗначениеЗаполнено(Период), Период, Неопределено));
		Запрос.УстановитьПараметр("Упаковка", Упаковка);
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	алкХранилищеУпаковокСрезПоследних.Регистратор,
		|	алкХранилищеУпаковокСрезПоследних.Упаковка	
		|ИЗ
		|	РегистрСведений.алкХранилищеУпаковок.СрезПоследних(&Период, Упаковка = &Упаковка) КАК алкХранилищеУпаковокСрезПоследних";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Регистратор = Выборка.Регистратор;
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Период", ?(ЗначениеЗаполнено(Период), Период, Неопределено));
			Запрос.УстановитьПараметр("Упаковка", Упаковка);
			Запрос.УстановитьПараметр("Регистратор", Регистратор);	
			Запрос.Текст = "ВЫБРАТЬ
			|	алкХранилищеАкцизныхМарокСрезПоследних.АлкогольнаяПродукция,
			|	алкХранилищеАкцизныхМарокСрезПоследних.СправкаБ
			|ПОМЕСТИТЬ ТаблицаМарок
			|ИЗ
			|	РегистрСведений.алкХранилищеАкцизныхМарок.СрезПоследних(&Период, Упаковка = &Упаковка И Регистратор=&Регистратор) КАК алкХранилищеАкцизныхМарокСрезПоследних
			|ГДЕ
			|	алкХранилищеАкцизныхМарокСрезПоследних.ОтметкаВыбытия = ЛОЖЬ
			|;
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТаблицаМарок.АлкогольнаяПродукция,
			|	ТаблицаМарок.СправкаБ,
			//|	ЕСТЬNULL(алкСоответствияСправокАиБЕГАИСИСерий.СерияНоменклатуры,ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)) КАК СерияНоменклатуры,
			//|	ЕСТЬNULL(алкСоответствияСправокАиБЕГАИСИСерий.СправкаА,ЗНАЧЕНИЕ(Справочник.алкКлассификаторСправокАиБ.ПустаяСсылка)) КАК СправкаА,
			|	1 КАК Количество
			|ПОМЕСТИТЬ ВТ_СправкиАИБ
			|ИЗ
			|	ТаблицаМарок КАК ТаблицаМарок
			//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алкСоответствияСправокАиБЕГАИСИСерий КАК алкСоответствияСправокАиБЕГАИСИСерий
			//|		ПО ТаблицаМарок.СправкаБ = алкСоответствияСправокАиБЕГАИСИСерий.СправкаБ
			|;				
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_СправкиАИБ.АлкогольнаяПродукция,
			|	ВТ_СправкиАИБ.СправкаБ,
			//|	ВТ_СправкиАИБ.СерияНоменклатуры,
			//|	ВТ_СправкиАИБ.СправкаА,
			|	СУММА(ВТ_СправкиАИБ.Количество) КАК Количество
			|ПОМЕСТИТЬ ОбщиеДанные
			|ИЗ
			|	ВТ_СправкиАИБ КАК ВТ_СправкиАИБ
			|СГРУППИРОВАТЬ ПО
			|	ВТ_СправкиАИБ.АлкогольнаяПродукция,
			//|	ВТ_СправкиАИБ.СерияНоменклатуры,
			// |	ВТ_СправкиАИБ.СправкаА,
			|	ВТ_СправкиАИБ.СправкаБ
			|;
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ОбщиеДанные.АлкогольнаяПродукция,
			|	ОбщиеДанные.СправкаБ,
			//|	ОбщиеДанные.СерияНоменклатуры,
			//|	ОбщиеДанные.СправкаА,
			|	ОбщиеДанные.Количество КАК Количество
			|ИЗ
			|	ОбщиеДанные КАК ОбщиеДанные";
			
			Если ПроверкаЗадания <> 2 и ПроверкаЗадания <> 6 Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст,"ТаблицаМарок.СправкаБ","0 КАК СправкаБ");	
			КонецЕсли;
			
			ЕстьДанные = Ложь;
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				ЕстьДанные = Истина;
				НоваяСтрока = ТЗМарок.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
			КонецЦикла;	
			
			// Выборка марок по старым агрегациям
			Если Не ЕстьДанные Тогда
				Запрос = Новый Запрос;
				Запрос.УстановитьПараметр("Период", ?(ЗначениеЗаполнено(Период), Период, Неопределено));
				Запрос.УстановитьПараметр("Упаковка", Упаковка);
				
				Запрос.Текст = "ВЫБРАТЬ
				|	алкХранилищеАкцизныхМарокСрезПоследних.АлкогольнаяПродукция,
				|	алкХранилищеАкцизныхМарокСрезПоследних.СправкаБ
				|ПОМЕСТИТЬ ТаблицаМарок
				|ИЗ
				|	РегистрСведений.алкХранилищеАкцизныхМарок.СрезПоследних(&Период, Упаковка = &Упаковка) КАК алкХранилищеАкцизныхМарокСрезПоследних
				|ГДЕ
				|	алкХранилищеАкцизныхМарокСрезПоследних.ОтметкаВыбытия = ЛОЖЬ
				|;
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ТаблицаМарок.АлкогольнаяПродукция,
				|	ТаблицаМарок.СправкаБ,
				//|	ЕСТЬNULL(алкСоответствияСправокАиБЕГАИСИСерий.СерияНоменклатуры,ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)) КАК СерияНоменклатуры,
				//|	ЕСТЬNULL(алкСоответствияСправокАиБЕГАИСИСерий.СправкаА,ЗНАЧЕНИЕ(Справочник.алкКлассификаторСправокАиБ.ПустаяСсылка)) КАК СправкаА,
				|	1 КАК Количество
				|ПОМЕСТИТЬ ВТ_СправкиАИБ
				|ИЗ
				|	ТаблицаМарок КАК ТаблицаМарок
				//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алкСоответствияСправокАиБЕГАИСИСерий КАК алкСоответствияСправокАиБЕГАИСИСерий
				//|		ПО ТаблицаМарок.СправкаБ = алкСоответствияСправокАиБЕГАИСИСерий.СправкаБ
				|;				
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ВТ_СправкиАИБ.АлкогольнаяПродукция,
				|	ВТ_СправкиАИБ.СправкаБ,
				//|	ВТ_СправкиАИБ.СерияНоменклатуры,
				//|	ВТ_СправкиАИБ.СправкаА,
				|	СУММА(ВТ_СправкиАИБ.Количество) КАК Количество
				|ПОМЕСТИТЬ ОбщиеДанные
				|ИЗ
				|	ВТ_СправкиАИБ КАК ВТ_СправкиАИБ
				|СГРУППИРОВАТЬ ПО
				|	ВТ_СправкиАИБ.АлкогольнаяПродукция,
				//|	ВТ_СправкиАИБ.СерияНоменклатуры,
				// |	ВТ_СправкиАИБ.СправкаА,
				|	ВТ_СправкиАИБ.СправкаБ
				|;
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ОбщиеДанные.АлкогольнаяПродукция,
				|	ОбщиеДанные.СправкаБ,
				//|	ОбщиеДанные.СерияНоменклатуры,
				//|	ОбщиеДанные.СправкаА,
				|	ОбщиеДанные.Количество КАК Количество
				|ИЗ
				|	ОбщиеДанные КАК ОбщиеДанные";
				
				Если ПроверкаЗадания <> 2 и ПроверкаЗадания <> 6 тогда
					Запрос.Текст = СтрЗаменить(Запрос.Текст,"ТаблицаМарок.СправкаБ","0 КАК СправкаБ");	
				КонецЕсли;
				
				Выборка = Запрос.Выполнить().Выбрать();
				Пока Выборка.Следующий() цикл
					НоваяСтрока = ТЗМарок.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
				КонецЦикла;	
				
			КонецЕсли;
			
		КонецЕсли;	
	КонецЦикла;
	
	Если ТЗМарок.Количество() > 0 Тогда
		ТЗМарок.Свернуть("АлкогольнаяПродукция,СправкаБ","Количество");
	Иначе
		Если ЭтоКороб Тогда
			// Информация об упаковках в регистре марок	
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Период", ?(ЗначениеЗаполнено(Период), Период, Неопределено));
			Запрос.УстановитьПараметр("Упаковка", ИдентификаторУпаковки);
			Запрос.Текст = "ВЫБРАТЬ
			|	алкХранилищеАкцизныхМарокСрезПоследних.АлкогольнаяПродукция,
			|	алкХранилищеАкцизныхМарокСрезПоследних.СправкаБ
			|ПОМЕСТИТЬ ТаблицаМарок
			|ИЗ
			|	РегистрСведений.алкХранилищеАкцизныхМарок.СрезПоследних(&Период, Упаковка = &Упаковка) КАК алкХранилищеАкцизныхМарокСрезПоследних
			|ГДЕ
			|	алкХранилищеАкцизныхМарокСрезПоследних.ОтметкаВыбытия = ЛОЖЬ
			|	И алкХранилищеАкцизныхМарокСрезПоследних.АлкогольнаяПродукция <> ЗНАЧЕНИЕ(Справочник.алкКлассификаторАлкогольнойПродукцииЕГАИС.ПустаяСсылка)
			|;
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТаблицаМарок.АлкогольнаяПродукция,
			|	ТаблицаМарок.СправкаБ,
			//|	ЕСТЬNULL(алкСоответствияСправокАиБЕГАИСИСерий.СерияНоменклатуры,ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)) КАК СерияНоменклатуры,
			//|	ЕСТЬNULL(алкСоответствияСправокАиБЕГАИСИСерий.СправкаА,ЗНАЧЕНИЕ(Справочник.алкКлассификаторСправокАиБ.ПустаяСсылка)) КАК СправкаА,
			|	1 КАК Количество
			|ПОМЕСТИТЬ ВТ_СправкиАИБ
			|ИЗ
			|	ТаблицаМарок КАК ТаблицаМарок
			//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алкСоответствияСправокАиБЕГАИСИСерий КАК алкСоответствияСправокАиБЕГАИСИСерий
			//|		ПО ТаблицаМарок.СправкаБ = алкСоответствияСправокАиБЕГАИСИСерий.СправкаБ
			|;				
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_СправкиАИБ.АлкогольнаяПродукция,
			|	ВТ_СправкиАИБ.СправкаБ,
			//|	ВТ_СправкиАИБ.СерияНоменклатуры,
			//|	ВТ_СправкиАИБ.СправкаА,
			|	СУММА(ВТ_СправкиАИБ.Количество) КАК Количество
			|ПОМЕСТИТЬ ОбщиеДанные
			|ИЗ
			|	ВТ_СправкиАИБ КАК ВТ_СправкиАИБ
			|СГРУППИРОВАТЬ ПО
			|	ВТ_СправкиАИБ.АлкогольнаяПродукция,
			//|	ВТ_СправкиАИБ.СерияНоменклатуры,
			//|	ВТ_СправкиАИБ.СправкаА,
			|	ВТ_СправкиАИБ.СправкаБ
			|;
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	ОбщиеДанные.АлкогольнаяПродукция,
			|	ОбщиеДанные.СправкаБ,
			//|	ОбщиеДанные.СерияНоменклатуры,
			//|	ОбщиеДанные.СправкаА,
			|	ОбщиеДанные.Количество КАК Количество
			|ИЗ
			|	ОбщиеДанные КАК ОбщиеДанные";
			
			Если ПроверкаЗадания <> 2 И ПроверкаЗадания <> 6 Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст,"ТаблицаМарок.СправкаБ","0 КАК СправкаБ");	
			КонецЕсли;
			
			ТЗМарок = Запрос.Выполнить().Выгрузить();	
		КонецЕсли;	
	КонецЕсли;
	
	Возврат ТЗМарок;
	
КонецФункции
Функция ПолучитьТаблицуКоличестваМарок(ИдентификаторУпаковки, ВыводитьУпаковкуВРезультат = Истина, ЭтоКороб = Ложь) Экспорт 
	
	ТЗМарок = Новый Массив;
	
	Если ИдентификаторУпаковки = "" Тогда
		Возврат ТЗМарок;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Если ЭтоКороб Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ алкХранилищеАкцизныхМарок.Марка) КАК Количество,
		|	алкХранилищеАкцизныхМарок.АлкогольнаяПродукция,
		|	алкХранилищеАкцизныхМарок.СправкаБ
		|ИЗ
		|	РегистрСведений.алкХранилищеАкцизныхМарок.СрезПоследних(
		|			&ДатаЗапроса,
		|			Упаковка = &Упаковка) КАК алкХранилищеАкцизныхМарок
		|
		//	|ГДЕ
		//	|	алкХранилищеАкцизныхМарок.ОтметкаВыбытия = ЛОЖЬ
		|СГРУППИРОВАТЬ ПО
		|	алкХранилищеАкцизныхМарок.СправкаБ,
		|	алкХранилищеАкцизныхМарок.АлкогольнаяПродукция";
		
	Иначе
		
		Запрос.Текст =
		//ВЫБИРАЕМ ПОСЛЕДНИЙ РЕГИСТРАТОР СФОРМИРОВАВШИЙ ПАЛЕТУ
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	алкХранилищеУпаковок.Регистратор КАК Регистратор,
		|	алкХранилищеУпаковок.Период КАК Период
		|ПОМЕСТИТЬ ТабРегистраторы
		|ИЗ
		|	РегистрСведений.алкХранилищеУпаковок.СрезПоследних(
		|			&ДатаЗапроса, 
		|			Упаковка = &Упаковка) КАК алкХранилищеУпаковок
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ
		|;
		|
		//ВЫБИРАЕМ УПАКОВКИ ПО ПОСЛЕДНЕМУ РЕГИСТРАТОРУ
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алкХранилищеУпаковок.Упаковка КАК Упаковка
		|ПОМЕСТИТЬ ТабУпаковок
		|ИЗ
		|	РегистрСведений.алкХранилищеУпаковок.СрезПоследних(
		|			&ДатаЗапроса,
		|			ИерархияУпаковки = &Упаковка
		|				И Регистратор В
		|					(ВЫБРАТЬ
		|						ТабРегистраторы.Регистратор
		|					ИЗ
		|						ТабРегистраторы КАК ТабРегистраторы)) КАК алкХранилищеУпаковок
		|;
		|
		//ВЫБИРАЕМ МАРКИ УПАКОВОК ПОСЛЕДНЕГО РЕГИСТРАТОРА
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алкХранилищеАкцизныхМарок.Марка КАК Марка,
		|	алкХранилищеАкцизныхМарок.Упаковка КАК Упаковка,
		|	алкХранилищеАкцизныхМарок.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
		|	алкХранилищеАкцизныхМарок.СправкаБ КАК СправкаБ
		|ПОМЕСТИТЬ ДанныеУпаковок
		|ИЗ
		|	РегистрСведений.алкХранилищеАкцизныхМарок.СрезПоследних(
		|			&ДатаЗапроса,
		|			Упаковка В
		|				(ВЫБРАТЬ
		|					ТабУпаковок.Упаковка
		|				ИЗ
		|					ТабУпаковок КАК ТабУпаковок)) КАК алкХранилищеАкцизныхМарок
		|ГДЕ
		|	алкХранилищеАкцизныхМарок.ОтметкаВыбытия = ЛОЖЬ
		|;
		|
		//ВЫБИРАЕМ КОЛИЧЕСТВО МАРОК УПАКОВОК ПОСЛЕДНЕГО РЕГИСТРАТОРА
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДанныеУпаковок.Марка) КАК Количество,
		|	ДанныеУпаковок.Упаковка КАК Упаковка,
		|	ДанныеУпаковок.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
		|	ДанныеУпаковок.СправкаБ КАК СправкаБ
		|ИЗ
		|	ДанныеУпаковок КАК ДанныеУпаковок
		|СГРУППИРОВАТЬ ПО
		|	ДанныеУпаковок.Упаковка,
		|	ДанныеУпаковок.СправкаБ,
		|	ДанныеУпаковок.АлкогольнаяПродукция";
		
	КонецЕсли;
	
	Если Не ВыводитьУпаковкуВРезультат И Не ЭтоКороб Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "алкХранилищеАкцизныхМарок.Упаковка", """""");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Упаковка", ИдентификаторУпаковки);
	Запрос.УстановитьПараметр("ДатаЗапроса", ТекущаяДата());
	
	ТЗМарок = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗМарок;
	
КонецФункции
Функция ПолучитьТаблицуУпакованногоТовара_УпаковочногоЛиста(ИдентификаторУпаковки = "") Экспорт 
	
	Если Лев(ИдентификаторУпаковки,3) = "UPL" Тогда 
		КодУпакЛиста = Прав(ИдентификаторУпаковки,СтрДлина(ИдентификаторУпаковки)-3); 
	Иначе     
		КодУпакЛиста = ИдентификаторУпаковки; 
	КонецЕсли; 
	
	Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ 
	|     ДатаМобайл_УпаковочныйЛистТовары.ЕГАИС_Номенклатура КАК АлкогольнаяПродукция,
	|     ДатаМобайл_УпаковочныйЛистТовары.Номенклатура КАК Номенклатура,
	|     ДатаМобайл_УпаковочныйЛистТовары.СправкаБ КАК СправкаБ, 
	|     СУММА(ДатаМобайл_УпаковочныйЛистТовары.Количество) КАК Количество 
	|ИЗ 
	|     Документ.ДатаМобайл_УпаковочныйЛист.Товары КАК ДатаМобайл_УпаковочныйЛистТовары 
	|ГДЕ 
	|     ДатаМобайл_УпаковочныйЛистТовары.Количество > 0 
	|     И (ДатаМобайл_УпаковочныйЛистТовары.Ссылка.Код = &КодУпакЛиста)
	| 
	|СГРУППИРОВАТЬ ПО 
	|     ДатаМобайл_УпаковочныйЛистТовары.ЕГАИС_Номенклатура,
	|     ДатаМобайл_УпаковочныйЛистТовары.Номенклатура,
	|     ДатаМобайл_УпаковочныйЛистТовары.СправкаБ"; 
	
	// искать по коду, если по коду нет - искать по номеру, где код не пустой
	
	Запрос.УстановитьПараметр("КодУпакЛиста", КодУпакЛиста); 		
	Рез = Запрос.Выполнить().Выгрузить(); 
	
	Если Рез.Количество() = 0 Тогда
		Рез = "";
		Запрос.Текст = "ВЫБРАТЬ 
		|     ДатаМобайл_УпаковочныйЛистТовары.ЕГАИС_Номенклатура КАК АлкогольнаяПродукция,
		|     ДатаМобайл_УпаковочныйЛистТовары.Номенклатура КАК Номенклатура,
		|     ДатаМобайл_УпаковочныйЛистТовары.СправкаБ КАК СправкаБ, 
		|     СУММА(ДатаМобайл_УпаковочныйЛистТовары.Количество) КАК Количество 
		|ИЗ 
		|     Документ.ДатаМобайл_УпаковочныйЛист.Товары КАК ДатаМобайл_УпаковочныйЛистТовары 
		|ГДЕ 
		|     ДатаМобайл_УпаковочныйЛистТовары.Количество > 0 
		|     И (ДатаМобайл_УпаковочныйЛистТовары.Ссылка.Номер = &КодУпакЛиста)
		|	   И  ДатаМобайл_УпаковочныйЛистТовары.Ссылка.Код = """"
		| 
		|СГРУППИРОВАТЬ ПО 
		|     ДатаМобайл_УпаковочныйЛистТовары.ЕГАИС_Номенклатура,
		|     ДатаМобайл_УпаковочныйЛистТовары.Номенклатура,
		|     ДатаМобайл_УпаковочныйЛистТовары.СправкаБ"; 
		
		Запрос.УстановитьПараметр("КодУпакЛиста", КодУпакЛиста); 		
		Рез = Запрос.Выполнить().Выгрузить(); 	
	КонецЕсли;
	
	Возврат  Рез;
	
КонецФункции
Функция ПланРавноФактЕГАИС(Док)
	
	ДокТЧ = ПолучитьТЧДокументаЕГАИС(Док);
	
	Если ДокТЧ.Количество() > 0 Тогда
		Для каждого Стр Из ДокТЧ Цикл
			Если Стр.План <> Стр.Факт Тогда
				Возврат Ложь;
			КонецЕсли;			
		КонецЦикла;				
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции
Функция ПолучитьТЧДокументаЕГАИС(Док)
	
	Если ТипЗнч(Док) = Тип("СправочникСсылка.ДатаМобайл_ДокументыТСД_ЕГАИС")
		Или ТипЗнч(Док) = Тип("СправочникОбъект.ДатаМобайл_ДокументыТСД_ЕГАИС") Тогда
		#Область ДокументТСД_ЕГАИС
		Если Док.Шаблон.ЕГАИС Тогда
			Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
			|	СУММА(ВложенныйЗапрос.План) КАК План,
			|	СУММА(ВложенныйЗапрос.Факт) КАК Факт,
			|	СУММА(-ВложенныйЗапрос.План + ВложенныйЗапрос.Факт) КАК Расхождения,
			|	ВложенныйЗапрос.ТипСтроки
			|ПОМЕСТИТЬ ВременнаяТаблица
			|ИЗ
			|	(ВЫБРАТЬ
			|		СобранныеДанныеПодбор.НоменклатураЕГАИС КАК Номенклатура,
			|		0 КАК План,
			|		СобранныеДанныеПодбор.Количество КАК Факт,
			|		""Подбор"" КАК ТипСтроки,
			|		"""" КАК Название
			|	ИЗ
			|		Справочник.ДатаМобайл_ДокументыТСД_ЕГАИС.СобранныеДанныеПодбор КАК СобранныеДанныеПодбор
			|	ГДЕ
			|		СобранныеДанныеПодбор.Ссылка = &Ссылка
			|	
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		ТаблицаДокумента1СПодбор.АлкогольнаяПродукция,
			|		ТаблицаДокумента1СПодбор.Количество,
			|		0,
			|		""Подбор"",
			|		""""
			|	ИЗ
			|		Документ.алкТоварноТранспортнаяНакладнаяЕГАИС.Товары КАК ТаблицаДокумента1СПодбор 
			|			
			|	ГДЕ
			|		ТаблицаДокумента1СПодбор.Ссылка = &ИсходныйДокумент) КАК ВложенныйЗапрос
			|
			|СГРУППИРОВАТЬ ПО
			|	ВложенныйЗапрос.ТипСтроки,
			|	ВложенныйЗапрос.Номенклатура
			|
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВременнаяТаблица.ТипСтроки,
			|	ВременнаяТаблица.Номенклатура КАК Номенклатура,
			|	ВременнаяТаблица.План,
			|	ВременнаяТаблица.Факт,
			|	ВременнаяТаблица.Расхождения
			|ИЗ
			|	ВременнаяТаблица КАК ВременнаяТаблица
			|ГДЕ
			|	ВременнаяТаблица.План-ВременнаяТаблица.Факт<>0
			|	И 1=1
			|"); 	
			
			Запрос.Текст=СтрЗаменить(Запрос.Текст,"Документ.алкТоварноТранспортнаяНакладнаяЕГАИС.Товары КАК ТаблицаДокумента1СПодбор","Документ."+Док.Шаблон.ВидДокумента+"."+Док.Шаблон.ИмяТабличнойЧастиПодбор+" КАК ТаблицаДокумента1СПодбор");							
			
			Если Док.Шаблон.ГрупповаяРабота И Док.ДатаЗавершения=Дата(1,1,1)  Тогда
				Запрос.Текст=СтрЗаменить(Запрос.Текст,"Справочник.ДатаМобайл_ДокументыТСД_ЕГАИС.СобранныеДанныеПодбор","РегистрСведений.ДатаМобайл_СтрокиГрупповыхДокументов");
				Запрос.Текст=СтрЗаменить(Запрос.Текст,"СобранныеДанныеПодбор.Ссылка = &Ссылка","СобранныеДанныеПодбор.ДокументТСД = &Ссылка И НЕ СобранныеДанныеПодбор.ДляОбмена И  СобранныеДанныеПодбор.ИмяТаблицы = ""Select""");
			КонецЕсли;			
			
			Если Док.Шаблон.ВидДокумента = "ДатаМобайл_УпаковочныйЛист" Или Док.Шаблон.ВидДокумента = "ДатаМобайл_ЗаявкаНаСклад" Тогда	
				Запрос.Текст=СтрЗаменить(Запрос.Текст,"ТаблицаДокумента1СПодбор.АлкогольнаяПродукция","ТаблицаДокумента1СПодбор.ЕГАИС_Номенклатура");
			ИначеЕсли Док.Шаблон.ВидДокумента = "алкАктФиксацииШтрихкодовНаБалансеОрганизацииЕГАИС" Тогда	
				Запрос.Текст=СтрЗаменить(Запрос.Текст,"ТаблицаДокумента1СПодбор.Количество","999");
			КонецЕсли;
			
			Если Док.Шаблон.ВидДокумента = "РеализацияТоваровУслуг" 
				Или Док.Шаблон.ВидДокумента = "ЗаказКлиента" 
				Или Док.Шаблон.ВидДокумента = "ПеремещениеТоваров"
				Или Док.Шаблон.ВидДокумента = "ПересчетТоваров"
				Или Док.Шаблон.ВидДокумента = "СписаниеНедостачТоваров" 
				Или Док.Шаблон.ВидДокумента = "ОрдерНаОтражениеНедостачТоваров"
				Или Док.Шаблон.ВидДокумента = "ВозвратТоваровПоставщику"
				Или Док.Шаблон.ПроверкаЗадания = 3 Или Док.Шаблон.ПроверкаЗадания = 6 Тогда				
				
				Запрос.Текст = "ВЫБРАТЬ
				|	ВложенныйЗапрос.ТипСтроки КАК ТипСтроки,
				|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
				|	СУММА(ВложенныйЗапрос.План) КАК План,
				|	СУММА(ВложенныйЗапрос.Факт) КАК Факт,
				|	СУММА(-ВложенныйЗапрос.План + ВложенныйЗапрос.Факт) КАК Расхождения
				|ПОМЕСТИТЬ ВременнаяТаблица
				|ИЗ
				|	(ВЫБРАТЬ
				|		СобранныеДанныеПодбор.Номенклатура КАК Номенклатура,
				|		0 КАК План,
				|		ВЫРАЗИТЬ(СобранныеДанныеПодбор.Количество * ВЫБОР
				|				КОГДА СобранныеДанныеПодбор.ЕдиницаИзмерения.Числитель ЕСТЬ NULL
				|					ТОГДА 1
				|				КОГДА СобранныеДанныеПодбор.ЕдиницаИзмерения.Числитель = 0
				|					ТОГДА 1
				|				ИНАЧЕ СобранныеДанныеПодбор.ЕдиницаИзмерения.Числитель
				|			КОНЕЦ КАК ЧИСЛО(19, 3)) КАК Факт,
				|		""Подбор"" КАК ТипСтроки
				|	ИЗ
				|		Справочник.ДатаМобайл_ДокументыТСД_ЕГАИС.СобранныеДанныеПодбор КАК СобранныеДанныеПодбор
				|	ГДЕ
				|		СобранныеДанныеПодбор.Ссылка = &Ссылка
				|	
				|	ОБЪЕДИНИТЬ ВСЕ
				|	
				|	ВЫБРАТЬ
				|		ТаблицаДокумента1СПодбор.Номенклатура,
				|		ТаблицаДокумента1СПодбор.Количество,
				|		0,
				|		""Подбор""
				|	ИЗ
				|		Документ.РеализацияТоваровУслуг.Товары КАК ТаблицаДокумента1СПодбор
				|	ГДЕ
				|		ТаблицаДокумента1СПодбор.Ссылка = &ИсходныйДокумент) КАК ВложенныйЗапрос
				|
				|СГРУППИРОВАТЬ ПО
				|	ВложенныйЗапрос.ТипСтроки,
				|	ВложенныйЗапрос.Номенклатура
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ВременнаяТаблица.ТипСтроки,
				|	ВременнаяТаблица.Номенклатура,
				|	ВременнаяТаблица.План,
				|	ВременнаяТаблица.Факт,
				|	ВременнаяТаблица.Расхождения
				|ИЗ
				|	ВременнаяТаблица КАК ВременнаяТаблица
				|ГДЕ
				|	ВременнаяТаблица.План-ВременнаяТаблица.Факт<>0
				|	И 1=1
				|";
				
				Запрос.Текст=СтрЗаменить(Запрос.Текст,"Документ.РеализацияТоваровУслуг.Товары КАК ТаблицаДокумента1СПодбор","Документ."+Док.Шаблон.ВидДокумента+"."+Док.Шаблон.ИмяТабличнойЧастиПодбор+" КАК ТаблицаДокумента1СПодбор");							
				
				Если Док.Шаблон.ГрупповаяРабота И Док.ДатаЗавершения=Дата(1,1,1) Тогда
					Запрос.Текст=СтрЗаменить(Запрос.Текст,"Справочник.ДатаМобайл_ДокументыТСД_ЕГАИС.СобранныеДанныеПодбор","РегистрСведений.ДатаМобайл_СтрокиГрупповыхДокументов");
					Запрос.Текст=СтрЗаменить(Запрос.Текст,"СобранныеДанныеПодбор.Ссылка = &Ссылка","СобранныеДанныеПодбор.ДокументТСД = &Ссылка И НЕ СобранныеДанныеПодбор.ДляОбмена И  СобранныеДанныеПодбор.ИмяТаблицы = ""Select""");
				КонецЕсли;				
			КонецЕсли;
		КонецЕсли;
		#КонецОбласти
	Иначе
		#Область ДокументТСД 
		Если Док.Шаблон.Егаис Тогда
			Если Лев(Док.Шаблон.ВидДокумента, 3) = "алк" Тогда
				Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
				|	СУММА(ВложенныйЗапрос.План) КАК План,
				|	СУММА(ВложенныйЗапрос.Факт) КАК Факт,
				|	СУММА(-ВложенныйЗапрос.План + ВложенныйЗапрос.Факт) КАК Расхождения,
				|	ВложенныйЗапрос.ТипСтроки
				|ПОМЕСТИТЬ ВременнаяТаблица
				|ИЗ
				|	(ВЫБРАТЬ
				|		СобранныеДанныеПодбор.НоменклатураЕГАИС КАК Номенклатура,
				|		0 КАК План,
				|		СобранныеДанныеПодбор.Количество КАК Факт,
				|		""Подбор"" КАК ТипСтроки,
				|		"""" КАК Название
				|	ИЗ
				|		Справочник.ДатаМобайл_ДокументыТСД_ЕГАИС.СобранныеДанныеПодбор КАК СобранныеДанныеПодбор
				|	ГДЕ
				|		СобранныеДанныеПодбор.Ссылка = &Ссылка
				|	
				|	
				|	ОБЪЕДИНИТЬ ВСЕ
				|	
				|	ВЫБРАТЬ
				|		ТаблицаДокумента1СПодбор.АлкогольнаяПродукция,
				|		ТаблицаДокумента1СПодбор.Количество,
				|		0,
				|		""Подбор"",
				|		""""
				|	ИЗ
				|		Документ.алкТоварноТранспортнаяНакладнаяЕГАИС.Товары КАК ТаблицаДокумента1СПодбор 
				|			
				|	ГДЕ
				|		ТаблицаДокумента1СПодбор.Ссылка = &ИсходныйДокумент) КАК ВложенныйЗапрос
				|
				|СГРУППИРОВАТЬ ПО
				|	ВложенныйЗапрос.ТипСтроки,
				|	ВложенныйЗапрос.Номенклатура
				|
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ВременнаяТаблица.ТипСтроки,
				|	ВременнаяТаблица.Номенклатура КАК Номенклатура,
				|	ВременнаяТаблица.План,
				|	ВременнаяТаблица.Факт,
				|	ВременнаяТаблица.Расхождения
				|ИЗ
				|	ВременнаяТаблица КАК ВременнаяТаблица
				|ГДЕ
				|	ВременнаяТаблица.План-ВременнаяТаблица.Факт<>0
				|	И 1=1
				|"); 	
				
				Запрос.Текст=СтрЗаменить(Запрос.Текст,"Документ.алкТоварноТранспортнаяНакладнаяЕГАИС.Товары КАК ТаблицаДокумента1СПодбор","Документ."+Док.Шаблон.ВидДокумента+"."+Док.Шаблон.ИмяТабличнойЧастиПодбор+" КАК ТаблицаДокумента1СПодбор");							
				
				Если Док.Шаблон.ГрупповаяРабота И Док.ДатаЗавершения=Дата(1,1,1)  Тогда
					Запрос.Текст=СтрЗаменить(Запрос.Текст,"Справочник.ДатаМобайл_ДокументыТСД_ЕГАИС.СобранныеДанныеПодбор","РегистрСведений.ДатаМобайл_СтрокиГрупповыхДокументов");
					Запрос.Текст=СтрЗаменить(Запрос.Текст,"СобранныеДанныеПодбор.Ссылка = &Ссылка","СобранныеДанныеПодбор.ДокументТСД = &Ссылка И НЕ СобранныеДанныеПодбор.ДляОбмена И  СобранныеДанныеПодбор.ИмяТаблицы = ""Select""");
				КонецЕсли;			
				
				Если Док.Шаблон.ВидДокумента = "ДатаМобайл_УпаковочныйЛист" Или Док.Шаблон.ВидДокумента = "ДатаМобайл_ЗаявкаНаСклад" Тогда	
					Запрос.Текст=СтрЗаменить(Запрос.Текст,"ТаблицаДокумента1СПодбор.АлкогольнаяПродукция","ТаблицаДокумента1СПодбор.ЕГАИС_Номенклатура");
				ИначеЕсли Док.Шаблон.ВидДокумента = "алкАктФиксацииШтрихкодовНаБалансеОрганизацииЕГАИС" Тогда	
					Запрос.Текст=СтрЗаменить(Запрос.Текст,"ТаблицаДокумента1СПодбор.Количество","999");
				КонецЕсли;
				
			Иначе				
				Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
				|	ВложенныйЗапрос.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
				|	СУММА(ВложенныйЗапрос.План) КАК План,
				|	СУММА(ВложенныйЗапрос.Факт) КАК Факт,
				|	СУММА(-ВложенныйЗапрос.План + ВложенныйЗапрос.Факт) КАК Расхождения,
				|	ВложенныйЗапрос.ТипСтроки
				|ПОМЕСТИТЬ ВременнаяТаблица
				|ИЗ
				|	(ВЫБРАТЬ
				|		ВЫБОР
				|			КОГДА СобранныеДанныеПодбор.НоменклатураЕГАИС ЕСТЬ NULL
				|					ИЛИ СобранныеДанныеПодбор.НоменклатураЕГАИС = ЗНАЧЕНИЕ(Справочник.КлассификаторАлкогольнойПродукцииЕГАИС.ПустаяСсылка)
				|				ТОГДА Товары.Номенклатура
				|			ИНАЧЕ СобранныеДанныеПодбор.НоменклатураЕГАИС
				|		КОНЕЦ КАК Номенклатура,
				|		СобранныеДанныеПодбор.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
				|		0 КАК План,
				|		СобранныеДанныеПодбор.Количество КАК Факт,
				|		""Подбор"" КАК ТипСтроки,
				|		"""" КАК Название
				|	ИЗ
				|		Справочник.ДатаМобайл_ДокументыТСД.СобранныеДанныеПодбор КАК СобранныеДанныеПодбор
				|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|				СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
				|				МАКСИМУМ(СоответствиеНоменклатурыЕГАИС.Номенклатура) КАК Номенклатура
				|			ИЗ
				|				РегистрСведений.СоответствиеНоменклатурыЕГАИС КАК СоответствиеНоменклатурыЕГАИС
				|			
				|			СГРУППИРОВАТЬ ПО
				|				СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция) КАК Товары
				|			ПО (Товары.АлкогольнаяПродукция = СобранныеДанныеПодбор.НоменклатураЕГАИС)
				|	ГДЕ
				|		СобранныеДанныеПодбор.Ссылка = &Ссылка
				|		И &УсловиеЕстьПодбор
				|	
				|	ОБЪЕДИНИТЬ ВСЕ
				|	
				|	ВЫБРАТЬ
				|		ВЫБОР
				|			КОГДА СобранныеДанныеПриемка.НоменклатураЕГАИС ЕСТЬ NULL
				|					ИЛИ СобранныеДанныеПриемка.НоменклатураЕГАИС = ЗНАЧЕНИЕ(Справочник.КлассификаторАлкогольнойПродукцииЕГАИС.ПустаяСсылка)
				|				ТОГДА Товары.Номенклатура
				|			ИНАЧЕ СобранныеДанныеПриемка.НоменклатураЕГАИС
				|		КОНЕЦ,
				|		СобранныеДанныеПриемка.ХарактеристикаНоменклатуры,
				|		0,
				|		СобранныеДанныеПриемка.Количество,
				|		""Размещение"",
				|		""""
				|	ИЗ
				|		Справочник.ДатаМобайл_ДокументыТСД.СобранныеДанныеПриемка КАК СобранныеДанныеПриемка
				|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|				СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
				|				МАКСИМУМ(СоответствиеНоменклатурыЕГАИС.Номенклатура) КАК Номенклатура
				|			ИЗ
				|				РегистрСведений.СоответствиеНоменклатурыЕГАИС КАК СоответствиеНоменклатурыЕГАИС
				|			
				|			СГРУППИРОВАТЬ ПО
				|				СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция) КАК Товары
				|			ПО (Товары.АлкогольнаяПродукция = СобранныеДанныеПриемка.НоменклатураЕГАИС)
				|	ГДЕ
				|		СобранныеДанныеПриемка.Ссылка = &Ссылка
				|		И &УсловиеЕстьПриемка
				|	
				|	ОБЪЕДИНИТЬ ВСЕ
				|	
				|	ВЫБРАТЬ
				|		ВЫБОР
				|			КОГДА ТаблицаДокумента1СПодбор.АлкогольнаяПродукция ЕСТЬ NULL
				|					ИЛИ ТаблицаДокумента1СПодбор.АлкогольнаяПродукция = ЗНАЧЕНИЕ(Справочник.КлассификаторАлкогольнойПродукцииЕГАИС.ПустаяСсылка)
				|				ТОГДА ТаблицаДокумента1СПодбор.Номенклатура
				|			ИНАЧЕ ТаблицаДокумента1СПодбор.АлкогольнаяПродукция
				|		КОНЕЦ,
				|		ТаблицаДокумента1СПодбор.Характеристика,
				|		ТаблицаДокумента1СПодбор.КоличествоУпаковок,
				|		0,
				|		""Подбор"",
				|		""""
				|	ИЗ
				|		Документ.АктПостановкиНаБалансЕГАИС.Товары КАК ТаблицаДокумента1СПодбор 
				|			
				|	ГДЕ
				|		&УсловиеЕстьПодбор
				|		И ТаблицаДокумента1СПодбор.Ссылка = &ИсходныйДокумент
				|	
				|	ОБЪЕДИНИТЬ ВСЕ
				|	
				|	ВЫБРАТЬ
				|		ВЫБОР
				|			КОГДА ТаблицаДокумента1СПриемка.АлкогольнаяПродукция ЕСТЬ NULL
				|					ИЛИ ТаблицаДокумента1СПриемка.АлкогольнаяПродукция = ЗНАЧЕНИЕ(Справочник.КлассификаторАлкогольнойПродукцииЕГАИС.ПустаяСсылка)
				|				ТОГДА ТаблицаДокумента1СПриемка.Номенклатура
				|			ИНАЧЕ ТаблицаДокумента1СПриемка.АлкогольнаяПродукция
				|		КОНЕЦ,
				|		ТаблицаДокумента1СПриемка.Характеристика,
				|		ТаблицаДокумента1СПриемка.КоличествоУпаковок,
				|		0,
				|		""Подбор"",
				|		""""
				|	ИЗ
				|		Документ.АктПостановкиНаБалансЕГАИС.Товары КАК ТаблицаДокумента1СПриемка
				|	ГДЕ
				|		&УсловиеЕстьПриемка
				|		И ТаблицаДокумента1СПриемка.Ссылка = &ИсходныйДокумент) КАК ВложенныйЗапрос
				|
				|СГРУППИРОВАТЬ ПО
				|	ВложенныйЗапрос.ТипСтроки,
				|	ВложенныйЗапрос.ХарактеристикаНоменклатуры,
				|	ВложенныйЗапрос.Номенклатура
				|
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ВременнаяТаблица.ТипСтроки,
				|	ВременнаяТаблица.Номенклатура КАК Номенклатура,
				|	ВременнаяТаблица.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
				|	ВременнаяТаблица.План,
				|	ВременнаяТаблица.Факт,
				|	ВременнаяТаблица.Расхождения
				|ИЗ
				|	ВременнаяТаблица КАК ВременнаяТаблица
				|ГДЕ
				|	ВременнаяТаблица.План-ВременнаяТаблица.Факт<>0
				|	И 1=1
				|");	
				
				Если Док.Шаблон.ИспользоватьПодбор Тогда
					Запрос.Текст=СтрЗаменить(Запрос.Текст,"Документ.АктПостановкиНаБалансЕГАИС.Товары КАК ТаблицаДокумента1СПодбор","Документ."+Док.Шаблон.ВидДокумента+"."+Док.Шаблон.ИмяТабличнойЧастиПодбор+" КАК ТаблицаДокумента1СПодбор");
				КонецЕсли;	
				
				Если Док.Шаблон.ИспользоватьПриемку Тогда
					Запрос.Текст=СтрЗаменить(Запрос.Текст,"Документ.АктПостановкиНаБалансЕГАИС.Товары КАК ТаблицаДокумента1СПриемка","Документ."+Док.Шаблон.ВидДокумента+"."+Док.Шаблон.ИмяТабличнойЧастиПриемка+" КАК ТаблицаДокумента1СПриемка");
				КонецЕсли; 
				
				Если Док.Шаблон.ВидДокумента = "ОстаткиЕГАИС"  ИЛИ Док.Шаблон.ВидДокумента = "ТТНВходящаяЕГАИС" ИЛИ Док.Шаблон.ВидДокумента = "ТТНИсходящаяЕГАИС" Тогда
					Запрос.Текст=СтрЗаменить(Запрос.Текст, "ТаблицаДокумента1СПодбор.КоличествоУпаковок", "ТаблицаДокумента1СПодбор.Количество");	
					Запрос.Текст=СтрЗаменить(Запрос.Текст, "ТаблицаДокумента1СПриемка.КоличествоУпаковок", "ТаблицаДокумента1СПриемка.Количество");
					Запрос.Текст=СтрЗаменить(Запрос.Текст, "ТаблицаДокумента1СПодбор.Номенклатура", "ТаблицаДокумента1СПодбор.АлкогольнаяПродукция");	
					Запрос.Текст=СтрЗаменить(Запрос.Текст, "ТаблицаДокумента1СПриемка.Номенклатура", "ТаблицаДокумента1СПриемка.АлкогольнаяПродукция");
				КонецЕсли;
			КонецЕсли;
			
		Иначе
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ИтоговаяТаблица.Номенклатура КАК Номенклатура,
			|	ИтоговаяТаблица.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			|	СУММА(ИтоговаяТаблица.План) КАК План,
			|	СУММА(ИтоговаяТаблица.Факт) КАК Факт,
			|	СУММА(ИтоговаяТаблица.Расхождения) КАК Расхождения,
			|	ИтоговаяТаблица.ТипСтроки
			|ПОМЕСТИТЬ ВременнаяТаблица
			|ИЗ
			|	(ВЫБРАТЬ
			|		ВложенныйЗапрос.Номенклатура КАК Номенклатура,
			|		ЕСТЬNULL(ВложенныйЗапрос.ХарактеристикаНоменклатуры, """") КАК ХарактеристикаНоменклатуры,
			|		СУММА(ВложенныйЗапрос.План) КАК План,
			|		СУММА(ВложенныйЗапрос.Факт) КАК Факт,
			|		СУММА(-ВложенныйЗапрос.План + ВложенныйЗапрос.Факт) КАК Расхождения,
			|		ВложенныйЗапрос.ТипСтроки КАК ТипСтроки,
			|		ВложенныйЗапрос.Название КАК Название
			|	ИЗ
			|		(ВЫБРАТЬ
			|			СобранныеДанныеПодбор.Номенклатура КАК Номенклатура,
			|			ЕСТЬNULL(СобранныеДанныеПодбор.ХарактеристикаНоменклатуры, """") КАК ХарактеристикаНоменклатуры,
			|			0 КАК План,
			|			СобранныеДанныеПодбор.Количество * ЕСТЬNULL(ВЫБОР КОГДА ЕСТЬNULL(СобранныеДанныеПодбор.ЕдиницаИзмерения.Числитель,1) = 0 ТОГДА 1 ИНАЧЕ ЕСТЬNULL(СобранныеДанныеПодбор.ЕдиницаИзмерения.Числитель,1) КОНЕЦ/ 
			|	         		   									ВЫБОР КОГДА ЕСТЬNULL(СобранныеДанныеПодбор.ЕдиницаИзмерения.Знаменатель,1) = 0 ТОГДА 1 ИНАЧЕ ЕСТЬNULL(СобранныеДанныеПодбор.ЕдиницаИзмерения.Знаменатель,1) КОНЕЦ, 1) КАК Факт,
			|			""Подбор"" КАК ТипСтроки,
			|			"""" КАК Название
			|		ИЗ
			|			Справочник.ДатаМобайл_ДокументыТСД.СобранныеДанныеПодбор КАК СобранныеДанныеПодбор
			|		ГДЕ
			|			СобранныеДанныеПодбор.Ссылка = &Ссылка
			|			И &УсловиеЕстьПодбор
			|		
			|		ОБЪЕДИНИТЬ ВСЕ
			|		
			|		ВЫБРАТЬ
			|			СобранныеДанныеПриемка.Номенклатура,
			|			ЕСТЬNULL(СобранныеДанныеПриемка.ХарактеристикаНоменклатуры, """"),
			|			0,
			|			СобранныеДанныеПриемка.Количество*СобранныеДанныеПриемка.ЕдиницаИзмерения.Числитель,
			|			""Размещение"",
			|			""""
			|		ИЗ
			|			Справочник.ДатаМобайл_ДокументыТСД.СобранныеДанныеПриемка КАК СобранныеДанныеПриемка
			|		ГДЕ
			|			СобранныеДанныеПриемка.Ссылка = &Ссылка
			|			И &УсловиеЕстьПриемка
			|		
			|		ОБЪЕДИНИТЬ ВСЕ
			|		
			|		ВЫБРАТЬ
			|			ТаблицаДокумента1СПодбор.Номенклатура,
			|			ЕСТЬNULL(ТаблицаДокумента1СПодбор.Характеристика, """"),
			|			ВЫБОР КОГДА ЕстьNULL(ТаблицаДокумента1СПодбор.Количество,0) = 0 
			|				ТОГДА ТаблицаДокумента1СПодбор.КоличествоУпаковок	
			|				ИНАЧЕ ЕстьNULL(ТаблицаДокумента1СПодбор.Количество,0) 
			|			КОНЕЦ,
			|			0,
			|			""Подбор"",
			|			""""
			|		ИЗ
			|			Документ.ПриходныйОрдерНаТовары.Товары КАК ТаблицаДокумента1СПодбор
			|		ГДЕ
			|			&УсловиеЕстьПодбор
			|			И ТаблицаДокумента1СПодбор.Ссылка = &ИсходныйДокумент
			|		
			|		ОБЪЕДИНИТЬ ВСЕ
			|		
			|		ВЫБРАТЬ
			|			ТаблицаДокумента1СПриемка.Номенклатура,
			|			ТаблицаДокумента1СПриемка.Характеристика,
			|			ВЫБОР КОГДА ЕстьNULL(ТаблицаДокумента1СПриемка.Количество,0) = 0 
			|				ТОГДА ТаблицаДокумента1СПриемка.КоличествоУпаковок	
			|				ИНАЧЕ ЕстьNULL(ТаблицаДокумента1СПриемка.Количество,0) 
			|			КОНЕЦ,
			|			0,
			|			""Размещение"",
			|			""""
			|		ИЗ
			|			Документ.ПриходныйОрдерНаТовары.Товары КАК ТаблицаДокумента1СПриемка
			|		ГДЕ
			|			&УсловиеЕстьПриемка
			|			И ТаблицаДокумента1СПриемка.Ссылка = &ИсходныйДокумент) КАК ВложенныйЗапрос
			|	
			|	СГРУППИРОВАТЬ ПО
			|		ВложенныйЗапрос.ТипСтроки,
			|		ВложенныйЗапрос.ХарактеристикаНоменклатуры,
			|		ВложенныйЗапрос.Номенклатура,
			|		ВложенныйЗапрос.Название) КАК ИтоговаяТаблица
			|
			|СГРУППИРОВАТЬ ПО
			|	ИтоговаяТаблица.ТипСтроки,
			|	ИтоговаяТаблица.ХарактеристикаНоменклатуры,
			|	ИтоговаяТаблица.Номенклатура
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВременнаяТаблица.Номенклатура КАК Номенклатура,
			|	ВременнаяТаблица.План КАК План,
			|	ВременнаяТаблица.Факт КАК Факт,
			|	ВременнаяТаблица.Расхождения КАК Расхождения,
			|	ВременнаяТаблица.ТипСтроки КАК ТипСтроки
			|ИЗ
			|	ВременнаяТаблица КАК ВременнаяТаблица
			|ГДЕ
			|	ВременнаяТаблица.План-ВременнаяТаблица.Факт<>0
			|";
			
			Если Док.Шаблон.ИспользоватьПодбор Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст,"Документ.ПриходныйОрдерНаТовары.Товары КАК ТаблицаДокумента1СПодбор","Документ."+Док.Шаблон.ВидДокумента+"."+Док.Шаблон.ИмяТабличнойЧастиПодбор+" КАК ТаблицаДокумента1СПодбор");
			КонецЕсли;
			
			Если Док.Шаблон.ИспользоватьПриемку Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст,"Документ.ПриходныйОрдерНаТовары.Товары КАК ТаблицаДокумента1СПриемка","Документ."+Док.Шаблон.ВидДокумента+"."+Док.Шаблон.ИмяТабличнойЧастиПриемка+" КАК ТаблицаДокумента1СПриемка");
			КонецЕсли;		
			
			Если Док.Шаблон.ВидДокумента ="УстановкаЦенНоменклатуры" Или Док.Шаблон.ВидДокумента ="ПрименениеЦенНоменклатуры" Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст,"ТаблицаДокумента1СПодбор.КоличествоУпаковок",999);
				Запрос.Текст = СтрЗаменить(Запрос.Текст,"ТаблицаДокумента1СПриемка.КоличествоУпаковок",999);
				
				Запрос.Текст = СтрЗаменить(Запрос.Текст,"ТаблицаДокумента1СПодбор.Количество",999);
				Запрос.Текст = СтрЗаменить(Запрос.Текст,"ТаблицаДокумента1СПриемка.Количество",999);
			КонецЕсли;
			
			Если Док.Шаблон.ГрупповаяРабота И Док.ДатаЗавершения=Дата(1,1,1) Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст,"Справочник.ДатаМобайл_ДокументыТСД.СобранныеДанныеПодбор","РегистрСведений.ДатаМобайл_СтрокиГрупповыхДокументов");
				Запрос.Текст = СтрЗаменить(Запрос.Текст,"СобранныеДанныеПодбор.Ссылка = &Ссылка","СобранныеДанныеПодбор.ДокументТСД = &Ссылка И НЕ СобранныеДанныеПодбор.ДляОбмена И  СобранныеДанныеПодбор.ИмяТаблицы = ""Select""");
				Запрос.Текст = СтрЗаменить(Запрос.Текст,"Справочник.ДатаМобайл_ДокументыТСД.СобранныеДанныеПриемка","РегистрСведений.ДатаМобайл_СтрокиГрупповыхДокументов");
				Запрос.Текст = СтрЗаменить(Запрос.Текст,"СобранныеДанныеПриемка.Ссылка = &Ссылка","СобранныеДанныеПриемка.ДокументТСД = &Ссылка И НЕ СобранныеДанныеПриемка.ДляОбмена И  СобранныеДанныеПриемка.ИмяТаблицы = ""Insert""");
			КонецЕсли;
		КонецЕсли; 
		
		Запрос.УстановитьПараметр("УсловиеЕстьПодбор" , Док.Шаблон.ИспользоватьПодбор);
		Запрос.УстановитьПараметр("УсловиеЕстьПриемка", Док.Шаблон.ИспользоватьПриемку);
		#КонецОбласти
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ИсходныйДокумент"  , Док.ИсходныйДокумент);
	Запрос.УстановитьПараметр("Ссылка"            , Док.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();	
	Возврат РезультатЗапроса;  
	
КонецФункции
Функция ПолучитьНоменклатуруПоЕГАИС_ОПТ(НоменклатураЕГАИС, PDFBarcode = "", ВернутьМассив = Ложь) Экспорт    	
	
	ТекТовар = Справочники.Номенклатура.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(PDFBarcode) Тогда 
		ДанныеНоменклатурыПоМарке = ПолучитьНоменклатуруАкцизнойМарки(PDFBarcode);
		
		Если ДанныеНоменклатурыПоМарке.Количество() > 0 Тогда
			Возврат ДанныеНоменклатурыПоМарке[0].Номенклатура;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекТовар) Тогда
		Запрос = Новый Запрос;		
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СоответствиеНоменклатурыЕГАИС.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ СписокНоменклатуры	
		|ИЗ
		|	РегистрСведений.алкСоответствияАлкогольнойПродукцииЕГАИСИНоменклатуры КАК СоответствиеНоменклатурыЕГАИС
		|ГДЕ
		|	СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция = &НоменклатураЕГАИС
		|;
		|ВЫБРАТЬ
		|	СписокНоменклатуры.Номенклатура КАК Номенклатура,
		|	ЕстьNULL(Сумма(ЕстьNULL(ОстаткиТоваров.ВНаличииОстаток,0)),0) КАК КоличествоОстаток
		|ПОМЕСТИТЬ СписокНоменклатурыОстатки
		|ИЗ
		|	СписокНоменклатуры КАК СписокНоменклатуры
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки КАК ОстаткиТоваров
		|		ПО ОстаткиТоваров.Номенклатура = СписокНоменклатуры.Номенклатура 
		//|		И  (ОстаткиТоваров.Склад = &Склад ИЛИ &ВсеСклады)
		|СГРУППИРОВАТЬ ПО
		|	СписокНоменклатуры.Номенклатура
		|;
		|ВЫБРАТЬ
		|	СписокНоменклатурыОстатки.Номенклатура КАК Номенклатура
		|ИЗ
		|	СписокНоменклатурыОстатки КАК СписокНоменклатурыОстатки
		|УПОРЯДОЧИТЬ ПО 
		|	СписокНоменклатурыОстатки.КоличествоОстаток УБЫВ";
		
		Запрос.УстановитьПараметр("НоменклатураЕГАИС",НоменклатураЕГАИС);
	
		Если ВернутьМассив Тогда
			Возврат Запрос.Выполнить().Выгрузить();
		Иначе
			Рез = Запрос.Выполнить().Выбрать();
			Если Рез.Следующий() Тогда
				Возврат	Рез.Номенклатура;
			КонецЕсли;
		КонецЕсли;		
	КонецЕсли;
	
	Возврат  ТекТовар;
	
КонецФункции
Функция ПолучитьЕГАИСПоНоменклатуреОПТ(Номенклатура, Серия = Неопределено) Экспорт    	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1 
	|	СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция КАК АлкогольнаяПродукция
	|ИЗ
	|	РегистрСведений.алкСоответствияАлкогольнойПродукцииЕГАИСИНоменклатуры КАК СоответствиеНоменклатурыЕГАИС
	|ГДЕ
	|	СоответствиеНоменклатурыЕГАИС.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	
	Если Серия <> Неопределено Тогда
		Запрос.Текст = Запрос.Текст + " И СоответствиеНоменклатурыЕГАИС.СерияНоменклатуры = &Серия"; 
		Запрос.УстановитьПараметр("Серия",Серия);		
	КонецЕсли;
		
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() тогда
		ТекТовар = Рез.АлкогольнаяПродукция;
		Возврат ТекТовар; 
	КонецЕсли;
	
	ТекТовар = Справочники.алкКлассификаторАлкогольнойПродукцииЕГАИС.ПустаяСсылка();
	Возврат ТекТовар;
	
КонецФункции
Функция ПолучитьНоменклатуруПоУпаковкеЕГАИС_ОПТ(НоменклатураЕГАИС, ИдентификаторУпаковки="") Экспорт
	ТекТовар = Справочники.Номенклатура.ПустаяСсылка();

	МассивМарок = Новый Массив;
	Если ТипЗнч(ИдентификаторУпаковки) = Тип("Строка") Тогда
		МассивМарок.Добавить(ИдентификаторУпаковки);
	Иначе
		МассивМарок = ИдентификаторУпаковки;
	КонецЕсли;
	
	//Информация об упаковках в регистре марок	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", Неопределено);
	Запрос.УстановитьПараметр("СписокМарок", МассивМарок);
	Запрос.Текст = "ВЫБРАТЬ
				   |	алкХранилищеАкцизныхМарокСрезПоследних.АлкогольнаяПродукция,
				   |	алкХранилищеАкцизныхМарокСрезПоследних.СправкаБ
				   |ПОМЕСТИТЬ ТаблицаМарок
				   |ИЗ
				   |	РегистрСведений.алкХранилищеАкцизныхМарок.СрезПоследних(&Период, Упаковка В (&СписокМарок)) КАК алкХранилищеАкцизныхМарокСрезПоследних
				   |ГДЕ
				   |	алкХранилищеАкцизныхМарокСрезПоследних.ОтметкаВыбытия = ЛОЖЬ
				   |	И алкХранилищеАкцизныхМарокСрезПоследних.АлкогольнаяПродукция <> ЗНАЧЕНИЕ(Справочник.алкКлассификаторАлкогольнойПродукцииЕГАИС.ПустаяСсылка)
				   |;
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	ТаблицаМарок.АлкогольнаяПродукция,
				   |	ТаблицаМарок.СправкаБ,
				   |	ЕСТЬNULL(алкСоответствияСправокАиБЕГАИСИСерий.СерияНоменклатуры,ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)) КАК СерияНоменклатуры,
				   |	ЕСТЬNULL(алкСоответствияСправокАиБЕГАИСИСерий.СправкаА,ЗНАЧЕНИЕ(Справочник.алкКлассификаторСправокАиБ.ПустаяСсылка)) КАК СправкаА,
				   |	1 КАК Количество
				   |ПОМЕСТИТЬ ВТ_СправкиАИБ
				   |ИЗ
				   |	ТаблицаМарок КАК ТаблицаМарок
				   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алкСоответствияСправокАиБЕГАИСИСерий КАК алкСоответствияСправокАиБЕГАИСИСерий
				   |		ПО ТаблицаМарок.СправкаБ = алкСоответствияСправокАиБЕГАИСИСерий.СправкаБ
				   |;				
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	ВТ_СправкиАИБ.АлкогольнаяПродукция,
				   |	ВТ_СправкиАИБ.СправкаБ,
				   |	ВТ_СправкиАИБ.СерияНоменклатуры,
				   |	ВТ_СправкиАИБ.СправкаА,
				   |	СУММА(ВТ_СправкиАИБ.Количество) КАК Количество
				   |ПОМЕСТИТЬ ОбщиеДанные
				   |ИЗ
				   |	ВТ_СправкиАИБ КАК ВТ_СправкиАИБ
				   |СГРУППИРОВАТЬ ПО
				   |	ВТ_СправкиАИБ.АлкогольнаяПродукция,
				   |	ВТ_СправкиАИБ.СправкаБ,
				   |	ВТ_СправкиАИБ.СерияНоменклатуры,
				   |	ВТ_СправкиАИБ.СправкаА
				   |;
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ ПЕРВЫЕ 1
				   |	ОбщиеДанные.АлкогольнаяПродукция,
				   |	ОбщиеДанные.СправкаБ,
				   |	ОбщиеДанные.СерияНоменклатуры,
				   |	ОбщиеДанные.СерияНоменклатуры.алкВладелец КАК Номенклатура,
				   |	ОбщиеДанные.СправкаА,
				   |	ОбщиеДанные.Количество КАК Количество
				   |ИЗ
				   |	ОбщиеДанные КАК ОбщиеДанные";
	
	
	ТЗМарок = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.Прямой);	
	Если ТЗМарок.Количество() > 0 тогда
		ТекущийТовар = ТЗМарок[0].Номенклатура;
		Если ЗначениеЗаполнено(ТекущийТовар) тогда
			  ТекТовар=ТекущийТовар;
		КонецЕсли;
	КонецЕсли;	
	
	Возврат  ТекТовар;
КонецФункции
Процедура ОчиститьЗаписиТСДГрупповогоДокумента_ОПТ(ДокументТСД, ТСД = Неопределено) Экспорт
	
	СтруктураОтбора = Новый Структура("ДокументТСД", ДокументТСД);

	ВыборкаЗаписейТСД = РегистрыСведений.ДатаМобайл_ТСДГрупповыхДокументов.Выбрать(СтруктураОтбора);
	Пока ВыборкаЗаписейТСД.Следующий() Цикл
		Если ТСД = Неопределено Тогда
		ВыборкаЗаписейТСД.ПолучитьМенеджерЗаписи().Удалить();
		Иначе
			Если ВыборкаЗаписейТСД.ПолучитьМенеджерЗаписи().ТСД = ТСД Тогда
				ВыборкаЗаписейТСД.ПолучитьМенеджерЗаписи().Удалить();
			КонецЕсли;            
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти