
#Область ОбработчикиСобытий

Процедура ПередУдалением(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
	 	Возврат;
	КонецЕсли;
	
	// Отключение механизма регистрации объектов.
	ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
	
	Если Не Этотобъект.ДополнительныеСвойства.Свойство("НеВыполнятьКонтрольУдаляемых") Тогда
		ДатаМобайл_ОбщийМодуль.СообщитьПользователю("Непосредственное удаление запрещено, могут остаться битые ссылки!");
		Отказ = Истина;	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ) 
	
	Если ОбменДанными.Загрузка Тогда
	 	Возврат;
	КонецЕсли;
	
	// Отключение механизма регистрации объектов.
	ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
	
КонецПроцедуры

#КонецОбласти