#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	т.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ СпрВесь
		|ИЗ
		|	Справочник.AMS_Продукция.Товары КАК т
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.AMS_Продукция КАК д
		|		ПО т.Ссылка = д.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СпрВесь.Номенклатура КАК Номенклатура,
		|	КОЛИЧЕСТВО(СпрВесь.Номенклатура) КАК Количество
		|ПОМЕСТИТЬ Повторы
		|ИЗ
		|	СпрВесь КАК СпрВесь
		|СГРУППИРОВАТЬ ПО
		|	СпрВесь.Номенклатура
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(СпрВесь.Номенклатура) > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Повторы.Номенклатура КАК Номенклатура
		|ИЗ
		|	Повторы КАК Повторы
		|		ЛЕВОЕ СОЕДИНЕНИЕ СпрВесь КАК СпрВесь
		|		ПО Повторы.Номенклатура = СпрВесь.Номенклатура";
	
	Рез = Запрос.Выполнить();
	
	Если Не Рез.Пустой() Тогда
		Выб = Рез.Выбрать();
		Выб.Следующий();
		
		ВызватьИсключение "Повторное использование """ + Выб.Номенклатура + """.";
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли