
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьУсловноеОформление();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьОтбор();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	УстановитьОтбор();
КонецПроцедуры

&НаКлиенте
Процедура ПриоритетПриИзменении(Элемент)
	УстановитьОтбор();
КонецПроцедуры

&НаКлиенте
Процедура ПартнерПриИзменении(Элемент)
	УстановитьОтбор();
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	УстановитьОтбор();
КонецПроцедуры

&НаКлиенте
Процедура АвторПриИзменении(Элемент)
	УстановитьОтбор();
КонецПроцедуры

&НаКлиенте
Процедура СкрытьЗакрытыеЗаказыПриИзменении(Элемент)
	УстановитьОтбор();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтчетОЗаказах(Команда)
	ОткрытьФорму("Отчет.AMS_ЗаказыПоставщика.Форма");
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьОтбор()
	Элементы.Статус.СписокВыбора.Очистить();
	
	Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыЗаказовПоставщикам.НеСогласован);
	Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыЗаказовПоставщикам.Согласован);
	Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыЗаказовПоставщикам.Подтвержден);
	
	Если Не СкрытьЗакрытыеЗаказы Тогда
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыЗаказовПоставщикам.Закрыт);
	КонецЕсли;
	
	Статусы = Новый СписокЗначений;
	
	Если ЗначениеЗаполнено(Статус) Тогда
		Элементы.СкрытьЗакрытыеЗаказы.Видимость = Ложь;
		Статусы.Добавить(Статус);
		
	Иначе
		Элементы.СкрытьЗакрытыеЗаказы.Видимость = Истина;
		
		Если СкрытьЗакрытыеЗаказы Тогда
			Статусы.Добавить(Перечисления.СтатусыЗаказовПоставщикам.НеСогласован);
			Статусы.Добавить(Перечисления.СтатусыЗаказовПоставщикам.Согласован);
			Статусы.Добавить(Перечисления.СтатусыЗаказовПоставщикам.Подтвержден);
		КонецЕсли;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Статус",Статусы,ВидСравненияКомпоновкиДанных.ВСписке,,Статусы.Количество() > 0);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Приоритет",Приоритет,ВидСравненияКомпоновкиДанных.Равно,,ЗначениеЗаполнено(Приоритет));
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Партнер",Партнер,ВидСравненияКомпоновкиДанных.Равно,,ЗначениеЗаполнено(Партнер));
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Склад",Склад,ВидСравненияКомпоновкиДанных.Равно,,ЗначениеЗаполнено(Склад));
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Автор",Автор,ВидСравненияКомпоновкиДанных.Равно,,ЗначениеЗаполнено(Автор));
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Автор",Автор,ВидСравненияКомпоновкиДанных.Равно,,ЗначениеЗаполнено(Автор));
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	УсловноеОформление.Элементы.Очистить();

	// Документ имеет статус На согласовании

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Список.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Список.Статус");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.СтатусыЗаказовПоставщикам.НеСогласован;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ПолеСОшибкойФон);

	// Документ имеет статус Согласован

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Список.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Список.Статус");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.СтатусыЗаказовПоставщикам.Согласован;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.РегулярноеСоглашение);

	// Документ имеет статус Подтвержден

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Список.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Список.Статус");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.СтатусыЗаказовПоставщикам.Подтвержден;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветВажного);

	СтандартныеПодсистемыСервер.УстановитьУсловноеОформлениеПоляДата(ЭтотОбъект, "Список.Дата", Элементы.СписокДата.Имя);
КонецПроцедуры

#КонецОбласти