#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьАдресаДоставки(Партнер) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Партнер", Партнер);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.АдресДоставки КАК АдресДоставки,
	|	т.АдресДоставкиЗначение КАК АдресДоставкиЗначение,
	|	т.АдресДоставкиЗначенияПолей КАК АдресДоставкиЗначенияПолей,
	|	т.ВремяДоставкиПо КАК ВремяДоставкиПо,
	|	т.ВремяДоставкиС КАК ВремяДоставкиС,
	|	т.ДополнительнаяИнформацияПоДоставке КАК ДополнительнаяИнформацияПоДоставке,
	|	т.ЗонаДоставки КАК ЗонаДоставки
	|ИЗ
	|	Справочник.AMS_АдресаДоставки КАК т
	|ГДЕ
	|	т.Владелец = &Партнер
	|	И НЕ т.ПометкаУдаления";

	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

#КонецОбласти

#КонецЕсли
	