#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ФиксированныеНастройки = Новый НастройкиКомпоновкиДанных;
	ЭлементОтбора = ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = ПараметрКоманды;
	ЭлементОтбора.Использование = Истина;
	
	ПараметрыФормы = Новый Структура("ФиксированныеНастройки, СформироватьПриОткрытии",ФиксированныеНастройки,Истина);
	
	ОткрытьФорму("Отчет._МатериалыВСпецификациях.Форма",
	        ПараметрыФормы,
	        ПараметрыВыполненияКоманды.Источник,
	        ПараметрыВыполненияКоманды.Уникальность,
	        ПараметрыВыполненияКоманды.Окно);
КонецПроцедуры

#КонецОбласти