#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Пользователи.РолиДоступны("_НачальникСклада,_КладовщикСклада") Тогда
		Склад = AMS_ВызовСервера.СкладПродукции();
		
	ИначеЕсли Пользователи.РолиДоступны("_Цех1") Тогда
		Склад = AMS_ВызовСервера.Цех1();
		
	ИначеЕсли Пользователи.РолиДоступны("_Цех2") Тогда
		Склад = AMS_ВызовСервера.Цех2();
		
	ИначеЕсли Пользователи.РолиДоступны("_Цех3") Тогда
		Склад = AMS_ВызовСервера.Цех3();
		
	Иначе
		Склад = Справочники.Склады.ПустаяСсылка();
	КонецЕсли;

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор,"Склад",Склад,ВидСравненияКомпоновкиДанных.Равно,,ЗначениеЗаполнено(Склад));
КонецПроцедуры

#КонецОбласти