#Область ОписаниеПеременных

&НаКлиенте
Перем КэшированныеЗначения; //используется механизмом обработки изменения реквизитов ТЧ

&НаКлиенте
Перем ПараметрыДляЗаписи Экспорт;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьУсловноеОформление();
	
	#Область ИнтегрируемыеПодсистемы
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ШтрихкодыИТорговоеОборудование
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтотОбъект);
	// Конец ШтрихкодыИТорговоеОборудование
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
	// Обработчик механизма "Свойства"
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Объект", Объект);
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	
	// СтандартныеПодсистемы.РаботаСФайлами
	ПараметрыГиперссылки = РаботаСФайлами.ГиперссылкаФайлов();
	ПараметрыГиперссылки.Размещение = "КоманднаяПанель";
	РаботаСФайлами.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыГиперссылки);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
	УстановитьДоступностьКомандБуфераОбмена(ЭтотОбъект, РаботаСТабличнымиЧастями.ЕстьСтрокиВБуфереОбмена());
	
	// Обработчик механизма "Назначения"
	Справочники.Назначения.ФормаДокументаПриСозданииНаСервере(ЭтотОбъект);
	
	
	ПараметрыВыбораСтатейИАналитик = Документы.ЗаявкаНаЗакупку.ПараметрыВыбораСтатейИАналитик(Объект.ЦельЗакупки);
	ДоходыИРасходыСервер.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыВыбораСтатейИАналитик);
	
	СобытияФорм.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
	#КонецОбласти
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
	Элементы.ТоварыЗаполнитьУсловияЗакупкиПоКоммерческимПредложениям.Видимость = КоммерческиеПредложенияДокументыУТ.ИспользоватьЗапросыКоммерческихПредложенийПоставщиков();
	УстановитьПараметрыВыбораСоглашений();
	УстановитьПараметрыВыбораДоговоров();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	#Область ИнтегрируемыеПодсистемы
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	СобытияФорм.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	#КонецОбласти
	
	ПараметрыВыбораСтатейИАналитик = Документы.ЗаявкаНаЗакупку.ПараметрыВыбораСтатейИАналитик(Объект.ЦельЗакупки);
	ДоходыИРасходыСервер.ПриЧтенииНаСервере(ЭтотОбъект, ПараметрыВыбораСтатейИАналитик);
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	#Область ИнтегрируемыеПодсистемы
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
	#КонецОбласти
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	#Область ИнтегрируемыеПодсистемы
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	МодификацияКонфигурацииПереопределяемый.ПередЗаписьюНаСервере(ЭтотОбъект, Отказ, ТекущийОбъект, ПараметрыЗаписи);

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
	#КонецОбласти
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	#Область ИнтегрируемыеПодсистемы
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
		
	СобытияФорм.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
	#КонецОбласти
	
	ОбеспечениеВДокументахСервер.ПроверитьЗапуститьФоновоеЗаданиеРаспределенияЗапасов();
	
	ЗаполнитьДанныеФормы();
	УправлениеФормой();
	
	ДоходыИРасходыСервер.ПослеЗаписиНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	#Область ИнтегрируемыеПодсистемы
	
	// ПодключаемоеОборудование
	Если ВводДоступен()
		И Источник = "ПодключаемоеОборудование" Тогда
		
		Если ИмяСобытия = "ScanData"
			И МенеджерОборудованияУТКлиент.ЕстьНеобработанноеСобытие() Тогда
			
			ОбработатьШтрихкоды(МенеджерОборудованияУТКлиент.ПреобразоватьДанныеСоСканераВМассив(Параметр));
			
		КонецЕсли;
		
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
	// Неизвестные штрихкоды
	Если ИмяСобытия = "НеизвестныеШтрихкоды"
		И Источник = "ПодключаемоеОборудование"
		И Параметр.ФормаВладелец = УникальныйИдентификатор Тогда
		
		КэшированныеЗначения.Штрихкоды.Очистить();
		
		ДанныеШтрихкодов = Новый Массив;
		
		Для Каждого ПолученныйШтрихкод Из Параметр.ШтрихкодыНоменклатуры Цикл
			ДанныеШтрихкодов.Добавить(ПолученныйШтрихкод);
		КонецЦикла;
		
		ОбработатьШтрихкоды(ДанныеШтрихкодов);
		
	КонецЕсли;
	
	// Обработчик механизма "Свойства"
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
		
	Если ИмяСобытия = "Запись_СоглашенияСПоставщиками" Тогда
		
		ЗаполнитьСлужебныеРеквизитыСоглашений();
		УправлениеСтрокойТоваров();
		
	КонецЕсли;
	
	Если ИмяСобытия = "КопированиеСтрокВБуферОбмена" Тогда
		
		УстановитьДоступностьКомандБуфераОбмена(ЭтотОбъект, Истина);
		
	КонецЕсли;
	
	СобытияФормКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
	Если ИмяСобытия = "ПриИзмененииДоговора"
		И Источник = ЭтотОбъект Тогда
		// Введено новое значение:
		Модифицированность = Истина;
	КонецЕсли;
	
	#КонецОбласти
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СобытияФормКлиент.ОбработкаНавигационнойСсылки(ЭтотОбъект, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	#Область ИнтегрируемыеПодсистемы
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(
		Неопределено,
		ЭтотОбъект,
		"СканерШтрихкода");
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ПриОткрытии(ЭтотОбъект, Отказ);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
	#КонецОбласти
	
	УправлениеСтрокойТоваров();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	ПринудительноЗакрытьФорму = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	#Область ИнтегрируемыеПодсистемы
	
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтотОбъект);
	
	#КонецОбласти
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	СкрыватьОтмененныеСтроки = Настройки.Получить("СкрыватьОтмененныеСтроки");
	
	ТоварыОбновитьОтборСтрокПоОтмененным(ЭтотОбъект, СкрыватьОтмененныеСтроки, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Обработка.ПодборТоваровВДокументЗакупки.Форма.Форма" Тогда
		
		ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение);
		
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Справочник.СтруктураПредприятия.Форма.ФормаВыбора" Тогда
		
		ВыделенныеСтроки = Элементы.Товары.ВыделенныеСтроки;
		
		Для Каждого Строка Из ВыделенныеСтроки Цикл
			
			ДанныеСтроки = Объект.Товары.НайтиПоИдентификатору(Строка);
			АктуализироватьПодразделениеСтрокиТоваров(ДанныеСтроки, ВыбранноеЗначение, Истина);
			
		КонецЦикла;
		
		
	КонецЕсли;
	
	УстановитьПризнакЗаполненияСклада(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НеВыполнятьПроверкуПередЗаписью Тогда
		НеВыполнятьПроверкуПередЗаписью = Ложь;
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияУТКлиент.ЗаписатьОбъектПриНеобходимости(ЭтотОбъект, ПараметрыЗаписи, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Запись_ЗаявкаНаЗакупку", ПараметрыЗаписи, Объект.Ссылка);
	
	#Область ИнтегрируемыеПодсистемы
	
	МодификацияКонфигурацииКлиентПереопределяемый.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи);
	
	ОбщегоНазначенияУТКлиент.ВыполнитьДействияПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
		МодульПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	#КонецОбласти
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#Область Протокол

&НаКлиенте
Процедура ПредставлениеСтатусаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	РаботаСПротоколомДокументаКлиент.ОбработатьНавигационнуюСсылкуПротокола(
		ЭтотОбъект,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеИсполнителяОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	РаботаСПротоколомДокументаКлиент.ОбработатьНавигационнуюСсылкуПротокола(
		ЭтотОбъект,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ЦеныПредприятияЗаполнениеКлиент.ЗадатьВопросПересчетаЦеныПриИзмененииДаты(
		Объект,
		Новый ОписаниеОповещения("ДатаПриИзмененииЗавершение", ЭтотОбъект),
		"Товары",
		Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)

	ОрганизацияПриИзмененииНаСервере(КэшированныеЗначения);
	УправлениеСтрокойТоваров();
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	
	Если ЦенообразованиеКлиент.НеобходимПересчетВВалюту(Объект, ВалютаДокумента) Тогда
		
		ПриИзмененииВалютыСервер();
		ЦенообразованиеКлиент.ОповеститьОбОкончанииПересчетаСуммВВалюту(ВалютаДокумента, Объект.Валюта);
	
	КонецЕсли;
	
	ВалютаДокумента = Объект.Валюта;
	УправлениеСтрокойТоваров();
	РассчитатьИтоговыеПоказателиЗаявки(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	
	СкладПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенаВключаетНДСПриИзменении(Элемент)
	
	ЦенаВключаетНДСПриИзмененииНаСервере();
	УправлениеСтрокойТоваров();

КонецПроцедуры

&НаКлиенте
Процедура ПоступлениеОднойДатойПриИзменении(Элемент)
	
	Если Объект.ПоступлениеОднойДатой Тогда
		УстановитьЖелаемуюДатуПоступленияВШапке();
	Иначе
		Объект.ЖелаемаяДатаПоступления = Неопределено;
	КонецЕсли;
		
	Элементы.ЖелаемаяДатаПоступления.Видимость = Объект.ПоступлениеОднойДатой;
	
КонецПроцедуры

&НаКлиенте
Процедура ЖелаемаяДатаПоступленияПриИзменении(Элемент)
	УстановитьЖелаемуюДатуПоступленияВТаблице();
КонецПроцедуры

&НаКлиенте
Процедура ЦельЗакупкиПриИзменении(Элемент)
	
	ЦельЗакупкиПриИзмененииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

#Область СобытияТаблицы

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
	// Вызов без обработчика ожидания, т.к. после обработчика сбрасывается активизация поля ввода.
	УправлениеСтрокойТоваров();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриАктивизацииЯчейки(Элемент)
	
	Если Элемент.ТекущийЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Элемент.ТекущийЭлемент.Имя = "ТоварыНоменклатураПартнера" Тогда
		УстановитьОтборНоменклатурыПартнера();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
	РаботаСТабличнымиЧастямиКлиент.КэшироватьТекущуюСтроку(Элементы.Товары, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	РаботаСТабличнымиЧастямиКлиент.КэшироватьТекущуюСтроку(Элементы.Товары, ЭтотОбъект);
	
	СтрокаТоваров = Элементы.Товары.ТекущиеДанные;
	Если НоваяСтрока И Не Копирование Тогда
		
		СтрокаТоваров.Подразделение = Объект.Подразделение;
		
		Если Объект.ПоступлениеОднойДатой Тогда
			СтрокаТоваров.ЖелаемаяДатаПоступления = Объект.ЖелаемаяДатаПоступления;
		КонецЕсли;
		
		СтрокаТоваров.НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС");
		
		Действия = Новый Структура;
		Действия.Вставить("ЗаполнитьПредставлениеУсловийЗакупки"); // Заполнение "пустым значением"
		ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(СтрокаТоваров, Действия, КэшированныеЗначения);
		
	КонецЕсли;
	
	Если НоваяСтрока Тогда
		// Активизация выполнятся перед заполнением данных в строке
		//   Поэтому вызываем для расчета по заполненным данным:
		УправлениеСтрокойТоваров();
	КонецЕсли;
	
	РассчитатьИтоговыеПоказателиЗаявки(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	СтрокаТоваров = Элементы.Товары.ТекущиеДанные;
	
	Если Не ОтменаРедактирования Тогда
		
		КэшСтроки = ?(НоваяСтрока, Неопределено, РаботаСТабличнымиЧастямиКлиентСервер.КэшСтроки(Элементы.Товары, ЭтотОбъект));
		СкладыКлиент.ОбновитьТаблицуСкладов(ТаблицаСкладов, СтрокаТоваров, КэшСтроки, СкладГруппа);
		ВсегоСкладов = ТаблицаСкладов.Количество();
		СкладыКлиентСервер.ОбновитьКартинкуГруппыСкладов(НадписьНесколькоСкладов, Элементы.КартинкаНесколькоСкладов, ВсегоСкладов);
	
	КонецЕсли;
	
	УстановитьПризнакЗаполненияСклада(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
	РассчитатьИтоговыеПоказателиЗаявки(ЭтотОбъект);
	ОбновитьКартинкуГруппыСкладов();
	УстановитьПризнакЗаполненияСклада(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	ОчиститьСообщения();
	
	СтрокаТоваров = Элементы.Товары.ТекущиеДанные;
	
	Действия = Новый Структура;
	Действия.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
	Действия.Вставить("ПриИзмененииТипаНоменклатуры", Новый Структура("ЕстьРаботы, ЕстьОтменено", Истина, Истина));
	Действия.Вставить("ПроверитьХарактеристикуПоВладельцу", СтрокаТоваров.Характеристика);
	Действия.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
	Действия.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу", СтрокаТоваров.Упаковка);
	Действия.Вставить("ПересчитатьКоличествоЕдиниц");
	Действия.Вставить(
		"ПроверитьЗаполнитьСклад",
		ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСкладаВСтрокеТЧ(Объект, СкладГруппа));
	
	Действия.Вставить("ЗаполнитьНоменклатуруПартнераПоНоменклатуре", Истина);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Действия, ДействияЗаполненияЦены(Объект), Истина);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Действия, ДействияЗаполненияСтавкиНДС(Объект, КэшФормы), Истина);
		
	Если КонтролироватьАссортимент(КэшФормы) Тогда
		Действия.Вставить("ПроверитьАссортиментСтроки", ПараметрыПроверкиАссортимента(Объект));
	КонецЕсли;
	
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(СтрокаТоваров, Действия, КэшированныеЗначения);
	
	АктуализироватьПодразделениеСтрокиТоваров(СтрокаТоваров, Объект.Подразделение);
	УстановитьПризнакЗаполненияСклада(ЭтотОбъект);
	РассчитатьИтоговыеПоказателиЗаявки(ЭтотОбъект);
	УправлениеСтрокойТоваров();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыХарактеристикаПриИзменении(Элемент)
	
	СтрокаТоваров = Элементы.Товары.ТекущиеДанные;
	
	Действия = Новый Структура;
	Действия.Вставить("ЗаполнитьНоменклатуруПартнераПоНоменклатуре", Истина);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Действия, ДействияЗаполненияЦены(Объект), Истина);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Действия, ДействияЗаполненияСтавкиНДС(Объект, КэшФормы), Истина);
	Действия.Вставить("ХарактеристикаПриИзмененииПереопределяемый", Новый Структура("ИмяФормы, ИмяТабличнойЧасти",
		ИмяФормы, "Товары"));

	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(СтрокаТоваров, Действия, КэшированныеЗначения);

	РассчитатьИтоговыеПоказателиЗаявки(ЭтотОбъект);
	УправлениеСтрокойТоваров();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНазначениеПриИзменении(Элемент)
	
	ТоварыНазначениеПриИзмененииНаСервере(КэшированныеЗначения);
	УправлениеСтрокойТоваров();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоУпаковокПриИзменении(Элемент)
	
	СтрокаТоваров = Элементы.Товары.ТекущиеДанные;
	Действия = ДействияПриИзмененииКоличества(Объект.ЦенаВключаетНДС);
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(СтрокаТоваров, Действия, КэшированныеЗначения);

	РассчитатьИтоговыеПоказателиЗаявки(ЭтотОбъект);
	УправлениеСтрокойТоваров();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыУпаковкаПриИзменении(Элемент)
	
	СтрокаТоваров = Элементы.Товары.ТекущиеДанные;
	
	Действия = Новый Структура;
	Действия.Вставить("ЗаполнитьНоменклатуруПартнераПоНоменклатуре", Истина);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Действия, ДействияПриИзмененииКоличества(Объект.ЦенаВключаетНДС), Истина);
	
	Если СтрокаТоваров.Количество > 0 Тогда
		Действия.Вставить("ПересчитатьЦенуЗаУпаковку", СтрокаТоваров.Количество);
		ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Действия, ДействияЗаполненияСуммовыхРеквизитовФормы(), Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Действия, ДействияЗаполненияЦены(Объект), Истина);
	КонецЕсли;
	
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(СтрокаТоваров, Действия, КэшированныеЗначения);
	РассчитатьИтоговыеПоказателиЗаявки(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыОтмененоПриИзменении(Элемент)
	
	СтрокаТоваров = Элементы.Товары.ТекущиеДанные;
	
	Действия = Новый Структура;
	Действия.Вставить("ПриИзмененииТипаНоменклатуры", // Заполнение обязательности склада
		Новый Структура("ЕстьРаботы, ЕстьОтменено", Истина, Истина));
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Действия, ДействияЗаполненияСуммовыхРеквизитовФормы(), Истина);
	
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(СтрокаТоваров, Действия, КэшированныеЗначения);
	
	РассчитатьИтоговыеПоказателиЗаявки(ЭтотОбъект);
	ТоварыОбновитьОтборСтрокПоОтмененным(ЭтотОбъект, СкрыватьОтмененныеСтроки, Ложь);
	УстановитьПризнакЗаполненияСклада(ЭтотОбъект);
	
КонецПроцедуры

//@skip-check module-structure-form-event-regions -- реквизиты выведены в "подвал"
#Область УсловияЗакупки

&НаКлиенте
Процедура ТоварыПартнерПриИзменении(Элемент)
	
	ТоварыПартнерПриИзмененииНаСервере(КэшированныеЗначения);
	УправлениеСтрокойТоваров();
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПартнераАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если Ожидание = 0 Тогда
		УстановитьОтборНоменклатурыПартнера();
	КонецЕсли;
	
КонецПроцедуры

 &НаКлиенте
Процедура ТоварыНоменклатураПартнераНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтрокаТоваров = Элементы.Товары.ТекущиеДанные;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ЭлементФормы" , Элемент);
	ДополнительныеПараметры.Вставить("ТекущаяСтрока", СтрокаТоваров);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбработатьВыборНоменклатурыПартнера", ЭтотОбъект, ДополнительныеПараметры);

	НоменклатураПартнеровКлиент.ОткрытьФормуВыбораНоменклатурыПартнера(ЭтотОбъект, СтрокаТоваров.Партнер, СтрокаТоваров, Элемент.Заголовок, ОповещениеОЗакрытии);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПартнераПриИзменении(Элемент)
	
	ОбработатьИзменениеНоменклатурыПартнера();
	РассчитатьИтоговыеПоказателиЗаявки(ЭтотОбъект);
	
КонецПроцедуры

#Область Соглашение

&НаКлиенте
Процедура ТоварыСоглашениеПриИзменении(Элемент)
	
	ТоварыСоглашениеПриИзмененииНаСервере(КэшированныеЗначения);
	УправлениеСтрокойТоваров();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСоглашениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	ЗакупкиКлиент.НачалоВыбораСоглашенияСПоставщиком(
		Элемент,
		СтандартнаяОбработка,
		ТекущиеДанные.Партнер,
		ТекущиеДанные.Соглашение,
		Объект.Дата);
		
КонецПроцедуры
	
#КонецОбласти

&НаКлиенте
Процедура ТоварыКонтрагентПриИзменении(Элемент)
	
	ТоварыКонтрагентПриИзмененииНаСервере(КэшированныеЗначения);
	УправлениеСтрокойТоваров();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыДоговорСоздание(Элемент, СтандартнаяОбработка)
	
	СтрокаТоваров = Элементы.Товары.ТекущиеДанные;
	ЗакупкиКлиент.ОткрытьФормуСозданияДоговора(
		ЭтотОбъект,
		Элемент,
		"Элементы.Товары.ТекущиеДанные.Договор",
		СтрокаТоваров.Партнер,
		СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыДоговорПриИзменении(Элемент)
	
	ТоварыДоговорПриИзмененииНаСервере(КэшированныеЗначения);
	УправлениеСтрокойТоваров();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНалогообложениеНДСПриИзменении(Элемент)
	
	ТоварыНалогообложениеНДСПриИзмененииНаСервере(КэшированныеЗначения);
	УправлениеСтрокойТоваров();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВидЦеныПоставщикаПриИзменении(Элемент)
	
	СтрокаТоваров = Элементы.Товары.ТекущиеДанные;
	
	Действия = ДействияЗаполненияЦены(Объект);
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(СтрокаТоваров, Действия, КэшированныеЗначения);
	
	РассчитатьИтоговыеПоказателиЗаявки(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСтавкаНДСПриИзменении(Элемент)
	
	СтрокаТоваров = Элементы.Товары.ТекущиеДанные;
	
	Действия = ДействияПересчетаСуммы(Объект.ЦенаВключаетНДС);
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(СтрокаТоваров, Действия, КэшированныеЗначения);
	
	СохранитьУказаннуюСтавкуНДС(КэшФормы, СтрокаТоваров.СтавкаНДС);
	
	РассчитатьИтоговыеПоказателиЗаявки(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	СтрокаТоваров = Элементы.Товары.ТекущиеДанные;
	
	Действия = ДействияПересчетаСуммы(Объект.ЦенаВключаетНДС);
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(СтрокаТоваров, Действия, КэшированныеЗначения);
	
	РассчитатьИтоговыеПоказателиЗаявки(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	
	СтрокаТоваров = Элементы.Товары.ТекущиеДанные;
	
	ПараметрыЗаполненияЦены = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаЦеныСкидкиВЗакупкахВТЧ(
		Объект,
		Истина); // Отключение ручных скидок
	
	Действия = Новый Структура;
	Действия.Вставить("ПересчитатьЦенуСкидкуПоСуммеВЗакупках", ПараметрыЗаполненияЦены);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Действия, ДействияПересчетаСуммы(Объект.ЦенаВключаетНДС, Ложь), Истина);
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(СтрокаТоваров, Действия, КэшированныеЗначения);
	
	РассчитатьИтоговыеПоказателиЗаявки(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаНДСПриИзменении(Элемент)
	
	СтрокаТоваров = Элементы.Товары.ТекущиеДанные;
	
	Действия = ДействияПересчетаСуммы(Объект.ЦенаВключаетНДС, Ложь, Ложь);
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(СтрокаТоваров, Действия, КэшированныеЗначения);
	
	РассчитатьИтоговыеПоказателиЗаявки(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСтатьяРасходовПриИзменении(Элемент)
	
	// Выбор статей и аналитик.
	ДоходыИРасходыКлиентСервер.СтатьяПриИзменении(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСтатьяРасходовНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	// Выбор статей и аналитик.
	ДоходыИРасходыКлиент.НачалоВыбораСтатьи(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область УсловияЗакупки

&НаКлиенте
Процедура СкопироватьУсловияЗакупки(Команда)
	
	Если Не ПроверитьНаличиеВыделенныхСтрок(Ложь) Тогда
		Возврат;
	КонецЕсли;
	
	БуферПараметровЗакупки = Новый Структура;
	БуферПараметровЗакупки.Вставить("Партнер");
	БуферПараметровЗакупки.Вставить("Контрагент");
	БуферПараметровЗакупки.Вставить("Соглашение");
	БуферПараметровЗакупки.Вставить("Договор");
	БуферПараметровЗакупки.Вставить("ВидЦеныПоставщика");
	БуферПараметровЗакупки.Вставить("Валюта");
	БуферПараметровЗакупки.Вставить("НалогообложениеНДС");
	БуферПараметровЗакупки.Вставить("СтавкаНДС");
	
	Элементы.ТоварыВставитьУсловияЗакупки.Доступность = Истина;
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	ЗаполнитьЗначенияСвойств(БуферПараметровЗакупки, ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура ВставитьУсловияЗакупки(Команда)
	
	Если Не ЗначениеЗаполнено(БуферПараметровЗакупки)
		Или Не ПроверитьНаличиеВыделенныхСтрок() Тогда
		Возврат;
	КонецЕсли;
	
	ВставитьУсловияЗакупкиНаСервере(Элементы.Товары.ВыделенныеСтроки);
	РассчитатьИтоговыеПоказателиЗаявки(ЭтотОбъект);
	УправлениеСтрокойТоваров();
	
КонецПроцедуры

#КонецОбласти

#Область КоммерческиеПредложения

&НаКлиенте
Процедура НачатьЗаполнениеУсловийЗакупкиПоКоммерческимПредложениям(Команда)
	
	ОчиститьСообщения();
	
	Если Не ПроверитьНаличиеВыделенныхСтрок() Тогда
		Возврат;
	КонецЕсли;
	
	РезультатЗаполнения = ЗаполнитьУсловияЗакупкиПоКоммерческимПредложениям(Элементы.Товары.ВыделенныеСтроки);
	
	Для Каждого НомерСтрокиТоваров Из РезультатЗаполнения.НомераСтрокСНезаполненнымиУсловиямиЗакупки Цикл
		
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Для строки %1 списка ""Товары"" не найдены условия закупки в выбранных коммерческих предложениях.'"),
			НомерСтрокиТоваров);
		
		ПутьКЭлементу = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
			"Объект.Товары",
			НомерСтрокиТоваров,
			"ПредставлениеУсловийЗакупки");
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			ТекстОшибки,
			,
			ПутьКЭлементу);
			
	КонецЦикла;
	
	Если РезультатЗаполнения.Отказ Тогда
		
		ПоказатьПредупреждение(, РезультатЗаполнения.ТекстОшибки);
		
	Иначе
		
		КоличествоНеобработанныхСтрок = РезультатЗаполнения.НомераСтрокСНезаполненнымиУсловиямиЗакупки.Количество();
		
		ЕстьЗаполненныеСтроки = Элементы.Товары.ВыделенныеСтроки.Количество() > КоличествоНеобработанныхСтрок;
		Если ЕстьЗаполненныеСтроки Тогда
			ТекстСообщения = НСтр("ru = 'Условия закупки заполнены.'");
		Иначе
			ТекстСообщения = НСтр("ru = 'Не удалось заполнить условия закупки.'");
		КонецЕсли;
		
		ТекстПояснения = СтрШаблон(НСтр("ru = 'Условия закупки заполнены в %1 из %2 строк.'"),
			Элементы.Товары.ВыделенныеСтроки.Количество() - КоличествоНеобработанныхСтрок,
			Элементы.Товары.ВыделенныеСтроки.Количество());
			
		ПоказатьОповещениеПользователя(ТекстСообщения,, ТекстПояснения, БиблиотекаКартинок.Информация32);
		
		РассчитатьИтоговыеПоказателиЗаявки(ЭтотОбъект);
		УправлениеСтрокойТоваров();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОтменаСтрок

&НаКлиенте
Процедура СкрыватьОтмененныеСтроки(Команда)
	
	СкрыватьОтмененныеСтроки = Не СкрыватьОтмененныеСтроки;
	
	ТоварыОбновитьОтборСтрокПоОтмененным(ЭтотОбъект, СкрыватьОтмененныеСтроки, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВыделенныеСтроки(Команда)
	
	Если Не ПроверитьНаличиеВыделенныхСтрок() Тогда
		Возврат;
	КонецЕсли;
	
	Действия = Новый Структура;
	Действия.Вставить("ПриИзмененииТипаНоменклатуры",
		Новый Структура("ЕстьРаботы, ЕстьОтменено", Истина, Истина));
		
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Действия, ДействияЗаполненияСуммовыхРеквизитовФормы(), Истина);
	
	Для Каждого ИдентификаторСтроки Из Элементы.Товары.ВыделенныеСтроки Цикл
		
		СтрокаТоваров = Объект.Товары.НайтиПоИдентификатору(ИдентификаторСтроки);
		
		Если Не СтрокаТоваров.Отменено Тогда
			СтрокаТоваров.Отменено = Истина;
			ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(СтрокаТоваров, Действия, КэшированныеЗначения);
		КонецЕсли;
		
	КонецЦикла;
	
	ОбновитьКартинкуГруппыСкладов();
	РассчитатьИтоговыеПоказателиЗаявки(ЭтотОбъект);
	УстановитьПризнакЗаполненияСклада(ЭтотОбъект);
	
	ПоказатьОповещениеПользователя(
		НСтр("ru = 'Выделенные строки отменены'"),
		,
		НСтр("ru='Выделенные строки заказа отменены.'"),
		БиблиотекаКартинок.Информация32);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьНезаказанныеСтроки(Команда)
	
	Результат = ОтменитьНезаказанныеСтрокиСервер();
	Если Не ПустаяСтрока(Результат.ТекстПредупреждения) Тогда
		ПоказатьПредупреждение(, Результат.ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	
	Если Результат.ЕстьОтмененныеСтроки = 0 Тогда
		
		ПоказатьОповещениеПользователя(
			НСтр("ru = 'Строки не отменены'"),
			,
			НСтр("ru='По всем строкам заявки оформлены заказы. Строки не могут быть отменены.'"),
			БиблиотекаКартинок.Информация32);
			
	Иначе
		
		ПоказатьОповещениеПользователя(
			НСтр("ru = 'Строки отменены'"),
			,
			НСтр("ru='Все незаказанные строки заявки отменены.'"),
			БиблиотекаКартинок.Информация32);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ИнтегрируемыеПодсистемы

#Область ШтрихкодыИТорговоеОборудование

&НаКлиенте
Процедура ПоискПоШтрихкодуВыполнить(Команда)
	ОчиститьСообщения();
	Оповещение = Новый ОписаниеОповещения("ПоискПоШтрихкодуЗавершение", ЭтотОбъект);
	ШтрихкодированиеНоменклатурыКлиент.ПоказатьВводШтрихкода(Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеИзТСД(Команда)
	
	ОчиститьСообщения();
	ОборудованиеТерминалыСбораДанныхКлиент.НачатьЗагрузкуДанныеИзТСД(
		Новый ОписаниеОповещения("ЗагрузитьИзТСДЗавершение", ЭтотОбъект),
		УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСФайлами

// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_КомандаПанелиПрисоединенныхФайлов(Команда)
	РаботаСФайламиКлиент.КомандаУправленияПрисоединеннымиФайлами(ЭтотОбъект, Команда);
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами

#КонецОбласти

#Область Свойства

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти

#Область БуферОбмена

&НаКлиенте
Процедура ВставитьСтроки(Команда)
	
	КоличествоТоваровДоВставки = Объект.Товары.Количество();
	
	ПолучитьСтрокиИзБуфераОбмена();
	
	КоличествоВставленных = Объект.Товары.Количество() - КоличествоТоваровДоВставки;
	РаботаСТабличнымиЧастямиКлиент.ОповеститьПользователяОВставкеСтрок(КоличествоВставленных);
	
	УстановитьПризнакЗаполненияСклада(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьСтроки(Команда)
	
	Если РаботаСТабличнымиЧастямиКлиент.ВыбранаСтрокаДляВыполненияКоманды(Элементы.Товары) Тогда
		СкопироватьСтрокиНаСервере();
		РаботаСТабличнымиЧастямиКлиент.ОповеститьПользователяОКопированииСтрок(Элементы.Товары.ВыделенныеСтроки.Количество());
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область РазбивкаСтрок

&НаКлиенте
Процедура РазбитьСтроку(Команда)
	
	ТаблицаФормы  = Элементы.Товары;
	ДанныеТаблицы = Объект.Товары;
	
	Оповещение = Новый ОписаниеОповещения("РазбитьСтрокуЗавершение", ЭтотОбъект);
	РаботаСТабличнымиЧастямиКлиент.РазбитьСтроку(ДанныеТаблицы, ТаблицаФормы, Оповещение);
	
КонецПроцедуры

#КонецОбласти

#Область ПодборТоваров

&НаКлиенте
Процедура ПодобратьТовары(Команда)
	
	// &ЗамерПроизводительности
	ОценкаПроизводительностиКлиент.ЗамерВремени(
		"Документ.ЗаявкаНаЗакупку.ФормаДокумента.Команда.ПодобратьТовары");
	
	Отказ = Ложь;
	
	Если Не ЗначениеЗаполнено(Объект.Валюта) Тогда
		ОчиститьСообщения();
		СообщитьОбОшибкахОткрытияПодбора(Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Документ",        Объект.Ссылка);
	ПараметрыФормы.Вставить("Склад",           Объект.Склад);
	ПараметрыФормы.Вставить("Дата",            Объект.Дата);
	ПараметрыФормы.Вставить("РежимПодбораИспользоватьСкладыВТабличнойЧасти", Истина);
	
	// Подбор товаров в документ выполняется заявителем, а не закупщиком.
	// Партнер и соглашение неизвестны для выбора видов цен.
	ПараметрыФормы.Вставить("РежимПодбораБезСуммовыхПараметров", Истина); 
	ПараметрыФормы.Вставить("ОтборПоТипуНоменклатуры", Новый ФиксированныйМассив(НоменклатураКлиентСервер.ОтборПоТоваруМногооборотнойТареУслугеРаботе(Ложь)));
	
	ОткрытьФорму("Обработка.ПодборТоваровВДокументЗакупки.Форма", ПараметрыФормы, ЭтотОбъект, УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти 

#Область Аналоги

&НаКлиенте
Процедура ПодобратьАналоги(Команда)
	
	
	Возврат; // в УТ и КА обработчик пустой
	
КонецПроцедуры

#КонецОбласти

#Область ЗагрузкаИзФайла

&НаКлиенте
Процедура ЗагрузитьИзВнешнегоФайла(Команда)
	
	ПараметрыЗагрузки = РаботаСТабличнымиЧастямиКлиент.ПараметрыЗагрузкиНоменклатуры();
	ПараметрыЗагрузки.ДатаЗаполнения  = Объект.Дата;
	ПараметрыЗагрузки.Организация     = Объект.Организация;
	ПараметрыЗагрузки.ЦенаВключаетНДС = Объект.ЦенаВключаетНДС;
	ПараметрыЗагрузки.ЗагружатьЦены   = Истина;
	ПараметрыЗагрузки.ЗагружатьСуммы  = Истина;
	ПараметрыЗагрузки.ПараметрыОтбора.Вставить("ТипНоменклатуры",
		НоменклатураКлиентСервер.ОтборПоТоваруМногооборотнойТареУслугеРаботе(Ложь));
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьИзВнешнегоФайлаЗавершение", ЭтотОбъект);
	РаботаСТабличнымиЧастямиКлиент.ПоказатьФормуЗагрузкиНоменклатуры(ПараметрыЗагрузки, Оповещение);
	
КонецПроцедуры

#КонецОбласти

#Область ЗаписьДокумента

&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Записать(ЭтотОбъект, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Провести(ЭтотОбъект, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	
	ОбщегоНазначенияУТКлиент.ПровестиИЗакрыть(ЭтотОбъект, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкуУдаленияДокумента(Команда)
	
	ОбщегоНазначенияУТКлиент.УстановитьПометкуУдаленияДокумента(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область Заполнение

&НаКлиенте
Процедура ЗаполнитьСкладВВыделенныхСтроках(Команда)
	
	ВыделенныеСтроки = Элементы.Товары.ВыделенныеСтроки;
	
	Если Не СкладыКлиент.ПроверитьВозможностьЗаполненияСкладовВТабличнойЧасти(
		Объект,
		Объект.Товары,
		НСтр("ru='Товары'"),
		ВыделенныеСтроки) Тогда
			
		Возврат;
	КонецЕсли;
		
	ВыборГруппы = Новый Массив;
	ВыборГруппы.Добавить(ПредопределенноеЗначение("Перечисление.ВыборГруппыСкладов.РазрешитьВЗаказах"));
	ВыборГруппы.Добавить(ПредопределенноеЗначение("Перечисление.ВыборГруппыСкладов.РазрешитьВЗаказахИНакладных"));
	
	Отбор = Новый Структура;
	Отбор.Вставить("ВыборГруппы", ВыборГруппы);
	Отбор.Вставить("ЭтоГруппа",    Ложь);
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Отбор", Отбор);
	ПараметрыОткрытия.Вставить("ГруппаСкладов", Объект.Склад);

	ОткрытьФорму(
		"Справочник.Склады.ФормаВыбора",
		ПараметрыОткрытия,
		ЭтотОбъект,,,,
		Новый ОписаниеОповещения("ЗаполнитьСкладВВыделенныхСтрокахЗавершение", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

#КонецОбласти

#Область ЗаказыПоставщикам

&НаКлиенте
Асинх Процедура СоздатьЗаказПоставщику(Команда)
	
	ОчиститьСообщения();
	
	Если Не ПроверитьНаличиеВыделенныхСтрок() Тогда
		Возврат;
	КонецЕсли;
	
	Если Модифицированность
		Или Объект.Ссылка.Пустая()
		Или Не Объект.Проведен Тогда
		
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.ОК, НСтр("ru = 'Провести и продолжить'"));
		Кнопки.Добавить(КодВозвратаДиалога.Отмена);
		
		ТекстВопроса = НСтр("ru = 'Для создания заказа поставщику документ будет проведен. Продолжить?'");
		Ответ = Ждать ВопросАсинх(ТекстВопроса, Кнопки);
		
		Если Ответ <> КодВозвратаДиалога.ОК Тогда
			Возврат;
		КонецЕсли;
		
		ПараметрыЗаписи = Новый Структура;
		ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Проведение);
		Если Не Записать(ПараметрыЗаписи) Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.ЗаявкаНаЗакупку.ФормаДокумента.Команда.СоздатьЗаказПоставщику");
	
	ВыделенныеСтроки = Элементы.Товары.ВыделенныеСтроки;
	ОписаниеЗаказаКСозданию = ОписаниеЗаказаКСозданию(ВыделенныеСтроки);
	
	Если ОписаниеЗаказаКСозданию.ДанныеЗаказа = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'По выделенным строкам не требуется ввод новых заказов.'"));
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Документ.ЗаказПоставщику.ФормаОбъекта",
		Новый Структура("ЗначенияЗаполнения", ОписаниеЗаказаКСозданию.ДанныеЗаказа),
		ЭтотОбъект,
		Истина);
		
	Если ЗначениеЗаполнено(ОписаниеЗаказаКСозданию.НеОбработаноИсходныхСтрок) Тогда
		
		ТекстСообщения = НСтр("ru = 'Невозможно разместить выделенные строки в одном заказе.'");
		ТекстПояснения = СтрШаблон(НСтр("ru = 'Выделено строк: %1. Обработано: %2. Требуют формирования заказов: %3'"),
			ВыделенныеСтроки.Количество(),
			ОписаниеЗаказаКСозданию.ОбработаноИсходныхСтрок,
			ОписаниеЗаказаКСозданию.НеОбработаноИсходныхСтрок);
		
		ПоказатьОповещениеПользователя(ТекстСообщения,, ТекстПояснения, БиблиотекаКартинок.Информация32);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	ЗаполнитьДанныеФормы();
	УправлениеФормой();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеФормы()
	
	// Используется как предыдущее значение и выводится даже при выключенной Ф.О. "ИспользоватьНесколькоВалют": 
	ВалютаДокумента = Объект.Валюта;
	
	РаботаСПротоколомДокумента.ЗаполнитьДанныеФормы(ЭтотОбъект);
	ИнициализироватьКэшФормы();
		
	Действия = Новый Структура;
	Действия.Вставить("ЗаполнитьПризнакХарактеристикиИспользуются", Новый Структура("Номенклатура", "ХарактеристикиИспользуются"));
	Действия.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
	Действия.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
	
	Действия.Вставить("ПриИзмененииТипаНоменклатуры",
		Новый Структура("ЕстьРаботы, ЕстьОтменено", Истина, Истина));
	
	Действия.Вставить("ЗаполнитьСлужебныеРеквизитыПоНазначению",
		Новый Структура("ТолькоТипНазначения", Истина));
	
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Действия, ДействияЗаполненияСуммовыхРеквизитовФормы(), Истина);
	
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Объект.Товары, Действия);
	
	ЗаполнитьСлужебныеРеквизитыСоглашений();
	
	СкладГруппа = Справочники.Склады.ЭтоГруппаИСкладыИспользуютсяВТЧДокументовЗакупки(Объект.Склад);
	ОбновитьКартинкуГруппыСкладов();
	РассчитатьИтоговыеПоказателиЗаявки(ЭтотОбъект);
	УстановитьПризнакЗаполненияСклада(ЭтотОбъект);
	
КонецПроцедуры

#Область УсловияЗакупки

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьИтоговыеПоказателиЗаявки(Форма)
	
	// Заполнение итогов по таблице "Товары"
	КоллекцияТовары = Форма.Объект.Товары;
	Форма.СуммаВсегоСНДС = КоллекцияТовары.Итог("СуммаСНДС") - КоллекцияТовары.Итог("СуммаСНДСОтменено");
	Форма.СуммаВсегоНДС = КоллекцияТовары.Итог("СуммаНДС") - КоллекцияТовары.Итог("СуммаНДСОтменено");
		
КонецПроцедуры

&НаСервере
Процедура ВставитьУсловияЗакупкиНаСервере(Знач ВыделенныеСтроки)
	
	СтрокиКОбработке = Новый Массив;
	Для Каждого ИдентификаторСтроки Из ВыделенныеСтроки Цикл
		СтрокаТоваров = Объект.Товары.НайтиПоИдентификатору(ИдентификаторСтроки);
		ЗаполнитьЗначенияСвойств(СтрокаТоваров, БуферПараметровЗакупки);
		СтрокиКОбработке.Добавить(СтрокаТоваров);
	КонецЦикла;
	
	Действия = Новый Структура;
	ПараметрыЗаполненияСоглашения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияСоглашенийПоставщика();
	Действия.Вставить("ЗаполнитьКоличествоСоглашенийПоставщика", ПараметрыЗаполненияСоглашения);
	Действия.Вставить("ЗаполнитьРеквизитыПоСоглашениюПоставщика");
	
	Если ЗначениеЗаполнено(БуферПараметровЗакупки.ВидЦеныПоставщика) Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Действия, ДействияЗаполненияЦены(Объект), Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Действия, ДействияПересчетаСуммы(Объект.ЦенаВключаетНДС));
	КонецЕсли;
	
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(
		СтрокиКОбработке,
		Действия,
		Объект.Товары,
		ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения());
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыВыбораСоглашений()
	
	ДоступныеОперации = Документы.ЗаявкаНаЗакупку.ДоступныеОперацииСоглашений();
	
	ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрВыбора(
		Элементы.Соглашение, "ХозяйственнаяОперация",
		ДоступныеОперации);
		
	ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрВыбора(
		Элементы.ТоварыСоглашение, "ХозяйственнаяОперация",
		ДоступныеОперации);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыВыбораДоговоров()

	ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрВыбора(
		Элементы.Договор, "ТипДоговора",
		ДоступныеТипыДоговоров(КэшФормы));
		
	ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрВыбора(
		Элементы.ТоварыДоговор, "ТипДоговора",
		ДоступныеТипыДоговоров(КэшФормы));
	
КонецПроцедуры

#КонецОбласти

#Область ДополнительныеОбработчикиСобытийЭлементов

#Область Дата_
// Использование "Дата" "недопустимо в данном контексте"

&НаКлиенте
Процедура ДатаПриИзмененииЗавершение(ПересчитыватьЦены, ДополнительныеПараметры) Экспорт 
	
	Если Не ПересчитыватьЦены Тогда
		Возврат;
	КонецЕсли;
	
	ДатаПриИзмененииНаСервере();
	УправлениеСтрокойТоваров();
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	СохранитьКонтрольАссортимента(КэшФормы, Объект.Склад, Объект.Дата);
	Действия = Новый Структура;
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Действия, ДействияЗаполненияЦены(Объект), Истина);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Действия, ДействияЗаполненияСтавкиНДС(Объект, КэшФормы), Истина);
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Объект.Товары, Действия);
	
	Если КонтролироватьАссортимент(КэшФормы) Тогда
		АссортиментСервер.ПроверитьАссортиментТаблицыПодобранныхТоваров(Объект, "Склад");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Организация

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере(КэшированныеЗначения)
	
	Действия = Новый Структура;
		
	ПараметрыЗаполненияДоговора = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияДоговораПоУмолчанию();
	ПараметрыЗаполненияДоговора.Организация = Объект.Организация;
	ПараметрыЗаполненияДоговора.ВалютаВзаиморасчетов = Объект.Валюта;
	ПараметрыЗаполненияДоговора.ТипДоговора = ДоступныеТипыДоговоров(КэшФормы);
	Действия.Вставить("ЗаполнитьДоговорПоУмолчанию", ПараметрыЗаполненияДоговора);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Действия, ДействияЗаполненияНалогообложенияНДС(Объект, КэшФормы), Истина);
	
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Объект.Товары, Действия, КэшированныеЗначения);
	
	ПересчитатьСуммуНДСПоСкорректированнымСтавкам(КэшированныеЗначения);
	
КонецПроцедуры

#КонецОбласти

#Область Склад

&НаКлиенте
Процедура ЗаполнитьСкладВВыделенныхСтрокахЗавершение(ВыбранныйСклад, ДополнительныеПараметры) Экспорт

	Если Не ЗначениеЗаполнено(ВыбранныйСклад) Тогда
		Возврат;
	КонецЕсли;
	
	ВыделенныеСтроки = Элементы.Товары.ВыделенныеСтроки;
	ЗаполненоСтрок = ЗаполнитьСкладВВыделенныхСтрокахНаСервере(ВыделенныеСтроки, ВыбранныйСклад);
	СкладыКлиент.ПоказатьОповещениеОЗаполненииСкладаВТабличнойЧасти(
		ВыбранныйСклад,
		ЗаполненоСтрок,
		ВыделенныеСтроки.Количество());

КонецПроцедуры

&НаСервере
Функция ЗаполнитьСкладВВыделенныхСтрокахНаСервере(Знач ВыделенныеСтроки, ВыбранныйСклад)
	
	ЗаполненоСтрок = СкладыСервер.ЗаполнитьСкладыВВыделенныхСтроках(
		Объект.Товары,
		ВыделенныеСтроки,
		ВыбранныйСклад);
	
	Если ЗаполненоСтрок > 0 Тогда
		ОбновитьКартинкуГруппыСкладов();
	КонецЕсли;
	
	Возврат ЗаполненоСтрок;
	
КонецФункции

&НаСервере
Процедура СкладПриИзмененииСервер()
	
	СкладГруппа = Справочники.Склады.ЭтоГруппаИСкладыИспользуютсяВТЧДокументовЗакупки(Объект.Склад);
	СкладыСервер.ЗаполнитьСкладыВТабличнойЧасти(Объект.Склад, СкладГруппа, Объект.Товары, Ложь);
	
	СохранитьКонтрольАссортимента(КэшФормы, Объект.Склад, Объект.Дата);
	
	Если КонтролироватьАссортимент(КэшФормы) Тогда
		АссортиментСервер.ПроверитьАссортиментТаблицыПодобранныхТоваров(Объект, "Склад");
	КонецЕсли;
	
	УправлениеФормойПоСкладу();
	
КонецПроцедуры

&НаСервере
Процедура УправлениеФормойПоСкладу()
	
	Элементы.ТоварыЗаполнитьСкладВВыделенныхСтроках.Доступность = СкладГруппа;
	ОбновитьКартинкуГруппыСкладов();
	УстановитьПараметрыВыбораТоварыСклад();
	
	Если Не СкладГруппа Тогда
		Элементы.ТоварыГруппаПолучатель.Заголовок = НСтр("ru = 'Подразделение-получатель'");
	Иначе
		Элементы.ТоварыГруппаПолучатель.Заголовок = НСтр("ru = 'Получатель'");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКартинкуГруппыСкладов()
	
	СкладыСервер.ПриИзмененииСкладаВТабличнойЧасти(Объект.Товары, ТаблицаСкладов, СкладГруппа);
	ВсегоСкладов = ТаблицаСкладов.Количество();
	СкладыКлиентСервер.ОбновитьКартинкуГруппыСкладов(НадписьНесколькоСкладов, Элементы.КартинкаНесколькоСкладов, ВсегоСкладов);
	
КонецПроцедуры

#КонецОбласти

#Область Назначение

&НаСервере
Процедура ТоварыНазначениеПриИзмененииНаСервере(КэшированныеЗначения)
	
	СтрокаТоваров = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	Действия = Новый Структура;
	Действия.Вставить("ЗаполнитьСлужебныеРеквизитыПоНазначению", Новый Структура("ТолькоТипНазначения", Истина));
	
	ПараметрыЗаполненияДоговора = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияДоговораПоУмолчанию();
	ПараметрыЗаполненияДоговора.Организация = Объект.Организация;
	ПараметрыЗаполненияДоговора.ВалютаВзаиморасчетов = Объект.Валюта;
	ПараметрыЗаполненияДоговора.ТипДоговора = ДоступныеТипыДоговоров(КэшФормы);
	Действия.Вставить("ЗаполнитьДоговорПоУмолчанию", ПараметрыЗаполненияДоговора);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Действия, ДействияЗаполненияНалогообложенияНДС(Объект, КэшФормы), Истина);
	
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаТоваров, Действия, КэшированныеЗначения);
	
	ПересчитатьСуммуНДСПоСкорректированнымСтавкам(КэшированныеЗначения);
	
КонецПроцедуры

#КонецОбласти

#Область Валюта

&НаСервере
Процедура ПриИзмененииВалютыСервер() 
	
	Действия = Новый Структура;
	
	ПараметрыЗаполненияДоговора = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияДоговораПоУмолчанию();
	ПараметрыЗаполненияДоговора.Организация = Объект.Организация;
	ПараметрыЗаполненияДоговора.ВалютаВзаиморасчетов = Объект.Валюта;
	ПараметрыЗаполненияДоговора.ТипДоговора = ДоступныеТипыДоговоров(КэшФормы);
	Действия.Вставить("ЗаполнитьДоговорПоУмолчанию", ПараметрыЗаполненияДоговора);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Действия, ДействияЗаполненияНалогообложенияНДС(Объект, КэшФормы), Истина);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(
		Действия,
		ДействияЗаполненияСуммовыхРеквизитовФормы(),
		Истина);
	
	ПараметрыПересчета = Ценообразование.ПараметрыПересчетаСуммТаблицыВВалюту(
		Объект.ЦенаВключаетНДС,
		ВалютаДокумента,
		Объект.Валюта,
		?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДатаСеанса()));
		
	Ценообразование.ПересчитатьСуммыТаблицыВВалюту(Объект.Товары, ПараметрыПересчета);
	
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Объект.Товары, Действия);
	
КонецПроцедуры

#КонецОбласти

#Область ЦенаВключаетНДС

&НаСервере
Процедура ЦенаВключаетНДСПриИзмененииНаСервере()
	
	Действия = ДействияПересчетаСуммы(Объект.ЦенаВключаетНДС, Ложь, Истина);
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Объект.Товары, Действия);
	УстановитьДоступностьТоварыСНДС();
	РассчитатьИтоговыеПоказателиЗаявки(ЭтотОбъект);
	
КонецПроцедуры
#КонецОбласти

#Область Партнер

&НаСервере
Процедура ТоварыПартнерПриИзмененииНаСервере(КэшированныеЗначения)

	СтрокаТоваров = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	Действия = Новый Структура;
	
	ПараметрыЗаполненияСоглашения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияСоглашенийПоставщика();
	ПараметрыЗаполненияСоглашения.ХозяйственнаяОперация = Документы.ЗаявкаНаЗакупку.ДоступныеОперацииСоглашений();
	Действия.Вставить("ЗаполнитьСоглашениеПоставщикаПоУмолчанию", ПараметрыЗаполненияСоглашения);
	
	Действия.Вставить("ЗаполнитьКонтрагентаПартнераПоУмолчанию", Истина);
	
	ПараметрыЗаполненияДоговора = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияДоговораПоУмолчанию();
	ПараметрыЗаполненияДоговора.Организация = Объект.Организация;
	ПараметрыЗаполненияДоговора.ВалютаВзаиморасчетов = Объект.Валюта;
	ПараметрыЗаполненияДоговора.ТипДоговора = ДоступныеТипыДоговоров(КэшФормы);
	Действия.Вставить("ЗаполнитьДоговорПоУмолчанию", ПараметрыЗаполненияДоговора);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Действия, ДействияЗаполненияНалогообложенияНДС(Объект, КэшФормы), Истина);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Действия, ДействияЗаполненияВидаЦены(Объект), Истина);
	
	Действия.Вставить("ЗаполнитьНоменклатуруПартнераПоНоменклатуре", Истина);
	
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаТоваров, Действия, КэшированныеЗначения);
	
	ЗаполнитьСлужебныеРеквизитыСоглашений(СтрокаТоваров);
	ПересчитатьСуммуНДСПоСкорректированнымСтавкам(КэшированныеЗначения);
	РассчитатьИтоговыеПоказателиЗаявки(ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область Контрагент

&НаСервере
Процедура ТоварыКонтрагентПриИзмененииНаСервере(КэшированныеЗначения)
	
	СтрокаТоваров = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	Действия = Новый Структура;
	
	ПараметрыЗаполненияДоговора = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияДоговораПоУмолчанию();
	ПараметрыЗаполненияДоговора.Организация = Объект.Организация;
	ПараметрыЗаполненияДоговора.ВалютаВзаиморасчетов = Объект.Валюта;
	ПараметрыЗаполненияДоговора.ТипДоговора = ДоступныеТипыДоговоров(КэшФормы);
	Действия.Вставить("ЗаполнитьДоговорПоУмолчанию", ПараметрыЗаполненияДоговора);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Действия, ДействияЗаполненияНалогообложенияНДС(Объект, КэшФормы), Истина);
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаТоваров, Действия, КэшированныеЗначения);
	
	ПересчитатьСуммуНДСПоСкорректированнымСтавкам(КэшированныеЗначения);
	
КонецПроцедуры

#КонецОбласти

#Область Соглашение

&НаСервере
Процедура ТоварыСоглашениеПриИзмененииНаСервере(КэшированныеЗначения)
	
	СтрокаТоваров = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	Действия = Новый Структура;
	
	Действия.Вставить("ЗаполнитьКонтрагентаПартнераПоУмолчанию", Истина);
	
	ПараметрыЗаполненияДоговора = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияДоговораПоУмолчанию();
	ПараметрыЗаполненияДоговора.Организация = Объект.Организация;
	ПараметрыЗаполненияДоговора.ВалютаВзаиморасчетов = Объект.Валюта;
	ПараметрыЗаполненияДоговора.ТипДоговора = ДоступныеТипыДоговоров(КэшФормы);
	Действия.Вставить("ЗаполнитьДоговорПоУмолчанию", ПараметрыЗаполненияДоговора);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Действия, ДействияЗаполненияНалогообложенияНДС(Объект, КэшФормы), Истина);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Действия, ДействияЗаполненияВидаЦены(Объект), Истина);
	
	Действия.Вставить("ЗаполнитьНоменклатуруПартнераПоНоменклатуре", Истина);
	
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаТоваров, Действия, КэшированныеЗначения);
	
	КэшированныеЗначения.ОбработанныеСтроки.Очистить(); // Очистка строк с корректированной ставкой НДС
	
	ЗаполнитьСлужебныеРеквизитыСоглашений(СтрокаТоваров);
	РассчитатьИтоговыеПоказателиЗаявки(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область Договор

&НаСервере
Процедура ТоварыДоговорПриИзмененииНаСервере(КэшированныеЗначения)
	
	СтрокаТоваров = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	Действия = ДействияЗаполненияНалогообложенияНДС(Объект, КэшФормы);
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаТоваров, Действия, КэшированныеЗначения);
	ПересчитатьСуммуНДСПоСкорректированнымСтавкам(КэшированныеЗначения);
	
КонецПроцедуры

#КонецОбласти

#Область НалогообложениеНДС

&НаСервере
Процедура ТоварыНалогообложениеНДСПриИзмененииНаСервере(КэшированныеЗначения)
	
	СтрокаТоваров = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	Действия = ЗаявкаНаЗакупкуКлиентСервер.ДействияКорректировкиСтавкиНДС(Объект, УказаннаяСтавкаНДС(КэшФормы));
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаТоваров, Действия, КэшированныеЗначения);
	ПересчитатьСуммуНДСПоСкорректированнымСтавкам(КэшированныеЗначения);
	
КонецПроцедуры

#КонецОбласти

#Область НоменклатураПартнера

&НаКлиенте
Процедура ОбработатьВыборНоменклатурыПартнера(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Товары.ТекущиеДанные.НоменклатураПартнера = ВыбранноеЗначение;
	Подключаемый_ПриИзменении_УстановитьДоступностьЭлементовПоСтатусуСервер(ДополнительныеПараметры.ЭлементФормы);
	ОбработатьИзменениеНоменклатурыПартнера();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеНоменклатурыПартнера()
	
	СтрокаТоваров = Элементы.Товары.ТекущиеДанные;
	
	НоменклатураПартнеровКлиент.УстановитьПараметрыВыбораУпаковки(Элементы.ТоварыНоменклатураПартнера.ПараметрыВыбора, СтрокаТоваров);
	НоменклатураПартнеровКлиент.УстановитьПараметрыВыбораУпаковки(Элементы.НоменклатураПартнера.ПараметрыВыбора, СтрокаТоваров);
	
	Действия = Новый Структура;
	
	Действия.Вставить("ЗаполнитьНоменклатуруПоНоменклатуреПартнера");
	
	Действия.Вставить("ПроверитьХарактеристикуПоВладельцу", СтрокаТоваров.Характеристика);
	Действия.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
	Действия.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу", СтрокаТоваров.Упаковка);
	Действия.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
	Действия.Вставить("ПриИзмененииТипаНоменклатуры",
		Новый Структура("ЕстьРаботы, ЕстьОтменено", Истина, Истина));
	
	Действия.Вставить(
		"ПроверитьЗаполнитьСклад",
		ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСкладаВСтрокеТЧ(Объект, СкладГруппа));
		
	Действия.Вставить("ПересчитатьКоличествоЕдиниц");
	
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Действия, ДействияЗаполненияЦены(Объект), Истина);
	
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(СтрокаТоваров, Действия, КэшированныеЗначения);
	
	АктуализироватьПодразделениеСтрокиТоваров(СтрокаТоваров, Объект.Подразделение);

	РассчитатьИтоговыеПоказателиЗаявки(ЭтотОбъект);
	УстановитьПризнакЗаполненияСклада(ЭтотОбъект);
	ОбновитьКартинкуГруппыСкладов();

КонецПроцедуры

#КонецОбласти

#Область ЖелаемаяДатаПоступления

&НаСервере
Процедура УстановитьЖелаемуюДатуПоступленияВШапке()
	Объект.ЖелаемаяДатаПоступления = МаксимальнаяЖелаемаяДатаПоступления();	
	УстановитьЖелаемуюДатуПоступленияВТаблице();
КонецПроцедуры

&НаСервере
Функция МаксимальнаяЖелаемаяДатаПоступления()
	
	ВозвращаемоеЗначение = '00010101';
	Для Каждого СтрокаТоваров Из Объект.Товары Цикл
		ВозвращаемоеЗначение = Макс(ВозвращаемоеЗначение, СтрокаТоваров.ЖелаемаяДатаПоступления);
	КонецЦикла;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

&НаСервере
Процедура УстановитьЖелаемуюДатуПоступленияВТаблице()
	
	Для Каждого СтрокаТоваров Из Объект.Товары Цикл
		СтрокаТоваров.ЖелаемаяДатаПоступления = Объект.ЖелаемаяДатаПоступления;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ЦельЗакупкиПриИзмененииНаСервере()
	
	ПараметрыВыбораСтатей = Документы.ЗаявкаНаЗакупку.ПараметрыВыбораСтатейИАналитик(Объект.ЦельЗакупки);
	ДоходыИРасходыСервер.ПриИзмененииПараметровВыбораСтатей(ЭтотОбъект, ПараметрыВыбораСтатей);
	
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	
	Если Не Документы.ЗаявкаНаЗакупку.КонтролироватьЛимитыБДР(Объект) Тогда
		Объект.НаправлениеДеятельности = Неопределено;
		Для Каждого СтрокаТЧ Из Объект.Товары Цикл
			СтрокаТЧ.СтатьяБюджетов = Неопределено;
		КонецЦикла;
	КонецЕсли;
	
	УправлениеФормой();
	
КонецПроцедуры

#КонецОбласти

#Область РазбивкаСтрок

&НаКлиенте
Процедура РазбитьСтрокуЗавершение(НоваяСтрока, ДополнительныеПараметры) Экспорт 
	
	Если НоваяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	Действия = ДействияПриИзмененииКоличества(Объект.ЦенаВключаетНДС);
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, Действия, КэшированныеЗначения);
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(НоваяСтрока,   Действия, КэшированныеЗначения);
	
КонецПроцедуры

#КонецОбласти

#Область КоммерческиеПредложения

&НаСервере
Функция ЗаполнитьУсловияЗакупкиПоКоммерческимПредложениям(Знач ИдентификаторыСтрок)
	
	НомераСтрок = Новый Массив;
	Для Каждого ИдентификаторСтроки Из ИдентификаторыСтрок Цикл
		СтрокаТоваров = Объект.Товары.НайтиПоИдентификатору(ИдентификаторСтроки);
		НомераСтрок.Добавить(СтрокаТоваров.НомерСтроки);
	КонецЦикла;
	
	ПараметрыЗаполнения = КоммерческиеПредложенияДокументыУТ.ПараметрыЗаполненияУсловийЗакупкиПоКоммерческимПредложениям();
	ПараметрыЗаполнения.Документ = Объект.Ссылка;
	ПараметрыЗаполнения.ДатаКурса = ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДатаСеанса());
	ПараметрыЗаполнения.Валюта = Объект.Валюта;
	ПараметрыЗаполнения.ЦенаВключаетНДС = Объект.ЦенаВключаетНДС;
	
	ПараметрыЗаполнения.ЕстьПартнер = Истина;
	ПараметрыЗаполнения.ЕстьКонтрагент = Истина;
	ПараметрыЗаполнения.НомераСтрок = НомераСтрок;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ПараметрыЗаполнения.ДействияСИзмененнымиСтроками, ДействияПересчетаСуммы(Объект.ЦенаВключаетНДС), Истина);
	ПараметрыЗаполнения.ДействияСИзмененнымиСтроками.Вставить("ЗаполнитьНоменклатуруПартнераПоНоменклатуре", Истина);
	
	// Соглашение в запросах КП не заполняется, заполняем значением по умолчанию:
	ПараметрыЗаполненияСоглашения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияСоглашенийПоставщика();
	ПараметрыЗаполненияСоглашения.ХозяйственнаяОперация = Документы.ЗаявкаНаЗакупку.ДоступныеОперацииСоглашений();
	ПараметрыЗаполнения.ДействияСИзмененнымиСтроками.Вставить("ЗаполнитьСоглашениеПоставщикаПоУмолчанию", ПараметрыЗаполненияСоглашения);
	
	ПараметрыЗаполненияДоговора = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияДоговораПоУмолчанию();
	ПараметрыЗаполненияДоговора.Организация = Объект.Организация;
	ПараметрыЗаполненияДоговора.ВалютаВзаиморасчетов = Объект.Валюта;
	ПараметрыЗаполненияДоговора.ТипДоговора = ДоступныеТипыДоговоров(КэшФормы);
	ПараметрыЗаполнения.ДействияСИзмененнымиСтроками.Вставить("ЗаполнитьДоговорПоУмолчанию", ПараметрыЗаполненияДоговора);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(
		ПараметрыЗаполнения.ДействияСИзмененнымиСтроками,
		ДействияЗаполненияНалогообложенияНДС(Объект, КэшФормы),
		Истина);
	
	РезультатЗаполнения = КоммерческиеПредложенияДокументыУТ.ЗаполнитьУсловияЗакупкиПоКоммерческимПредложениям(Объект.Товары, ПараметрыЗаполнения);
	ЗаполнитьСлужебныеРеквизитыСоглашений(РезультатЗаполнения.ИзмененныеСтроки);
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("Отказ", РезультатЗаполнения.Отказ);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки", РезультатЗаполнения.ТекстОшибки);
	ВозвращаемоеЗначение.Вставить("НомераСтрокСНезаполненнымиУсловиямиЗакупки", РезультатЗаполнения.НомераСтрокСНезаполненнымиУсловиямиЗакупки);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти

#Область ОтменаСтрок

&НаКлиентеНаСервереБезКонтекста
Процедура ТоварыОбновитьОтборСтрокПоОтмененным(Форма, СкрытьОтмененныеСтроки, УстановитьПометкуТоварыСкрыватьОтмененныеСтроки = Истина)
	
	Если СкрытьОтмененныеСтроки Тогда
		Форма.Элементы.Товары.ОтборСтрок = Новый ФиксированнаяСтруктура("Отменено", Ложь);
	Иначе
		Форма.Элементы.Товары.ОтборСтрок = Неопределено;
	КонецЕсли;
	
	Если УстановитьПометкуТоварыСкрыватьОтмененныеСтроки Тогда
		Форма.Элементы.ТоварыСкрыватьОтмененныеСтроки.Пометка = СкрытьОтмененныеСтроки;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ВсеСтрокиОтменены()
	
	Для Каждого СтрокаТоваров Из Объект.Товары Цикл
		
		Если Не СтрокаТоваров.Отменено Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область ЗаписьДокумента

&НаКлиенте
Процедура Подключаемый_ОбработатьЗаписьОбъекта()
	
	ОбщегоНазначенияУТКлиент.ОбработатьЗаписьОбъектаВФорме(ЭтотОбъект, ПараметрыДляЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗакрытьФорму()
	
	Если Открыта() Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область УправлениеФормой

&НаСервере
Процедура УправлениеФормой()

	УправлениеФормойПоСкладу();
	УстановитьДоступностьТоварыСНДС();
	УстановитьДоступностьЭлементовПоСтатусуСервер();
	Элементы.ЖелаемаяДатаПоступления.Видимость = Объект.ПоступлениеОднойДатой;
	Элементы.ТоварыСоздатьЗаказПоставщику.Видимость =
		Перечисления.СтатусыЗаявокНаЗакупку.Согласована(Объект.Статус)
		И ЗначениеИзКэша(КэшФормы, "ПравоДобавленияЗаказаПоставщику");
	
	ВидимостьПолейАналитикЛимитирования = Документы.ЗаявкаНаЗакупку.КонтролироватьЛимитыБДР(Объект);
	Элементы.НаправлениеДеятельности.Видимость = ВидимостьПолейАналитикЛимитирования;
	Элементы.ТоварыСтатьяБюджетов.Видимость = ВидимостьПолейАналитикЛимитирования;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформлениеСписковКлиентСервер.НовыйЭлементОформления(ЭтотОбъект,
		Элементы.ТоварыЖелаемаяДатаПоступления.Имя,
		"Видимость",
		Ложь,
		"Объект.ПоступлениеОднойДатой",
		Истина);
		
	ЦеныПредприятияЗаполнениеСервер.УстановитьУсловноеОформлениеЦенаВключаетНДС(ЭтотОбъект);
	НоменклатураСервер.УстановитьУсловноеОформлениеЕдиницИзмерения(ЭтотОбъект);
	НоменклатураСервер.УстановитьУсловноеОформлениеХарактеристикНоменклатуры(ЭтотОбъект);
	УстановитьУсловноеОформлениеСклада();
	НоменклатураСервер.УстановитьУсловноеОформлениеНазначенияНоменклатуры(ЭтотОбъект,,, Ложь);
	УстановитьУсловноеОформлениеПодразделения();
	УстановитьУсловноеОформлениеСоглашения();
	УстановитьУсловноеОформлениеДоговора();
	
	ЭлементыЗависимыеОтПоставщика = Новый Массив;
	ЭлементыЗависимыеОтПоставщика.Добавить(Элементы.ТоварыКонтрагент.Имя);
	ЭлементыЗависимыеОтПоставщика.Добавить(Элементы.ТоварыНоменклатураПартнера.Имя);
	ЭлементыЗависимыеОтПоставщика.Добавить(Элементы.ТоварыВидЦеныПоставщика.Имя);
	
	УсловноеОформлениеСписковКлиентСервер.НовыйЭлементОформленияНедоступногоПоля(ЭтотОбъект,
		ЭлементыЗависимыеОтПоставщика,
		ЦветаСтиля.ЦветНедоступногоТекста,
		ТекстВыберитеПоставщика(),
		"Объект.Товары.Партнер",
		Истина,
		ВидСравненияКомпоновкиДанных.НеЗаполнено);
	
	УсловноеОформлениеСписковКлиентСервер.НовыйЭлементОформленияНедоступногоПоля(ЭтотОбъект,
		Элементы.ТоварыПредставлениеУсловийЗакупки.Имя,
		ЦветаСтиля.ЦветНедоступногоТекста,
		НСтр("ru = '<Не заполнены>'"),
		"Объект.Товары.ПредставлениеУсловийЗакупки",
		Истина,
		ВидСравненияКомпоновкиДанных.НеЗаполнено);
	
	ЗаказыСервер.УстановитьОформлениеОтмененнойСтроки(УсловноеОформление,
		Элементы.Товары,
		Элементы.ТоварыОтменено.Имя,,
		Элементы.ТоварыЦена.Имя,
		Элементы.ТоварыСумма.Имя);
	
	УчетНДСУП.УстановитьУсловноеОформлениеСуммНДСПоНалогообложениюЗакупки(ЭтотОбъект,
		Элементы.ТоварыСтавкаНДС.Имя,
		Элементы.ТоварыСуммаНДС.Имя,
		Элементы.ТоварыСуммаСНДС.Имя,
		"Объект.Товары.НалогообложениеНДС");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеСклада()
	
	// Скрыт, если указан в шапке (не группа):
	СкладыСервер.УстановитьУсловноеОформлениеСкладаВТЧ(ЭтотОбъект);
	
	ТоварМногооборотнаяТара = Новый СписокЗначений;
	ТоварМногооборотнаяТара.Добавить(Перечисления.ТипыНоменклатуры.Товар);
	ТоварМногооборотнаяТара.Добавить(Перечисления.ТипыНоменклатуры.МногооборотнаяТара);
	
	// Скрыт, если тип номенклатуры не хранится на складе:
	ЭлементОформления = УсловноеОформлениеСписковКлиентСервер.НовыйЭлементОформления(
		ЭтотОбъект,
		Элементы.ТоварыСклад.Имя,
		"Видимость",
		Ложь,
		"Объект.Товары.ТипНоменклатуры",
		ТоварМногооборотнаяТара,
		ВидСравненияКомпоновкиДанных.НеВСписке);
		
	КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(ЭлементОформления.Отбор,
		"Объект.Товары.Склад",
		Истина,
		ВидСравненияКомпоновкиДанных.НеЗаполнено);
		
	// Запрет редактирования, если тип номенклатуры не хранится на складе:
	ЭлементОформления = УсловноеОформлениеСписковКлиентСервер.НовыйПростойЭлементОформления(
		ЭтотОбъект,
		Элементы.ТоварыСклад.Имя);
		
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НезаполненноеПолеТаблицы);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<для товаров>'"));
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
		
	КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(ЭлементОформления.Отбор,
		"Объект.Товары.ТипНоменклатуры",
		ТоварМногооборотнаяТара,
		ВидСравненияКомпоновкиДанных.НеВСписке);
		
	КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(ЭлементОформления.Отбор,
		"Объект.Товары.Склад",
		Истина,
		ВидСравненияКомпоновкиДанных.НеЗаполнено);
		
	// Отметка незаполненного:
	ЭлементОформления = УсловноеОформлениеСписковКлиентСервер.НовыйПростойЭлементОформленияСПараметромОформления(
		ЭтотОбъект,
		Элементы.ТоварыСклад.Имя,
		"ОтметкаНезаполненного",
		Истина);
		
	КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(ЭлементОформления.Отбор,
		"Объект.Товары.Склад",
		Истина,
		ВидСравненияКомпоновкиДанных.НеЗаполнено);
		
	КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(ЭлементОформления.Отбор,
		"Объект.Товары.ТипНоменклатуры",
		ТоварМногооборотнаяТара,
		ВидСравненияКомпоновкиДанных.ВСписке);
	
	ОбщегоНазначенияУТ.УстановитьСнятьОтметкуНезаполненного(
		УсловноеОформление, "ТоварыСклад", "Объект.Товары.Склад", "Объект.Товары.СкладОбязателен");
	
	ОбщегоНазначенияУТ.УстановитьСнятьОтметкуНезаполненного(
		УсловноеОформление, "Склад", "Объект.Склад", "СкладОбязателен");
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеПодразделения()
	
	ТоварМногооборотнаяТара = Новый СписокЗначений;
	ТоварМногооборотнаяТара.Добавить(Перечисления.ТипыНоменклатуры.Товар);
	ТоварМногооборотнаяТара.Добавить(Перечисления.ТипыНоменклатуры.МногооборотнаяТара);
	
	// Отключение видимости, если в таблице указывается склад:
	ЭлементОформления = УсловноеОформлениеСписковКлиентСервер.НовыйПростойЭлементОформленияСПараметромОформления(
		ЭтотОбъект,
		Элементы.ТоварыПодразделение.Имя,
		"Видимость",
		Ложь);
	 
	КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(
		ЭлементОформления.Отбор,
		"Объект.Товары.ТипНоменклатуры",
		ТоварМногооборотнаяТара,
		ВидСравненияКомпоновкиДанных.ВСписке);
		
	КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(
		ЭлементОформления.Отбор,
		"СкладГруппа",
		Истина);
		
	// Поясняющая надпись, если склады не в табличной части:
	ЭлементОформления = УсловноеОформлениеСписковКлиентСервер.НовыйПростойЭлементОформления(
		ЭтотОбъект,
		Элементы.ТоварыПодразделение.Имя);
		
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<для услуг и работ>'"));
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
		
	КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(ЭлементОформления.Отбор,
		"Объект.Товары.ТипНоменклатуры",
		ТоварМногооборотнаяТара,
		ВидСравненияКомпоновкиДанных.ВСписке);
	
	КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(
		ЭлементОформления.Отбор,
		"СкладГруппа",
		Ложь);
	
	// Отключение проверки для работ по агентской закупке:
	ЭлементОформления = УсловноеОформлениеСписковКлиентСервер.НовыйПростойЭлементОформленияСПараметромОформления(
		ЭтотОбъект,
		Элементы.ТоварыПодразделение.Имя,
		"ОтметкаНезаполненного",
		Ложь);
		
	КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(ЭлементОформления.Отбор,
		"Объект.Товары.ТипНоменклатуры",
		Перечисления.ТипыНоменклатуры.Работа);
		
	КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(ЭлементОформления.Отбор,
		"Объект.Товары.ТипНазначения",
		Перечисления.ТипыНазначений.ПоставкаПодПринципала);
		
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыВыбораТоварыСклад()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Склады.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	Склады.Ссылка В ИЕРАРХИИ(&ГруппаСкладов)
	|	И Склады.ЭтоГруппа = ЛОЖЬ
	|	И Склады.ВыборГруппы <> ЗНАЧЕНИЕ(Перечисление.ВыборГруппыСкладов.Запретить)");

	Запрос.УстановитьПараметр("ГруппаСкладов", Объект.Склад);
	ДоступныеСклады = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Элементы.ТоварыСклад.ПараметрыВыбора = Новый ФиксированныйМассив(Новый Массив);
	ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрВыбора(Элементы.ТоварыСклад, "Ссылка", ДоступныеСклады);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборНоменклатурыПартнера()
	
	КлючИзменен = Ложь;
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	ОтборНоменклатурыПартнера = ЗначениеИзКэша(КэшФормы, "ОтборНоменклатурыПартнера");
	
	Для Каждого КлючИЗначение Из ОтборНоменклатурыПартнера Цикл
		
		Если ТекущиеДанные[КлючИЗначение.Ключ] <> КлючИЗначение.Значение Тогда
			КлючИзменен = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не КлючИзменен Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ОтборНоменклатурыПартнера, ТекущиеДанные);
	
	НоменклатураПартнеровКлиент.ЗаполнитьСписокВыбораНоменклатурыПартнера(
		ОтборНоменклатурыПартнера.Партнер,
		ТекущиеДанные,
		Элементы.ТоварыНоменклатураПартнера.СписокВыбора);
		
	Элементы.НоменклатураПартнера.СписокВыбора.Очистить();
	ОбщегоНазначенияКлиентСервер.ДополнитьСписок(
		Элементы.НоменклатураПартнера.СписокВыбора,
		Элементы.ТоварыНоменклатураПартнера.СписокВыбора,
		Ложь);
		
	НоменклатураПартнеровКлиент.УстановитьПараметрыВыбораУпаковки(
		Элементы.ТоварыНоменклатураПартнера.ПараметрыВыбора,
		ТекущиеДанные);
		
	НоменклатураПартнеровКлиент.УстановитьПараметрыВыбораУпаковки(
		Элементы.НоменклатураПартнера.ПараметрыВыбора,
		ТекущиеДанные);
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПризнакЗаполненияСклада(Форма)
	
	Форма.СкладОбязателен = ?(Форма.Объект.Товары.Итог("СкладОбязателен") = 0, 0, 1);
	
КонецПроцедуры

#КонецОбласти

#Область УправлениеСтрокойТоваров

&НаКлиенте
Процедура УправлениеСтрокойТоваров()
	
	СтрокаТоваров = Элементы.Товары.ТекущиеДанные;
	
	УстановитьДоступностьСоглашения(СтрокаТоваров);
	УстановитьДоступностьДоговора(СтрокаТоваров);
	
	ДоступныЭлементыЗависимыеОтПоставщика = Ложь;
	ПодсказкаВводаЭлементовЗависимыхОтПоставщика = "";
	СтрокаВыделена = Истина;
	
	Если СтрокаТоваров = Неопределено Тогда
		// Элементы недоступны
		СтрокаВыделена = Ложь;
	ИначеЕсли Не ЗначениеЗаполнено(СтрокаТоваров.Партнер) Тогда
		ПодсказкаВводаЭлементовЗависимыхОтПоставщика = ТекстВыберитеПоставщика();
	Иначе
		ДоступныЭлементыЗависимыеОтПоставщика = Истина;
	КонецЕсли;
		
	ЭлементыЗависимыеОтПоставщика = Новый Массив;
	ЭлементыЗависимыеОтПоставщика.Добавить(Элементы.Контрагент);
	ЭлементыЗависимыеОтПоставщика.Добавить(Элементы.НоменклатураПартнера);
	ЭлементыЗависимыеОтПоставщика.Добавить(Элементы.ВидЦеныПоставщика);
	
	Для Каждого ЭлементФормы // ПолеФормы
		Из ЭлементыЗависимыеОтПоставщика Цикл 
		
		ЭлементФормы.Доступность    = ДоступныЭлементыЗависимыеОтПоставщика;
		ЭлементФормы.ПодсказкаВвода = ПодсказкаВводаЭлементовЗависимыхОтПоставщика;
		 
	КонецЦикла;
	
	ПараметрыАктивизацииНаКлиенте = Новый Структура;
	ДанныеШапки = Новый Структура;
	ДанныеШапки.Вставить("Дата", Объект.Дата);
	ДанныеШапки.Вставить("Ссылка", Объект.Ссылка);
	ПараметрыАктивизацииНаКлиенте.Вставить("ДанныеШапки", ДанныеШапки);
	
	ДанныеСтроки = Новый Структура;
	ДанныеСтроки.Вставить("Контрагент", ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка"));
	ДанныеСтроки.Вставить("Договор", ПредопределенноеЗначение("Справочник.ДоговорыКонтрагентов.ПустаяСсылка"));
	ДанныеСтроки.Вставить("ХозяйственнаяОперация", ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПустаяСсылка"));
	ДанныеСтроки.Вставить("НалогообложениеНДС", ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка"));
	ДанныеСтроки.Вставить("СтавкаНДС", ПредопределенноеЗначение("Справочник.СтавкиНДС.ПустаяСсылка"));
	ПараметрыАктивизацииНаКлиенте.Вставить("ДанныеСтроки", ДанныеСтроки);
	Если СтрокаВыделена Тогда
		ЗаполнитьЗначенияСвойств(ДанныеСтроки, СтрокаТоваров);
	КонецЕсли;
	
	ПараметрыАктивизации = ПараметрыАктивизацииСтроки(ПараметрыАктивизацииНаКлиенте);
	
	Элементы.НалогообложениеНДС.Доступность = ПараметрыАктивизации.ДоступностьНалогообложения;
	Элементы.НалогообложениеНДС.СписокВыбора.Очистить();
	ОбщегоНазначенияКлиентСервер.ДополнитьСписок(
		Элементы.НалогообложениеНДС.СписокВыбора,
		ПараметрыАктивизации.СписокВыбораНалогообложения,
		Ложь);
	
	Элементы.ТоварыНалогообложениеНДС.ТолькоПросмотр = Не ПараметрыАктивизации.ДоступностьНалогообложения;
	Элементы.ТоварыНалогообложениеНДС.СписокВыбора.Очистить();
	ОбщегоНазначенияКлиентСервер.ДополнитьСписок(
		Элементы.ТоварыНалогообложениеНДС.СписокВыбора,
		ПараметрыАктивизации.СписокВыбораНалогообложения,
		Ложь);
	
	ТипыНалогообложенияБезНДС = УчетНДСУПКлиентСервер.ТипыНалогообложенияСкрывающиеРеквизитыНДС(Элементы.ТоварыСтавкаНДС);
	БлокироватьРеквизитыНДС = Не СтрокаВыделена
		Или ТипыНалогообложенияБезНДС.Найти(ДанныеСтроки.НалогообложениеНДС) <> Неопределено;
		
	БлокироватьСуммуНДС = БлокироватьРеквизитыНДС
		Или Не ЗначениеЗаполнено(ДанныеСтроки.СтавкаНДС)
		Или ПараметрыАктивизации.СтавкаНДС0;
	
	// При недоступной строке элементы должны быть оформлены в одном стиле:
	Элементы.Партнер.Доступность   = СтрокаВыделена;
	Элементы.СтавкаНДС.Доступность = Не БлокироватьРеквизитыНДС;
	Элементы.Цена.Доступность      = СтрокаВыделена;
	Элементы.Сумма.Доступность     = СтрокаВыделена;
	Элементы.СуммаНДС.Доступность  = Не БлокироватьСуммуНДС;
	Элементы.СуммаСНДС.Доступность = СтрокаВыделена;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПараметрыАктивизацииСтроки(ПараметрыАктивизацииНаКлиенте)
	
	// Элемент нельзя передавать с клиента на сервер,
	//    а также модификация значения в таблице отличается от модификации в шапке.
	//    Поэтому используем структуру как адаптер для получения необходимых свойств.
	ОписаниеЭлементаФормы = Новый Структура;
	ОписаниеЭлементаФормы.Вставить("СписокВыбора", Новый СписокЗначений);
	ОписаниеЭлементаФормы.Вставить("Видимость",    Истина);
	ОписаниеЭлементаФормы.Вставить("Заголовок",    "");
	
	ПараметрыЗаполнения          = УчетНДСУПКлиентСервер.ПараметрыПакетногоЗаполненияНалогообложенияНДСЗакупки();
	ПараметрыЗаполнения.Дата     = ПараметрыАктивизацииНаКлиенте.ДанныеШапки.Дата;
	ПараметрыЗаполнения.Документ = ПараметрыАктивизацииНаКлиенте.ДанныеШапки.Ссылка;
	
	ПараметрыНалогообложенияНДС = Документы.ЗаявкаНаЗакупку.ПараметрыНалогообложенияНДС(
		ПараметрыАктивизацииНаКлиенте.ДанныеСтроки,
		ПараметрыЗаполнения);
	
	УчетНДСУП.ЗаполнитьСписокВыбораНалогообложенияНДСЗакупки(
		ОписаниеЭлементаФормы,
		ПараметрыАктивизацииНаКлиенте.ДанныеСтроки.НалогообложениеНДС,
		ПараметрыНалогообложенияНДС);
	
	СтавкаНДС0 = Не ЗначениеЗаполнено(ПараметрыАктивизацииНаКлиенте.ДанныеСтроки.СтавкаНДС)
		Или УчетНДСУП.НезначащаяСтавка(ПараметрыАктивизацииНаКлиенте.ДанныеСтроки.СтавкаНДС);
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("СписокВыбораНалогообложения", ОписаниеЭлементаФормы.СписокВыбора);
	ВозвращаемоеЗначение.Вставить("ДоступностьНалогообложения", ОписаниеЭлементаФормы.Видимость);
	ВозвращаемоеЗначение.Вставить("СтавкаНДС0", СтавкаНДС0);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#Область Соглашение

&НаКлиенте
Процедура УстановитьДоступностьСоглашения(СтрокаТоваров)
	
	ЭлементФормы = Элементы.Найти("Соглашение");
	Если ЭлементФормы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементДоступен = Ложь;
	ПодсказкаВвода = "";
	
	Если СтрокаТоваров = Неопределено Тогда
		// Элемент не доступен
	ИначеЕсли ЗначениеЗаполнено(СтрокаТоваров.Соглашение) Тогда
		ЭлементДоступен = Истина; // Недействующее соглашение должно быть доступно
	ИначеЕсли Не ЗначениеЗаполнено(СтрокаТоваров.Партнер) Тогда
		ПодсказкаВвода = ТекстВыберитеПоставщика();
	ИначеЕсли СтрокаТоваров.КоличествоСоглашений = 0 Тогда
		ПодсказкаВвода = НСтр("ru = '<соглашения отсутствуют>'");
	Иначе
		ЭлементДоступен = Истина;
	КонецЕсли;

	ЭлементФормы.Доступность    = ЭлементДоступен;
	ЭлементФормы.ПодсказкаВвода = ПодсказкаВвода;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеСоглашения()
	
	ИмяЭлемента = Элементы.ТоварыСоглашение.Имя;
	
	ЭлементОформления = УсловноеОформлениеСписковКлиентСервер.НовыйЭлементОформленияНедоступногоПоля(ЭтотОбъект,
		ИмяЭлемента,
		ЦветаСтиля.ЦветНедоступногоТекста,
		НСтр("ru = '<соглашения отсутствуют>'"),
		"Объект.Товары.КоличествоСоглашений",
		Истина,
		ВидСравненияКомпоновкиДанных.НеЗаполнено);
		
	// Недействующее соглашение должно быть доступно
	КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(ЭлементОформления.Отбор,
		"Объект.Товары.Соглашение",
		Истина,
		ВидСравненияКомпоновкиДанных.НеЗаполнено);
		
	УсловноеОформлениеСписковКлиентСервер.НовыйЭлементОформленияНедоступногоПоля(ЭтотОбъект,
		ИмяЭлемента,
		ЦветаСтиля.ЦветНедоступногоТекста,
		ТекстВыберитеПоставщика(),
		"Объект.Товары.Партнер",
		Истина,
		ВидСравненияКомпоновкиДанных.НеЗаполнено);
	
КонецПроцедуры

#КонецОбласти

#Область Договор

&НаКлиенте
Процедура УстановитьДоступностьДоговора(СтрокаТоваров)
	
	ЭлементФормы = Элементы.Найти("Договор");
	Если ЭлементФормы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементДоступен = Ложь;
	ПодсказкаВвода = "";
	Если СтрокаТоваров = Неопределено Тогда
		// Элемент не доступен
	ИначеЕсли Не ЗначениеЗаполнено(Объект.Организация) Тогда
		ПодсказкаВвода = НСтр("ru = '<выберите организацию>'");
	ИначеЕсли Не ЗначениеЗаполнено(СтрокаТоваров.Партнер) Тогда
		ПодсказкаВвода = ТекстВыберитеПоставщика();
	ИначеЕсли Не ЗначениеЗаполнено(СтрокаТоваров.Контрагент) Тогда
		ПодсказкаВвода = НСтр("ru = '<выберите контрагента>'");
	ИначеЕсли Не СтрокаТоваров.ИспользуютсяДоговорыКонтрагентов Тогда
		ПодсказкаВвода = НСтр("ru = '<не используется>'");
	Иначе
		ЭлементДоступен = Истина;
	КонецЕсли;
	
	ЭлементФормы.Доступность    = ЭлементДоступен;
	ЭлементФормы.ПодсказкаВвода = ПодсказкаВвода;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеДоговора()
	
	ИмяЭлемента = Элементы.ТоварыДоговор.Имя;
	
	УсловноеОформлениеСписковКлиентСервер.НовыйЭлементОформленияНедоступногоПоля(ЭтотОбъект,
		ИмяЭлемента,
		ЦветаСтиля.ЦветНедоступногоТекста,
		НСтр("ru = '<не используется>'"),
		"Объект.Товары.ИспользуютсяДоговорыКонтрагентов",
		Ложь);
	
	УсловноеОформлениеСписковКлиентСервер.НовыйЭлементОформленияНедоступногоПоля(ЭтотОбъект,
		ИмяЭлемента,
		ЦветаСтиля.ЦветНедоступногоТекста,
		НСтр("ru = '<выберите контрагента>'"),
		"Объект.Товары.Контрагент",
		Истина,
		ВидСравненияКомпоновкиДанных.НеЗаполнено);
		
	УсловноеОформлениеСписковКлиентСервер.НовыйЭлементОформленияНедоступногоПоля(ЭтотОбъект,
		ИмяЭлемента,
		ЦветаСтиля.ЦветНедоступногоТекста,
		ТекстВыберитеПоставщика(),
		"Объект.Товары.Партнер",
		Истина,
		ВидСравненияКомпоновкиДанных.НеЗаполнено);
		
	УсловноеОформлениеСписковКлиентСервер.НовыйЭлементОформленияНедоступногоПоля(ЭтотОбъект,
		ИмяЭлемента,
		ЦветаСтиля.ЦветНедоступногоТекста,
		НСтр("ru = '<выберите организацию>'"),
		"Объект.Организация",
		Истина,
		ВидСравненияКомпоновкиДанных.НеЗаполнено);
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура УстановитьДоступностьТоварыСНДС()
	
	Элементы.ТоварыСуммаСНДС.Видимость = Не Объект.ЦенаВключаетНДС;
	Элементы.СуммаСНДС.Видимость       = Не Объект.ЦенаВключаетНДС;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ТекстВыберитеПоставщика()
	Возврат НСтр("ru = '<выберите поставщика>'");
КонецФункции

#КонецОбласти

#Область ПодборыИОбработкаПроверкиКоличества

&НаКлиенте
Процедура СообщитьОбОшибкахОткрытияПодбора(Отказ) 
	
	Если Не ЗначениеЗаполнено(Объект.Валюта) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Поле ""Валюта"" не заполнено'"), Объект.Ссылка, "Объект.Валюта",,Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение)

	ПодобранныеТовары = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресТоваровВХранилище);
	
	Действия = Новый Структура;
	Действия.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
	Действия.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
	Действия.Вставить("ПриИзмененииТипаНоменклатуры", Новый Структура("ЕстьРаботы, ЕстьОтменено", Истина, Истина));
	Действия.Вставить("ЗаполнитьПризнакХарактеристикиИспользуются", Новый Структура("Номенклатура", "ХарактеристикиИспользуются"));
	
	Действия.Вставить("ЗаполнитьСлужебныеРеквизитыПоНазначению", Новый Структура("ТолькоТипНазначения", Истина));
	
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Действия, ДействияЗаполненияСтавкиНДС(Объект, КэшФормы), Истина);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Действия, ДействияПересчетаСуммы(Объект.ЦенаВключаетНДС), Истина);
	
	ОбрабатываемыеСтроки = Новый Массив;
	
	Для Каждого ПодобраннаяСтрока Из ПодобранныеТовары Цикл
		
		СтрокаТоваров = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТоваров, ПодобраннаяСтрока, 
			"НоменклатураПартнера, Номенклатура, Характеристика, Упаковка, Склад, 
			|ВидЦеныПоставщика, Цена, КоличествоУпаковок, Количество, Сумма");
		
		Если Объект.ПоступлениеОднойДатой Тогда
			СтрокаТоваров.ЖелаемаяДатаПоступления = Объект.ЖелаемаяДатаПоступления;
		КонецЕсли;
		
		ОбрабатываемыеСтроки.Добавить(СтрокаТоваров);
		
	КонецЦикла;
	
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(
		ОбрабатываемыеСтроки,
		Действия,
		Объект.Товары);
	
	Для Каждого СтрокаТоваров Из ОбрабатываемыеСтроки Цикл
		АктуализироватьПодразделениеСтрокиТоваров(СтрокаТоваров, Объект.Подразделение);
	КонецЦикла;
		
	Если КонтролироватьАссортимент(КэшФормы) Тогда
		АссортиментСервер.ПроверитьАссортиментТаблицыПодобранныхТоваров(Объект, "Склад", ПодобранныеТовары);
	КонецЕсли;

	РассчитатьИтоговыеПоказателиЗаявки(ЭтотОбъект);
	ОбновитьКартинкуГруппыСкладов();

КонецПроцедуры

#КонецОбласти

#Область КэшФормы

&НаСервере
Процедура ИнициализироватьКэшФормы()

	КэшФормы = Новый Структура;
		
	УстановитьЗначениеВКэше(КэшФормы,
		"КонечныеСтатусы",
		Перечисления.СтатусыЗаявокНаЗакупку.КонечныеСтатусы());
	
	УстановитьЗначениеВКэше(КэшФормы,
		"ДоступныеТипыДоговоров",
		Документы.ЗаявкаНаЗакупку.ДоступныеТипыДоговоров());
		
	СохранитьУказаннуюСтавкуНДС(КэшФормы, Справочники.СтавкиНДС.ПустаяСсылка());
	СохранитьКонтрольАссортимента(КэшФормы, Объект.Склад, Объект.Дата);
	
	УстановитьЗначениеВКэше(КэшФормы,
		"ИменаРеквизитовУсловийЗакупки",
		Документы.ЗаявкаНаЗакупку.ИменаРеквизитовУсловийЗакупки());
	
	РаботаСТабличнымиЧастями.ИнициализироватьКэшСтрок(Элементы.Товары);
	
	ОтборНоменклатурыПартнера = Новый Структура;
	ОтборНоменклатурыПартнера.Вставить("Партнер");
	ОтборНоменклатурыПартнера.Вставить("Номенклатура");
	ОтборНоменклатурыПартнера.Вставить("Характеристика");
	ОтборНоменклатурыПартнера.Вставить("Упаковка");
	УстановитьЗначениеВКэше(КэшФормы,
		"ОтборНоменклатурыПартнера",
		ОтборНоменклатурыПартнера);
	
	УстановитьЗначениеВКэше(КэшФормы,
		"ПравоДобавленияЗаказаПоставщику",
		ПравоДоступа("Добавление", Метаданные.Документы.ЗаказПоставщику));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗначениеВКэше(КэшФормы, ИмяСвойства, ЗначениеСвойства)
	
	Если Не КэшФормы.Свойство(ИмяСвойства) Тогда
		
		КэшФормы.Вставить(ИмяСвойства);
		
	КонецЕсли;
	
	КэшФормы[ИмяСвойства] = ЗначениеСвойства;
	
КонецПроцедуры

// Значение из кэша.
// 
// Параметры:
//  КэшФормы - Структура - Одноименный реквизит формы
//  ИмяСвойства - Строка - Имя свойства в кэше, установленное через "УстановитьЗначениеВКэше"
// 
// Возвращаемое значение:
//  Произвольный - Ранее сохраненное значение
&НаКлиентеНаСервереБезКонтекста
Функция ЗначениеИзКэша(КэшФормы, ИмяСвойства)
	
	Возврат КэшФормы[ИмяСвойства];
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ДоступныеТипыДоговоров(КэшФормы)
	Возврат ЗначениеИзКэша(КэшФормы, "ДоступныеТипыДоговоров");
КонецФункции

#Область СохраненнаяСтавкаНДС

&НаКлиентеНаСервереБезКонтекста
Процедура СохранитьУказаннуюСтавкуНДС(КэшФормы, УказаннаяСтавкаНДС)
	УстановитьЗначениеВКэше(КэшФормы, "УказаннаяСтавкаНДС", УказаннаяСтавкаНДС);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция УказаннаяСтавкаНДС(КэшФормы)
	Возврат ЗначениеИзКэша(КэшФормы, "УказаннаяСтавкаНДС");
КонецФункции

#КонецОбласти

#Область КонтрольАссортимента

&НаСервереБезКонтекста
Процедура СохранитьКонтрольАссортимента(КэшФормы, Склад, Дата)
	
	 УстановитьЗначениеВКэше(КэшФормы,
	 	"КонтролироватьАссортимент",
	 	АссортиментСерверПовтИсп.КонтролироватьАссортимент(Склад, Дата));
	
КонецПроцедуры
	
&НаКлиентеНаСервереБезКонтекста
Функция КонтролироватьАссортимент(КэшФормы)
	
	Возврат ЗначениеИзКэша(КэшФормы, "КонтролироватьАссортимент");
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПараметрыПроверкиАссортимента(Объект)
	
	ВозвращаемоеЗначение = АссортиментКлиентСервер.ПараметрыПроверкиАссортимента();
	ВозвращаемоеЗначение.Ссылка = Объект.Ссылка;
	ВозвращаемоеЗначение.Склад = Объект.Склад;
	ВозвращаемоеЗначение.Дата = ?(ЗначениеЗаполнено(Объект.ЖелаемаяДатаПоступления), Объект.ЖелаемаяДатаПоступления, Объект.Дата);
	ВозвращаемоеЗначение.ТекстСообщения = НСтр("ru = 'Товар %1 не включен в ассортимент магазина. Заказывать его не рекомендуется.'");
	ВозвращаемоеЗначение.ИмяРесурсаАссортимента = "РазрешеныЗакупки";
	ВозвращаемоеЗначение.ПровереноМожноДобавлять = Истина;
	ВозвращаемоеЗначение.РазрешатьДобавление = Истина;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ПакетнаяОбработкаТабличнойЧасти

&НаКлиентеНаСервереБезКонтекста
Функция ДействияПриИзмененииКоличества(ЦенаВключаетНДС)
	
	Действия = ЗаявкаНаЗакупкуКлиентСервер.ДействияПриИзмененииКоличества(ЦенаВключаетНДС);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Действия, ДействияЗаполненияСуммовыхРеквизитовФормы(), Истина);
	
	Возврат Действия;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ДействияЗаполненияВидаЦены(Объект)

	Действия = ЗаявкаНаЗакупкуКлиентСервер.ДействияЗаполненияВидаЦены(Объект);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Действия, ДействияЗаполненияСуммовыхРеквизитовФормы(), Истина);
	
	Возврат Действия;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ДействияЗаполненияЦены(Объект)

	Действия = ЗаявкаНаЗакупкуКлиентСервер.ДействияЗаполненияЦены(Объект);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Действия, ДействияЗаполненияСуммовыхРеквизитовФормы(), Истина);
	
	Возврат Действия;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ДействияЗаполненияНалогообложенияНДС(Объект, КэшФормы)
	
	УказаннаяСтавкаНДС = УказаннаяСтавкаНДС(КэшФормы);
	Действия = ЗаявкаНаЗакупкуКлиентСервер.ДействияЗаполненияНалогообложенияНДС(Объект, УказаннаяСтавкаНДС);
	
	// Т.к. налогообложение может изменить ставку НДС необходимо пересчитывать суммы.
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Действия, ДействияЗаполненияСуммовыхРеквизитовФормы(), Истина);
	
	Возврат Действия; 
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ДействияЗаполненияСтавкиНДС(Объект, КэшФормы)

	УказаннаяСтавкаНДС = УказаннаяСтавкаНДС(КэшФормы);
	Действия = ЗаявкаНаЗакупкуКлиентСервер.ДействияЗаполненияСтавкиНДС(Объект, УказаннаяСтавкаНДС);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Действия, ДействияЗаполненияСуммовыхРеквизитовФормы(), Истина);
	
	Возврат Действия;
		
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ДействияПересчетаСуммы(ЦенаВключаетНДС, ПересчитатьСумму = Истина, ПересчитатьСуммуНДС = Истина)
	
	Действия = ЗаявкаНаЗакупкуКлиентСервер.ДействияПересчетаСуммы(ЦенаВключаетНДС, ПересчитатьСумму, ПересчитатьСуммуНДС);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Действия, ДействияЗаполненияСуммовыхРеквизитовФормы(), Истина);
	
	Возврат Действия;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ДействияЗаполненияСуммовыхРеквизитовФормы()
	
	ОписаниеДубликатов = Новый Структура("Отменено", "СуммаНДС, СуммаСНДС");
	Действия = Новый Структура;
	Действия.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ОписаниеДубликатов);
	Действия.Вставить("ЗаполнитьПредставлениеУсловийЗакупки");
	
	Возврат Действия
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСлужебныеРеквизитыСоглашений(СтрокиТоваров = Неопределено)
	
	Действия = Новый Структура;
	
	ПараметрыЗаполненияСоглашения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияСоглашенийПоставщика();
	
	// Заполняемые реквизиты используются только для интерактивной работы, не участвуют в пакетной обработке.
	Действия.Вставить("ЗаполнитьРеквизитыПоСоглашениюПоставщика"); 
	
	// Заполняется в привилегированном режиме. Нельзя добавлять в общий пакет запросов.
	Действия.Вставить("ЗаполнитьКоличествоСоглашенийПоставщика", ПараметрыЗаполненияСоглашения); 
	
	КэшированныеЗначения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	Если СтрокиТоваров = Неопределено Тогда
		
		ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Объект.Товары,
			Действия,
			КэшированныеЗначения);
	
	ИначеЕсли ТипЗнч(СтрокиТоваров) = Тип("Массив") Тогда
		
		ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(СтрокиТоваров,
			Действия,
			Объект.Товары,
			КэшированныеЗначения);
		
	Иначе
		
		ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокиТоваров,
			Действия,
			КэшированныеЗначения);
	
	КонецЕсли;
	
КонецПроцедуры

// Пересчитывает сумму НДС в строках табличной части для строк, 
// в которых была изменена ставка НДС после вызова действия "СкорректироватьСтавкуНДС" обработки табличной части.
// Параметры:
//  КэшированныеЗначения - См. ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения
&НаСервере
Процедура ПересчитатьСуммуНДСПоСкорректированнымСтавкам(КэшированныеЗначения)
	
	Если КэшированныеЗначения = Неопределено Тогда
		Возврат; // Пакетная обработка не инициализировалась, т.к. нет строк к обработке.
	КонецЕсли;
	
	Действия = ДействияПересчетаСуммы(Объект.ЦенаВключаетНДС, Ложь, Истина);
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(КэшированныеЗначения.ОбработанныеСтроки,
		Действия,
		Объект.Товары,
		КэшированныеЗначения);
	КэшированныеЗначения.ОбработанныеСтроки.Очистить();
	
	РассчитатьИтоговыеПоказателиЗаявки(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ИнтегрируемыеПодсистемы

#Область Протокол

&НаКлиенте
Процедура Подключаемый_ПриИзмененииПротокола(ОписаниеИзменений, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Не ОписаниеИзменений.ИзмененныеСвойства.Свойство("Статус") Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриИзмененииСтатусаПослеВопроса", ЭтотОбъект);
	
	Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявокНаЗакупку.Закрыта")
		И ЕстьНезаказанныеСтроки() Тогда
		
		ТекстВопроса = НСтр("ru = 'В документе присутствуют строки, по которым не сформированы заказы поставщикам. Отменить незаказанные товары?'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, КодВозвратаДиалога.Нет);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииСтатусаПослеВопроса(ОтветОтменитьНезаказанныеСтроки, ДополнительныеПараметры = Неопределено) Экспорт
	
	ОтменитьНезаказанныеСтроки = ОтветОтменитьНезаказанныеСтроки = КодВозвратаДиалога.Да;
	ПриИзмененииСтатусаНаСервере(ОтменитьНезаказанныеСтроки);
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииСтатусаНаСервере(ОтменитьНезаказанныеСтроки)
	
	Если ОтменитьНезаказанныеСтроки Тогда
		ОтменитьНезаказанныеСтрокиСервер();
	КонецЕсли;
	
	Если Не Перечисления.СтатусыЗаявокНаЗакупку.Согласована(Объект.Статус) Тогда
		// Заявку можно закрыть или вернуть в работу без повторного согласования
		Объект.Согласован = Ложь;
	КонецЕсли;
	
	УправлениеФормой();
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	
КонецПроцедуры

#КонецОбласти

#Область ЗагрузкаИзФайла

&НаКлиенте
Процедура ЗагрузитьИзВнешнегоФайлаЗавершение(АдресЗагруженныхДанных, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(АдресЗагруженныхДанных) Тогда
		ПолучитьЗагруженныеТоварыИзХранилища(АдресЗагруженныхДанных);
		УстановитьПризнакЗаполненияСклада(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьЗагруженныеТоварыИзХранилища(АдресТоваровВХранилище)
	
	Действия = Новый Структура;
	Действия.Вставить("ЗаполнитьСлужебныеРеквизитыПоНазначению", Новый Структура("ТолькоТипНазначения", Истина));
	Действия.Вставить(
		"ПроверитьЗаполнитьСклад",
		ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСкладаВСтрокеТЧ(Объект, СкладГруппа));
	Действия.Вставить("ПриИзмененииТипаНоменклатуры",
		Новый Структура("ЕстьРаботы, ЕстьОтменено", Истина, Истина));
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Действия, ДействияПриИзмененииКоличества(Объект.ЦенаВключаетНДС), Истина);
	
	ОбрабатываемыеСтроки = Новый Массив;
	ТоварыИзХранилища = ПолучитьИзВременногоХранилища(АдресТоваровВХранилище);
	
	Для Каждого СтрокаИсточник Из ТоварыИзХранилища Цикл
		СтрокаТоваров = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТоваров, СтрокаИсточник);
		ОбрабатываемыеСтроки.Добавить(СтрокаТоваров);
	КонецЦикла;
	
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(
		ОбрабатываемыеСтроки,
		Действия,
		Объект.Товары);
	
	Для Каждого СтрокаТоваров Из ОбрабатываемыеСтроки Цикл
		АктуализироватьПодразделениеСтрокиТоваров(СтрокаТоваров, Объект.Подразделение);
	КонецЦикла;
	
	РассчитатьИтоговыеПоказателиЗаявки(ЭтотОбъект);
	ОбновитьКартинкуГруппыСкладов();
	
КонецПроцедуры

#КонецОбласти

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
//
// Служебный метод для выполнения контекстного вызова сервера из подсистемы "ПодключаемыеКоманды".
// Параметры:
//  ПараметрыВыполнения - Структура
//  ДополнительныеПараметры - Произвольный - Не используется.
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область ШтрихкодыИТорговоеОборудование

&НаКлиенте
Процедура ПоискПоШтрихкодуЗавершение(ДанныхШтрихкода, ДополнительныеПараметры) Экспорт
	
	ОбработатьШтрихкоды(ДанныхШтрихкода);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзТСДЗавершение(Результат, Параметры) Экспорт
	
	Если Результат.Результат Тогда
		ОбработатьШтрихкоды(Результат.ТаблицаТоваров);
	Иначе
		МенеджерОборудованияУТКлиент.СообщитьОбОшибке(Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШтрихкоды(ДанныеШтрихкодов)
	
	ОчиститьСообщения();
	
	Если Не ШтрихкодированиеНоменклатурыКлиент.ШтрихкодыВалидны(ДанныеШтрихкодов) Тогда
		Возврат;
	КонецЕсли;
	
	ДействияПриИзмененииКоличества = ДействияПриИзмененииКоличества(Объект.ЦенаВключаетНДС);
	
	ДействияСДобавленнымиСтроками = Новый Структура;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ДействияСДобавленнымиСтроками, ДействияЗаполненияЦены(Объект), Истина);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ДействияСДобавленнымиСтроками, ДействияЗаполненияСтавкиНДС(Объект, КэшФормы), Истина);
	
	ДействияСДобавленнымиСтроками.Вставить(
		"ПроверитьЗаполнитьСклад",
		ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСкладаВСтрокеТЧ(Объект, СкладГруппа));
		
	ДействияСДобавленнымиСтроками.Вставить("ЗаполнитьПризнакХарактеристикиИспользуются", Новый Структура("Номенклатура", "ХарактеристикиИспользуются"));
	ДействияСДобавленнымиСтроками.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
	ДействияСДобавленнымиСтроками.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
	ДействияСДобавленнымиСтроками.Вставить("ПриИзмененииТипаНоменклатуры",
		Новый Структура("ЕстьРаботы, ЕстьОтменено", Истина, Истина));
	
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ДействияСДобавленнымиСтроками, ДействияПриИзмененииКоличества, Истина);
	
	ДействияСИзмененнымиСтроками = Новый Структура;
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ДействияСДобавленнымиСтроками, ДействияПриИзмененииКоличества, Истина);
	
	ПараметрыОбработкиШтрихкодов = ШтрихкодированиеНоменклатурыКлиент.ПараметрыОбработкиШтрихкодов();
	ПараметрыОбработкиШтрихкодов.Штрихкоды                              = ДанныеШтрихкодов;
	ПараметрыОбработкиШтрихкодов.СтруктураДействийСДобавленнымиСтроками = ДействияСДобавленнымиСтроками;
	ПараметрыОбработкиШтрихкодов.СтруктураДействийСИзмененнымиСтроками  = ДействияСИзмененнымиСтроками;
	
	Если КонтролироватьАссортимент(КэшФормы) Тогда
		ПараметрыОбработкиШтрихкодов.ПараметрыПроверкиАссортимента = ПараметрыПроверкиАссортимента(Объект);
	КонецЕсли;
		
	ОбработатьШтрихкодыСервер(ПараметрыОбработкиШтрихкодов, КэшированныеЗначения);
	
	ШтрихкодированиеНоменклатурыКлиент.ОбработатьНеизвестныеШтрихкоды(ПараметрыОбработкиШтрихкодов, КэшированныеЗначения, ЭтотОбъект);
	
	Если ПараметрыОбработкиШтрихкодов.ТекущаяСтрока <> Неопределено Тогда
		Элементы.Товары.ТекущаяСтрока = ПараметрыОбработкиШтрихкодов.ТекущаяСтрока;
		СтрокаТоваров = Элементы.Товары.ТекущиеДанные;
		
		Если Объект.ПоступлениеОднойДатой Тогда
			СтрокаТоваров.ЖелаемаяДатаПоступления = Объект.ЖелаемаяДатаПоступления;
		КонецЕсли;
		
		АктуализироватьПодразделениеСтрокиТоваров(СтрокаТоваров, Объект.Подразделение);
		
	КонецЕсли;
	
	РассчитатьИтоговыеПоказателиЗаявки(ЭтотОбъект);
	УстановитьПризнакЗаполненияСклада(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьШтрихкодыСервер(ПараметрыОбработкиШтрихкодов, КэшированныеЗначения)
	ШтрихкодированиеНоменклатурыСервер.ОбработатьШтрихкоды(ЭтотОбъект, Объект, ПараметрыОбработкиШтрихкодов, КэшированныеЗначения);
КонецПроцедуры

#КонецОбласти

#Область РаботаСФайлами

// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	 РаботаСФайламиКлиент.ПолеПредпросмотраПроверкаПеретаскивания(ЭтотОбъект, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	 РаботаСФайламиКлиент.ПолеПредпросмотраПеретаскивание(ЭтотОбъект, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраНажатие(Элемент, СтандартнаяОбработка)
	 РаботаСФайламиКлиент.ПолеПредпросмотраНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами

#КонецОбласти

#Область Свойства

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти

#Область ИнтеграцияС1СДокументооборотом

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(
		Команда,
		ЭтотОбъект,
		Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтотОбъект, Команда);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

#КонецОбласти

//@skip-check invocation-form-event-handler - Особенности реализации.
// Обработчики событий переназначаются на "подписку", затем выполняется вызов исходного обработчика.
#Область КонтрольНесогласованныхИзменений

&НаСервере
Процедура УстановитьДоступностьЭлементовПоСтатусуСервер()
	
	ИменаЭлементов = Новый Массив;
	
	// Шапка:
	ИменаЭлементов.Добавить(Элементы.Дата.Имя);
	ИменаЭлементов.Добавить(Элементы.Организация.Имя);
	ИменаЭлементов.Добавить(Элементы.Подразделение.Имя);
	ИменаЭлементов.Добавить(Элементы.Склад.Имя);
	
	ИменаЭлементов.Добавить(Элементы.Валюта.Имя);
	ИменаЭлементов.Добавить(Элементы.ЦенаВключаетНДС.Имя);
	ИменаЭлементов.Добавить(Элементы.ПоступлениеОднойДатой.Имя);
	ИменаЭлементов.Добавить(Элементы.ЖелаемаяДатаПоступления.Имя);
	
	// Товары:
	ИменаЭлементов.Добавить("Товары;ПередНачаломДобавления,ПередУдалением");
	ИменаЭлементов.Добавить(Элементы.ТоварыНоменклатура.Имя);
	ИменаЭлементов.Добавить(Элементы.ТоварыХарактеристика.Имя);
	ИменаЭлементов.Добавить(Элементы.ТоварыКоличествоУпаковок.Имя);
	ИменаЭлементов.Добавить(Элементы.ТоварыУпаковка.Имя);
	ИменаЭлементов.Добавить(Элементы.ТоварыСклад.Имя);
	ИменаЭлементов.Добавить(Элементы.ТоварыОтменено.Имя);
	ИменаЭлементов.Добавить(Элементы.ТоварыЖелаемаяДатаПоступления.Имя);
	
	Для Каждого ИмяРеквизита Из ЗначениеИзКэша(КэшФормы, "ИменаРеквизитовУсловийЗакупки") Цикл
		
		ИменаЭлементов.Добавить(Элементы[ИмяРеквизита].Имя);
		ИменаЭлементов.Добавить(Элементы["Товары" + ИмяРеквизита].Имя);
		
	КонецЦикла;
	
	// Команды (товары):
	ИменаЭлементов.Добавить(Элементы.ТоварыВставитьСтроки.Имя);
	ИменаЭлементов.Добавить(Элементы.ТоварыПоискПоШтрихкоду.Имя);
	ИменаЭлементов.Добавить(Элементы.ТоварыЗагрузитьДанныеИзТСД.Имя);
	ИменаЭлементов.Добавить(Элементы.ТоварыВставитьУсловияЗакупки.Имя);
	ИменаЭлементов.Добавить(Элементы.ТоварыЗаполнитьУсловияЗакупкиПоКоммерческимПредложениям.Имя);
	ИменаЭлементов.Добавить(Элементы.ТоварыПодобратьНоменклатуру.Имя);
	ИменаЭлементов.Добавить(Элементы.ТоварыПодобратьАналоги.Имя);
	ИменаЭлементов.Добавить(Элементы.ТоварыЗагрузитьИзВнешнегоФайла.Имя);
	
	ИменаЭлементов.Добавить(Элементы.ТоварыОтменитьВыделенныеСтроки.Имя);
	ИменаЭлементов.Добавить(Элементы.ТоварыОтменитьНезаказанныеСтроки.Имя);
	
	ИменаЭлементов.Добавить(Элементы.ТоварыЗаполнитьСкладВВыделенныхСтроках.Имя);
	
	ОбщегоНазначенияУТ.УстановитьПодпискуНаСобытияИзмененияЭлементовФормы(
		ЭтотОбъект,
		ИменаЭлементов);
	
КонецПроцедуры

// Параметры:
//	Элемент - ГруппаФормы, ТаблицаФормы, ПолеФормы, КнопкаФормы - ЭлементФормы
&НаКлиенте
Процедура КонтрольНеСогласованныхИзмененийОбработатьСобытиеПриИзменении(Элемент)
	
	ИмяЭлемента = Элемент.Имя;
	
	Если ЗначениеИзКэша(КэшФормы, "ИменаРеквизитовУсловийЗакупки").Найти(ИмяЭлемента) <> Неопределено Тогда
		// Изменение префикса элемента расположенного в "подвале":
		ИмяЭлемента = "Товары" + ИмяЭлемента;
	КонецЕсли;
	
	Если ИмяЭлемента = Элементы.Дата.Имя Тогда
		ДатаПриИзменении(Элемент);
	ИначеЕсли ИмяЭлемента = Элементы.Организация.Имя Тогда
		ОрганизацияПриИзменении(Элемент);
	ИначеЕсли ИмяЭлемента = Элементы.Склад.Имя Тогда
		СкладПриИзменении(Элемент);
	ИначеЕсли ИмяЭлемента = Элементы.Валюта.Имя Тогда
		ВалютаПриИзменении(Элемент);
	ИначеЕсли ИмяЭлемента = Элементы.ЦенаВключаетНДС.Имя Тогда
		ЦенаВключаетНДСПриИзменении(Элемент);
	ИначеЕсли ИмяЭлемента = Элементы.ПоступлениеОднойДатой.Имя Тогда
		ПоступлениеОднойДатойПриИзменении(Элемент);
	ИначеЕсли ИмяЭлемента = Элементы.ЖелаемаяДатаПоступления.Имя Тогда
		ЖелаемаяДатаПоступленияПриИзменении(Элемент);
	// Товары:
	ИначеЕсли ИмяЭлемента = Элементы.ТоварыНоменклатура.Имя Тогда
		ТоварыНоменклатураПриИзменении(Элемент);
	ИначеЕсли ИмяЭлемента = Элементы.ТоварыХарактеристика.Имя Тогда
		ТоварыХарактеристикаПриИзменении(Элемент);
	ИначеЕсли ИмяЭлемента = Элементы.ТоварыКоличествоУпаковок.Имя Тогда
		ТоварыКоличествоУпаковокПриИзменении(Элемент);
	ИначеЕсли ИмяЭлемента = Элементы.ТоварыУпаковка.Имя Тогда
		ТоварыУпаковкаПриИзменении(Элемент);
	ИначеЕсли ИмяЭлемента = Элементы.ТоварыОтменено.Имя Тогда
		ТоварыОтмененоПриИзменении(Элемент);
	ИначеЕсли ИмяЭлемента = Элементы.ТоварыПартнер.Имя Тогда
		ТоварыПартнерПриИзменении(Элемент);
	ИначеЕсли ИмяЭлемента = Элементы.ТоварыКонтрагент.Имя Тогда
		ТоварыКонтрагентПриИзменении(Элемент);
	ИначеЕсли ИмяЭлемента = Элементы.ТоварыСоглашение.Имя Тогда
		ТоварыСоглашениеПриИзменении(Элемент);
	ИначеЕсли ИмяЭлемента = Элементы.ТоварыДоговор.Имя Тогда
		ТоварыДоговорПриИзменении(Элемент);
	ИначеЕсли ИмяЭлемента = Элементы.ТоварыВидЦеныПоставщика.Имя Тогда
		ТоварыВидЦеныПоставщикаПриИзменении(Элемент);
	ИначеЕсли ИмяЭлемента = Элементы.ТоварыНоменклатураПартнера.Имя Тогда
		ТоварыНоменклатураПартнераПриИзменении(Элемент);
	ИначеЕсли ИмяЭлемента = Элементы.ТоварыЦена.Имя Тогда
		ТоварыЦенаПриИзменении(Элемент);
	ИначеЕсли ИмяЭлемента = Элементы.ТоварыСумма.Имя Тогда
		ТоварыСуммаПриИзменении(Элемент);
	ИначеЕсли ИмяЭлемента = Элементы.ТоварыСтавкаНДС.Имя Тогда
		ТоварыСтавкаНДСПриИзменении(Элемент);
	ИначеЕсли ИмяЭлемента = Элементы.ТоварыСуммаНДС.Имя Тогда
		ТоварыСуммаНДСПриИзменении(Элемент);
	ИначеЕсли ИмяЭлемента = Элементы.ТоварыНазначение.Имя Тогда
		ТоварыНазначениеПриИзменении(Элемент);
	Иначе
		ОбщегоНазначенияУТКлиент.КонтрольНеСогласованныхИзмененийВызватьИсключение(ЭтотОбъект, Элемент);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//	Команда - КомандаФормы - 
&НаКлиенте
Процедура КонтрольНеСогласованныхИзмененийОбработатьСобытиеКоманды(Команда)

	Если Команда.Имя = Команды.ВставитьСтроки.Имя Тогда
		ВставитьСтроки(Команда);
	ИначеЕсли Команда.Имя = Команды.ПоискПоШтрихкоду.Имя Тогда
		ПоискПоШтрихкодуВыполнить(Команда);
	ИначеЕсли Команда.Имя = Команды.ЗагрузитьДанныеИзТСД.Имя Тогда
		ЗагрузитьДанныеИзТСД(Команда);
	ИначеЕсли Команда.Имя = Команды.ВставитьУсловияЗакупки.Имя Тогда
		ВставитьУсловияЗакупки(Команда);
	ИначеЕсли Команда.Имя = Команды.ЗаполнитьУсловияЗакупкиПоКоммерческимПредложениям.Имя Тогда
		НачатьЗаполнениеУсловийЗакупкиПоКоммерческимПредложениям(Команда);
	ИначеЕсли Команда.Имя = Команды.ПодобратьТовары.Имя Тогда
		ПодобратьТовары(Команда);
	ИначеЕсли Команда.Имя = Команды.ПодобратьАналоги.Имя Тогда
		ПодобратьАналоги(Команда);
	ИначеЕсли Команда.Имя = Команды.ЗагрузитьИзВнешнегоФайла.Имя Тогда
		ЗагрузитьИзВнешнегоФайла(Команда);
	ИначеЕсли Команда.Имя = Команды.ОтменитьВыделенныеСтроки.Имя Тогда
		ОтменитьВыделенныеСтроки(Команда);
	ИначеЕсли Команда.Имя = Команды.ОтменитьНезаказанныеСтроки.Имя Тогда
		 ОтменитьНезаказанныеСтроки(Команда);
	ИначеЕсли Команда.Имя = Команды.ЗаполнитьСкладВВыделенныхСтроках.Имя Тогда
		ЗаполнитьСкладВВыделенныхСтроках(Команда);
	Иначе
		ОбщегоНазначенияУТКлиент.КонтрольНеСогласованныхИзмененийВызватьИсключение(ЭтотОбъект, Команда);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрольНеСогласованныхИзмененийОбработатьСобытиеНажатие(Элемент)
	ОбщегоНазначенияУТКлиент.КонтрольНеСогласованныхИзмененийВызватьИсключение(ЭтотОбъект, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура КонтрольНеСогласованныхИзмененийОбработатьСобытиеПередНачаломИзменения(Элемент, Отказ)
	ОбщегоНазначенияУТКлиент.КонтрольНеСогласованныхИзмененийВызватьИсключение(ЭтотОбъект, Элемент);
КонецПроцедуры

// Параметры:
//	Элемент - ГруппаФормы, ТаблицаФормы, ПолеФормы, КнопкаФормы - ЭлементФормы
// Отказ - Булево - Одноименный параметр события.
&НаКлиенте
Процедура КонтрольНеСогласованныхИзмененийОбработатьСобытиеПередУдалением(Элемент, Отказ)
	
	Если Элемент.Имя = "Товары" Тогда
		ТоварыПередУдалением(Элемент, Отказ);
	Иначе
		ОбщегоНазначенияУТКлиент.КонтрольНеСогласованныхИзмененийВызватьИсключение(ЭтотОбъект, Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрольНеСогласованныхИзмененийОбработатьСобытиеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	ОбщегоНазначенияУТКлиент.КонтрольНеСогласованныхИзмененийВызватьИсключение(ЭтотОбъект, Элемент);
КонецПроцедуры

// Параметры:
//	Элемент - ГруппаФормы, ТаблицаФормы, ПолеФормы, КнопкаФормы - ЭлементФормы
&НаКлиенте
Процедура Подключаемый_ПриИзменении_УстановитьДоступностьЭлементовПоСтатусуСервер(Элемент)
	
	Если ОбщегоНазначенияУТКлиент.ПриДействииСЭлементомЗависящимОтСтатуса(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если СтруктураДействийКонтрольНеСогласованныхИзменений.ПриИзменении.Свойство(Элемент.Имя) Тогда
		КонтрольНеСогласованныхИзмененийОбработатьСобытиеПриИзменении(Элемент);
	КонецЕсли;

КонецПроцедуры

// Параметры:
//	Элемент - ГруппаФормы, ТаблицаФормы, ПолеФормы, КнопкаФормы - ЭлементФормы
&НаКлиенте
Процедура Подключаемый_Нажатие_УстановитьДоступностьЭлементовПоСтатусуСервер(Элемент)
	
	Если ОбщегоНазначенияУТКлиент.ПриДействииСЭлементомЗависящимОтСтатуса(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если СтруктураДействийКонтрольНеСогласованныхИзменений.Нажатие.Свойство(Элемент.Имя) Тогда
		КонтрольНеСогласованныхИзмененийОбработатьСобытиеНажатие(Элемент);
	КонецЕсли;

КонецПроцедуры

// Параметры:
//	Команда - КомандаФормы - 
&НаКлиенте
Процедура Подключаемый_Команда_УстановитьДоступностьЭлементовПоСтатусуСервер(Команда)
	
	Если ОбщегоНазначенияУТКлиент.ПриДействииСЭлементомЗависящимОтСтатуса(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если СтруктураДействийКонтрольНеСогласованныхИзменений.Команды.Свойство(Команда.Имя) Тогда
		КонтрольНеСогласованныхИзмененийОбработатьСобытиеКоманды(Команда);
	КонецЕсли;

КонецПроцедуры

// Параметры:
//	Элемент - ГруппаФормы, ТаблицаФормы, ПолеФормы, КнопкаФормы - ЭлементФормы
// Отказ - Булево - Одноименный параметр события.
&НаКлиенте
Процедура Подключаемый_ПередНачаломИзменения_УстановитьДоступностьЭлементовПоСтатусуСервер(Элемент, Отказ)
	
	Если ОбщегоНазначенияУТКлиент.ПриДействииСЭлементомЗависящимОтСтатуса(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если СтруктураДействийКонтрольНеСогласованныхИзменений.ПередНачаломИзменения.Свойство(Элемент.Имя) Тогда
		КонтрольНеСогласованныхИзмененийОбработатьСобытиеПередНачаломИзменения(Элемент, Отказ);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//	Элемент - ГруппаФормы, ТаблицаФормы, ПолеФормы, КнопкаФормы - ЭлементФормы
// Отказ - Булево - Одноименный параметр события.
&НаКлиенте
Процедура Подключаемый_ПередУдалением_УстановитьДоступностьЭлементовПоСтатусуСервер(Элемент, Отказ)
	
	Если ОбщегоНазначенияУТКлиент.ПриДействииСЭлементомЗависящимОтСтатуса(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Имя = Элемент.Имя;
	Если СтруктураДействийКонтрольНеСогласованныхИзменений.ПередУдалением.Свойство(Имя) Тогда
		КонтрольНеСогласованныхИзмененийОбработатьСобытиеПередУдалением(Элемент, Отказ);
	КонецЕсли;

КонецПроцедуры

// Параметры:
//	Элемент - ГруппаФормы, ТаблицаФормы, ПолеФормы, КнопкаФормы - ЭлементФормы
// Отказ - Булево - Одноименный параметр события.
// Копирование - Булево - Одноименный параметр события.
// Родитель - Неопределено - Одноименный параметр события.
// Группа - Булево - Одноименный параметр события.
&НаКлиенте
Процедура Подключаемый_ПередНачаломДобавления_УстановитьДоступностьЭлементовПоСтатусуСервер(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если ОбщегоНазначенияУТКлиент.ПриДействииСЭлементомЗависящимОтСтатуса(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Имя = Элемент.Имя;
	Если СтруктураДействийКонтрольНеСогласованныхИзменений.ПередНачаломДобавления.Свойство(Имя) Тогда
		КонтрольНеСогласованныхИзмененийОбработатьСобытиеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииРеквизитаЗависящегоОтСтатуса()
	
	УстановитьДоступностьЭлементовПоСтатусуСервер();
	ОбщегоНазначенияУТКлиент.ПослеИзмененияРеквизитаЗависящегоОтСтатуса(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти


#Область РаботаСБуферомОбмена

&НаСервере
Процедура СкопироватьСтрокиНаСервере()
	
	РаботаСТабличнымиЧастями.СкопироватьСтрокиВБуферОбмена(Объект.Товары, Элементы.Товары.ВыделенныеСтроки);
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьСтрокиИзБуфераОбмена()
	
	ПараметрыОтбора = Новый Соответствие;
	ПараметрыОтбора.Вставить("Номенклатура.ТипНоменклатуры", НоменклатураКлиентСервер.ОтборПоТоваруМногооборотнойТареУслугеРаботе(Ложь));
	
	Колонки = Новый Массив;
	Колонки.Добавить("Номенклатура");
	Колонки.Добавить("Характеристика");
	Колонки.Добавить("Упаковка");
	Колонки.Добавить("КоличествоУпаковок");
	Колонки.Добавить("Цена");
	Колонки.Добавить("Подразделение");
	Колонки.Добавить("Склад");
	Колонки.Добавить("Партнер");
	Колонки.Добавить("Контрагент");
	Колонки.Добавить("Соглашение");
	Колонки.Добавить("Договор");
	
	СтрокиИзБуфераОбмена = РаботаСТабличнымиЧастями.СтрокиИзБуфераОбмена(ПараметрыОтбора, Колонки);
	
	Если Не ЗначениеЗаполнено(СтрокиИзБуфераОбмена) Тогда
		Возврат;
	КонецЕсли;
	
	Действия = Новый Структура;
	Действия.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
	Действия.Вставить("ПриИзмененииТипаНоменклатуры", Новый Структура("ЕстьРаботы, ЕстьОтменено", Истина, Истина));
	Действия.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
	Действия.Вставить("ЗаполнитьПризнакХарактеристикиИспользуются", Новый Структура("Номенклатура", "ХарактеристикиИспользуются"));
	
	Действия.Вставить("ЗаполнитьСлужебныеРеквизитыПоНазначению", Новый Структура("ТолькоТипНазначения", Истина));
	
	Действия.Вставить(
		"ПроверитьЗаполнитьСклад",
		ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСкладаВСтрокеТЧ(Объект, СкладГруппа));
	
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Действия, ДействияПриИзмененииКоличества(Объект.ЦенаВключаетНДС), Истина);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Действия, ДействияЗаполненияСтавкиНДС(Объект, КэшФормы), Истина);
	
	ОбрабатываемыеСтроки = Новый Массив;
	Для Каждого СтрокаИзБуфера Из СтрокиИзБуфераОбмена Цикл
		
		СтрокаТоваров = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТоваров, СтрокаИзБуфера);
		ОбрабатываемыеСтроки.Добавить(СтрокаТоваров);
		
	КонецЦикла;
	
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(
		ОбрабатываемыеСтроки,
		Действия,
		Объект.Товары);
	
	ЗаполнитьСлужебныеРеквизитыСоглашений(ОбрабатываемыеСтроки);
		
	Для Каждого СтрокаТоваров Из ОбрабатываемыеСтроки Цикл
		
		Если Объект.ПоступлениеОднойДатой Тогда
			СтрокаТоваров.ЖелаемаяДатаПоступления = Объект.ЖелаемаяДатаПоступления;
		КонецЕсли;
		
		АктуализироватьПодразделениеСтрокиТоваров(СтрокаТоваров, Объект.Подразделение);
		
	КонецЦикла;
	
	РассчитатьИтоговыеПоказателиЗаявки(ЭтотОбъект);
	ОбновитьКартинкуГруппыСкладов();

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьКомандБуфераОбмена(Форма, ЗначениеДоступности)
	
	ИменаЭлементов = Новый Массив;
	ИменаЭлементов.Добавить("ТоварыВставитьСтроки");
	ИменаЭлементов.Добавить("ТоварыКонтекстноеМенюВставитьСтроки");
	
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(
		Форма.Элементы,
		ИменаЭлементов,
		"Доступность",
		ЗначениеДоступности);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбщиеПроцедурыИФункции

&НаКлиенте
Функция ПроверитьНаличиеВыделенныхСтрок(МножественныйРежимВыделения = Истина)
	
	ТекстПредупреждения = "";
	
	Если Объект.Товары.Количество() = 0 Тогда
		
		ТекстПредупреждения = НСтр("ru='Таблица товаров не заполнена.'");
		
	ИначеЕсли Элементы.Товары.ВыделенныеСтроки.Количество() = 0 Тогда
		
		Если МножественныйРежимВыделения Тогда
			ТекстПредупреждения = НСтр("ru='В таблице товаров отсутствуют выделенные строки.'");
		Иначе
			ТекстПредупреждения = НСтр("ru='Необходимо выделить строку товаров.'");
		КонецЕсли;
		
	КонецЕсли;
	
	ПроверкаПройдена = ПустаяСтрока(ТекстПредупреждения);
	Если Не ПроверкаПройдена Тогда
		ПоказатьПредупреждение(Неопределено, ТекстПредупреждения);
	КонецЕсли;
	
	Возврат ПроверкаПройдена;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура АктуализироватьПодразделениеСтрокиТоваров(СтрокаТоваров, Подразделение, Перезаполнять = Ложь)
	
	Если СтрокаТоваров.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Товар")
		Или СтрокаТоваров.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.МногооборотнаяТара")
		Или СтрокаТоваров.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Набор") Тогда

		СтрокаТоваров.Подразделение = Неопределено;

	ИначеЕсли (Перезаполнять Или Не ЗначениеЗаполнено(СтрокаТоваров.Подразделение)) 
		И (СтрокаТоваров.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга")
			Или СтрокаТоваров.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Работа")) Тогда
			
		СтрокаТоваров.Подразделение = Подразделение;
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ЗаказыПоставщикам

&НаСервере
Функция ОписаниеЗаказаКСозданию(Знач ВыделенныеСтроки)
	
	НомераСтрок = Новый Массив;
	Для Каждого ИдентификаторСтроки Из ВыделенныеСтроки Цикл
		НомераСтрок.Добавить(Объект.Товары.НайтиПоИдентификатору(ИдентификаторСтроки).НомерСтроки);
	КонецЦикла;
	
	ОписаниеЗаказаКСозданию = Документы.ЗаявкаНаЗакупку.ОписаниеЗаказаКСозданию(Объект.Ссылка, НомераСтрок);
	
	Если ОписаниеЗаказаКСозданию.ДанныеЗаказа <> Неопределено Тогда
		
		ОписаниеЗаказаКСозданию.ДанныеЗаказа.Товары = ПоместитьВоВременноеХранилище(
			ОписаниеЗаказаКСозданию.ДанныеЗаказа.Товары,
			УникальныйИдентификатор);
		
	КонецЕсли;
	
	Возврат ОписаниеЗаказаКСозданию;
	
КонецФункции

&НаСервере
Функция ЕстьНезаказанныеСтроки()
	Возврат Документы.ЗаявкаНаЗакупку.ЕстьНезаказанныеСтроки(Объект);
КонецФункции

&НаСервере
Функция ОтменитьНезаказанныеСтрокиСервер()
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ТекстПредупреждения", "");
	ВозвращаемоеЗначение.Вставить("ЕстьОтмененныеСтроки", Ложь);
	
	Если Не Объект.Проведен Тогда
		ВозвращаемоеЗначение.ТекстПредупреждения = НСтр("ru = 'Невозможно рассчитать незаказанное количество для непроведенного документа.'");
	ИначеЕсли Не ЗначениеЗаполнено(Объект.Товары) Тогда
		ВозвращаемоеЗначение.ТекстПредупреждения = НСтр("ru = 'Таблица товаров не заполнена.'");
	ИначеЕсли ВсеСтрокиОтменены() Тогда
		ВозвращаемоеЗначение.ТекстПредупреждения = НСтр("ru = 'Все строки отменены.'");
	КонецЕсли;
	
	Если Не ПустаяСтрока(ВозвращаемоеЗначение.ТекстПредупреждения) Тогда
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	Результат = Документы.ЗаявкаНаЗакупку.ОтменитьНезаказанныеСтроки(Объект);
	ВозвращаемоеЗначение.ЕстьОтмененныеСтроки = ЗначениеЗаполнено(Результат.ОтмененныеСтроки);
	
	Действия = Новый Структура;
	Действия.Вставить("ПриИзмененииТипаНоменклатуры", // Заполнение обязательности склада
		Новый Структура("ЕстьРаботы, ЕстьОтменено", Истина, Истина));
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Действия, ДействияЗаполненияСуммовыхРеквизитовФормы(), Истина);
	
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(Результат.ИзмененныеСтроки, Действия, Объект.Товары);
	
	РассчитатьИтоговыеПоказателиЗаявки(ЭтотОбъект);
	ТоварыОбновитьОтборСтрокПоОтмененным(ЭтотОбъект, СкрыватьОтмененныеСтроки, Ложь);
	УстановитьПризнакЗаполненияСклада(ЭтотОбъект);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти

#КонецОбласти
