
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОчиститьСообщения();
	
	Источник = ПараметрыВыполненияКоманды.Источник;
	Если ТипЗнч(Источник) <> Тип("ФормаКлиентскогоПриложения") Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = СервисДоставкиКлиент.НовыйПараметрыОткрытьФормуСервисаДоставки();
	
	ПараметрыФормы.ИмяФормы = СервисДоставкиКлиентСервер.ИмяФормыСервисаДоставки(Источник.ТипГрузоперевозки);
	ПараметрыФормы.ТипГрузоперевозки = Источник.ТипГрузоперевозки;
	ПараметрыФормы.ОрганизацияБизнесСети = Источник.ОрганизацияБизнесСетиСсылка;
	ПараметрыФормы.Вставить("РежимМастера", 0);
	ПараметрыФормы.Вставить("Уникальность", СтрШаблон("ЭтоНовый_%1", Источник.ТипГрузоперевозки));
	ПараметрыФормы.Вставить("ЭтоЗаполнениеКопированием", Истина);
	
	Если Источник.ИмяФормы = "Обработка.СервисДоставки.Форма.СписокЗаказов" Тогда
		ПараметрыФормы.Вставить("ИдентификаторЗаказа", Источник.Элементы.Список.ТекущиеДанные.Идентификатор);
		Если СервисДоставкиКлиентСервер.ЭтоКурьерика(Источник.ТипГрузоперевозки) И Источник.ОпцияДоступнаКурьерика Тогда
			ПараметрыФормы.Вставить("СоответствиеСкладов", Источник.СоответствиеСкладов);
			ПараметрыФормы.Вставить("ОпцияДоступнаКурьерика", Источник.ОпцияДоступнаКурьерика);
			ПараметрыФормы.Вставить("КомментарийОпцияКурьерика", Источник.КомментарийОпцияКурьерика);
			ПараметрыФормы.Вставить("БалансОпцияКурьерика", Источник.БалансОпцияКурьерика);
			ПараметрыФормы.Вставить("СрокДействияОпцияКурьерика", Источник.СрокДействияОпцияКурьерика);
			ПараметрыФормы.Вставить("ОтображатьУведомлениеПоОпцииКурьерика", Источник.ОтображатьУведомлениеПоОпцииКурьерика);
		КонецЕсли;
	Иначе
		ПараметрыФормы.Вставить("ИдентификаторЗаказа", Источник.ИдентификаторЗаказа);
	КонецЕсли;
	
	СервисДоставкиКлиент.ОткрытьФормуСервисаДоставки(ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти