#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если Не ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "Наименование") = "Эстервуд" Тогда
		Возврат;
	КонецЕсли;

	НачатьТранзакцию();

	Попытка

		Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			ОформитьДокументПеремещениеТоваров(Отказ);

		ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
			ОтменитьПроведение(Отказ);
		КонецЕсли;

		Если Отказ Тогда
			ОтменитьТранзакцию();
			Возврат;
		КонецЕсли;

		ЗафиксироватьТранзакцию();

	Исключение
		ОтменитьТранзакцию();
	КонецПопытки;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	Товары.Ссылка.Дата КАК Период,
	|	Товары.Ссылка.Партнер КАК Партнер,
	|	Товары.Ссылка.Контрагент КАК Контрагент,
	|	Товары.Ссылка.Основание КАК ДокументПоступления,
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Количество КАК Количество
	|ИЗ
	|	Документ.AMS_ПередачаВПереработку.Товары КАК Товары
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	Рез = Запрос.Выполнить();

	Если Рез.Пустой() Тогда
		Возврат;
	КонецЕсли;

	Движения._ТоварыПереданные.Записывать = Истина;
	Движения._ТоварыПереданные.Загрузить(Рез.Выгрузить());
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
		ЗаполнитьПоПоступлению(ДанныеЗаполнения);
	Иначе
		Ответственный = Пользователи.АвторизованныйПользователь()
	КонецЕсли;
	
	Организация = AMS_ВызовСервера.ПолучитьОсновнуюОрганизацию();
	Склад = AMS_ВызовСервера.СкладКомпании();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОформитьДокументПеремещениеТоваров(Отказ)
	УстановитьПривилегированныйРежим(Истина);

	Если ЗначениеЗаполнено(ПеремещениеТоваров) Тогда
		Док = ПеремещениеТоваров.ПолучитьОбъект();
	Иначе
		Док = Документы.ПеремещениеТоваров.СоздатьДокумент();
	КонецЕсли;

	Если Док.ПометкаУдаления <> ПометкаУдаления Тогда
		мср.УстановитьПометкуУдаленияДокументу(Док, ПометкаУдаления, Отказ);
	КонецЕсли;

	Док.Дата                  = Дата;
	Док.ВидЦены               = Справочники.Склады.УчетныйВидЦены(Склад);
	Док.Организация           = Организация;
	Док.Ответственный         = Ответственный;
	Док.Автор                 = Ответственный;
	Док.Подразделение         = Справочники.СтруктураПредприятия.НайтиПоКоду("01-000002"); //Цех 1
	Док.СкладОтправитель      = Склад;
	Док.СкладПолучатель       = AMS_ВызовСервера.СкладКомпании();
	Док.Статус                = Перечисления.СтатусыПеремещенийТоваров.Принято;
	Док.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеремещениеТоваров;
	Док.СпособДоставки        = Перечисления.СпособыДоставки.Самовывоз;
	Док.ВариантПриемкиТоваров = Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным;
	Док.Комментарий           = "Сформирован автоматичестки. Оформление передачи на переработку (на склад компании). Передача в переработку № "
		+ Номер + " от " + Формат(Дата, "ДЛФ=Д") + " г.";

	Док._ОперацияПроизводства = Перечисления.AMS_ОперацииПроизводства.ПеремещениеМатериаловВПереработку;
	Док._Основание            = Ссылка;

	Табл = Док.Товары;
	Табл.Очистить();
	Для Каждого Стр Из Товары Цикл
		НовСтр = Табл.Добавить();
		НовСтр.Номенклатура       = Стр.Номенклатура;
		НовСтр.Количество         = Стр.Количество;
		НовСтр.КоличествоУпаковок = Стр.Количество;
	КонецЦикла;

	мср.ЗаписатьДокумент(Док, РежимЗаписиДокумента.Проведение, Отказ);

	Если Отказ Тогда
		ОбщегоНазначения.СообщитьПользователю("Не удалось записать документ перемещения продукции на склад.");
	Иначе
		ПеремещениеТоваров = Док.Ссылка;
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьПоПоступлению(Основание)
	Стр = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Основание, "Организация,Склад,Менеджер");

	Организация   = Стр.Организация;
	Склад         = Стр.Склад;
	Ответственный = Стр.Менеджер;

	Товары.Очистить();

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Основание);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Количество КАК Количество,
	|	Товары.КоличествоУпаковок КАК КоличествоУпаковок
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг.Товары КАК Товары
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|	И Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Товары.Номенклатура.Наименование";

	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;

	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		НовСтр = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
	КонецЦикла;
КонецПроцедуры

Процедура ОтменитьПроведение(Отказ)
	Если ЗначениеЗаполнено(ПеремещениеТоваров) Тогда
		Если ПометкаУдаления Тогда
			мср.УстановитьПометкуУдаленияДокументу(ПеремещениеТоваров, Истина, Отказ);

		ИначеЕсли ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПеремещениеТоваров, "Проведен") Тогда
			мср.ЗаписатьДокумент(ПеремещениеТоваров, РежимЗаписиДокумента.ОтменаПроведения, Отказ);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецЕсли