#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗаписатьДанные(ИдентификаторыНовыхРасхождений) Экспорт 
	
	Для Каждого ИдентификаторРасхождения Из ИдентификаторыНовыхРасхождений Цикл
		
		МенеджерЗаписи = РегистрыСведений.СервисСверкиРасчетовСтатусыРасхождений.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ИдентификаторРасхождения = ИдентификаторРасхождения;
		МенеджерЗаписи.ЭтоНовоеРасхождение = Истина;
		
		МенеджерЗаписи.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Функция ОчиститьСтатусыРасхождений() Экспорт
	
	НаборЗаписейРасхождения= РегистрыСведений.СервисСверкиРасчетовСтатусыРасхождений.СоздатьНаборЗаписей();
	НаборЗаписейРасхождения.Записать();
	
КонецФункции

#КонецОбласти

#КонецЕсли