
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	СтруктураТипов = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(МассивОбъектов);

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СчетНаОплату") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм, "СчетНаОплату", "Счет на оплату", 
		СформироватьПечатнуюФормуСчетНаОплату(МассивОбъектов, ОбъектыПечати, ПараметрыПечати));
	КонецЕсли;

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СН") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм, "СН", "Складская накладная", 
		СформироватьПечатнуюФормуСН(МассивОбъектов,	ОбъектыПечати, ПараметрыПечати));
	КонецЕсли;

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "УпаковочныйЛист") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм, "УпаковочныйЛист", "Упаковочный лист", 
		СформироватьПечатнуюФормуУпаковочныйЛист(МассивОбъектов, ОбъектыПечати, ПараметрыПечати));
	КонецЕсли;

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "УПД") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм, "УПД", "Универсальный передаточный документ (УПД)",
		Обработки.ПечатьОбщихФорм.СформироватьПечатнуюФормуУПД(СтруктураТипов, ОбъектыПечати, ПараметрыПечати));
	КонецЕсли;

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТОРГ12") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм, "ТОРГ12", "Товарная накладная (ТОРГ-12)",
		Обработки.ПечатьОбщихФорм.амсСформироватьПечатнуюФормуТОРГ12(СтруктураТипов, ОбъектыПечати,	ПараметрыПечати));
	КонецЕсли;

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СчетФактура") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм, "СчетФактура", "Счет-фактура",
		Обработки.ПечатьОбщихФорм.СформироватьПечатнуюФормуСчетФактура(СтруктураТипов, ОбъектыПечати, ПараметрыПечати));
	КонецЕсли;

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Доверенность") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм, "Доверенность", "Доверенность", 
		СформироватьПечатнуюФормуДоверенность(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
 
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТН") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм, "ТН", "Транспортная накладная", 
		СформироватьПечатнуюФормуТранспортнаяНакладная(МассивОбъектов, ПараметрыПечати));
	КонецЕсли;

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТТН") Тогда
		ПараметрыПечати.Вставить("ТипПечати", "АМС");
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм, "ТТН", НСтр("ru = 'Товарно-транспортная накладная'"),
		СформироватьПечатнуюФормуТТН(МассивОбъектов, ОбъектыПечати, ПараметрыПечати));
	КонецЕсли;

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Спецификация") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм, "Спецификация", НСтр("ru = 'Спецификация товаров'"),
		Обработки.ПечатьОбщихФорм.амсСформироватьПечатнуюФормуСпецификации(МассивОбъектов, ОбъектыПечати, ПараметрыПечати));
	КонецЕсли;

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СпецификацияЭкспорт") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм, "СпецификацияЭкспорт", НСтр("ru = 'Спецификация товаров (экпорт)'"), 
			СформироватьПечатнуюФормуСпецификацияЭкпорт(МассивОбъектов,	ОбъектыПечати, ПараметрыПечати));
	КонецЕсли;

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СличительнаяВедомость") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм, "СличительнаяВедомость", "Сличительная ведомость",
		СформироватьПечатнуюФормуСличительнаяВедомость(МассивОбъектов));
	КонецЕсли;

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктОРасхождениях") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм, "АктОРасхождениях", "Акт о расхождениях",
		Обработки.ПечатьОбщихФорм.амсСформироватьПечатнуюФормуАктОРасхождениях(МассивОбъектов, ОбъектыПечати, ПараметрыПечати));
	КонецЕсли;

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПалетнаяЭтикетка") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм, "ПалетнаяЭтикетка", "Палетная этикетка",
		СформироватьПалетнаяЭтикетка(МассивОбъектов));
	КонецЕсли;

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЗаявкаПеревозчику") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм, "ЗаявкаПеревозчику", "Заявка перевозчику", 
		СформироватьЗаявкаПеревозчику(МассивОбъектов));
	КонецЕсли;

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Прайс") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм, "Прайс", НСтр("ru = 'Прайс-лист'"), ПараметрыПечати.ТабличныйДокумент);
	КонецЕсли;

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПрайсЛист") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПрайсЛист", "Прайс - лист",
		СформироватьПрайсЛист(ПараметрыПечати));
	КонецЕсли;

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СертификатыНоменклатурыРеестр") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм, "СертификатыНоменклатурыРеестр", НСтр("ru = 'Сертификаты (реестр)'"),
		Справочники.СертификатыНоменклатуры.СформироватьПечатнуюФормуРеестрСертификатовНоменклатуры(МассивОбъектов,
			ОбъектыПечати), , "Справочник.СертификатыНоменклатуры.ПФ_MXL_РеестрСертификатов");
	КонецЕсли;

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СертификатыНоменклатурыИзображенияИзДокументовБезДублей") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм, "СертификатыНоменклатурыИзображенияИзДокументовБезДублей", НСтр("ru = 'Сертификаты (по одному на сертификат)'"), 
		Справочники.СертификатыНоменклатуры.СформироватьПечатнуюФормуИзображенияСертификатовИзДокументовБезДублей(
			МассивОбъектов, ОбъектыПечати), , "Справочник.СертификатыНоменклатуры.ПФ_MXL_ИзображенияСертификатов");
	КонецЕсли;

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктПоПеревозкам") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм, "АктПоПеревозкам", "Акт выполненных работ",
		Документы._ТранспортныеУслуги.СформироватьАктВыполненныхРабот(МассивОбъектов));
	КонецЕсли;

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ДопСоглашение") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм, "ДопСоглашение", "Дополнительное соглашение", 
		СформироватьДопСоглашение(МассивОбъектов));
	КонецЕсли;

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЛогистическийЛист") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм, "ЛогистическийЛист", "Логистический лист (доставка и подвоз)",
		СформироватьЛогистическийЛист(МассивОбъектов, ПараметрыПечати));
	КонецЕсли;

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЛогистическийЛистДоставка") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм, "ЛогистическийЛистДоставка", "Логистический лист (доставка товаров)",
		СформироватьЛогистическийЛист(МассивОбъектов, ПараметрыПечати));
	КонецЕсли;

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЛогистическийЛистПодвоз") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм, "ЛогистическийЛистПодвоз", "Логистический лист (подвоз сырья, возврат)",
		СформироватьЛогистическийЛист(МассивОбъектов, ПараметрыПечати));
	КонецЕсли;

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "НакладнаяНаПалеты") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм, "НакладнаяНаПалеты", "Накладная на перемещение палет",
		СформироватьНакладнаяНаПалеты(МассивОбъектов));
	КонецЕсли;

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктПереводаНаименований") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм, "АктПереводаНаименований", "Акт перевода наименований",
		СформироватьАктПереводаНаименований(МассивОбъектов));
	КонецЕсли;

	ФормированиеПечатныхФорм.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);
КонецПроцедуры

#Область Печать_СчетНаОплату

Функция СформироватьПечатнуюФормуСчетНаОплату(МассивОбъектов, ОбъектыПечати, ПараметрыПечати) Экспорт
	УстановитьПривилегированныйРежим(Истина);

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СЧЕТНАОПЛАТУ";

	Если ТипЗнч(МассивОбъектов[0]) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		ДанныеДляПечати = ПолучитьДанныеДляПечатнойФормыСчетаОтРеализации(МассивОбъектов);
	Иначе
		ДанныеДляПечати = ПолучитьДанныеДляПечатнойФормыСчетаОтЗаказа(МассивОбъектов);
	КонецЕсли;

	ЗаполнитьТабличныйДокументСчетаНаОплату(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати, ПараметрыПечати);

	УстановитьПривилегированныйРежим(Ложь);

	Возврат ТабличныйДокумент;
КонецФункции

Функция ПолучитьДанныеДляПечатнойФормыСчетаОтРеализации(МассивОбъектов)
	Запрос = Новый Запрос;

	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ОтветственныеЛицаСервер.СформироватьВременнуюТаблицуОтветственныхЛицДокументов(МассивОбъектов,
		МенеджерВременныхТаблиц);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;

	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ док
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК т
	|ГДЕ
	|	т.Ссылка В (&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Ссылка КАК Ссылка,
	|	т.НомерСтроки КАК НомерСтроки,
	|	т.Номенклатура КАК Номенклатура,
	|	н.Код КАК Код,
	|	н.Артикул КАК Артикул,
	|	н.НаименованиеПолное КАК НаименованиеПолное,
	|	т.Количество КАК Количество,
	|	т.КоличествоУпаковок КАК КоличествоУпаковок,
	|	т.Сумма / т.Количество КАК Цена,
	|	т.Сумма КАК Сумма,
	|	т.СтавкаНДС КАК СтавкаНДС,
	|	т.СуммаНДС КАК СуммаНДС,
	|	н._Упаковка КАК Упаковка,
	|	т.Сумма + т.СуммаРучнойСкидки + т.СуммаАвтоматическойСкидки КАК СуммаБезСкидки,
	|	н.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(т.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА т.Номенклатура.ЕдиницаИзмерения.Наименование
	|		КОГДА т.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Упаковка)
	|			ТОГДА т.Упаковка.ЕдиницаИзмерения.Наименование
	|		ИНАЧЕ т.Упаковка.Наименование
	|	КОНЕЦ КАК ВидУпаковки,
	|	т.Упаковка.Числитель / т.Упаковка.Знаменатель КАК КоличествоВУпаковке
	|ПОМЕСТИТЬ тов
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК н
	|		ПО т.Номенклатура = н.Ссылка
	|			И (НЕ н.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
	|ГДЕ
	|	т.Ссылка В
	|			(ВЫБРАТЬ
	|				т.Ссылка КАК Ссылка
	|			ИЗ
	|				док КАК т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тов.Ссылка КАК Ссылка,
	|	СУММА(тов.КоличествоУпаковок) КАК КоличествоМест
	|ПОМЕСТИТЬ КолМест
	|ИЗ
	|	тов КАК тов
	|
	|СГРУППИРОВАТЬ ПО
	|	тов.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Ссылка КАК Ссылка,
	|	1 КАК НомерСтроки,
	|	т.Дата КАК ДатаПлатежа,
	|	100 КАК ПроцентПлатежа,
	|	т.СуммаДокумента КАК СуммаПлатежа
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК т
	|ГДЕ
	|	т.Ссылка В
	|			(ВЫБРАТЬ
	|				т.Ссылка КАК Ссылка
	|			ИЗ
	|				док КАК т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА т.AMS_ЗаказКлиентаНомер = """"
	|			ТОГДА т.Номер
	|		ИНАЧЕ т.AMS_ЗаказКлиентаНомер
	|	КОНЕЦ КАК Номер,
	|	ВЫБОР
	|		КОГДА т.AMS_ДатаСчета = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА т.Дата
	|		ИНАЧЕ т.AMS_ДатаСчета
	|	КОНЕЦ КАК Дата,
	|	т.Ссылка КАК ДокументОснование,
	|	ЕСТЬNULL(т.БанковскийСчетОрганизации.Владелец, т.Организация) КАК Организация,
	|	т.Организация КАК ОрганизацияПоставщик,
	|	ОтвЛица.РуководительНаименование КАК Руководитель,
	|	ОтвЛица.РуководительДолжность КАК ДолжностьРуководителя,
	|	ОтвЛица.ГлавныйБухгалтерНаименование КАК ГлавныйБухгалтер,
	|	т.Контрагент КАК Контрагент,
	|	т.Контрагент.ЮрФизЛицо КАК КонтрагентЮрФизЛицо,
	|	т.БанковскийСчетОрганизации КАК БанковскийСчет,
	|	ВЫБОР
	|		КОГДА т.БанковскийСчетОрганизации.ИностранныйБанк
	|				ИЛИ т.БанковскийСчетОрганизации.ВалютаДенежныхСредств <> Константы.ВалютаРегламентированногоУчета
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПлатежЗаРубеж,
	|	т.БанковскийСчетОрганизации.ВалютаДенежныхСредств КАК ВалютаДенежныхСредств,
	|	т.БанковскийСчетОрганизации.СВИФТБанка КАК СВИФТБанка,
	|	т.БанковскийСчетОрганизации.СВИФТБанкаДляРасчетов КАК СВИФТБанкаДляРасчетов,
	|	т.БанковскийСчетОрганизации.АдресБанка КАК АдресБанка,
	|	т.БанковскийСчетОрганизации.АдресБанкаДляРасчетов КАК АдресБанкаДляРасчетов,
	|	т.БанковскийСчетОрганизации.СчетВБанкеДляРасчетов КАК СчетВБанкеДляРасчетов,
	|	т.БанковскийСчетОрганизации.НомерСчета КАК НомерБанковскогоСчета,
	|	ВЫБОР
	|		КОГДА т.БанковскийСчетОрганизации.РучноеИзменениеРеквизитовБанка
	|			ТОГДА т.БанковскийСчетОрганизации.БИКБанка
	|		ИНАЧЕ КлассификаторБанков.Код
	|	КОНЕЦ КАК БИКБанк,
	|	ВЫБОР
	|		КОГДА т.БанковскийСчетОрганизации.РучноеИзменениеРеквизитовБанка
	|			ТОГДА т.БанковскийСчетОрганизации.НаименованиеБанка
	|		ИНАЧЕ КлассификаторБанков.Наименование
	|	КОНЕЦ КАК НаименованиеБанка,
	|	ВЫБОР
	|		КОГДА т.БанковскийСчетОрганизации.РучноеИзменениеРеквизитовБанка
	|			ТОГДА т.БанковскийСчетОрганизации.КоррСчетБанка
	|		ИНАЧЕ КлассификаторБанков.КоррСчет
	|	КОНЕЦ КАК КоррСчетБанка,
	|	ВЫБОР
	|		КОГДА т.БанковскийСчетОрганизации.РучноеИзменениеРеквизитовБанка
	|			ТОГДА т.БанковскийСчетОрганизации.ГородБанка
	|		ИНАЧЕ КлассификаторБанков.Город
	|	КОНЕЦ КАК ГородБанка,
	|	ВЫБОР
	|		КОГДА т.БанковскийСчетОрганизации.РучноеИзменениеРеквизитовБанкаДляРасчетов
	|			ТОГДА т.БанковскийСчетОрганизации.БИКБанкаДляРасчетов
	|		ИНАЧЕ КлассификаторБанковКорреспондентов.Код
	|	КОНЕЦ КАК БИКБанкаДляРасчетов,
	|	ВЫБОР
	|		КОГДА т.БанковскийСчетОрганизации.РучноеИзменениеРеквизитовБанкаДляРасчетов
	|			ТОГДА т.БанковскийСчетОрганизации.НаименованиеБанкаДляРасчетов
	|		ИНАЧЕ КлассификаторБанковКорреспондентов.Наименование
	|	КОНЕЦ КАК НаименованиеБанкаДляРасчетов,
	|	ВЫБОР
	|		КОГДА т.БанковскийСчетОрганизации.РучноеИзменениеРеквизитовБанкаДляРасчетов
	|			ТОГДА т.БанковскийСчетОрганизации.КоррСчетБанкаДляРасчетов
	|		ИНАЧЕ КлассификаторБанковКорреспондентов.КоррСчет
	|	КОНЕЦ КАК КоррСчетБанкаДляРасчетов,
	|	ВЫБОР
	|		КОГДА т.БанковскийСчетОрганизации.РучноеИзменениеРеквизитовБанкаДляРасчетов
	|			ТОГДА т.БанковскийСчетОрганизации.ГородБанкаДляРасчетов
	|		ИНАЧЕ КлассификаторБанковКорреспондентов.Город
	|	КОНЕЦ КАК ГородБанкаДляРасчетов,
	|	т.БанковскийСчетОрганизации.ТекстКорреспондента КАК БанковскийСчетТекстКорреспондента,
	|	т.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	|	т.СуммаДокумента КАК СуммаКВозврату,
	|	ВЫБОР
	|		КОГДА т.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК УчитыватьНДС,
	|	т.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДСУПокупателя) КАК ОперацияОблагаетсяНДСУПокупателя,
	|	т.Валюта КАК Валюта,
	|	т.Автор.ФизическоеЛицо КАК Менеджер,
	|	"""" КАК ДополнительнаяИнформация,
	|	ЛОЖЬ КАК ЧастичнаяОплата,
	|	""Товары бытовой химии."" КАК НазначениеПлатежа,
	|	ВЫБОР
	|		КОГДА т.СуммаДокумента = 0
	|			ТОГДА 0
	|		ИНАЧЕ 100
	|	КОНЕЦ КАК ПроцентОплаты,
	|	т.СуммаДокумента КАК СуммаДокумента,
	|	НЕОПРЕДЕЛЕНО КАК Грузоотправитель,
	|	т.Грузополучатель КАК Грузополучатель,
	|	т.Грузополучатель.КПП КАК ГрузополучательКПП,
	|	т.Контрагент.КПП КАК КонтрагентКПП,
	|	т.ИдентификаторПлатежа КАК ИдентификаторПлатежа,
	|	ЛОЖЬ КАК СчетКВозврату,
	|	т.AMS_Вес КАК Вес,
	|	т.AMS_Объем КАК Объем,
	|	т.AMS_КоличествоПалет КАК КоличествоПалет,
	|	ВЫБОР
	|		КОГДА т.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоЭкспорт,
	|	КолМест.КоличествоМест КАК КоличествоМест
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК т
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтветственныеЛица КАК ОтвЛица
	|		ПО т.Ссылка = ОтвЛица.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторБанков КАК КлассификаторБанков
	|		ПО т.БанковскийСчетОрганизации.Банк = КлассификаторБанков.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторБанков КАК КлассификаторБанковКорреспондентов
	|		ПО т.БанковскийСчетОрганизации.БанкДляРасчетов = КлассификаторБанковКорреспондентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Константы КАК Константы
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ КолМест КАК КолМест
	|		ПО т.Ссылка = КолМест.Ссылка
	|ГДЕ
	|	т.Ссылка В
	|			(ВЫБРАТЬ
	|				т.Ссылка КАК Ссылка
	|			ИЗ
	|				док КАК т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тов.Ссылка КАК Ссылка,
	|	тов.НомерСтроки КАК НомерСтроки,
	|	тов.Номенклатура КАК Номенклатура,
	|	тов.Код КАК Код,
	|	тов.Артикул КАК Артикул,
	|	тов.НаименованиеПолное КАК НаименованиеПолное,
	|	тов.Количество КАК Количество,
	|	тов.КоличествоУпаковок КАК КоличествоУпаковок,
	|	тов.Цена КАК Цена,
	|	тов.Сумма КАК Сумма,
	|	тов.СтавкаНДС КАК СтавкаНДС,
	|	тов.СуммаНДС КАК СуммаНДС,
	|	тов.Упаковка КАК Упаковка,
	|	тов.СуммаБезСкидки КАК СуммаБезСкидки,
	|	тов.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	тов.ВидУпаковки КАК ВидУпаковки,
	|	тов.КоличествоВУпаковке КАК КоличествоВУпаковке
	|ИЗ
	|	тов КАК тов
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";

	ПакетРезультатовЗапроса = Запрос.ВыполнитьПакет();

	СтруктураДанныхДляПечати = Новый Структура;
	СтруктураДанныхДляПечати.Вставить("РезультатПоЭтапамОплаты", ПакетРезультатовЗапроса[3]);
	СтруктураДанныхДляПечати.Вставить("РезультатПоШапке", ПакетРезультатовЗапроса[4]);
	СтруктураДанныхДляПечати.Вставить("РезультатПоТабличнойЧасти", ПакетРезультатовЗапроса[5]);

	Возврат СтруктураДанныхДляПечати;
КонецФункции

Функция ПолучитьДанныеДляПечатнойФормыСчетаОтЗаказа(МассивОбъектов)
	Запрос = Новый Запрос;

	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ОтветственныеЛицаСервер.СформироватьВременнуюТаблицуОтветственныхЛицДокументов(МассивОбъектов,
		МенеджерВременныхТаблиц);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;

	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ док
	|ИЗ
	|	Документ.ЗаказКлиента КАК т
	|ГДЕ
	|	т.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Ссылка КАК Ссылка,
	|	т.Номер КАК Номер,
	|	ВЫБОР
	|		КОГДА т.AMS_ДатаСчета = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА т.Дата
	|		ИНАЧЕ т.AMS_ДатаСчета
	|	КОНЕЦ КАК Дата,
	|	т.Ссылка КАК ДокументОснование,
	|	ЕСТЬNULL(т.БанковскийСчет.Владелец, т.Организация) КАК Организация,
	|	т.Организация КАК ОрганизацияПоставщик,
	|	ОтвЛица.РуководительНаименование КАК Руководитель,
	|	ОтвЛица.РуководительДолжность КАК ДолжностьРуководителя,
	|	ОтвЛица.ГлавныйБухгалтерНаименование КАК ГлавныйБухгалтер,
	|	т.Контрагент КАК Контрагент,
	|	т.Контрагент.ЮридическоеФизическоеЛицо КАК КонтрагентЮрФизЛицо,
	|	т.БанковскийСчет КАК БанковскийСчет,
	|	ВЫБОР
	|		КОГДА т.БанковскийСчет.ИностранныйБанк
	|				ИЛИ т.БанковскийСчет.ВалютаДенежныхСредств <> Константы.ВалютаРегламентированногоУчета
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПлатежЗаРубеж,
	|	т.БанковскийСчет.ВалютаДенежныхСредств КАК ВалютаДенежныхСредств,
	|	т.БанковскийСчет.СВИФТБанка КАК СВИФТБанка,
	|	т.БанковскийСчет.СВИФТБанкаДляРасчетов КАК СВИФТБанкаДляРасчетов,
	|	т.БанковскийСчет.АдресБанка КАК АдресБанка,
	|	т.БанковскийСчет.АдресБанкаДляРасчетов КАК АдресБанкаДляРасчетов,
	|	т.БанковскийСчет.СчетВБанкеДляРасчетов КАК СчетВБанкеДляРасчетов,
	|	т.БанковскийСчет.НомерСчета КАК НомерБанковскогоСчета,
	|	ВЫБОР
	|		КОГДА т.БанковскийСчет.РучноеИзменениеРеквизитовБанка
	|			ТОГДА т.БанковскийСчет.БИКБанка
	|		ИНАЧЕ КлассификаторБанков.Код
	|	КОНЕЦ КАК БИКБанк,
	|	ВЫБОР
	|		КОГДА т.БанковскийСчет.РучноеИзменениеРеквизитовБанка
	|			ТОГДА т.БанковскийСчет.НаименованиеБанка
	|		ИНАЧЕ КлассификаторБанков.Наименование
	|	КОНЕЦ КАК НаименованиеБанка,
	|	ВЫБОР
	|		КОГДА т.БанковскийСчет.РучноеИзменениеРеквизитовБанка
	|			ТОГДА т.БанковскийСчет.КоррСчетБанка
	|		ИНАЧЕ КлассификаторБанков.КоррСчет
	|	КОНЕЦ КАК КоррСчетБанка,
	|	ВЫБОР
	|		КОГДА т.БанковскийСчет.РучноеИзменениеРеквизитовБанка
	|			ТОГДА т.БанковскийСчет.ГородБанка
	|		ИНАЧЕ КлассификаторБанков.Город
	|	КОНЕЦ КАК ГородБанка,
	|	ВЫБОР
	|		КОГДА т.БанковскийСчет.РучноеИзменениеРеквизитовБанкаДляРасчетов
	|			ТОГДА т.БанковскийСчет.БИКБанкаДляРасчетов
	|		ИНАЧЕ КлассификаторБанковКорреспондентов.Код
	|	КОНЕЦ КАК БИКБанкаДляРасчетов,
	|	ВЫБОР
	|		КОГДА т.БанковскийСчет.РучноеИзменениеРеквизитовБанкаДляРасчетов
	|			ТОГДА т.БанковскийСчет.НаименованиеБанкаДляРасчетов
	|		ИНАЧЕ КлассификаторБанковКорреспондентов.Наименование
	|	КОНЕЦ КАК НаименованиеБанкаДляРасчетов,
	|	ВЫБОР
	|		КОГДА т.БанковскийСчет.РучноеИзменениеРеквизитовБанкаДляРасчетов
	|			ТОГДА т.БанковскийСчет.КоррСчетБанкаДляРасчетов
	|		ИНАЧЕ КлассификаторБанковКорреспондентов.КоррСчет
	|	КОНЕЦ КАК КоррСчетБанкаДляРасчетов,
	|	ВЫБОР
	|		КОГДА т.БанковскийСчет.РучноеИзменениеРеквизитовБанкаДляРасчетов
	|			ТОГДА т.БанковскийСчет.ГородБанкаДляРасчетов
	|		ИНАЧЕ КлассификаторБанковКорреспондентов.Город
	|	КОНЕЦ КАК ГородБанкаДляРасчетов,
	|	т.БанковскийСчет.ТекстКорреспондента КАК БанковскийСчетТекстКорреспондента,
	|	т.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	|	т.СуммаДокумента КАК СуммаКВозврату,
	|	ВЫБОР
	|		КОГДА т.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК УчитыватьНДС,
	|	т.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДСУПокупателя) КАК ОперацияОблагаетсяНДСУПокупателя,
	|	т.Валюта КАК Валюта,
	|	т.Автор.ФизическоеЛицо КАК Менеджер,
	|	"""" КАК ДополнительнаяИнформация,
	|	ЛОЖЬ КАК ЧастичнаяОплата,
	|	""Товары бытовой химии."" КАК НазначениеПлатежа,
	|	ВЫБОР
	|		КОГДА т.СуммаДокумента = 0
	|			ТОГДА 0
	|		ИНАЧЕ 100
	|	КОНЕЦ КАК ПроцентОплаты,
	|	т.СуммаДокумента КАК СуммаДокумента,
	|	НЕОПРЕДЕЛЕНО КАК Грузоотправитель,
	|	НЕОПРЕДЕЛЕНО КАК Грузополучатель,
	|	т.ИдентификаторПлатежа КАК ИдентификаторПлатежа,
	|	ЛОЖЬ КАК СчетКВозврату,
	|	ВЫБОР
	|		КОГДА т.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоЭкспорт,
	|	т.AMS_Вес КАК Вес,
	|	т.AMS_Объем КАК Объем,
	|	т.AMS_КоличествоПалет КАК КоличествоПалет,
	|	т.AMS_КоличествоУпаковок КАК КоличествоМест
	|ПОМЕСТИТЬ Шапка
	|ИЗ
	|	Документ.ЗаказКлиента КАК т
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтветственныеЛица КАК ОтвЛица
	|		ПО т.Ссылка = ОтвЛица.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторБанков КАК КлассификаторБанков
	|		ПО т.БанковскийСчет.Банк = КлассификаторБанков.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторБанков КАК КлассификаторБанковКорреспондентов
	|		ПО т.БанковскийСчет.БанкДляРасчетов = КлассификаторБанковКорреспондентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Константы КАК Константы
	|		ПО (ИСТИНА)
	|ГДЕ
	|	т.Ссылка В
	|			(ВЫБРАТЬ
	|				т.Ссылка КАК Ссылка
	|			ИЗ
	|				док КАК т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Ссылка КАК Ссылка,
	|	т.НомерСтроки КАК НомерСтроки,
	|	т.Номенклатура КАК Номенклатура,
	|	н.Код КАК Код,
	|	н.Артикул КАК Артикул,
	|	н.НаименованиеПолное КАК НаименованиеПолное,
	|	т.Количество КАК Количество,
	|	т.КоличествоУпаковок КАК КоличествоУпаковок,
	|	т.Сумма / т.Количество КАК Цена,
	|	т.Сумма КАК Сумма,
	|	т.СтавкаНДС КАК СтавкаНДС,
	|	т.СуммаНДС КАК СуммаНДС,
	|	н._Упаковка КАК Упаковка,
	|	т.Сумма + т.СуммаРучнойСкидки + т.СуммаАвтоматическойСкидки КАК СуммаБезСкидки,
	|	н.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(т.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА т.Номенклатура.ЕдиницаИзмерения.Наименование
	|		КОГДА т.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Упаковка)
	|			ТОГДА т.Упаковка.ЕдиницаИзмерения.Наименование
	|		ИНАЧЕ т.Упаковка.Наименование
	|	КОНЕЦ КАК ВидУпаковки,
	|	т.Упаковка.Числитель / т.Упаковка.Знаменатель КАК КоличествоВУпаковке,
	|	т.Упаковка.Вес * т.КоличествоУпаковок КАК УпаковкаВес,
	|	т.Упаковка.Объем * т.КоличествоУпаковок КАК УпаковкаОбъем
	|ПОМЕСТИТЬ тов
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК т
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК н
	|		ПО т.Номенклатура = н.Ссылка
	|ГДЕ
	|	т.Ссылка В
	|			(ВЫБРАТЬ
	|				т.Ссылка КАК Ссылка
	|			ИЗ
	|				док КАК т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тов.Номенклатура КАК Номенклатура,
	|	Упак.Числитель КАК кфцПалета
	|ПОМЕСТИТЬ пал
	|ИЗ
	|	тов КАК тов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК Упак
	|		ПО тов.Номенклатура.НаборУпаковок = Упак.Владелец
	|			И (Упак.ЕдиницаИзмерения.Наименование = ""пал"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Ссылка КАК Ссылка,
	|	1 КАК НомерСтроки,
	|	т.Дата КАК ДатаПлатежа,
	|	100 КАК ПроцентПлатежа,
	|	т.СуммаДокумента КАК СуммаПлатежа
	|ИЗ
	|	Документ.ЗаказКлиента КАК т
	|ГДЕ
	|	т.Ссылка В
	|			(ВЫБРАТЬ
	|				т.Ссылка КАК Ссылка
	|			ИЗ
	|				док КАК т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Шапка.Ссылка КАК Ссылка,
	|	Шапка.Номер КАК Номер,
	|	Шапка.Дата КАК Дата,
	|	Шапка.ДокументОснование КАК ДокументОснование,
	|	Шапка.Организация КАК Организация,
	|	Шапка.ОрганизацияПоставщик КАК ОрганизацияПоставщик,
	|	Шапка.Руководитель КАК Руководитель,
	|	Шапка.ДолжностьРуководителя КАК ДолжностьРуководителя,
	|	Шапка.ГлавныйБухгалтер КАК ГлавныйБухгалтер,
	|	Шапка.Контрагент КАК Контрагент,
	|	Шапка.КонтрагентЮрФизЛицо КАК КонтрагентЮрФизЛицо,
	|	Шапка.БанковскийСчет КАК БанковскийСчет,
	|	Шапка.ПлатежЗаРубеж КАК ПлатежЗаРубеж,
	|	Шапка.ВалютаДенежныхСредств КАК ВалютаДенежныхСредств,
	|	Шапка.СВИФТБанка КАК СВИФТБанка,
	|	Шапка.СВИФТБанкаДляРасчетов КАК СВИФТБанкаДляРасчетов,
	|	Шапка.АдресБанка КАК АдресБанка,
	|	Шапка.АдресБанкаДляРасчетов КАК АдресБанкаДляРасчетов,
	|	Шапка.СчетВБанкеДляРасчетов КАК СчетВБанкеДляРасчетов,
	|	Шапка.НомерБанковскогоСчета КАК НомерБанковскогоСчета,
	|	Шапка.БИКБанк КАК БИКБанк,
	|	Шапка.НаименованиеБанка КАК НаименованиеБанка,
	|	Шапка.КоррСчетБанка КАК КоррСчетБанка,
	|	Шапка.ГородБанка КАК ГородБанка,
	|	Шапка.БИКБанкаДляРасчетов КАК БИКБанкаДляРасчетов,
	|	Шапка.НаименованиеБанкаДляРасчетов КАК НаименованиеБанкаДляРасчетов,
	|	Шапка.КоррСчетБанкаДляРасчетов КАК КоррСчетБанкаДляРасчетов,
	|	Шапка.ГородБанкаДляРасчетов КАК ГородБанкаДляРасчетов,
	|	Шапка.БанковскийСчетТекстКорреспондента КАК БанковскийСчетТекстКорреспондента,
	|	Шапка.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	|	Шапка.СуммаКВозврату КАК СуммаКВозврату,
	|	Шапка.УчитыватьНДС КАК УчитыватьНДС,
	|	Шапка.ОперацияОблагаетсяНДСУПокупателя КАК ОперацияОблагаетсяНДСУПокупателя,
	|	Шапка.Валюта КАК Валюта,
	|	Шапка.Менеджер КАК Менеджер,
	|	Шапка.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
	|	Шапка.ЧастичнаяОплата КАК ЧастичнаяОплата,
	|	Шапка.НазначениеПлатежа КАК НазначениеПлатежа,
	|	Шапка.ПроцентОплаты КАК ПроцентОплаты,
	|	Шапка.СуммаДокумента КАК СуммаДокумента,
	|	Шапка.Грузоотправитель КАК Грузоотправитель,
	|	Шапка.Грузополучатель КАК Грузополучатель,
	|	Шапка.ИдентификаторПлатежа КАК ИдентификаторПлатежа,
	|	Шапка.СчетКВозврату КАК СчетКВозврату,
	|	Шапка.ЭтоЭкспорт КАК ЭтоЭкспорт,
	|	Шапка.Вес КАК Вес,
	|	Шапка.Объем КАК Объем,
	|	Шапка.КоличествоПалет КАК КоличествоПалет,
	|	Шапка.КоличествоМест КАК КоличествоМест
	|ИЗ
	|	Шапка КАК Шапка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тов.Ссылка КАК Ссылка,
	|	тов.НомерСтроки КАК НомерСтроки,
	|	тов.Номенклатура КАК Номенклатура,
	|	тов.Код КАК Код,
	|	тов.Артикул КАК Артикул,
	|	тов.НаименованиеПолное КАК НаименованиеПолное,
	|	тов.Количество КАК Количество,
	|	тов.КоличествоУпаковок КАК КоличествоУпаковок,
	|	тов.Цена КАК Цена,
	|	тов.Сумма КАК Сумма,
	|	тов.СтавкаНДС КАК СтавкаНДС,
	|	тов.СуммаНДС КАК СуммаНДС,
	|	тов.Упаковка КАК Упаковка,
	|	тов.СуммаБезСкидки КАК СуммаБезСкидки,
	|	тов.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	тов.ВидУпаковки КАК ВидУпаковки,
	|	тов.КоличествоВУпаковке КАК КоличествоВУпаковке
	|ИЗ
	|	тов КАК тов
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("Палета", AMS_ВызовСервера.УпаковкаПалета());

	ПакетРезультатовЗапроса = Запрос.ВыполнитьПакет();

	СтруктураДанныхДляПечати = Новый Структура;
	СтруктураДанныхДляПечати.Вставить("РезультатПоЭтапамОплаты", ПакетРезультатовЗапроса[4]);
	СтруктураДанныхДляПечати.Вставить("РезультатПоШапке", ПакетРезультатовЗапроса[5]);
	СтруктураДанныхДляПечати.Вставить("РезультатПоТабличнойЧасти", ПакетРезультатовЗапроса[6]);

	Возврат СтруктураДанныхДляПечати;
КонецФункции

Процедура ЗаполнитьТабличныйДокументСчетаНаОплату(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати, ПараметрыПечати)
	СтруктураИмяДопКолонки = Новый Структура("ИмяКолонкиКодов", "Артикул");

	ДанныеПечати = ДанныеДляПечати.РезультатПоШапке.Выбрать();
	ЭтапыОплаты = ДанныеДляПечати.РезультатПоЭтапамОплаты.Выгрузить();
	Товары = ДанныеДляПечати.РезультатПоТабличнойЧасти.Выгрузить();

	ПервыйДокумент = Истина;

	Пока ДанныеПечати.Следующий() Цикл
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);

		ТаблицаТовары = Товары.НайтиСтроки(СтруктураПоиска);
		ТаблицаЭтапыОплаты = ЭтапыОплаты.НайтиСтроки(СтруктураПоиска);

		Если ПервыйДокумент Тогда
			ПервыйДокумент = Ложь;
		Иначе
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;

		Макет = Новый ТабличныйДокумент;

		ЗаполнитьРеквизитыШапкиСчетаНаОплату(ДанныеПечати, Макет, ТабличныйДокумент, ТаблицаЭтапыОплаты, ТаблицаТовары, ПараметрыПечати);
		
		// Таблица "Товары"
		ОбластьШапкаТаблицы  = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
		ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");

		ВыводШапки = 0;

		ОбластьШапкаТаблицы.Параметры.Заполнить(СтруктураИмяДопКолонки);
		ОбластьСуммаПрописью = Макет.ПолучитьОбласть("СуммаПрописью");

		МассивПроверкиВывода = Новый Массив;

		Сумма = 0;
		СуммаНДС = 0;
		НомерСтроки = 0;
		СоответствиеСтавокНДС = Новый Соответствие;
		Для Каждого СтрокаТовары Из ТаблицаТовары Цикл

			НомерСтроки = НомерСтроки + 1;
			НомерСтрокиПечать = НомерСтроки;

			Если НомерСтроки = 0 И ВыводШапки <> 2 Тогда
				ВыводШапки = 1;
			КонецЕсли;

			Товар = СтрокаТовары.НаименованиеПолное;

			СтруктураДанныхСтроки = Новый Структура;
			СтруктураДанныхСтроки.Вставить("Товар", Товар);
			СтруктураДанныхСтроки.Вставить("НомерСтроки", НомерСтрокиПечать);
			ОбластьСтрокаТаблицы.Параметры.Заполнить(СтрокаТовары);

			Если ЗначениеЗаполнено(СтруктураИмяДопКолонки.ИмяКолонкиКодов) Тогда
				СтруктураДанныхСтроки.Вставить("Артикул", СтрокаТовары[СтруктураИмяДопКолонки.ИмяКолонкиКодов]);
			КонецЕсли;

			ОбластьСтрокаТаблицы.Параметры.Заполнить(СтруктураДанныхСтроки);

			МассивПроверкиВывода.Очистить();
			МассивПроверкиВывода.Добавить(ОбластьСтрокаТаблицы);
			Если НомерСтроки = ТаблицаТовары.Количество() Тогда
				МассивПроверкиВывода.Добавить(ОбластьПодвалТаблицы);
				МассивПроверкиВывода.Добавить(ОбластьСуммаПрописью);
			КонецЕсли;

			Если ТабличныйДокумент.ПроверитьВывод(МассивПроверкиВывода) Тогда
				Если (НомерСтроки = 1 И ВыводШапки = 0) Или (НомерСтроки = 0 И ВыводШапки = 1) Тогда
					ВыводШапки = 2;
					ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
				КонецЕсли;
			Иначе
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
			КонецЕсли;

			ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);

			Сумма = Сумма + СтрокаТовары.Сумма;
			СуммаНДС = СуммаНДС + СтрокаТовары.СуммаНДС;

			Если ДанныеПечати.УчитыватьНДС Тогда
				СуммаНДСПоСтавке = СоответствиеСтавокНДС[СтрокаТовары.СтавкаНДС];
				Если СуммаНДСПоСтавке = Неопределено Тогда
					СуммаНДСПоСтавке = 0;
				КонецЕсли;
				СоответствиеСтавокНДС.Вставить(СтрокаТовары.СтавкаНДС, СуммаНДСПоСтавке + СтрокаТовары.СуммаНДС);
			КонецЕсли;
		КонецЦикла;
		
		// Подвал таблицы "Товары"
		СтруктураДанныхПодвала = Новый Структура;
		СтруктураДанныхПодвала.Вставить("ВсегоМест", "Количество: " + ДанныеПечати.КоличествоМест + " мест; " + Окр(
			ДанныеПечати.КоличествоПалет, 2) + " палет");
		СтруктураДанныхПодвала.Вставить("Всего", ФормированиеПечатныхФорм.ФорматСумм(Сумма));
		СтруктураДанныхПодвала.Вставить("ВсегоВес", ?(ДанныеПечати.Вес = Null, "", "Вес " + Окр(ДанныеПечати.Вес, 3)
			+ " т"));
		СтруктураДанныхПодвала.Вставить("ВсегоОбъем", ?(ДанныеПечати.Объем = Null, "", "Объём " + Окр(
			ДанныеПечати.Объем, 3) + " куб. м"));

		Если ДанныеПечати.УчитыватьНДС Тогда
			Для Каждого ТекСтавкаНДС Из СоответствиеСтавокНДС Цикл
				СтруктураДанныхПодвала.Вставить("НДС", ФормированиеПечатныхФорм.ТекстНДСПоСтавке(ТекСтавкаНДС.Ключ,
					ДанныеПечати.ЦенаВключаетНДС));
				СтруктураДанныхПодвала.Вставить("ВсегоНДС", ФормированиеПечатныхФорм.ФорматСумм(ТекСтавкаНДС.Значение, ,
					"-"));
				СтруктураДанныхПодвала.Вставить("ВсегоСНДС", ФормированиеПечатныхФорм.ФорматСумм(Сумма + ?(
					ДанныеПечати.ЦенаВключаетНДС, 0, СуммаНДС)));
			КонецЦикла;

		Иначе
			СтруктураДанныхПодвала.Вставить("НДС", НСтр("ru='Без налога (НДС)'"));
		КонецЕсли;

		ОбластьПодвалТаблицы.Параметры.Заполнить(СтруктураДанныхПодвала);
		ТабличныйДокумент.Вывести(ОбластьПодвалТаблицы);
		
		// Вывести Сумму прописью
		СуммаКПрописи = Сумма + ?(ДанныеПечати.ЦенаВключаетНДС, 0, СуммаНДС);
		ИтоговаяСтрока = НСтр("ru='Всего наименований %Количество%, на сумму %Сумма%'");
		ИтоговаяСтрока = СтрЗаменить(ИтоговаяСтрока, "%Количество%", НомерСтроки);
		ИтоговаяСтрока = СтрЗаменить(ИтоговаяСтрока, "%Сумма%", ФормированиеПечатныхФорм.ФорматСумм(СуммаКПрописи,
			ДанныеПечати.Валюта));

		СтруктураДанныхСуммаПрописью = Новый Структура;
		СтруктураДанныхСуммаПрописью.Вставить("СуммаПрописью", РаботаСКурсамиВалют.СформироватьСуммуПрописью(
			СуммаКПрописи, ДанныеПечати.Валюта));
		СтруктураДанныхСуммаПрописью.Вставить("ИтоговаяСтрока", ИтоговаяСтрока);
		ОбластьСуммаПрописью.Параметры.Заполнить(СтруктураДанныхСуммаПрописью);
		ТабличныйДокумент.Вывести(ОбластьСуммаПрописью);

		ЗаполнитьРеквизитыПодвалаСчетаНаОплату(ДанныеПечати, Макет, ТабличныйДокумент, ТаблицаЭтапыОплаты,
			СоответствиеСтавокНДС, ПараметрыПечати);

		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати,
			ДанныеПечати.Ссылка);
	КонецЦикла;
КонецПроцедуры

Процедура ЗаполнитьРеквизитыШапкиСчетаНаОплату(ДанныеПечати, Макет, ТабличныйДокумент, ТаблицаЭтапыОплаты, ТаблицаТовары, ПараметрыПечати)
	Заголовок = Неопределено;
	ЕстьЗаголовок = ПараметрыПечати.Свойство("Заголовок", Заголовок);
	Если Не ЕстьЗаголовок Или Заголовок = "Счет" Тогда
		ЭтоСчет = Истина;
	Иначе	
		ЭтоСчет = Ложь;
	КонецЕсли;

	Если ДанныеПечати.ЭтоЭкспорт Тогда
		Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.AMS_Продажи.СчетНаОплатуЭкспорт");
	Иначе
		Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.AMS_Продажи.СчетНаОплату");
	КонецЕсли;

	СведенияОПоставщике = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Организация, ДанныеПечати.Дата);

	Если ЭтоСчет Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокСчета");
		ФормированиеПечатныхФорм.ВывестиЛоготипВТабличныйДокумент(Макет, ОбластьМакета, "ЗаголовокСчета",
			ДанныеПечати.Организация);
		ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ОбластьМакета,
			ДанныеПечати.Ссылка);
	
		ДатаПлатежа = ДанныеПечати.Дата + 60 * 60 * 24 * 3;
	
		Если ЗначениеЗаполнено(ДатаПлатежа) Тогда
			СтруктураДанныхЗаголовок = Новый Структура;
			НадписьСрокДействия = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Счет действителен до %1.'"), Формат(ДатаПлатежа, "ДЛФ=D")) + " ";
			СтруктураДанныхЗаголовок.Вставить("СрокДействия", НадписьСрокДействия);
			ОбластьМакета.Параметры.Заполнить(СтруктураДанныхЗаголовок);
		КонецЕсли;
	
		ТабличныйДокумент.Вывести(ОбластьМакета);

		Если ДанныеПечати.КонтрагентЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо И ЗначениеЗаполнено(ДанныеПечати.БанковскийСчет) Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("ОбразецЗаполненияППСКодом");
		Иначе
			ОбластьМакета = Макет.ПолучитьОбласть("ОбразецЗаполненияПП");
		КонецЕсли;
	
		СтруктураДанныхШапки = Новый Структура;
		СтруктураДанныхШапки.Вставить("ИНН", СведенияОПоставщике.ИНН);
		СтруктураДанныхШапки.Вставить("КПП", СведенияОПоставщике.КПП);
		ПредставлениеПоставщикаДляПлатПоручения = "";
	
		СтруктураДанныхШапки.Вставить("ИдентификаторПлатежа", ДанныеПечати.ИдентификаторПлатежа);
	
		Если ЗначениеЗаполнено(ДанныеПечати.БанковскийСчет) Тогда
	
			Если ЗначениеЗаполнено(ДанныеПечати.БИКБанкаДляРасчетов) Тогда
				Банк		= ДанныеПечати.НаименованиеБанкаДляРасчетов;
				БИК         = ДанныеПечати.БИКБанкаДляРасчетов;
				КоррСчет    = ДанныеПечати.КоррСчетБанкаДляРасчетов;
				ГородБанка  = ДанныеПечати.ГородБанкаДляРасчетов;
				НомерСчета  = ДанныеПечати.КоррСчетБанка;
			Иначе
				Банк		= ДанныеПечати.НаименованиеБанка;
				БИК         = ДанныеПечати.БИКБанк;
				КоррСчет    = ДанныеПечати.КоррСчетБанка;
				ГородБанка  = ДанныеПечати.ГородБанка;
				НомерСчета  = ДанныеПечати.НомерБанковскогоСчета;
			КонецЕсли;
	
			СтруктураДанныхШапки.Вставить("БИКБанкаПолучателя", БИК);
			СтруктураДанныхШапки.Вставить("БанкПолучателя", Банк);
			СтруктураДанныхШапки.Вставить("БанкПолучателяПредставление", СокрЛП(Банк) + " " + ГородБанка);
			СтруктураДанныхШапки.Вставить("СчетБанкаПолучателя", КоррСчет);
			СтруктураДанныхШапки.Вставить("СчетБанкаПолучателяПредставление", КоррСчет);
			СтруктураДанныхШапки.Вставить("СчетПолучателяПредставление", НомерСчета);
			СтруктураДанныхШапки.Вставить("СчетПолучателя", НомерСчета);
			ПредставлениеПоставщикаДляПлатПоручения = ДанныеПечати.БанковскийСчетТекстКорреспондента;
	
			Если ПустаяСтрока(ПредставлениеПоставщикаДляПлатПоручения) Тогда
				ПредставлениеПоставщикаДляПлатПоручения = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике,
					"ПолноеНаименование,");
			КонецЕсли;
	
			Если Не ЗначениеЗаполнено(ДанныеПечати.НазначениеПлатежа) И ТипЗнч(ДанныеПечати.Ссылка) <> Тип(
				"ДокументСсылка.СчетНаОплатуКлиенту") Тогда
	
				СтруктураДанныхШапки.Вставить("НазначениеПлатежа", Документы.СчетНаОплатуКлиенту.СформироватьНазначениеПлатежа(
					ДанныеПечати.Номер, ДанныеПечати.Ссылка));
			Иначе
	
				СтруктураДанныхШапки.Вставить("НазначениеПлатежа", ДанныеПечати.НазначениеПлатежа);
			КонецЕсли;
	
			СтруктураДанныхШапки.Вставить("ПредставлениеПоставщикаДляПлатПоручения",
				ПредставлениеПоставщикаДляПлатПоручения);
			ОбластьМакета.Параметры.Заполнить(СтруктураДанныхШапки);

			Если ДанныеПечати.КонтрагентЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо И ЗначениеЗаполнено(
				ДанныеПечати.БанковскийСчет) Тогда
	
				РеквизитыПлатежа = РеквизитыПлатежаQRКод(СтруктураДанныхШапки);
				РеквизитыПлатежа.СуммаЧислом = СуммаКОплатеПоСчету(ДанныеПечати, ТаблицаТовары);
				РеквизитыПлатежа.Ссылка = ДанныеПечати.Ссылка;
	
				ВывестиQRКод(РеквизитыПлатежа, ДанныеПечати, ОбластьМакета);
			КонецЕсли;
	
			ТабличныйДокумент.Вывести(ОбластьМакета);
		КонецЕсли;
	КонецЕсли;
	

	КолонкаКодов = "Артикул";
	ВыводитьКоды = ЗначениеЗаполнено(КолонкаКодов);

	Смещать = ТипСмещенияТабличногоДокумента.ПоВертикали;
	ОбластьПервойКолонкиТоваров = Макет.Область("ПерваяКолонкаТовара");
	Если Не ВыводитьКоды Тогда
		ОбластьПервойКолонкиТоваров.ШиринаКолонки = ОбластьПервойКолонкиТоваров.ШиринаКолонки + Макет.Область(
			"КолонкаКодов").ШиринаКолонки;
		Макет.УдалитьОбласть(Макет.Область("КолонкаКодов"), Смещать);
	КонецЕсли;

	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");

	Если ЭтоСчет Тогда
		Если ДанныеПечати.ЭтоЭкспорт Тогда
			ТекстЗаголовка = ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(ДанныеПечати, НСтр(
				"ru='Счет (инвойс)'"));
		Иначе
			ТекстЗаголовка = ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(ДанныеПечати, НСтр(
				"ru='Счет на оплату'"));
		КонецЕсли;
		
	Иначе
		ТекстЗаголовка = ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(ДанныеПечати, НСтр(
			"ru='Заказ клиента'"));
	КонецЕсли;

	СтруктураДанныхШапки = Новый Структура;
	СтруктураДанныхШапки.Вставить("ТекстЗаголовка", ТекстЗаголовка);
	ОбластьМакета.Параметры.Заполнить(СтруктураДанныхШапки);
	ТабличныйДокумент.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
	СтруктураДанныхПоставщик = Новый Структура;
	СтруктураДанныхПоставщик.Вставить("ПредставлениеПоставщика", ФормированиеПечатныхФорм.ОписаниеОрганизации(
		ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.ОрганизацияПоставщик, ДанныеПечати.Дата),
		"ПолноеНаименование,ИНН,КПП,ЮридическийАдрес,Телефоны,"));
	ОбластьМакета.Параметры.Заполнить(СтруктураДанныхПоставщик);
	ТабличныйДокумент.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
	ПредставлениеПолучателя = ФормированиеПечатныхФорм.ОписаниеОрганизации(
		ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Контрагент, ДанныеПечати.Дата),
		"ПолноеНаименование,ИНН,КПП,ЮридическийАдрес,Телефоны,");
	СтруктураДанныхПокупатель = Новый Структура;
	СтруктураДанныхПокупатель.Вставить("ПредставлениеПолучателя", ПредставлениеПолучателя);
	ОбластьМакета.Параметры.Заполнить(СтруктураДанныхПокупатель);
	ТабличныйДокумент.Вывести(ОбластьМакета);

	Если ЗначениеЗаполнено(ДанныеПечати.Грузоотправитель) Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Грузоотправитель");
		СтруктураДанныхГрузоотправитель = Новый Структура;
		СтруктураДанныхГрузоотправитель.Вставить("ПредставлениеГрузоотправителя", ОписаниеОрганизации(ДанныеПечати,
			"Грузоотправитель"));
		ОбластьМакета.Параметры.Заполнить(СтруктураДанныхГрузоотправитель);
		ТабличныйДокумент.Вывести(ОбластьМакета);
	КонецЕсли;

	Если ЗначениеЗаполнено(ДанныеПечати.Грузополучатель) Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Грузополучатель");
		СтруктураДанныхГрузополучатель = Новый Структура;
		СтруктураДанныхГрузополучатель.Вставить("ПредставлениеГрузополучателя", ОписаниеОрганизации(ДанныеПечати,
			"Грузополучатель"));
		ОбластьМакета.Параметры.Заполнить(СтруктураДанныхГрузополучатель);
		ТабличныйДокумент.Вывести(ОбластьМакета);
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьРеквизитыПодвалаСчетаНаОплату(ДанныеПечати, Макет, ТабличныйДокумент, ТаблицаЭтапыОплаты,
	СоответствиеСтавокНДС, ПараметрыПечати)
	
	Заголовок = Неопределено;
	ЕстьЗаголовок = ПараметрыПечати.Свойство("Заголовок", Заголовок);
	Если Не ЕстьЗаголовок Или Заголовок = "Счет" Тогда
		ЭтоСчет = Истина;
	Иначе	
		ЭтоСчет = Ложь;	
	КонецЕсли;

	МассивПроверкиВывода = Новый Массив;
	
	// Вывести этапы графика оплаты
	Если ТаблицаЭтапыОплаты.Количество() > 1 Тогда

		ИмяКолонкиДатыОплаты = ?(ДанныеПечати.СчетКВозврату, НСтр("ru='Дата оплаты или возврата'",
			ОбщегоНазначения.КодОсновногоЯзыка()), НСтр("ru='Дата оплаты'", ОбщегоНазначения.КодОсновногоЯзыка()));

		ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицыЭтапыОплаты");
		ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ИтогоЭтапыОплаты");
		СтруктураДанныхШапки = Новый Структура("ИмяКолонкиДатыОплаты", ИмяКолонкиДатыОплаты);
		ОбластьШапкаТаблицы.Параметры.Заполнить(СтруктураДанныхШапки);
		МассивПроверкиВывода.Добавить(ОбластьШапкаТаблицы);
		МассивПроверкиВывода.Добавить(ОбластьПодвалТаблицы);

		ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицыЭтапыОплаты");

		НомерЭтапа = 1;
		Для Каждого ТекЭтап Из ТаблицаЭтапыОплаты Цикл

			ПараметрыСтроки = НовыеПараметрыСтрокиЭтапа();
			ЗаполнитьЗначенияСвойств(ПараметрыСтроки, ТекЭтап);
			ПараметрыСтроки.НомерСтроки = НомерЭтапа;
			Если Не ПараметрыСтроки.ЭтоЗалогЗаТару Тогда
				ПараметрыСтроки.ТекстНДС = ФормированиеПечатныхФорм.СформироватьТекстНДСЭтапаОплаты(
					СоответствиеСтавокНДС, ТекЭтап.ПроцентПлатежа);
			Иначе
				//@skip-check bsl-legacy-check-expression-type
				ПараметрыСтроки.ПроцентПлатежа = "-";
				ПараметрыСтроки.ТекстНДС = НСтр("ru='Залог за тару. Без налога (НДС).'",
					ОбщегоНазначения.КодОсновногоЯзыка());
			КонецЕсли;

			ОбластьСтрокаТаблицы.Параметры.Заполнить(ПараметрыСтроки);

			МассивПроверкиВывода.Добавить(ОбластьСтрокаТаблицы);

			Если ТабличныйДокумент.ПроверитьВывод(МассивПроверкиВывода) Тогда
				Если НомерЭтапа = 1 Тогда
					ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
					МассивПроверкиВывода.Удалить(0);
				КонецЕсли;
			Иначе
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
			КонецЕсли;

			ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);
			МассивПроверкиВывода.Удалить(МассивПроверкиВывода.ВГраница());

			НомерЭтапа = НомерЭтапа + 1;

		КонецЦикла;
		ТабличныйДокумент.Вывести(ОбластьПодвалТаблицы);

	КонецЕсли;
	
	// Вывести дополнительную информацию
	Если ЗначениеЗаполнено(ДанныеПечати.ДополнительнаяИнформация) Тогда

		Область = Макет.ПолучитьОбласть("ДополнительнаяИнформация");
		Область.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(Область);

	КонецЕсли;

	ДолжностьРуководителя = ?(ДанныеПечати.ДолжностьРуководителя = "", Нстр("ru = 'Генеральный директор'"),
		ДанныеПечати.ДолжностьРуководителя);
	
	Если ЭтоСчет Тогда
		// Вывести подписи
		Область = Макет.ПолучитьОбласть("ПодвалСчета");
		СтруктураДанныхПодвал = Новый Структура;
		СтруктураДанныхПодвал.Вставить("ФИОРуководителя", ДанныеПечати.Руководитель);
		СтруктураДанныхПодвал.Вставить("ДолжностьРуководителя", ДолжностьРуководителя);
		СтруктураДанныхПодвал.Вставить("ФИОБухгалтера", ДанныеПечати.ГлавныйБухгалтер);
		СтруктураДанныхПодвал.Вставить("ФИОМенеджер", ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ДанныеПечати.Менеджер,
			ДанныеПечати.Дата));
		СтруктураДанныхПодвал.Вставить("Менеджер", "Менеджер");
		Область.Параметры.Заполнить(СтруктураДанныхПодвал);
	
		ОтветственноеЛицо = мср.ПолучитьОтветственноеЛицо(ДанныеПечати.Организация);
		Если ОтветственноеЛицо = Неопределено Тогда
			СтруктураДанныхПодвал.ФИОБухгалтера = ДанныеПечати.Организация._ГлавныйБухгалтер;
		Иначе
			СтруктураДанныхПодвал.ФИОРуководителя = ОтветственноеЛицо;
			СтруктураДанныхПодвал.ФИОБухгалтера   = ОтветственноеЛицо;
			СтруктураДанныхПодвал.Вставить("Менеджер", "Помощник бухгалтера");
			СтруктураДанныхПодвал.ФИОМенеджер     = ОтветственноеЛицо;
		КонецЕсли;
		Область.Параметры.Заполнить(СтруктураДанныхПодвал);
	
		ФормированиеПечатныхФорм.ВывестиФаксимилеВТабличныйДокумент(Макет, Область, ДанныеПечати.Организация,
			ПараметрыПечати);
		МассивПроверкиВывода.Очистить();
		МассивПроверкиВывода.Добавить(Область);
		Если Не ТабличныйДокумент.ПроверитьВывод(МассивПроверкиВывода) Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(Область);
	КонецЕсли;

КонецПроцедуры

Функция РеквизитыПлатежаQRКод(СтруктураДанныхШапки)

	РеквизитыПлатежа = Новый Структура;
	РеквизитыПлатежа.Вставить("ТекстПолучателя", СтруктураДанныхШапки.ПредставлениеПоставщикаДляПлатПоручения);
	РеквизитыПлатежа.Вставить("НомерСчетаПолучателя", СтруктураДанныхШапки.СчетПолучателяПредставление);
	РеквизитыПлатежа.Вставить("НаименованиеБанкаПолучателя", СтруктураДанныхШапки.БанкПолучателяПредставление);
	РеквизитыПлатежа.Вставить("БИКБанкаПолучателя", СтруктураДанныхШапки.БИКБанкаПолучателя);
	РеквизитыПлатежа.Вставить("СчетБанкаПолучателя", СтруктураДанныхШапки.СчетБанкаПолучателяПредставление);
	РеквизитыПлатежа.Вставить("СуммаЧислом");
	РеквизитыПлатежа.Вставить("НазначениеПлатежа", СтруктураДанныхШапки.НазначениеПлатежа);
	РеквизитыПлатежа.Вставить("ИННПолучателя", СтруктураДанныхШапки.ИНН);
	РеквизитыПлатежа.Вставить("КПППолучателя", СтруктураДанныхШапки.КПП);
	РеквизитыПлатежа.Вставить("Ссылка");

	Возврат РеквизитыПлатежа

КонецФункции

Функция СуммаКОплатеПоСчету(ДанныеПечати, ТаблицаТовары)

	Если ТипЗнч(ДанныеПечати.Ссылка) = Тип("ДокументСсылка.АвансовыйОтчет") Или ТипЗнч(ДанныеПечати.ДокументОснование)
		= Тип("ДокументСсылка.ОтчетКомитенту") Или ДанныеПечати.ЧастичнаяОплата Тогда

		СуммаКОплатеПоСчету = ДанныеПечати.СуммаДокумента;

	Иначе

		СуммаКОплатеПоСчету = 0;

		ИспользоватьНаборы = Ложь;
		Если ТаблицаТовары.Количество() > 0 И ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(ТаблицаТовары[0],
			"ЭтоНабор") Тогда
			ИспользоватьНаборы = Истина;
		КонецЕсли;

		Для Каждого СтрокаТовары Из ТаблицаТовары Цикл
			Если Не НаборыСервер.ИспользоватьОбластьКомплектующие(СтрокаТовары, ИспользоватьНаборы) Тогда
				СуммаКОплатеПоСчету = СуммаКОплатеПоСчету + СтрокаТовары.Сумма + ?(ДанныеПечати.ЦенаВключаетНДС, 0,
					СтрокаТовары.СуммаНДС);
			КонецЕсли;
		КонецЦикла;

		Если ДанныеПечати.СчетКВозврату Тогда
			СуммаКОплатеПоСчету = СуммаКОплатеПоСчету - ДанныеПечати.СуммаКВозврату;
			Если СуммаКОплатеПоСчету < 0 Тогда
				СуммаКОплатеПоСчету = 0;
			КонецЕсли;
		КонецЕсли;

	КонецЕсли;

	Возврат СуммаКОплатеПоСчету;

КонецФункции

Функция ОписаниеОрганизации(ДанныеПечати, ИмяОрганизации)

	Сведения = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати[ИмяОрганизации], ДанныеПечати.Дата);
	РеквизитыОрганизации = "ПолноеНаименование,ИНН,КПП,ФактическийАдрес,Телефоны,";

	Возврат ФормированиеПечатныхФорм.ОписаниеОрганизации(Сведения, РеквизитыОрганизации);

КонецФункции

Процедура ВывестиQRКод(РеквизитыПлатежа, ДанныеПечати, ОбластьМакета)
	QRСтрока = "";

	УправлениеПечатьюЛокализация.СформироватьСтрокуВФорматеЭлектронныхБанковскихСообщений(QRСтрока, РеквизитыПлатежа);

	Если Не ПустаяСтрока(QRСтрока) Тогда

		ДанныеQRКода = ГенерацияШтрихкода.ДанныеQRКода(QRСтрока, 0, 190);

		Если ТипЗнч(ДанныеQRКода) = Тип("ДвоичныеДанные") Тогда
			КартинкаQRКода = Новый Картинка(ДанныеQRКода);
			ОбластьМакета.Рисунки.QRКод.Картинка = КартинкаQRКода;
		Иначе
			Шаблон = Нстр("ru = 'Не удалось сформировать QR-код для документа %1.
						  |Технические подробности см. в журнале регистрации.'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон, ДанныеПечати.Ссылка);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;

	КонецЕсли;
КонецПроцедуры

Функция НовыеПараметрыСтрокиЭтапа()

	СтруктураСтрокиЭтапа = Новый Структура;
	СтруктураСтрокиЭтапа.Вставить("НомерСтроки", 0);
	СтруктураСтрокиЭтапа.Вставить("ДатаПлатежа", '00010101');
	СтруктураСтрокиЭтапа.Вставить("ПроцентПлатежа", 0);
	СтруктураСтрокиЭтапа.Вставить("СуммаПлатежа", 0);
	СтруктураСтрокиЭтапа.Вставить("ТекстНДС", "");
	СтруктураСтрокиЭтапа.Вставить("ЭтоЗалогЗаТару", Ложь);

	Возврат СтруктураСтрокиЭтапа;

КонецФункции

#КонецОбласти

#Область Печать_СкладскаяНакладная

Функция СформироватьПечатнуюФормуСН(МассивОбъектов, ОбъектыПечати, ПараметрыПечати, КомплектыПечати = Неопределено) Экспорт
	УстановитьПривилегированныйРежим(Истина);

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ПолеСлева = 5;
	ТабличныйДокумент.ПолеСправа = 5;
	ТабличныйДокумент.РазмерКолонтитулаСверху = 0;
	ТабличныйДокумент.РазмерКолонтитулаСнизу = 0;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;

	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ__СН";

	ДанныеДляПечати = ПолучитьДанныеДляПечатиСН(МассивОбъектов);

	ЗаполнитьТабДокСН(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати, ПараметрыПечати, КомплектыПечати);

	Возврат ТабличныйДокумент;
КонецФункции

Функция ПолучитьДанныеДляПечатиСН(МассивОбъектов)
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("ПродукцияЦеха1", AMS_ВызовСервера.ВидНоменклатурыПродукцияЦеха1());
	Запрос.УстановитьПараметр("ПродукцияЦеха2", AMS_ВызовСервера.ВидНоменклатурыПродукцияЦеха2());
	Запрос.УстановитьПараметр("ПродукцияЦеха3", AMS_ВызовСервера.ВидНоменклатурыПродукцияЦеха3());
	Запрос.УстановитьПараметр("ХозТовар", AMS_ВызовСервера.ВидНоменклатурыТовар());

	Запрос.Текст =
	"ВЫБРАТЬ
	|	Реал.Партнер КАК Клиент,
	|	Реал.Партнер.НаименованиеПолное КАК ПартнерНаименованиеПолное,
	|	Реал.Партнер.Код КАК ПартнерКод,
	|	Реал.СпособДоставки КАК СпособДоставки,
	|	Реал.ВремяДоставкиС КАК ВремяДоставкиС,
	|	Реал.ВремяДоставкиПо КАК ВремяДоставкиПо,
	|	Реал.AMS_Обрешетка КАК Обрешетка,
	|	Реал.AMS_СпособПередачиТоваров КАК СпособПередачиТоваров,
	|	Реал.AMS_УсловияОтгрузки КАК УсловияОтгрузки,
	|	Реал.AMS_КоличествоПалет КАК КоличествоПалет,
	|	Реал.AMS_Вес КАК Вес,
	|	Реал.AMS_Объем КАК Объем,
	|	Реал.СуммаДокумента КАК СуммаДокумента,
	|	Реал.Ссылка КАК Ссылка,
	|	1 КАК Связь
	|ПОМЕСТИТЬ док1
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК Реал
	|ГДЕ
	|	Реал.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	СУММА(т.Количество) КАК Количество,
	|	СУММА(т.КоличествоУпаковок) КАК КоличествоУпаковок,
	|	СУММА(т.Сумма * 1.22) КАК Сумма,
	|	т.Упаковка КАК Упаковка
	|ПОМЕСТИТЬ тов
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК т
	|ГДЕ
	|	т.Ссылка В(&МассивОбъектов)
	|
	|СГРУППИРОВАТЬ ПО
	|	т.Номенклатура,
	|	т.Упаковка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Реал.Номер КАК Номер,
	|	Реал.Дата КАК Дата,
	|	Реал.Организация КАК Организация,
	|	Реал.Контрагент КАК Покупатель,
	|	Реал.Грузополучатель КАК Грузополучатель,
	|	Реал.ПеревозчикПартнер КАК Перевозчик,
	|	Реал.ПеревозчикПартнер.НаименованиеПолное КАК ПеревозчикНаименование,
	|	Реал.АдресДоставки КАК АдресДоставки,
	|	Реал.АдресДоставкиПеревозчика КАК АдресДоставкиПеревозчика,
	|	Реал.ДополнительнаяИнформацияПоДоставке КАК ДополнительнаяИнформацияПоДоставке,
	|	Реал.Комментарий КАК Комментарий,
	|	Реал.AMS_ТелефонВодителяКлиента КАК ТелефонВодителяКлиента,
	|	Реал.AMS_ПравилоПродажи КАК ПравилоПродажи,
	|	Реал.Ссылка КАК Ссылка,
	|	1 КАК Связь
	|ПОМЕСТИТЬ шапка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК Реал
	|ГДЕ
	|	Реал.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	шапка.Номер КАК Номер,
	|	шапка.Дата КАК Дата,
	|	док1.Клиент КАК Клиент,
	|	док1.ПартнерКод КАК ПартнерКод,
	|	док1.ПартнерНаименованиеПолное КАК КлиентНаименование,
	|	док1.СпособДоставки КАК СпособДоставки,
	|	шапка.АдресДоставки КАК АдресДоставки,
	|	док1.ВремяДоставкиС КАК ВремяДоставкиС,
	|	док1.ВремяДоставкиПо КАК ВремяДоставкиПо,
	|	док1.Обрешетка КАК Обрешетка,
	|	док1.СпособПередачиТоваров КАК СпособПередачиТоваров,
	|	док1.УсловияОтгрузки КАК УсловияОтгрузки,
	|	док1.КоличествоПалет КАК КоличествоПалет,
	|	док1.Вес КАК ИтогоВес,
	|	док1.Объем КАК ИтогоОбъем,
	|	док1.СуммаДокумента КАК ИтогоСумма,
	|	шапка.Организация КАК Организация,
	|	шапка.Покупатель КАК Покупатель,
	|	шапка.Грузополучатель КАК Грузополучатель,
	|	шапка.Перевозчик КАК Перевозчик,
	|	шапка.ПеревозчикНаименование КАК ПеревозчикНаименование,
	|	шапка.АдресДоставкиПеревозчика КАК АдресДоставкиПеревозчика,
	|	шапка.ДополнительнаяИнформацияПоДоставке КАК ДополнительнаяИнформацияПоДоставке,
	|	шапка.Комментарий КАК Комментарий,
	|	шапка.ТелефонВодителяКлиента КАК ТелефонВодителяКлиента,
	|	шапка.ПравилоПродажи КАК ПравилоПродажи,
	|	шапка.Ссылка КАК Ссылка
	|ИЗ
	|	док1 КАК док1
	|		ЛЕВОЕ СОЕДИНЕНИЕ шапка КАК шапка
	|		ПО док1.Связь = шапка.Связь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Реал.Номер КАК Номер,
	|	Реал.Дата КАК Дата
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК Реал
	|ГДЕ
	|	Реал.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ном.ВидНоменклатуры = &ПродукцияЦеха1
	|			ТОГДА 1
	|		КОГДА ном.ВидНоменклатуры = &ПродукцияЦеха2
	|			ТОГДА 2
	|		КОГДА ном.ВидНоменклатуры = &ПродукцияЦеха3
	|			ТОГДА 3
	|		КОГДА ном.ВидНоменклатуры = &ХозТовар
	|			ТОГДА 5
	|	КОНЕЦ КАК Цех,
	|	ном.Артикул КАК Артикул,
	|	тов.Номенклатура КАК Номенклатура,
	|	тов.Упаковка КАК Ед,
	|	тов.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ВЫРАЗИТЬ(тов.Количество / ЕСТЬNULL(Палл.Числитель, 1) КАК ЧИСЛО(10, 3)) КАК КоличествоПалет,
	|	ВЫРАЗИТЬ(тов.Сумма / тов.КоличествоУпаковок КАК ЧИСЛО(10, 2)) КАК Цена,
	|	ВЫРАЗИТЬ(тов.Сумма КАК ЧИСЛО(10, 2)) КАК Сумма,
	|	ВЫРАЗИТЬ(тов.КоличествоУпаковок * Упак.Вес / 1000 КАК ЧИСЛО(10, 3)) КАК Вес,
	|	ВЫРАЗИТЬ(тов.КоличествоУпаковок * Упак.Объем / 1000 КАК ЧИСЛО(10, 3)) КАК Объем
	|ИЗ
	|	тов КАК тов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК ном
	|		ПО тов.Номенклатура = ном.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК Упак
	|		ПО тов.Упаковка = Упак.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК Палл
	|		ПО тов.Номенклатура = Палл.Владелец
	|			И тов.Упаковка = Палл.Родитель
	|
	|УПОРЯДОЧИТЬ ПО
	|	Цех,
	|	ном.Наименование";

	Рез = Запрос.ВыполнитьПакет();
	РезультатПоШапке = Рез[3];
	РезультатПоНомерамУПД = Рез[4];
	РезультатПоТабличнойЧасти = Рез[5];

	Возврат Новый Структура("РезультатПоШапке,РезультатПоНомерамУПД,РезультатПоТабличнойЧасти", РезультатПоШапке,
		РезультатПоНомерамУПД, РезультатПоТабличнойЧасти);
КонецФункции

Процедура ЗаполнитьТабДокСН(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати, ПараметрыПечати, КомплектыПечати = Неопределено)
	Просмотр = Неопределено;
	ПараметрыПечати.Свойство("Просмотр", Просмотр);
	
	Если Пользователи.РолиДоступны("_КладовщикСклада") Тогда
		Просмотр = Истина;
	КонецЕсли;

	ВыбПоШапке = ДанныеДляПечати.РезультатПоШапке.Выбрать();
	ВыбПоШапке.Следующий();

	ВыбПоНомерам = ДанныеДляПечати.РезультатПоНомерамУПД.Выбрать();
	ВыбПоТоварам = ДанныеДляПечати.РезультатПоТабличнойЧасти;

	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.AMS_Продажи.СкладскаяНакладная");

	НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;

	ВывестиШапкуСН(ВыбПоШапке, ВыбПоНомерам, Макет, ТабличныйДокумент, Просмотр);

	НомерСтраницы = 1;
	НомерСтроки = 0;
	ИтогоКоличествоУпаковок = 0;
	ИтогоКоличествоПалет = 0;
		
	// Создаем массив для проверки вывода
	МассивВыводимыхОбластей = Новый Массив;
		
	// Выводим многострочную часть документа
	ОбластьЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаб");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");

	ВыводШапки = 0;

	Стр = ВыбПоТоварам.Выбрать();
	КоличествоСтрок = Стр.Количество();
	Пока Стр.Следующий() Цикл
		НомерСтроки = НомерСтроки + 1;

		ИтогоКоличествоУпаковок = ИтогоКоличествоУпаковок + Стр.КоличествоУпаковок;
		ИтогоКоличествоПалет = ИтогоКоличествоПалет + Стр.КоличествоПалет;

		ОбластьСтрока.Параметры.Заполнить(Стр);
		ОбластьСтрока.Параметры.НомерСтроки = НомерСтроки;

		Если НомерСтроки = 0 И ВыводШапки <> 2 Тогда
			ВыводШапки = 1;
		КонецЕсли;

		Если (НомерСтроки = 1 И ВыводШапки = 0) Или (НомерСтроки = 0 И ВыводШапки = 1) Тогда
			ВыводШапки = 2;
			ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
			ТабличныйДокумент.Вывести(ОбластьЗаголовокТаблицы);
		КонецЕсли;

		МассивВыводимыхОбластей.Очистить();
		МассивВыводимыхОбластей.Добавить(ОбластьСтрока);
		Если НомерСтроки = КоличествоСтрок Тогда
			ОбластьПодвал = ЗаполнитьПодвалСН(ВыбПоШапке, ИтогоКоличествоУпаковок, ИтогоКоличествоПалет, КоличествоСтрок, Макет);
			МассивВыводимыхОбластей.Добавить(ОбластьПодвал);
		КонецЕсли;

		Если Не ТабличныйДокумент.ПроверитьВывод(МассивВыводимыхОбластей) Тогда
			НомерСтраницы = НомерСтраницы + 1;
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();

			ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
			ТабличныйДокумент.Вывести(ОбластьЗаголовокТаблицы);
		КонецЕсли;

		ТабличныйДокумент.Вывести(ОбластьСтрока);
	КонецЦикла;
		
	// Выводим подвал документа
	ОбластьПодвала = ЗаполнитьПодвалСН(ВыбПоШапке, ИтогоКоличествоУпаковок, ИтогоКоличествоПалет, КоличествоСтрок, Макет);
	ТабличныйДокумент.Вывести(ОбластьПодвала);

	Если Не ПустаяСтрока(ВыбПоШапке.УсловияОтгрузки) Тогда
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		ОбластьУсловия = Макет.ПолучитьОбласть("УсловияОтгрузки");
		ОбластьУсловия.Параметры.УсловияОтгрузки = ВыбПоШапке.УсловияОтгрузки;
		ТабличныйДокумент.Вывести(ОбластьУсловия);
	КонецЕсли;
	
	УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыбПоШапке.Ссылка);
КонецПроцедуры

Процедура ВывестиШапкуСН(ВыбПоШапке, ВыбПоНомерам, Макет, ТабличныйДокумент, Просмотр)
	Распоряжение = "УПД: ";
	Пока ВыбПоНомерам.Следующий() Цикл
		Распоряжение = Распоряжение + ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ВыбПоНомерам.Номер) + " от "
			+ Формат(ВыбПоНомерам.Дата, "ДЛФ=Д") + ", ";
	КонецЦикла;
	Распоряжение = Лев(Распоряжение, СтрДлина(Распоряжение) - 2);

	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	Парам = ОбластьМакета.Параметры;
	Парам.Документ = "Складская накладная № " + ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ВыбПоШапке.Номер)
		+ " от " + Формат(ВыбПоШапке.Дата, "ДЛФ=ДД");
	Парам.Распоряжение = Распоряжение;

	Парам.Организация  = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(
		ВыбПоШапке.Организация, ВыбПоШапке.Дата), "ПолноеНаименование, ИНН, КПП");

	Парам.Организация = СтрЗаменить(Парам.Организация, "774301001", "505045001");
	
	ТабличныйДокумент.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть("Клиент");
	Парам = ОбластьМакета.Параметры;
	Парам.Клиент = ВыбПоШапке.КлиентНаименование;
	Парам.Покупатель = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(
		ВыбПоШапке.Покупатель, ВыбПоШапке.Дата), "ПолноеНаименование, ИНН, КПП");
	Если Не ЗначениеЗаполнено(ВыбПоШапке.Грузополучатель) Или ВыбПоШапке.Грузополучатель = ВыбПоШапке.Покупатель Тогда
		Парам.Грузополучатель = "он же";
	Иначе
		Парам.Грузополучатель = ФормированиеПечатныхФорм.ОписаниеОрганизации(
			ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ВыбПоШапке.Грузополучатель, ВыбПоШапке.Дата),
			"ПолноеНаименование, ИНН, КПП");
	КонецЕсли;
	ТабличныйДокумент.Вывести(ОбластьМакета);

	СпособДоставки = ВыбПоШапке.СпособДоставки;

	Если СпособДоставки = Перечисления.СпособыДоставки.Самовывоз Тогда
		Способ = "Самовывоз (с нашего склада)";
	ИначеЕсли СпособДоставки = Перечисления.СпособыДоставки.ДоКлиента Тогда
		Способ = "Наша транспортная служба до клиента";
	ИначеЕсли СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу Тогда
		Способ = "Наша транспортная служба до перевозчика";
	ИначеЕсли СпособДоставки = Перечисления.СпособыДоставки.КПолучателюОпределяетСлужбаДоставки Тогда
		Способ = "Наша транспортная служба до пункта перегрузки";
	КонецЕсли;

	Если СпособДоставки = Перечисления.СпособыДоставки.Самовывоз Тогда
		ОбластьМакета  = Макет.ПолучитьОбласть("СпособДоставки1");
		ОбластьМакета.Параметры.СпособДоставки = Способ;
	Иначе
		ОбластьМакета  = Макет.ПолучитьОбласть("СпособДоставки2");

		Час = Час(ВыбПоШапке.ВремяДоставкиС);
		Мин = Минута(ВыбПоШапке.ВремяДоставкиС);
		Если Час < 10 Тогда
			Час = "0" + Строка(Час);
		Иначе
			Час = Строка(Час);
		КонецЕсли;
		Если Мин < 10 Тогда
			Мин = "0" + Строка(Мин);
		Иначе
			Мин = Строка(Мин);
		КонецЕсли;
		ВремяС = Час + ":" + Мин;

		Час = Час(ВыбПоШапке.ВремяДоставкиПо);
		Мин = Минута(ВыбПоШапке.ВремяДоставкиПо);
		Если Час < 10 Тогда
			Час = "0" + Строка(Час);
		Иначе
			Час = Строка(Час);
		КонецЕсли;
		Если Мин < 10 Тогда
			Мин = "0" + Строка(Мин);
		Иначе
			Мин = Строка(Мин);
		КонецЕсли;
		ВремяПо = Час + ":" + Мин;

		Парам = ОбластьМакета.Параметры;
		Парам.СпособДоставки = Способ;
		Парам.ВремяДоставки = "Время доставки с " + ВремяС + " по " + ВремяПо;
	КонецЕсли;
	ТабличныйДокумент.Вывести(ОбластьМакета);

	Если СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Перевозчик");
		Парам = ОбластьМакета.Параметры;
		Парам.Перевозчик = ВыбПоШапке.ПеревозчикНаименование;
		Парам.АдресДоставкиПеревозчика = ВыбПоШапке.АдресДоставкиПеревозчика;
		ТабличныйДокумент.Вывести(ОбластьМакета);
	КонецЕсли;

	ОбластьМакета = Макет.ПолучитьОбласть("АдресДоставки");
	Парам = ОбластьМакета.Параметры;
	Парам.АдресДоставки = ВыбПоШапке.АдресДоставки;
	Если Не ПустаяСтрока(ВыбПоШапке.ТелефонВодителяКлиента) Тогда
		Парам.АдресДоставки = Парам.АдресДоставки + ", тел. " + СокрЛП(ВыбПоШапке.ТелефонВодителяКлиента);
	КонецЕсли;
	ТабличныйДокумент.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть("Условия");
	Парам = ОбластьМакета.Параметры;
	Парам.УсловияОтгрузки = ВыбПоШапке.УсловияОтгрузки;
	Парам.ДопИнфо         = ВыбПоШапке.ДополнительнаяИнформацияПоДоставке;
	Парам.СпособПередачи  = ?(ВыбПоШапке.СпособПередачиТоваров = 0, "Палетами. ", "Коробками (канистрами). ")
							+ ?(ВыбПоШапке.Обрешетка, "В обрешетке.", "Без обрешетки.");
	Парам.Комментарий     = ВыбПоШапке.Комментарий;
	ТабличныйДокумент.Вывести(ОбластьМакета);

	Если Не Просмотр = Неопределено Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Просмотр");
		ТабличныйДокумент.Вывести(ОбластьМакета);
	КонецЕсли;
КонецПроцедуры

Функция ЗаполнитьПодвалСН(ВыбПоШапке, ИтогоКоличествоУпаковок, ИтогоКоличествоПалет, КоличествоСтрок, Макет)
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвал.Параметры.Заполнить(ВыбПоШапке);

	ИтоговаяСтрока = НСтр("ru='Всего наименований %КоличествоНаименований%, на сумму %СуммаДокумента% руб.'");
	ИтоговаяСтрока = СтрЗаменить(ИтоговаяСтрока, "%КоличествоНаименований%", ЧислоПрописью(КоличествоСтрок, ,
		",,,,,,,,0"));
	ИтоговаяСтрока = СтрЗаменить(ИтоговаяСтрока, "%СуммаДокумента%", ВыбПоШапке.ИтогоСумма);

	ОбластьПодвал.Параметры.ИтогоКоличествоУпаковок = ИтогоКоличествоУпаковок;
	ОбластьПодвал.Параметры.ИтогоКоличествоПалет = ИтогоКоличествоПалет;
	ОбластьПодвал.Параметры.ИтоговаяСтрока = ИтоговаяСтрока + ", НДС в том числе";
	ОбластьПодвал.Параметры.СуммаПрописью = РаботаСКурсамиВалют.СформироватьСуммуПрописью(ВыбПоШапке.ИтогоСумма,
		Константы.ВалютаРегламентированногоУчета.Получить());

	Возврат ОбластьПодвал;
КонецФункции

#КонецОбласти

#Область Печать_УпаковочныйЛист

Функция СформироватьПечатнуюФормуУпаковочныйЛист(МассивОбъектов, ОбъектыПечати, ПараметрыПечати, КомплектыПечати = Неопределено) Экспорт
	УстановитьПривилегированныйРежим(Истина);

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ПолеСлева = 5;
	ТабличныйДокумент.ПолеСправа = 5;
	ТабличныйДокумент.РазмерКолонтитулаСверху = 0;
	ТабличныйДокумент.РазмерКолонтитулаСнизу = 0;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;

	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_УЛ";

	ЗаполнитьТабДокУпаковочныйЛист(ТабличныйДокумент, МассивОбъектов, ОбъектыПечати, ПараметрыПечати, КомплектыПечати);

	Возврат ТабличныйДокумент;
КонецФункции

Процедура ЗаполнитьТабДокУпаковочныйЛист(ТабличныйДокумент, МассивОбъектов, ОбъектыПечати, ПараметрыПечати, КомплектыПечати = Неопределено)
	Реализация = МассивОбъектов[0];
	
	Если ТипЗнч(Реализация) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда 
		Реал = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Реализация,
			"Номер, Дата, Организация, Договор, Валюта, Контрагент, Грузополучатель, AMS_КоличествоПалет, Ссылка");
	Иначе
		Возврат;
	КонецЕсли;		

	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.AMS_Продажи.УпаковочныйЛист");

	ОбластьШапка    = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапкаТаб = Макет.ПолучитьОбласть("ЗаголовокТаб");
	ОбластьСтрока   = Макет.ПолучитьОбласть("Строка"); 
	ОбластьТНВЭД    = Макет.ПолучитьОбласть("СтрокаТНВЭД"); 
	ОбластьПодвал   = Макет.ПолучитьОбласть("Подвал");

	
	Парам = ОбластьШапка.Параметры;
	
	Парам.Документ          = "Упаковочный лист № " + ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Реал.Номер) 
								+ " от " + Формат(Реал.Дата, "ДЛФ=ДД") + " к " + Реал.Договор;
	Парам.Организация       = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(
								Реал.Организация, Реал.Дата), "ПолноеНаименование");
	Парам.ОрганизацияАдрес  = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(
								Реал.Организация, Реал.Дата), "ЮридическийАдрес");
	Парам.ОрганизацияИНН    = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(
								Реал.Организация, Реал.Дата), "ИНН");
	Парам.Покупатель        = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(
								Реал.Контрагент, Реал.Дата), "ПолноеНаименование");
	Парам.ПокупательАдрес   = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(
								Реал.Контрагент, Реал.Дата), "ЮридическийАдрес");
	Парам.ПокупательИНН     = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(
								Реал.Контрагент, Реал.Дата), "ИНН");

	Если Не ЗначениеЗаполнено(Реал.Грузополучатель) Или Реал.Грузополучатель = Реал.Контрагент Тогда
		Парам.Грузополучатель = "он же";
	Иначе
		Парам.Грузополучатель = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(
								Реал.Грузополучатель, Реал.Дата), "ПолноеНаименование");
	КонецЕсли;

	ТабличныйДокумент.Вывести(ОбластьШапка);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Реализация", Реализация);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	СУММА(т.Количество) КАК Количество,
	|	МАКСИМУМ(т.Цена) КАК Цена
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК т
	|ГДЕ
	|	т.Ссылка = &Реализация
	|
	|СГРУППИРОВАТЬ ПО
	|	т.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ном.КодТНВЭД КАК КодТНВЭД,
	|	Ном.Артикул КАК Артикул,
	|	Ном.НаименованиеПолное КАК Номенклатура,
	|	Ном.ЕдиницаИзмерения КАК Ед,
	|	Ном.КоэффициентЕдиницыДляОтчетов КАК Кфц,
	|	Товары.Количество КАК Количество,
	|	Товары.Количество / Ном.КоэффициентЕдиницыДляОтчетов КАК КоличествоУпаковок,
	|	Товары.Цена / Ном.КоэффициентЕдиницыДляОтчетов КАК Цена,
	|	Товары.Цена * Товары.Количество / Ном.КоэффициентЕдиницыДляОтчетов КАК Сумма,
	|	Ном.ВесЧислитель * Товары.Количество КАК ВесНетто,
	|	Ном._Упаковка.Вес * Товары.Количество / Ном.КоэффициентЕдиницыДляОтчетов КАК ВесБрутто,
	|	Ном.СтранаПроисхождения КАК СтранаПроисхождения,
	|	Ном.Производитель КАК Производитель,
	|	ВЫБОР
	|		КОГДА Штрихкоды.Штрихкод ЕСТЬ NULL
	|			ТОГДА ШтрихкодыКанистр.Штрихкод
	|		ИНАЧЕ Штрихкоды.Штрихкод
	|	КОНЕЦ КАК Штрихкод
	|ИЗ
	|	Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК Штрихкоды
	|			ПО Ном.Ссылка = Штрихкоды.Номенклатура
	|				И (Штрихкоды.Упаковка.Числитель = 1)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений._ШтрихкодыКанистр КАК ШтрихкодыКанистр
	|			ПО Ном.Ссылка = ШтрихкодыКанистр.Номенклатура
	|		ПО Товары.Номенклатура = Ном.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	КодТНВЭД,
	|	Ном.Наименование";
	
	Табл = Запрос.Выполнить().Выгрузить();
	
	КоличествоСтрок = Табл.Количество();
	
	ВыводШапки    = 0;
	НомерСтроки   = 0;
	НомСтр        = 0;
	
	Количество  = 0;
	КолУпаковок = 0;
	Сумма       = 0;
	ВесНетто    = 0;
	ВесБрутто   = 0;

	ИтогоКоличество  = 0;
	ИтогоКолУпаковок = 0;
	ИтогоСумма       = 0;
	ИтогоВесНетто    = 0;
	ИтогоВесБрутто   = 0;

	НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1; 
	
	МассивВыводимыхОбластей = Новый Массив; // Создаем массив для проверки вывода

	ВыводШапки = 0;
	
	Для каждого Стр Из Табл Цикл
		НомерСтроки = НомерСтроки + 1;
		НомСтр      = НомСтр + 1;
		
		Если НомерСтроки = 1 Тогда
			КодТНВЭД = Стр.КодТНВЭД;
		КонецЕсли;

		Если Не КодТНВЭД = Стр.КодТНВЭД Тогда 
			ОбластьТНВЭД.Параметры.Количество         = Количество;
			ОбластьТНВЭД.Параметры.КоличествоУпаковок = КолУпаковок;
			ОбластьТНВЭД.Параметры.Сумма              = Сумма;
			ОбластьТНВЭД.Параметры.ВесНетто           = ВесНетто;
			ОбластьТНВЭД.Параметры.ВесБрутто          = ВесБрутто;
			
			МассивВыводимыхОбластей.Добавить(ОбластьТНВЭД);
			
			ТабличныйДокумент.Вывести(ОбластьТНВЭД); 

			Количество  = 0;
			КолУпаковок = 0;
			Сумма       = 0;
			ВесНетто    = 0;
			ВесБрутто   = 0;
		КонецЕсли;
		
		Количество  = Количество  + Стр.Количество;
		КолУпаковок = КолУпаковок + Стр.КоличествоУпаковок;
		Сумма       = Сумма       + Стр.Сумма;
		ВесНетто    = ВесНетто    + Стр.ВесНетто;
		ВесБрутто   = ВесБрутто   + Стр.ВесБрутто;
			
		ИтогоКоличество  = ИтогоКоличество  + Стр.Количество;
		ИтогоКолУпаковок = ИтогоКолУпаковок + Стр.КоличествоУпаковок;
		ИтогоСумма       = ИтогоСумма       + Стр.Сумма;
		ИтогоВесНетто    = ИтогоВесНетто    + Стр.ВесНетто;
		ИтогоВесБрутто   = ИтогоВесБрутто   + Стр.ВесБрутто; 
		
		ОбластьСтрока.Параметры.Заполнить(Стр);
		ОбластьСтрока.Параметры.НомСтр = НомСтр;

		Если НомерСтроки = 0 И ВыводШапки <> 2 Тогда
			ВыводШапки = 1;
		КонецЕсли;

		Если (НомерСтроки = 1 И ВыводШапки = 0) Или (НомерСтроки = 0 И ВыводШапки = 1) Тогда
			ВыводШапки = 2;
			ТабличныйДокумент.Вывести(ОбластьШапкаТаб);
		КонецЕсли;

		МассивВыводимыхОбластей.Очистить();
		
		МассивВыводимыхОбластей.Добавить(ОбластьСтрока);
		
		Если НомерСтроки = КоличествоСтрок Тогда
			ОбластьТНВЭД.Параметры.Количество         = Количество;
			ОбластьТНВЭД.Параметры.КоличествоУпаковок = КолУпаковок;
			ОбластьТНВЭД.Параметры.Сумма              = Сумма;
			ОбластьТНВЭД.Параметры.ВесНетто           = ВесНетто;
			ОбластьТНВЭД.Параметры.ВесБрутто          = ВесБрутто;
			
			МассивВыводимыхОбластей.Добавить(ОбластьТНВЭД);
			
			ОбластьПодвал.Параметры.Количество         = ИтогоКоличество;
			ОбластьПодвал.Параметры.КоличествоУпаковок = ИтогоКолУпаковок;
			ОбластьПодвал.Параметры.Сумма              = ИтогоСумма;
			ОбластьПодвал.Параметры.ВесНетто           = ИтогоВесНетто;
			ОбластьПодвал.Параметры.ВесБрутто          = ИтогоВесБрутто;
			
			ОбластьПодвал.Параметры.Мест = "Количество мест " + ИтогоКолУпаковок + "шт."; 
			ОбластьПодвал.Параметры.Вес  = "Вес НЕТТО: " + ИтогоВесНетто + " кг.,      Вес БРУТТО: " 
														+ ИтогоВесБрутто + " кг."; 
			ОбластьПодвал.Параметры.СуммаПрописью = "Всего отгружено на сумму: " 
											+ РаботаСКурсамиВалют.СформироватьСуммуПрописью(ИтогоСумма, Реал.Валюта); 
			ОбластьПодвал.Параметры.Упаковано = "Упаковано на  " + Реал.AMS_КоличествоПалет + " палетах"; 

			МассивВыводимыхОбластей.Добавить(ОбластьПодвал);
		КонецЕсли;

		Если Не ТабличныйДокумент.ПроверитьВывод(МассивВыводимыхОбластей) Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			ТабличныйДокумент.Вывести(ОбластьШапкаТаб);
		КонецЕсли;

		ТабличныйДокумент.Вывести(ОбластьСтрока);
		
		КодТНВЭД = Стр.КодТНВЭД;
	КонецЦикла;
		
	Если НомерСтроки = КоличествоСтрок Тогда 
		ТабличныйДокумент.Вывести(ОбластьТНВЭД);
	КонецЕсли;
	
	ТабличныйДокумент.Вывести(ОбластьПодвал);

	УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Реал.Ссылка);
КонецПроцедуры

#КонецОбласти

#Область Печать_Доверенность

Функция СформироватьПечатнуюФормуДоверенность(МассивОбъектов, ОбъектыПечати) Экспорт
	УстановитьПривилегированныйРежим(Истина);

	Док = МассивОбъектов[0];

	ДанныеПечати = ПолучитьДанныеДляПечатнойФормыДоверенность(Док);

	ТабличныйДокумент = Новый ТабличныйДокумент;

	ПервыйДокумент = Истина;

	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.AMS_Продажи.Доверенность");

	Пока ДанныеПечати.Следующий() Цикл

		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ПервыйДокумент = Ложь;

		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;

		НомерДокументаНаПечать        = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеПечати.Номер, Ложь, Истина);

		СведенияОбОрганизации = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(
			ДанныеПечати.Организация, ДанныеПечати.ДатаДокумента, , ДанныеПечати.БанковскийСчет);
		НазваниеФормы = НСтр("ru='Типовая межотраслевая форма № М-2а'");
		КодПоОКУД = "0315002";
		
		// Заполнить реквизиты шапки
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");

		СтруктураДанныхШапка = Новый Структура;
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		СтруктураДанныхШапка.Вставить("НомерДокумента", НомерДокументаНаПечать);
		СтруктураДанныхШапка.Вставить("НазваниеФормы", НазваниеФормы);
		СтруктураДанныхШапка.Вставить("ДатаДокумента", Формат(ДанныеПечати.ДатаДокумента,
			"ДФ = ""дд ММММ гггг """"г."""));
		СтруктураДанныхШапка.Вставить("СрокДействия", Формат(ДанныеПечати.СрокДействия, "ДФ = ""дд ММММ гггг """"г."""));

		ПредставлениеОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации,
			"ПолноеНаименование,ЮридическийАдрес");
		СтруктураДанныхШапка.Вставить("ОрганизацияПредставление", ПредставлениеОрганизации);

		РеквизитыПотребителя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации,
			"ПолноеНаименование,ЮридическийАдрес,Телефоны");
		СтруктураДанныхШапка.Вставить("РеквизитыПотребителя", РеквизитыПотребителя);

		РеквизитыПлательщика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации,
			"ПолноеНаименование,ИНН,КПП,ЮридическийАдрес");
		СтруктураДанныхШапка.Вставить("РеквизитыПлательщика", РеквизитыПлательщика);

		СтруктураДанныхШапка.Вставить("ОрганизацияКодПоОКПО", СведенияОбОрганизации.КодПоОКПО);
		СтруктураДанныхШапка.Вставить("КодПоОКУД", КодПоОКУД);

		СтруктураДанныхШапка.Вставить("РеквизитыСчета", ФормированиеПечатныхФорм.ОписаниеОрганизации(
			СведенияОбОрганизации, "НомерСчета,Банк,БИК,КоррСчет,"));
			
		//СтруктураДанныхШапка.Вставить("ДолжностьДоверенного",);
		ФамилияИмяОтчествоДоверенного = ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(
			ДанныеПечати.ФамилияИмяОтчествоДоверенного, ДанныеПечати.ДатаДокумента);
		СтруктураДанныхШапка.Вставить("ФамилияИмяОтчествоДоверенного", ФамилияИмяОтчествоДоверенного);
		СтруктураДанныхШапка.Вставить("ПаспортСерия", ДанныеПечати.ПаспортСерия);
		СтруктураДанныхШапка.Вставить("ПаспортНомер", ДанныеПечати.ПаспортНомер);
		СтруктураДанныхШапка.Вставить("ПаспортВыдан", ДанныеПечати.ПаспортВыдан);
		СтруктураДанныхШапка.Вставить("ПаспортДатаВыдачи", ДанныеПечати.ПаспортДатаВыдачи);

		СтруктураДанныхШапка.Вставить("РеквизитыДокументаНаПолучение", "Товарная накладная " + НомерДокументаНаПечать
			+ " от " + Формат(ДанныеПечати.ДатаОснования, "ДФ = ""дд ММ гггг """"г."""));

		ОбластьМакета.Параметры.Заполнить(СтруктураДанныхШапка);
		ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ОбластьМакета,
			ДанныеПечати.Ссылка);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Заполнить таблицу
		ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТаблицы");
		ОбластьМакета.Параметры.КоличествоМест = ЧислоПрописью(Док.Товары.Итог("КоличествоУпаковок"), , ",,,,,,,,0");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Заполнить реквизиты подвала
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");

		СтруктураДанныхПодвал = Новый Структура;
		ОтветственноеЛицо = мср.ПолучитьОтветственноеЛицо(ДанныеПечати.Организация);
		Если ОтветственноеЛицо = Неопределено Тогда
			СтруктураДанныхПодвал.Вставить("ФИОРуководителя", ДанныеПечати.Руководитель);
			СтруктураДанныхПодвал.Вставить("ФИОГлавногоБухгалтера", ДанныеПечати.ГлавныйБухгалтер);
		Иначе
			СтруктураДанныхПодвал.Вставить("ФИОРуководителя", ОтветственноеЛицо);
			СтруктураДанныхПодвал.Вставить("ФИОГлавногоБухгалтера", ОтветственноеЛицо);
		КонецЕсли;
		ОбластьМакета.Параметры.Заполнить(СтруктураДанныхПодвал);
		ТабличныйДокумент.Вывести(ОбластьМакета);

		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати,
			ДанныеПечати.Ссылка);
	КонецЦикла;

	ТабличныйДокумент.АвтоМасштаб = Истина;

	Возврат ТабличныйДокумент;
КонецФункции

Функция ПолучитьДанныеДляПечатнойФормыДоверенность(Док)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Док", Док);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	|	РеализацияТоваровУслуг.БанковскийСчетОрганизации КАК БанковскийСчет,
	|	ПРЕДСТАВЛЕНИЕ(РеализацияТоваровУслуг.Валюта) КАК ВалютаПредставление,
	|	РеализацияТоваровУслуг.Дата КАК ДатаДокумента,
	|	РеализацияТоваровУслуг.Дата КАК ДатаОснования,
	|	Организации._Руководитель КАК Руководитель,
	|	Организации._ГлавныйБухгалтер КАК ГлавныйБухгалтер,
	|	РеализацияТоваровУслуг.Номер КАК Номер,
	|	РеализацияТоваровУслуг.Организация КАК Организация,
	|	ДОБАВИТЬКДАТЕ(РеализацияТоваровУслуг.Дата, ДЕНЬ, 10) КАК СрокДействия,
	|	РеализацияТоваровУслуг.СуммаДокумента КАК СуммаДокумента,
	|	Рейсы.Водитель КАК ФамилияИмяОтчествоДоверенного,
	|	ДокФизЛиц.Серия КАК ПаспортСерия,
	|	ДокФизЛиц.Номер КАК ПаспортНомер,
	|	ДокФизЛиц.ДатаВыдачи КАК ПаспортДатаВыдачи,
	|	ДокФизЛиц.КемВыдан КАК ПаспортВыдан
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО РеализацияТоваровУслуг.Организация = Организации.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.AMS_ЛогистическийЛист.Распоряжения КАК Распоряжения
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.AMS_ЛогистическийЛист.Рейсы КАК Рейсы
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц КАК ДокФизЛиц
	|				ПО Рейсы.Водитель = ДокФизЛиц.Физлицо
	|				И (ДокФизЛиц.ЯвляетсяДокументомУдостоверяющимЛичность)
	|			ПО Распоряжения.Ссылка = Рейсы.Ссылка
	|			И Распоряжения.ТранспортноеСредство = Рейсы.ТранспортноеСредство
	|		ПО РеализацияТоваровУслуг.Ссылка = Распоряжения.Распоряжение
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &Док";

	Возврат Запрос.Выполнить().Выбрать();
КонецФункции

#КонецОбласти

#Область Печать_ТранспортнаяНакладная

Функция СформироватьПечатнуюФормуТранспортнаяНакладная(МассивОбъектов, ПараметрыПечати) Экспорт
	УстановитьПривилегированныйРежим(Истина);

	ТранспортноеСредство = ПараметрыПечати.ТранспортноеСредство;
	Распоряжение         = ПараметрыПечати.Распоряжение;
	Образец              = ПараметрыПечати.Образец;

	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб         = Истина;
	ТабДок.ОриентацияСтраницы  = ОриентацияСтраницы.Портрет;
	ТабДок.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ТРАНСПОРТНАЯ_НАКЛАДНАЯ";

	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.AMS_Продажи.ТранспортнаяНакладная");
	Шапка1    = Макет.ПолучитьОбласть("Шапка1");
	Шапка2    = Макет.ПолучитьОбласть("Шапка2");
	ОбластьТН = Макет.ПолучитьОбласть("ТН");
	Подвал    = Макет.ПолучитьОбласть("Подвал");

	Док = МассивОбъектов[0];

	Отказ = Ложь;

	Данные = ПолучитьДанныеЛогЛиста(Док, Распоряжение, Отказ);
	
	Если Отказ Тогда
		Возврат ТабДок;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ТранспортноеСредство) Тогда
		ТранспортноеСредство = Данные.ТранспортноеСредство;
	КонецЕсли;

	СКД = ПолучитьМакет("скдТН");

	Настройки    = СКД.НастройкиПоУмолчанию;

	ПараметрыСКД = Новый Структура;
	ПараметрыСКД.Вставить("ЛогистическийЛист", Данные.ЛогистическийЛист);

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Настройки.Отбор, "ТранспортноеСредство", ТранспортноеСредство,
		ВидСравненияКомпоновкиДанных.Равно, , ЗначениеЗаполнено(ТранспортноеСредство));

	Таб = Новый ДеревоЗначений;

	мср.ПолучитьДанныеНаОснованииСКД(СКД, Таб, Настройки, ПараметрыСКД);

	Для Каждого Авто Из Таб.Строки Цикл
		ВесОбщий = Авто.Вес;

		Для Каждого Стр Из Авто.Строки Цикл
			НомерЗаказа      = "";
			ЕстьРаспоряжение = Ложь;
			
			Для Каждого Стр1 Из Стр.Строки Цикл
				Если ЗначениеЗаполнено(Распоряжение) И Распоряжение = Стр1.Распоряжение Тогда
					ЕстьРаспоряжение = Истина;
				КонецЕсли;
				
				//@skip-check bsl-legacy-check-string-literal
				ОрганизацияРеализации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр1.Распоряжение, "Организация");
				
				//@skip-check query-in-loop
				НомерДата = ПолучитьНомерДатуДокумента(Стр1.Распоряжение);
				
				Если Не НомерДата = Неопределено Тогда
					НомерЗаказа = НомерЗаказа + ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(НомерДата.Номер) 
									+ " от " + Формат(НомерДата.Дата, "ДФ=""дд'.'ММ'.'гг""") + ", ";
				КонецЕсли;
			КонецЦикла;
			НомерЗаказа = Лев(НомерЗаказа, СтрДлина(НомерЗаказа) - 2);

			ДолжностьКладовщика = ОрганизацияРеализации._ДолжностьКладовщика;
			Кладовщик           = ОрганизацияРеализации._Кладовщик;
			СведенияОрганизация      = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Данные.Организация, Данные.Дата);
			СведенияГрузоотправитель = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Стр.Грузоотправитель, Данные.Дата,
				Ложь);
			СведенияГрузополучатель  = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Стр.Грузополучатель, Данные.Дата,
				Ложь);
			СведенияОПеревозчике     = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Стр.ПеревозчикКонтрагент,
				Данные.Дата, Ложь);

			ПервыйДокумент = Истина;

			НомерСтрокиНачало = ТабДок.ВысотаТаблицы + 1;

			ПечататьНомерЗаказа = (СтрНайти(Стр.ПартнерНаименование, "Перекресток") > 0 Или СтрНайти(Стр.ПартнерНаименование, "Тандер") > 0);

			Если Не ПервыйДокумент Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;

			ПервыйДокумент = Ложь;

			Если ПечататьНомерЗаказа Тогда
				Шапка2.Параметры.НомерЗаказа = "Номер заказа " + СокрП(Сред(Стр.Основание, 7, СтрДлина(Стр.Основание) - 6));
				Шапка2.Параметры.НомерУПД    = "Номер УПД " + ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Стр.Номер);
			КонецЕсли;

			ОбластьТН.Параметры.ДатаТН      = Формат(Данные.Дата, "ДЛФ=ДД");
			ОбластьТН.Параметры.НомерТН     = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Данные.Номер) + "/"
				+ Стр.НомерРейса + "/" + Стр.ПорядокВМаршруте;
			ОбластьТН.Параметры.НомерЗаказа = НомерЗаказа;

			Если Стр.ВидДок = "Реализация" Тогда
				ОбластьТН.Параметры.Организация = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияГрузоотправитель,
					"ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны");
			Иначе
				ОбластьТН.Параметры.Организация = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОрганизация,
					"ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны");
			КонецЕсли;

			ОбластьТН.Параметры.Грузополучатель   = ФормированиеПечатныхФорм.ОписаниеОрганизации(
				СведенияГрузополучатель, "ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны");
			ОбластьТН.Параметры.МестоВыгрузки     = Стр.МестоВыгрузки;
			ОбластьТН.Параметры.НаименованиеГруза = Стр.НаименованиеГруза;

			КоличествоМест = Стр.КоличествоПалетДок;
			КоличествоМест = Стр.КоличествоУпаковокДок;

			КолМест = Строка(Окр(КоличествоМест)) + " (" + СокрЛП(ЧислоПрописью(КоличествоМест, , ",,,,,,,,0")) + ")";
			Если КоличествоМест = 1 Тогда
				ГрузМест = " грузовое место";
			ИначеЕсли КоличествоМест = 2 Или КоличествоМест = 3 Или КоличествоМест = 4 Тогда
				ГрузМест = " грузовых места";
			Иначе
				ГрузМест = " грузовых мест";
			КонецЕсли;

			ОбластьТН.Параметры.КоличествоМест = ?(КоличествоМест = 0, "", КолМест + ГрузМест);
			ОбластьТН.Параметры.ВесОбъем       = "Масса (брутто) " + Строка(Стр.Вес) + " (" + СокрЛП(ЧислоПрописью(
				Стр.Вес, , ",,,,,,,,0")) + ") кг, " + "объём " + Строка(Окр(Стр.Объем, 3)) + " куб. м.";
			ОбластьТН.Параметры.СтоимостьГруза = Строка(Стр.СуммаДокумента) + ?(Стр.СуммаДокумента = 0, "", " руб.");

			Если Стр.ВидДок = "ВПереработку" Тогда
				ВидДок = "М-15";
			ИначеЕсли Стр.ВидДок = "Реализация" Тогда
				ВидДок = ?(Данные.Организация = AMS_ВызовСервера.ОрганизацияТрейд(), "ТОРГ-12", "УПД");
			Иначе
				ВидДок = "УПД";
			КонецЕсли;

			ОбластьТН.Параметры.ПереченьДокументов = ВидДок + " " + НомерЗаказа;
			ОбластьТН.Параметры.Сертификаты        = "Санитарно-эпидемиологические заключения и сертификаты соответсвия";
			ОбластьТН.Параметры.МестоВыгрузки      = Стр.МестоВыгрузки + ". " + Формат(Данные.Дата, "ДЛФ=Д") + " "
				+ Формат(Стр.ВремяВыгрузки, "ДФ=ЧЧ:мм");
			ОбластьТН.Параметры.Начальник          = "Шаров Виталий Владимирович, тел. 8 (495) 232-24-01";
			ОбластьТН.Параметры.Перевозчик         = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике,
				"ПолноеНаименование,ФактическийАдрес,Телефоны");
			ОбластьТН.Параметры.Водитель           = "" + Стр.Водитель + ", тел: " + Стр.ВодительТелефон;
			ОбластьТН.Параметры.ТипАвто            = Стр.Марка + " грузоподъёмность " + Стр.Грузоподъемность + " т";
			ОбластьТН.Параметры.НомерАвто          = Стр.ТранспортноеСредство;
			ОбластьТН.Параметры.КтоГрузит          = ФормированиеПечатныхФорм.ОписаниеОрганизации(
				СведенияГрузоотправитель, "ПолноеНаименование");
			ОбластьТН.Параметры.ЧьеМестоПогрузки   = ФормированиеПечатныхФорм.ОписаниеОрганизации(
				СведенияГрузоотправитель, "ПолноеНаименование,ИНН");
			ОбластьТН.Параметры.МестоПогрузки      = Стр.МестоПогрузки;

			Если Стр.ВидДок = "ВПереработку" Или Стр.ВидДок = "Реализация" Тогда
				ОбластьТН.Параметры.ВремяЗагрузки = Стр.ВремяЗагрузкиОтНас;
			Иначе
				ОбластьТН.Параметры.ВремяЗагрузки = Стр.ВремяЗагрузкиКНам;
			КонецЕсли;

			ОбластьТН.Параметры.Масса = "Масса (брутто) " + Строка(Стр.Вес) 
				+ " (" + СокрЛП(ЧислоПрописью(Стр.Вес, , ",,,,,,,,0")) + ") кг, (определено взвешиванием)";

			Если Стр.ВидДок = "ЗаказПоставщику" Или Стр.ВидДок = "ЗаявкаНаВозврат" Тогда
				ОбластьТН.Параметры.НачСклада = "";
			Иначе
				Если Стр.ВидДок = "ВПереработку" Тогда
					ОбластьТН.Параметры.НачСклада = "Главный инженер Щукин А.В.";
				Иначе
					ОбластьТН.Параметры.НачСклада = ДолжностьКладовщика + " " + Кладовщик;
				КонецЕсли;
			КонецЕсли;

			ОбластьТН.Параметры.Водитель  = "" + Стр.Водитель;

			Подвал.Параметры.МестоВыгрузки = Стр.МестоВыгрузки;
			Подвал.Параметры.ВремяВыгрузки = Формат(Данные.Дата, "ДЛФ=Д") + " " + Формат(Стр.ВремяВыгрузки, "ДФ=ЧЧ:мм");

			Если Стр.ВидДок = "Реализация" Тогда
				Подвал.Параметры.Упаковка = "Груз упакован в картонные коробки, упаковка не нарушена, маркировка нанесена.";
			Иначе
				Подвал.Параметры.Упаковка = "";
			КонецЕсли;

			Подвал.Параметры.КоличествоМест = КолМест + ГрузМест;
			Подвал.Параметры.Вес            = "" + Окр(Стр.Вес, 3) + " кг (брутто) / " + Окр(?(Стр.ВесНетто = Неопределено, Стр.Вес, Стр.ВесНетто), 3) + " кг (нетто)";
			Подвал.Параметры.Водитель       = "" + Стр.Водитель;

			СтоимостьДоставки = Стр.СтоимостьДоставки - ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.ТранспортноеСредство, "_СтавкаАгента");
			СтоимостьДоставки = СтоимостьДоставки * Стр.Вес / ВесОбщий;

			Если Стр.ЮрФизЛицо = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.ЮрФизЛицо.ИндивидуальныйПредприниматель") Тогда
				Подвал.Параметры.СуммаБезНДС = Формат(СтоимостьДоставки, "ЧЦ=10; ЧДЦ=2; ЧФ=""Ч руб.""");
				Подвал.Параметры.СтавкаНДС   = "Без НДС";
				Подвал.Параметры.СуммаНДС    = "0,00 руб.";
				Подвал.Параметры.Сумма       = Формат(СтоимостьДоставки, "ЧЦ=10; ЧДЦ=2; ЧФ=""Ч руб.""");
			Иначе
				СуммаНДС    = СтоимостьДоставки * 22 / 100;
				СуммаБезНДС = СтоимостьДоставки - СуммаНДС;

				Подвал.Параметры.СуммаБезНДС = Формат(СуммаБезНДС, "ЧЦ=10; ЧДЦ=2; ЧФ=""Ч руб.""");
				Подвал.Параметры.СтавкаНДС   = "22 %";
				Подвал.Параметры.СуммаНДС    = Формат(СуммаНДС, "ЧЦ=10; ЧДЦ=2; ЧФ=""Ч руб.""");
				Подвал.Параметры.Сумма       = Формат(СтоимостьДоставки, "ЧЦ=10; ЧДЦ=2; ЧФ=""Ч руб.""");
			КонецЕсли;

			Подвал.Параметры.Перевозчик  = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, "ПолноеНаименование,ФактическийАдрес,Телефоны");
			Подвал.Параметры.Организация = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОрганизация, "ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны");
			Подвал.Параметры.Договор     = Стр.Договор;
			Подвал.Параметры.Водитель    = Стр.Водитель;
			Подвал.Параметры.Бухгалтер   = мср.ПолучитьОтветственноеЛицо(Данные.Организация);

			Если ЗначениеЗаполнено(Распоряжение) И Не ЕстьРаспоряжение Тогда
				Продолжить;
			КонецЕсли;

			Если Образец Тогда
				ТабДок.Вывести(Макет.ПолучитьОбласть("Образец"));
				Если ПечататьНомерЗаказа Тогда
					ТабДок.Вывести(Шапка2);
				Иначе
					ТабДок.Вывести(Шапка1);
				КонецЕсли;
				ТабДок.Вывести(ОбластьТН);
				ТабДок.Вывести(Подвал);

			Иначе
				Для индекс = 1 По 3 Цикл
					Если индекс = 1 Тогда
						ОбластьТН.Параметры.Пункт0_1 = "1 (грузоотправителю)";
					ИначеЕсли индекс = 2 Тогда
						ОбластьТН.Параметры.Пункт0_1 = "2 (грузополучателю)";
					ИначеЕсли индекс = 3 Тогда
						ОбластьТН.Параметры.Пункт0_1 = "3 (перевозчику)";
					КонецЕсли;

					Если ПечататьНомерЗаказа Тогда
						ТабДок.Вывести(Шапка2);
					Иначе
						ТабДок.Вывести(Шапка1);
					КонецЕсли;
					ТабДок.Вывести(ОбластьТН);
					ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
					ТабДок.Вывести(Подвал);
					ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЦикла;
			КонецЕсли;

			ОбъектыПечати = Новый СписокЗначений;
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДок, НомерСтрокиНачало, ОбъектыПечати, Стр.Распоряжение);
		КонецЦикла;
	КонецЦикла;

	Возврат ТабДок;
КонецФункции

Функция ПолучитьДанныеЛогЛиста(Док, Распоряжение, Отказ)
	УстановитьПривилегированныйРежим(Истина);

	ТранспортноеСредство = Неопределено;

	Если Не ЗначениеЗаполнено(Распоряжение) Тогда
		ЛогистическийЛист = Док;

	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1 РАЗЛИЧНЫЕ
		|	т.Ссылка КАК ЛогистическийЛист,
		|	т.ТранспортноеСредство
		|ИЗ
		|	Документ.AMS_ЛогистическийЛист.Распоряжения КАК т
		|ГДЕ
		|	т.Распоряжение = &Док";

		Запрос.УстановитьПараметр("Док", Распоряжение);

		Рез = Запрос.Выполнить();

		Если Рез.Пустой() Тогда
			ОбщегоНазначения.СообщитьПользователю("Для выбранного документа назначен транспорт доставки.", , , , Отказ);
		Иначе
			Выб = Рез.Выбрать();
			Выб.Следующий();

			ЛогистическийЛист    = Выб.ЛогистическийЛист;
			ТранспортноеСредство = Выб.ТранспортноеСредство;
		КонецЕсли;
	КонецЕсли;

	Если Не Отказ Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Лист.Номер КАК Номер,
		|	Лист.Дата КАК Дата,
		|	Лист.Организация КАК Организация,
		|	Орг._Руководитель КАК Руководитель,
		|	Орг._ДолжностьРуководителя КАК ДолжностьРуководителя
		|ИЗ
		|	Документ.AMS_ЛогистическийЛист КАК Лист
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Орг
		|		ПО Лист.Организация = Орг.Ссылка
		|ГДЕ
		|	Лист.Ссылка = &ЛогистическийЛист";

		Запрос.УстановитьПараметр("ЛогистическийЛист", ЛогистическийЛист);

		Рез = Запрос.Выполнить();

		Если Рез.Пустой() Тогда
			Возврат Неопределено;
		Иначе
			Выб = Рез.Выбрать();
			Выб.Следующий();

			Стр = Новый Структура;
			Стр.Вставить("ЛогистическийЛист", ЛогистическийЛист);
			Стр.Вставить("ТранспортноеСредство", ТранспортноеСредство);
			Стр.Вставить("Номер", Выб.Номер);
			Стр.Вставить("Дата", Выб.Дата);
			Стр.Вставить("Организация", Выб.Организация);
			Стр.Вставить("Руководитель", Выб.Руководитель);
			Стр.Вставить("ДолжностьРуководителя", Выб.ДолжностьРуководителя);

			Возврат Стр;
		КонецЕсли;
	КонецЕсли;
КонецФункции

Функция ПолучитьНомерДатуДокумента(Распоряжение)
	Если Не ЗначениеЗаполнено(Распоряжение) Тогда
			Возврат Неопределено;
		
	ИначеЕсли ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ЗаказКлиента", Распоряжение);
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	т.Номер КАК Номер,
		|	т.Дата КАК Дата
		|ИЗ
		|	Документ.ОтгрузкаТоваровКлиенту КАК т
		|ГДЕ
		|	т.ЗаказКлиента = &ЗаказКлиента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	т.Номер,
		|	т.Дата
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК т
		|ГДЕ
		|	т.ЗаказКлиента = &ЗаказКлиента";

		Табл = Запрос.Выполнить().Выгрузить();
		
		Если Табл.Количество() = 0 Тогда
			Возврат Неопределено;
		Иначе
			Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Табл[0]);
		КонецЕсли;
		
	Иначе
		Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Распоряжение, "Номер, Дата");
	КонецЕсли;
КонецФункции

#КонецОбласти

#Область Печать_ТТН

Функция СформироватьПечатнуюФормуТТН(МассивОбъектов, ОбъектыПечати, ПараметрыПечати) Экспорт
	УстановитьПривилегированныйРежим(Истина);

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.РазмерКолонтитулаСверху = 0;
	ТабличныйДокумент.РазмерКолонтитулаСнизу = 0;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;

	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ТТН";

	ДанныеДляПечати = ПолучитьДанныеДляПечатнойФормыТТН(ПараметрыПечати, МассивОбъектов);

	ЗаполнитьТабличныйДокументТТН(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати);

	Возврат ТабличныйДокумент;
КонецФункции

Функция ПолучитьДанныеДляПечатнойФормыТТН(ПараметрыПечати, МассивОбъектов) Экспорт
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Реализация.Ссылка КАК Ссылка,
	|	Реализация.Номер КАК ПорядковыйНомер,
	|	Реализация.Номер КАК Номер,
	|	Реализация.Дата КАК Дата,
	|	ВЫБОР
	|		КОГДА Реализация.Организация.ОбособленноеПодразделение
	|			ТОГДА Реализация.Организация.ГоловнаяОрганизация
	|		ИНАЧЕ Реализация.Организация
	|	КОНЕЦ КАК Организация,
	|	ВЫБОР
	|		КОГДА Реализация.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Реализация.Контрагент
	|		ИНАЧЕ Реализация.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	ВЫБОР
	|		КОГДА Реализация.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Реализация.Организация
	|		ИНАЧЕ Реализация.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	Реализация.Контрагент КАК Плательщик,
	|	Реализация.Контрагент КАК ЗаказчикПеревозки,
	|	Реализация.Организация.Префикс КАК Префикс,
	|	Организации._Кладовщик КАК Кладовщик,
	|	Организации._ДолжностьКладовщика КАК ДолжностьКладовщика,
	|	Организации._Руководитель КАК Руководитель,
	|	Организации._ДолжностьРуководителя КАК ДолжностьРуководителя,
	|	Организации._ГлавныйБухгалтер КАК ГлавныйБухгалтер,
	|	Реализация.БанковскийСчетКонтрагента КАК БанковскийСчетПлательщика,
	|	Реализация.БанковскийСчетКонтрагента КАК БанковскийСчетЗаказчикаПеревозки,
	|	Реализация.БанковскийСчетОрганизации КАК БанковскийСчетПеревозчика,
	|	Реализация.Организация КАК Перевозчик,
	|	"""" КАК Водитель,
	|	"""" КАК ВидПеревозки,
	|	"""" КАК ЛицензионнаяКарточкаРегистрационныйНомер,
	|	"""" КАК ЛицензионнаяКарточкаСерия,
	|	"""" КАК ЛицензионнаяКарточкаНомер,
	|	"""" КАК ЛицензионнаяКарточкаВид,
	|	"""" КАК МаркаАвтомобиля,
	|	"""" КАК ГосНомерАвтомобиля,
	|	"""" КАК Прицеп,
	|	"""" КАК ГосНомерПрицепа,
	|	Реализация.ДоверенностьНомер КАК ДоверенностьНомер,
	|	Реализация.ДоверенностьДата КАК ДоверенностьДата,
	|	Реализация.ДоверенностьВыдана КАК ДоверенностьВыдана,
	|	Реализация.ДоверенностьЛицо КАК ДоверенностьЛицо,
	|	Реализация.Валюта КАК Валюта,
	|	СкладыКонтактнаяИнформация.Представление КАК ПунктПогрузки,
	|	Реализация.АдресДоставки КАК ПунктРазгрузки,
	|	0 КАК СрокДоставки,
	|	ЗНАЧЕНИЕ(Документ.ЗаданиеНаПеревозку.ПустаяСсылка) КАК ЗаданиеНаПеревозку,
	|	ЗНАЧЕНИЕ(Перечисление.ВариантыВыводаДанныхОТоварномСоставе.ТоварныйСостав) КАК ВыводДанныхОТоварномСоставе,
	|	"""" КАК УдостоверениеНомер,
	|	"""" КАК УдостоверениеСерия
	|ПОМЕСТИТЬ Шапка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК Реализация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады.КонтактнаяИнформация КАК СкладыКонтактнаяИнформация
	|		ПО Реализация.Склад = СкладыКонтактнаяИнформация.Ссылка
	|			И (СкладыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресСклада))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО Реализация.Организация = Организации.Ссылка
	|ГДЕ
	|	Реализация.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Ссылка КАК Ссылка,
	|	ТаблицаТоваров.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ТаблицаТоваров.АналитикаУчетаНаборов КАК АналитикаУчетаНаборов,
	|	ТаблицаТоваров.Упаковка КАК Упаковка,
	|	МАКСИМУМ(ТаблицаТоваров.НомерСтроки) КАК НомерСтроки
	|ПОМЕСТИТЬ СтрокиТоваров
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК ТаблицаТоваров
	|ГДЕ
	|	ТаблицаТоваров.Ссылка В(&МассивОбъектов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваров.Ссылка,
	|	ТаблицаТоваров.АналитикаУчетаНоменклатуры,
	|	ТаблицаТоваров.АналитикаУчетаНаборов,
	|	ТаблицаТоваров.Упаковка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТаблицаТоваров.Ссылка,
	|	ТаблицаТоваров.АналитикаУчетаНоменклатуры,
	|	ТаблицаТоваров.АналитикаУчетаНаборов,
	|	ТаблицаТоваров.Упаковка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокумента.Ссылка КАК Ссылка,
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.Номенклатура КАК Номенклатура,
	|	ТаблицаДокумента.Характеристика.НаименованиеПолное КАК Характеристика,
	|	ТаблицаДокумента.Количество КАК Количество,
	|	ТаблицаДокумента.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ТаблицаДокумента.СуммаСНДС - ТаблицаДокумента.СуммаНДС КАК СуммаБезНДС,
	|	ТаблицаДокумента.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаДокумента.СуммаНДС КАК СуммаНДС,
	|	ИСТИНА КАК ЭтоТовар,
	|	ЛОЖЬ КАК ЭтоНеВозвратнаяТара,
	|	ЛОЖЬ КАК ВернутьМногооборотнуюТару,
	|	ТаблицаДокумента.Упаковка КАК Упаковка
	|ПОМЕСТИТЬ РеализацияТоваровУслугТаблицаТоваров
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК ТаблицаДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК ном
	|		ПО ТаблицаДокумента.Номенклатура = ном.Ссылка
	|ГДЕ
	|	ном.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	|	И ТаблицаДокумента.Ссылка В(&МассивОбъектов)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.Упаковка КАК Упаковка,
	|	УпаковкиНоменклатуры.Владелец КАК Владелец,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА УпаковкиНоменклатуры.Ссылка ЕСТЬ NULL
	|				ТОГДА 1
	|			ИНАЧЕ ВЫБОР
	|					КОГДА УпаковкиНоменклатуры.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Вес)
	|							И ТаблицаТоваров.Номенклатура.ВесИспользовать
	|							И ЕСТЬNULL(УпаковкиНоменклатуры.Знаменатель, 0) <> 0
	|							И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ВесЕдиницаИзмерения.Числитель, 0) <> 0
	|							И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ВесЕдиницаИзмерения.Знаменатель, 0) <> 0
	|							И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ВесЧислитель, 0) <> 0
	|							И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ВесЗнаменатель, 0) <> 0
	|						ТОГДА УпаковкиНоменклатуры.Числитель / УпаковкиНоменклатуры.Знаменатель / (ТаблицаТоваров.Номенклатура.ВесЕдиницаИзмерения.Числитель / ТаблицаТоваров.Номенклатура.ВесЕдиницаИзмерения.Знаменатель) / (ТаблицаТоваров.Номенклатура.ВесЧислитель / ТаблицаТоваров.Номенклатура.ВесЗнаменатель)
	|					КОГДА УпаковкиНоменклатуры.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Объем)
	|							И ТаблицаТоваров.Номенклатура.ОбъемИспользовать
	|							И ЕСТЬNULL(УпаковкиНоменклатуры.Знаменатель, 0) <> 0
	|							И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ОбъемЕдиницаИзмерения.Числитель, 0) <> 0
	|							И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ОбъемЕдиницаИзмерения.Знаменатель, 0) <> 0
	|							И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ОбъемЧислитель, 0) <> 0
	|							И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ОбъемЗнаменатель, 0) <> 0
	|						ТОГДА УпаковкиНоменклатуры.Числитель / УпаковкиНоменклатуры.Знаменатель / (ТаблицаТоваров.Номенклатура.ОбъемЕдиницаИзмерения.Числитель / ТаблицаТоваров.Номенклатура.ОбъемЕдиницаИзмерения.Знаменатель) / (ТаблицаТоваров.Номенклатура.ОбъемЧислитель / ТаблицаТоваров.Номенклатура.ОбъемЗнаменатель)
	|					КОГДА УпаковкиНоменклатуры.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Площадь)
	|							И ТаблицаТоваров.Номенклатура.ПлощадьИспользовать
	|							И ЕСТЬNULL(УпаковкиНоменклатуры.Знаменатель, 0) <> 0
	|							И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ПлощадьЕдиницаИзмерения.Числитель, 0) <> 0
	|							И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ПлощадьЕдиницаИзмерения.Знаменатель, 0) <> 0
	|							И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ПлощадьЧислитель, 0) <> 0
	|							И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ПлощадьЗнаменатель, 0) <> 0
	|						ТОГДА УпаковкиНоменклатуры.Числитель / УпаковкиНоменклатуры.Знаменатель / (ТаблицаТоваров.Номенклатура.ПлощадьЕдиницаИзмерения.Числитель / ТаблицаТоваров.Номенклатура.ПлощадьЕдиницаИзмерения.Знаменатель) / (ТаблицаТоваров.Номенклатура.ПлощадьЧислитель / ТаблицаТоваров.Номенклатура.ПлощадьЗнаменатель)
	|					КОГДА УпаковкиНоменклатуры.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Длина)
	|							И ТаблицаТоваров.Номенклатура.ДлинаИспользовать
	|							И ЕСТЬNULL(УпаковкиНоменклатуры.Знаменатель, 0) <> 0
	|							И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ДлинаЕдиницаИзмерения.Числитель, 0) <> 0
	|							И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ДлинаЕдиницаИзмерения.Знаменатель, 0) <> 0
	|							И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ДлинаЧислитель, 0) <> 0
	|							И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ДлинаЗнаменатель, 0) <> 0
	|						ТОГДА УпаковкиНоменклатуры.Числитель / УпаковкиНоменклатуры.Знаменатель / (ТаблицаТоваров.Номенклатура.ДлинаЕдиницаИзмерения.Числитель / ТаблицаТоваров.Номенклатура.ДлинаЕдиницаИзмерения.Знаменатель) / (ТаблицаТоваров.Номенклатура.ДлинаЧислитель / ТаблицаТоваров.Номенклатура.ДлинаЗнаменатель)
	|					КОГДА УпаковкиНоменклатуры.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Упаковка)
	|							И ЕСТЬNULL(УпаковкиНоменклатуры.Знаменатель, 0) <> 0
	|						ТОГДА УпаковкиНоменклатуры.Числитель / УпаковкиНоменклатуры.Знаменатель
	|					КОГДА УпаковкиНоменклатуры.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук)
	|						ТОГДА 1
	|					ИНАЧЕ NULL
	|				КОНЕЦ
	|		КОНЕЦ) КАК Коэффициент
	|ПОМЕСТИТЬ Упаковки
	|ИЗ
	|	РеализацияТоваровУслугТаблицаТоваров КАК ТаблицаТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиНоменклатуры
	|		ПО (УпаковкиНоменклатуры.Родитель = ТаблицаТоваров.Упаковка)
	|			И (УпаковкиНоменклатуры.Владелец = ВЫБОР
	|				КОГДА ТаблицаТоваров.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|					ТОГДА ТаблицаТоваров.Номенклатура
	|				ИНАЧЕ ТаблицаТоваров.Упаковка.Владелец
	|			КОНЕЦ)
	|ГДЕ
	|	НЕ УпаковкиНоменклатуры.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваров.Номенклатура,
	|	ТаблицаТоваров.Упаковка,
	|	УпаковкиНоменклатуры.Владелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Упаковки.Номенклатура КАК Номенклатура,
	|	Упаковки.Упаковка КАК Упаковка,
	|	ВЫБОР
	|		КОГДА Упаковки.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Вес)
	|				И Упаковки.Номенклатура.ВесИспользовать
	|				И ЕСТЬNULL(Упаковки.Упаковка.Знаменатель, 0) <> 0
	|				И ЕСТЬNULL(Упаковки.Номенклатура.ВесЕдиницаИзмерения.Числитель, 0) <> 0
	|				И ЕСТЬNULL(Упаковки.Номенклатура.ВесЕдиницаИзмерения.Знаменатель, 0) <> 0
	|				И ЕСТЬNULL(Упаковки.Номенклатура.ВесЧислитель, 0) <> 0
	|				И ЕСТЬNULL(Упаковки.Номенклатура.ВесЗнаменатель, 0) <> 0
	|			ТОГДА Упаковки.Упаковка.Числитель / Упаковки.Упаковка.Знаменатель / (Упаковки.Номенклатура.ВесЕдиницаИзмерения.Числитель / Упаковки.Номенклатура.ВесЕдиницаИзмерения.Знаменатель) / (Упаковки.Номенклатура.ВесЧислитель / Упаковки.Номенклатура.ВесЗнаменатель)
	|		КОГДА Упаковки.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Объем)
	|				И Упаковки.Номенклатура.ОбъемИспользовать
	|				И ЕСТЬNULL(Упаковки.Упаковка.Знаменатель, 0) <> 0
	|				И ЕСТЬNULL(Упаковки.Номенклатура.ОбъемЕдиницаИзмерения.Числитель, 0) <> 0
	|				И ЕСТЬNULL(Упаковки.Номенклатура.ОбъемЕдиницаИзмерения.Знаменатель, 0) <> 0
	|				И ЕСТЬNULL(Упаковки.Номенклатура.ОбъемЧислитель, 0) <> 0
	|				И ЕСТЬNULL(Упаковки.Номенклатура.ОбъемЗнаменатель, 0) <> 0
	|			ТОГДА Упаковки.Упаковка.Числитель / Упаковки.Упаковка.Знаменатель / (Упаковки.Номенклатура.ОбъемЕдиницаИзмерения.Числитель / Упаковки.Номенклатура.ОбъемЕдиницаИзмерения.Знаменатель) / (Упаковки.Номенклатура.ОбъемЧислитель / Упаковки.Номенклатура.ОбъемЗнаменатель)
	|		КОГДА Упаковки.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Площадь)
	|				И Упаковки.Номенклатура.ПлощадьИспользовать
	|				И ЕСТЬNULL(Упаковки.Упаковка.Знаменатель, 0) <> 0
	|				И ЕСТЬNULL(Упаковки.Номенклатура.ПлощадьЕдиницаИзмерения.Числитель, 0) <> 0
	|				И ЕСТЬNULL(Упаковки.Номенклатура.ПлощадьЕдиницаИзмерения.Знаменатель, 0) <> 0
	|				И ЕСТЬNULL(Упаковки.Номенклатура.ПлощадьЧислитель, 0) <> 0
	|				И ЕСТЬNULL(Упаковки.Номенклатура.ПлощадьЗнаменатель, 0) <> 0
	|			ТОГДА Упаковки.Упаковка.Числитель / Упаковки.Упаковка.Знаменатель / (Упаковки.Номенклатура.ПлощадьЕдиницаИзмерения.Числитель / Упаковки.Номенклатура.ПлощадьЕдиницаИзмерения.Знаменатель) / (Упаковки.Номенклатура.ПлощадьЧислитель / Упаковки.Номенклатура.ПлощадьЗнаменатель)
	|		КОГДА Упаковки.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Длина)
	|				И Упаковки.Номенклатура.ДлинаИспользовать
	|				И ЕСТЬNULL(Упаковки.Упаковка.Знаменатель, 0) <> 0
	|				И ЕСТЬNULL(Упаковки.Номенклатура.ДлинаЕдиницаИзмерения.Числитель, 0) <> 0
	|				И ЕСТЬNULL(Упаковки.Номенклатура.ДлинаЕдиницаИзмерения.Знаменатель, 0) <> 0
	|				И ЕСТЬNULL(Упаковки.Номенклатура.ДлинаЧислитель, 0) <> 0
	|				И ЕСТЬNULL(Упаковки.Номенклатура.ДлинаЗнаменатель, 0) <> 0
	|			ТОГДА Упаковки.Упаковка.Числитель / Упаковки.Упаковка.Знаменатель / (Упаковки.Номенклатура.ДлинаЕдиницаИзмерения.Числитель / Упаковки.Номенклатура.ДлинаЕдиницаИзмерения.Знаменатель) / (Упаковки.Номенклатура.ДлинаЧислитель / Упаковки.Номенклатура.ДлинаЗнаменатель)
	|		КОГДА Упаковки.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Упаковка)
	|				И ЕСТЬNULL(Упаковки.Упаковка.Знаменатель, 0) <> 0
	|			ТОГДА Упаковки.Упаковка.Числитель / Упаковки.Упаковка.Знаменатель
	|		КОГДА Упаковки.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук)
	|			ТОГДА 1
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК КоэффициентУпаковки,
	|	МИНИМУМ(УпаковкиНоменклатуры.Ссылка) КАК ВложеннаяУпаковка,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА УпаковкиНоменклатуры.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Вес)
	|					И Упаковки.Номенклатура.ВесИспользовать
	|					И ЕСТЬNULL(УпаковкиНоменклатуры.Знаменатель, 0) <> 0
	|					И ЕСТЬNULL(Упаковки.Номенклатура.ВесЕдиницаИзмерения.Числитель, 0) <> 0
	|					И ЕСТЬNULL(Упаковки.Номенклатура.ВесЕдиницаИзмерения.Знаменатель, 0) <> 0
	|					И ЕСТЬNULL(Упаковки.Номенклатура.ВесЧислитель, 0) <> 0
	|					И ЕСТЬNULL(Упаковки.Номенклатура.ВесЗнаменатель, 0) <> 0
	|				ТОГДА УпаковкиНоменклатуры.Числитель / УпаковкиНоменклатуры.Знаменатель / (Упаковки.Номенклатура.ВесЕдиницаИзмерения.Числитель / Упаковки.Номенклатура.ВесЕдиницаИзмерения.Знаменатель) / (Упаковки.Номенклатура.ВесЧислитель / Упаковки.Номенклатура.ВесЗнаменатель)
	|			КОГДА УпаковкиНоменклатуры.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Объем)
	|					И Упаковки.Номенклатура.ОбъемИспользовать
	|					И ЕСТЬNULL(УпаковкиНоменклатуры.Знаменатель, 0) <> 0
	|					И ЕСТЬNULL(Упаковки.Номенклатура.ОбъемЕдиницаИзмерения.Числитель, 0) <> 0
	|					И ЕСТЬNULL(Упаковки.Номенклатура.ОбъемЕдиницаИзмерения.Знаменатель, 0) <> 0
	|					И ЕСТЬNULL(Упаковки.Номенклатура.ОбъемЧислитель, 0) <> 0
	|					И ЕСТЬNULL(Упаковки.Номенклатура.ОбъемЗнаменатель, 0) <> 0
	|				ТОГДА УпаковкиНоменклатуры.Числитель / УпаковкиНоменклатуры.Знаменатель / (Упаковки.Номенклатура.ОбъемЕдиницаИзмерения.Числитель / Упаковки.Номенклатура.ОбъемЕдиницаИзмерения.Знаменатель) / (Упаковки.Номенклатура.ОбъемЧислитель / Упаковки.Номенклатура.ОбъемЗнаменатель)
	|			КОГДА УпаковкиНоменклатуры.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Площадь)
	|					И Упаковки.Номенклатура.ПлощадьИспользовать
	|					И ЕСТЬNULL(УпаковкиНоменклатуры.Знаменатель, 0) <> 0
	|					И ЕСТЬNULL(Упаковки.Номенклатура.ПлощадьЕдиницаИзмерения.Числитель, 0) <> 0
	|					И ЕСТЬNULL(Упаковки.Номенклатура.ПлощадьЕдиницаИзмерения.Знаменатель, 0) <> 0
	|					И ЕСТЬNULL(Упаковки.Номенклатура.ПлощадьЧислитель, 0) <> 0
	|					И ЕСТЬNULL(Упаковки.Номенклатура.ПлощадьЗнаменатель, 0) <> 0
	|				ТОГДА УпаковкиНоменклатуры.Числитель / УпаковкиНоменклатуры.Знаменатель / (Упаковки.Номенклатура.ПлощадьЕдиницаИзмерения.Числитель / Упаковки.Номенклатура.ПлощадьЕдиницаИзмерения.Знаменатель) / (Упаковки.Номенклатура.ПлощадьЧислитель / Упаковки.Номенклатура.ПлощадьЗнаменатель)
	|			КОГДА УпаковкиНоменклатуры.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Длина)
	|					И Упаковки.Номенклатура.ДлинаИспользовать
	|					И ЕСТЬNULL(УпаковкиНоменклатуры.Знаменатель, 0) <> 0
	|					И ЕСТЬNULL(Упаковки.Номенклатура.ДлинаЕдиницаИзмерения.Числитель, 0) <> 0
	|					И ЕСТЬNULL(Упаковки.Номенклатура.ДлинаЕдиницаИзмерения.Знаменатель, 0) <> 0
	|					И ЕСТЬNULL(Упаковки.Номенклатура.ДлинаЧислитель, 0) <> 0
	|					И ЕСТЬNULL(Упаковки.Номенклатура.ДлинаЗнаменатель, 0) <> 0
	|				ТОГДА УпаковкиНоменклатуры.Числитель / УпаковкиНоменклатуры.Знаменатель / (Упаковки.Номенклатура.ДлинаЕдиницаИзмерения.Числитель / Упаковки.Номенклатура.ДлинаЕдиницаИзмерения.Знаменатель) / (Упаковки.Номенклатура.ДлинаЧислитель / Упаковки.Номенклатура.ДлинаЗнаменатель)
	|			КОГДА УпаковкиНоменклатуры.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Упаковка)
	|					И ЕСТЬNULL(УпаковкиНоменклатуры.Знаменатель, 0) <> 0
	|				ТОГДА УпаковкиНоменклатуры.Числитель / УпаковкиНоменклатуры.Знаменатель
	|			КОГДА УпаковкиНоменклатуры.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук)
	|				ТОГДА 1
	|			ИНАЧЕ NULL
	|		КОНЕЦ) КАК КоэффициентВложеннойУпаковки
	|ПОМЕСТИТЬ ВложенныеУпаковки
	|ИЗ
	|	Упаковки КАК Упаковки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиНоменклатуры
	|		ПО Упаковки.Владелец = УпаковкиНоменклатуры.Владелец
	|			И (Упаковки.Коэффициент = ВЫБОР
	|				КОГДА УпаковкиНоменклатуры.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Вес)
	|						И Упаковки.Номенклатура.ВесИспользовать
	|						И ЕСТЬNULL(УпаковкиНоменклатуры.Знаменатель, 0) <> 0
	|						И ЕСТЬNULL(Упаковки.Номенклатура.ВесЕдиницаИзмерения.Числитель, 0) <> 0
	|						И ЕСТЬNULL(Упаковки.Номенклатура.ВесЕдиницаИзмерения.Знаменатель, 0) <> 0
	|						И ЕСТЬNULL(Упаковки.Номенклатура.ВесЧислитель, 0) <> 0
	|						И ЕСТЬNULL(Упаковки.Номенклатура.ВесЗнаменатель, 0) <> 0
	|					ТОГДА УпаковкиНоменклатуры.Числитель / УпаковкиНоменклатуры.Знаменатель / (Упаковки.Номенклатура.ВесЕдиницаИзмерения.Числитель / Упаковки.Номенклатура.ВесЕдиницаИзмерения.Знаменатель) / (Упаковки.Номенклатура.ВесЧислитель / Упаковки.Номенклатура.ВесЗнаменатель)
	|				КОГДА УпаковкиНоменклатуры.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Объем)
	|						И Упаковки.Номенклатура.ОбъемИспользовать
	|						И ЕСТЬNULL(УпаковкиНоменклатуры.Знаменатель, 0) <> 0
	|						И ЕСТЬNULL(Упаковки.Номенклатура.ОбъемЕдиницаИзмерения.Числитель, 0) <> 0
	|						И ЕСТЬNULL(Упаковки.Номенклатура.ОбъемЕдиницаИзмерения.Знаменатель, 0) <> 0
	|						И ЕСТЬNULL(Упаковки.Номенклатура.ОбъемЧислитель, 0) <> 0
	|						И ЕСТЬNULL(Упаковки.Номенклатура.ОбъемЗнаменатель, 0) <> 0
	|					ТОГДА УпаковкиНоменклатуры.Числитель / УпаковкиНоменклатуры.Знаменатель / (Упаковки.Номенклатура.ОбъемЕдиницаИзмерения.Числитель / Упаковки.Номенклатура.ОбъемЕдиницаИзмерения.Знаменатель) / (Упаковки.Номенклатура.ОбъемЧислитель / Упаковки.Номенклатура.ОбъемЗнаменатель)
	|				КОГДА УпаковкиНоменклатуры.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Площадь)
	|						И Упаковки.Номенклатура.ПлощадьИспользовать
	|						И ЕСТЬNULL(УпаковкиНоменклатуры.Знаменатель, 0) <> 0
	|						И ЕСТЬNULL(Упаковки.Номенклатура.ПлощадьЕдиницаИзмерения.Числитель, 0) <> 0
	|						И ЕСТЬNULL(Упаковки.Номенклатура.ПлощадьЕдиницаИзмерения.Знаменатель, 0) <> 0
	|						И ЕСТЬNULL(Упаковки.Номенклатура.ПлощадьЧислитель, 0) <> 0
	|						И ЕСТЬNULL(Упаковки.Номенклатура.ПлощадьЗнаменатель, 0) <> 0
	|					ТОГДА УпаковкиНоменклатуры.Числитель / УпаковкиНоменклатуры.Знаменатель / (Упаковки.Номенклатура.ПлощадьЕдиницаИзмерения.Числитель / Упаковки.Номенклатура.ПлощадьЕдиницаИзмерения.Знаменатель) / (Упаковки.Номенклатура.ПлощадьЧислитель / Упаковки.Номенклатура.ПлощадьЗнаменатель)
	|				КОГДА УпаковкиНоменклатуры.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Длина)
	|						И Упаковки.Номенклатура.ДлинаИспользовать
	|						И ЕСТЬNULL(УпаковкиНоменклатуры.Знаменатель, 0) <> 0
	|						И ЕСТЬNULL(Упаковки.Номенклатура.ДлинаЕдиницаИзмерения.Числитель, 0) <> 0
	|						И ЕСТЬNULL(Упаковки.Номенклатура.ДлинаЕдиницаИзмерения.Знаменатель, 0) <> 0
	|						И ЕСТЬNULL(Упаковки.Номенклатура.ДлинаЧислитель, 0) <> 0
	|						И ЕСТЬNULL(Упаковки.Номенклатура.ДлинаЗнаменатель, 0) <> 0
	|					ТОГДА УпаковкиНоменклатуры.Числитель / УпаковкиНоменклатуры.Знаменатель / (Упаковки.Номенклатура.ДлинаЕдиницаИзмерения.Числитель / Упаковки.Номенклатура.ДлинаЕдиницаИзмерения.Знаменатель) / (Упаковки.Номенклатура.ДлинаЧислитель / Упаковки.Номенклатура.ДлинаЗнаменатель)
	|				КОГДА УпаковкиНоменклатуры.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Упаковка)
	|						И ЕСТЬNULL(УпаковкиНоменклатуры.Знаменатель, 0) <> 0
	|					ТОГДА УпаковкиНоменклатуры.Числитель / УпаковкиНоменклатуры.Знаменатель
	|				КОГДА УпаковкиНоменклатуры.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук)
	|					ТОГДА 1
	|				ИНАЧЕ NULL
	|			КОНЕЦ)
	|ГДЕ
	|	УпаковкиНоменклатуры.Родитель = Упаковки.Упаковка
	|
	|СГРУППИРОВАТЬ ПО
	|	Упаковки.Номенклатура,
	|	Упаковки.Упаковка,
	|	ВЫБОР
	|		КОГДА Упаковки.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Вес)
	|				И Упаковки.Номенклатура.ВесИспользовать
	|				И ЕСТЬNULL(Упаковки.Упаковка.Знаменатель, 0) <> 0
	|				И ЕСТЬNULL(Упаковки.Номенклатура.ВесЕдиницаИзмерения.Числитель, 0) <> 0
	|				И ЕСТЬNULL(Упаковки.Номенклатура.ВесЕдиницаИзмерения.Знаменатель, 0) <> 0
	|				И ЕСТЬNULL(Упаковки.Номенклатура.ВесЧислитель, 0) <> 0
	|				И ЕСТЬNULL(Упаковки.Номенклатура.ВесЗнаменатель, 0) <> 0
	|			ТОГДА Упаковки.Упаковка.Числитель / Упаковки.Упаковка.Знаменатель / (Упаковки.Номенклатура.ВесЕдиницаИзмерения.Числитель / Упаковки.Номенклатура.ВесЕдиницаИзмерения.Знаменатель) / (Упаковки.Номенклатура.ВесЧислитель / Упаковки.Номенклатура.ВесЗнаменатель)
	|		КОГДА Упаковки.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Объем)
	|				И Упаковки.Номенклатура.ОбъемИспользовать
	|				И ЕСТЬNULL(Упаковки.Упаковка.Знаменатель, 0) <> 0
	|				И ЕСТЬNULL(Упаковки.Номенклатура.ОбъемЕдиницаИзмерения.Числитель, 0) <> 0
	|				И ЕСТЬNULL(Упаковки.Номенклатура.ОбъемЕдиницаИзмерения.Знаменатель, 0) <> 0
	|				И ЕСТЬNULL(Упаковки.Номенклатура.ОбъемЧислитель, 0) <> 0
	|				И ЕСТЬNULL(Упаковки.Номенклатура.ОбъемЗнаменатель, 0) <> 0
	|			ТОГДА Упаковки.Упаковка.Числитель / Упаковки.Упаковка.Знаменатель / (Упаковки.Номенклатура.ОбъемЕдиницаИзмерения.Числитель / Упаковки.Номенклатура.ОбъемЕдиницаИзмерения.Знаменатель) / (Упаковки.Номенклатура.ОбъемЧислитель / Упаковки.Номенклатура.ОбъемЗнаменатель)
	|		КОГДА Упаковки.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Площадь)
	|				И Упаковки.Номенклатура.ПлощадьИспользовать
	|				И ЕСТЬNULL(Упаковки.Упаковка.Знаменатель, 0) <> 0
	|				И ЕСТЬNULL(Упаковки.Номенклатура.ПлощадьЕдиницаИзмерения.Числитель, 0) <> 0
	|				И ЕСТЬNULL(Упаковки.Номенклатура.ПлощадьЕдиницаИзмерения.Знаменатель, 0) <> 0
	|				И ЕСТЬNULL(Упаковки.Номенклатура.ПлощадьЧислитель, 0) <> 0
	|				И ЕСТЬNULL(Упаковки.Номенклатура.ПлощадьЗнаменатель, 0) <> 0
	|			ТОГДА Упаковки.Упаковка.Числитель / Упаковки.Упаковка.Знаменатель / (Упаковки.Номенклатура.ПлощадьЕдиницаИзмерения.Числитель / Упаковки.Номенклатура.ПлощадьЕдиницаИзмерения.Знаменатель) / (Упаковки.Номенклатура.ПлощадьЧислитель / Упаковки.Номенклатура.ПлощадьЗнаменатель)
	|		КОГДА Упаковки.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Длина)
	|				И Упаковки.Номенклатура.ДлинаИспользовать
	|				И ЕСТЬNULL(Упаковки.Упаковка.Знаменатель, 0) <> 0
	|				И ЕСТЬNULL(Упаковки.Номенклатура.ДлинаЕдиницаИзмерения.Числитель, 0) <> 0
	|				И ЕСТЬNULL(Упаковки.Номенклатура.ДлинаЕдиницаИзмерения.Знаменатель, 0) <> 0
	|				И ЕСТЬNULL(Упаковки.Номенклатура.ДлинаЧислитель, 0) <> 0
	|				И ЕСТЬNULL(Упаковки.Номенклатура.ДлинаЗнаменатель, 0) <> 0
	|			ТОГДА Упаковки.Упаковка.Числитель / Упаковки.Упаковка.Знаменатель / (Упаковки.Номенклатура.ДлинаЕдиницаИзмерения.Числитель / Упаковки.Номенклатура.ДлинаЕдиницаИзмерения.Знаменатель) / (Упаковки.Номенклатура.ДлинаЧислитель / Упаковки.Номенклатура.ДлинаЗнаменатель)
	|		КОГДА Упаковки.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Упаковка)
	|				И ЕСТЬNULL(Упаковки.Упаковка.Знаменатель, 0) <> 0
	|			ТОГДА Упаковки.Упаковка.Числитель / Упаковки.Упаковка.Знаменатель
	|		КОГДА Упаковки.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук)
	|			ТОГДА 1
	|		ИНАЧЕ NULL
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ТаблицаТоваров.Количество КАК Количество,
	|	ТаблицаТоваров.Упаковка КАК Упаковка,
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА ВложенныеУпаковки.ВложеннаяУпаковка ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаТоваров.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|						ТОГДА 1
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ТаблицаТоваров.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Вес)
	|									И ТаблицаТоваров.Номенклатура.ВесИспользовать
	|									И ЕСТЬNULL(ТаблицаТоваров.Упаковка.Знаменатель, 0) <> 0
	|									И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ВесЕдиницаИзмерения.Числитель, 0) <> 0
	|									И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ВесЕдиницаИзмерения.Знаменатель, 0) <> 0
	|									И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ВесЧислитель, 0) <> 0
	|									И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ВесЗнаменатель, 0) <> 0
	|								ТОГДА ТаблицаТоваров.Упаковка.Числитель / ТаблицаТоваров.Упаковка.Знаменатель / (ТаблицаТоваров.Номенклатура.ВесЕдиницаИзмерения.Числитель / ТаблицаТоваров.Номенклатура.ВесЕдиницаИзмерения.Знаменатель) / (ТаблицаТоваров.Номенклатура.ВесЧислитель / ТаблицаТоваров.Номенклатура.ВесЗнаменатель)
	|							КОГДА ТаблицаТоваров.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Объем)
	|									И ТаблицаТоваров.Номенклатура.ОбъемИспользовать
	|									И ЕСТЬNULL(ТаблицаТоваров.Упаковка.Знаменатель, 0) <> 0
	|									И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ОбъемЕдиницаИзмерения.Числитель, 0) <> 0
	|									И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ОбъемЕдиницаИзмерения.Знаменатель, 0) <> 0
	|									И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ОбъемЧислитель, 0) <> 0
	|									И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ОбъемЗнаменатель, 0) <> 0
	|								ТОГДА ТаблицаТоваров.Упаковка.Числитель / ТаблицаТоваров.Упаковка.Знаменатель / (ТаблицаТоваров.Номенклатура.ОбъемЕдиницаИзмерения.Числитель / ТаблицаТоваров.Номенклатура.ОбъемЕдиницаИзмерения.Знаменатель) / (ТаблицаТоваров.Номенклатура.ОбъемЧислитель / ТаблицаТоваров.Номенклатура.ОбъемЗнаменатель)
	|							КОГДА ТаблицаТоваров.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Площадь)
	|									И ТаблицаТоваров.Номенклатура.ПлощадьИспользовать
	|									И ЕСТЬNULL(ТаблицаТоваров.Упаковка.Знаменатель, 0) <> 0
	|									И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ПлощадьЕдиницаИзмерения.Числитель, 0) <> 0
	|									И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ПлощадьЕдиницаИзмерения.Знаменатель, 0) <> 0
	|									И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ПлощадьЧислитель, 0) <> 0
	|									И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ПлощадьЗнаменатель, 0) <> 0
	|								ТОГДА ТаблицаТоваров.Упаковка.Числитель / ТаблицаТоваров.Упаковка.Знаменатель / (ТаблицаТоваров.Номенклатура.ПлощадьЕдиницаИзмерения.Числитель / ТаблицаТоваров.Номенклатура.ПлощадьЕдиницаИзмерения.Знаменатель) / (ТаблицаТоваров.Номенклатура.ПлощадьЧислитель / ТаблицаТоваров.Номенклатура.ПлощадьЗнаменатель)
	|							КОГДА ТаблицаТоваров.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Длина)
	|									И ТаблицаТоваров.Номенклатура.ДлинаИспользовать
	|									И ЕСТЬNULL(ТаблицаТоваров.Упаковка.Знаменатель, 0) <> 0
	|									И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ДлинаЕдиницаИзмерения.Числитель, 0) <> 0
	|									И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ДлинаЕдиницаИзмерения.Знаменатель, 0) <> 0
	|									И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ДлинаЧислитель, 0) <> 0
	|									И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ДлинаЗнаменатель, 0) <> 0
	|								ТОГДА ТаблицаТоваров.Упаковка.Числитель / ТаблицаТоваров.Упаковка.Знаменатель / (ТаблицаТоваров.Номенклатура.ДлинаЕдиницаИзмерения.Числитель / ТаблицаТоваров.Номенклатура.ДлинаЕдиницаИзмерения.Знаменатель) / (ТаблицаТоваров.Номенклатура.ДлинаЧислитель / ТаблицаТоваров.Номенклатура.ДлинаЗнаменатель)
	|							КОГДА ТаблицаТоваров.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Упаковка)
	|									И ЕСТЬNULL(ТаблицаТоваров.Упаковка.Знаменатель, 0) <> 0
	|								ТОГДА ТаблицаТоваров.Упаковка.Числитель / ТаблицаТоваров.Упаковка.Знаменатель
	|							КОГДА ТаблицаТоваров.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук)
	|								ТОГДА 1
	|							ИНАЧЕ NULL
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ВложенныеУпаковки.КоэффициентУпаковки
	|	КОНЕЦ КАК КоэффициентУпаковки,
	|	ВЫБОР
	|		КОГДА ВложенныеУпаковки.ВложеннаяУпаковка ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаТоваров.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|						ТОГДА 1
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ТаблицаТоваров.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Вес)
	|									И ТаблицаТоваров.Номенклатура.ВесИспользовать
	|									И ЕСТЬNULL(ТаблицаТоваров.Упаковка.Знаменатель, 0) <> 0
	|									И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ВесЕдиницаИзмерения.Числитель, 0) <> 0
	|									И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ВесЕдиницаИзмерения.Знаменатель, 0) <> 0
	|									И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ВесЧислитель, 0) <> 0
	|									И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ВесЗнаменатель, 0) <> 0
	|								ТОГДА ТаблицаТоваров.Упаковка.Числитель / ТаблицаТоваров.Упаковка.Знаменатель / (ТаблицаТоваров.Номенклатура.ВесЕдиницаИзмерения.Числитель / ТаблицаТоваров.Номенклатура.ВесЕдиницаИзмерения.Знаменатель) / (ТаблицаТоваров.Номенклатура.ВесЧислитель / ТаблицаТоваров.Номенклатура.ВесЗнаменатель)
	|							КОГДА ТаблицаТоваров.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Объем)
	|									И ТаблицаТоваров.Номенклатура.ОбъемИспользовать
	|									И ЕСТЬNULL(ТаблицаТоваров.Упаковка.Знаменатель, 0) <> 0
	|									И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ОбъемЕдиницаИзмерения.Числитель, 0) <> 0
	|									И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ОбъемЕдиницаИзмерения.Знаменатель, 0) <> 0
	|									И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ОбъемЧислитель, 0) <> 0
	|									И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ОбъемЗнаменатель, 0) <> 0
	|								ТОГДА ТаблицаТоваров.Упаковка.Числитель / ТаблицаТоваров.Упаковка.Знаменатель / (ТаблицаТоваров.Номенклатура.ОбъемЕдиницаИзмерения.Числитель / ТаблицаТоваров.Номенклатура.ОбъемЕдиницаИзмерения.Знаменатель) / (ТаблицаТоваров.Номенклатура.ОбъемЧислитель / ТаблицаТоваров.Номенклатура.ОбъемЗнаменатель)
	|							КОГДА ТаблицаТоваров.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Площадь)
	|									И ТаблицаТоваров.Номенклатура.ПлощадьИспользовать
	|									И ЕСТЬNULL(ТаблицаТоваров.Упаковка.Знаменатель, 0) <> 0
	|									И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ПлощадьЕдиницаИзмерения.Числитель, 0) <> 0
	|									И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ПлощадьЕдиницаИзмерения.Знаменатель, 0) <> 0
	|									И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ПлощадьЧислитель, 0) <> 0
	|									И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ПлощадьЗнаменатель, 0) <> 0
	|								ТОГДА ТаблицаТоваров.Упаковка.Числитель / ТаблицаТоваров.Упаковка.Знаменатель / (ТаблицаТоваров.Номенклатура.ПлощадьЕдиницаИзмерения.Числитель / ТаблицаТоваров.Номенклатура.ПлощадьЕдиницаИзмерения.Знаменатель) / (ТаблицаТоваров.Номенклатура.ПлощадьЧислитель / ТаблицаТоваров.Номенклатура.ПлощадьЗнаменатель)
	|							КОГДА ТаблицаТоваров.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Длина)
	|									И ТаблицаТоваров.Номенклатура.ДлинаИспользовать
	|									И ЕСТЬNULL(ТаблицаТоваров.Упаковка.Знаменатель, 0) <> 0
	|									И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ДлинаЕдиницаИзмерения.Числитель, 0) <> 0
	|									И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ДлинаЕдиницаИзмерения.Знаменатель, 0) <> 0
	|									И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ДлинаЧислитель, 0) <> 0
	|									И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ДлинаЗнаменатель, 0) <> 0
	|								ТОГДА ТаблицаТоваров.Упаковка.Числитель / ТаблицаТоваров.Упаковка.Знаменатель / (ТаблицаТоваров.Номенклатура.ДлинаЕдиницаИзмерения.Числитель / ТаблицаТоваров.Номенклатура.ДлинаЕдиницаИзмерения.Знаменатель) / (ТаблицаТоваров.Номенклатура.ДлинаЧислитель / ТаблицаТоваров.Номенклатура.ДлинаЗнаменатель)
	|							КОГДА ТаблицаТоваров.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Упаковка)
	|									И ЕСТЬNULL(ТаблицаТоваров.Упаковка.Знаменатель, 0) <> 0
	|								ТОГДА ТаблицаТоваров.Упаковка.Числитель / ТаблицаТоваров.Упаковка.Знаменатель
	|							КОГДА ТаблицаТоваров.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук)
	|								ТОГДА 1
	|							ИНАЧЕ NULL
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ВложенныеУпаковки.КоэффициентВложеннойУпаковки
	|	КОНЕЦ КАК КоэффициентВложеннойУпаковки,
	|	ВЫБОР
	|		КОГДА ВложенныеУпаковки.ВложеннаяУпаковка ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаТоваров.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|						ТОГДА ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения
	|					ИНАЧЕ ТаблицаТоваров.Упаковка
	|				КОНЕЦ
	|		ИНАЧЕ ВложенныеУпаковки.ВложеннаяУпаковка
	|	КОНЕЦ КАК ВидУпаковки,
	|	ТаблицаТоваров.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ КоэффициентыУпаковок
	|ИЗ
	|	РеализацияТоваровУслугТаблицаТоваров КАК ТаблицаТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВложенныеУпаковки КАК ВложенныеУпаковки
	|		ПО ТаблицаТоваров.Номенклатура = ВложенныеУпаковки.Номенклатура
	|			И ТаблицаТоваров.Упаковка = ВложенныеУпаковки.Упаковка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	ТаблицаТоваров.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Ссылка КАК Ссылка,
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.Номенклатура.Код КАК ТоварКод,
	|	ТаблицаТоваров.Номенклатура.Артикул КАК ТоварАртикул,
	|	ТаблицаТоваров.Номенклатура.НаименованиеПолное КАК ТоварНаименование,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВЫБОР
	|					КОГДА ТаблицаТоваров.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Вес)
	|							И ТаблицаТоваров.Номенклатура.ВесИспользовать
	|							И ЕСТЬNULL(ТаблицаТоваров.Упаковка.Знаменатель, 0) <> 0
	|							И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ВесЕдиницаИзмерения.Числитель, 0) <> 0
	|							И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ВесЕдиницаИзмерения.Знаменатель, 0) <> 0
	|							И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ВесЧислитель, 0) <> 0
	|							И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ВесЗнаменатель, 0) <> 0
	|						ТОГДА ТаблицаТоваров.Упаковка.Числитель / ТаблицаТоваров.Упаковка.Знаменатель / (ТаблицаТоваров.Номенклатура.ВесЕдиницаИзмерения.Числитель / ТаблицаТоваров.Номенклатура.ВесЕдиницаИзмерения.Знаменатель) / (ТаблицаТоваров.Номенклатура.ВесЧислитель / ТаблицаТоваров.Номенклатура.ВесЗнаменатель)
	|					КОГДА ТаблицаТоваров.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Объем)
	|							И ТаблицаТоваров.Номенклатура.ОбъемИспользовать
	|							И ЕСТЬNULL(ТаблицаТоваров.Упаковка.Знаменатель, 0) <> 0
	|							И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ОбъемЕдиницаИзмерения.Числитель, 0) <> 0
	|							И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ОбъемЕдиницаИзмерения.Знаменатель, 0) <> 0
	|							И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ОбъемЧислитель, 0) <> 0
	|							И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ОбъемЗнаменатель, 0) <> 0
	|						ТОГДА ТаблицаТоваров.Упаковка.Числитель / ТаблицаТоваров.Упаковка.Знаменатель / (ТаблицаТоваров.Номенклатура.ОбъемЕдиницаИзмерения.Числитель / ТаблицаТоваров.Номенклатура.ОбъемЕдиницаИзмерения.Знаменатель) / (ТаблицаТоваров.Номенклатура.ОбъемЧислитель / ТаблицаТоваров.Номенклатура.ОбъемЗнаменатель)
	|					КОГДА ТаблицаТоваров.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Площадь)
	|							И ТаблицаТоваров.Номенклатура.ПлощадьИспользовать
	|							И ЕСТЬNULL(ТаблицаТоваров.Упаковка.Знаменатель, 0) <> 0
	|							И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ПлощадьЕдиницаИзмерения.Числитель, 0) <> 0
	|							И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ПлощадьЕдиницаИзмерения.Знаменатель, 0) <> 0
	|							И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ПлощадьЧислитель, 0) <> 0
	|							И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ПлощадьЗнаменатель, 0) <> 0
	|						ТОГДА ТаблицаТоваров.Упаковка.Числитель / ТаблицаТоваров.Упаковка.Знаменатель / (ТаблицаТоваров.Номенклатура.ПлощадьЕдиницаИзмерения.Числитель / ТаблицаТоваров.Номенклатура.ПлощадьЕдиницаИзмерения.Знаменатель) / (ТаблицаТоваров.Номенклатура.ПлощадьЧислитель / ТаблицаТоваров.Номенклатура.ПлощадьЗнаменатель)
	|					КОГДА ТаблицаТоваров.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Длина)
	|							И ТаблицаТоваров.Номенклатура.ДлинаИспользовать
	|							И ЕСТЬNULL(ТаблицаТоваров.Упаковка.Знаменатель, 0) <> 0
	|							И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ДлинаЕдиницаИзмерения.Числитель, 0) <> 0
	|							И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ДлинаЕдиницаИзмерения.Знаменатель, 0) <> 0
	|							И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ДлинаЧислитель, 0) <> 0
	|							И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ДлинаЗнаменатель, 0) <> 0
	|						ТОГДА ТаблицаТоваров.Упаковка.Числитель / ТаблицаТоваров.Упаковка.Знаменатель / (ТаблицаТоваров.Номенклатура.ДлинаЕдиницаИзмерения.Числитель / ТаблицаТоваров.Номенклатура.ДлинаЕдиницаИзмерения.Знаменатель) / (ТаблицаТоваров.Номенклатура.ДлинаЧислитель / ТаблицаТоваров.Номенклатура.ДлинаЗнаменатель)
	|					КОГДА ТаблицаТоваров.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Упаковка)
	|							И ЕСТЬNULL(ТаблицаТоваров.Упаковка.Знаменатель, 0) <> 0
	|						ТОГДА ТаблицаТоваров.Упаковка.Числитель / ТаблицаТоваров.Упаковка.Знаменатель
	|					КОГДА ТаблицаТоваров.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук)
	|						ТОГДА 1
	|					ИНАЧЕ NULL
	|				КОНЕЦ, 1) = 1
	|			ТОГДА """"
	|		ИНАЧЕ ТаблицаТоваров.Упаковка.Наименование
	|	КОНЕЦ КАК Упаковка,
	|	ТаблицаТоваров.КоличествоУпаковок КАК Количество,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаТоваров.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.Наименование
	|		КОГДА ТаблицаТоваров.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Упаковка)
	|			ТОГДА ТаблицаТоваров.Упаковка.ЕдиницаИзмерения.Наименование
	|		ИНАЧЕ ТаблицаТоваров.Упаковка.Наименование
	|	КОНЕЦ КАК ВидУпаковки,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаТоваров.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.Наименование
	|		КОГДА ТаблицаТоваров.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Упаковка)
	|			ТОГДА ТаблицаТоваров.Упаковка.ЕдиницаИзмерения.Наименование
	|		ИНАЧЕ ТаблицаТоваров.Упаковка.Наименование
	|	КОНЕЦ КАК БазоваяЕдиницаНаименование,
	|	ТаблицаТоваров.СуммаБезНДС / ТаблицаТоваров.КоличествоУпаковок КАК Цена,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.Упаковка.Вес ЕСТЬ NULL
	|			ТОГДА ТаблицаТоваров.Количество
	|		ИНАЧЕ ТаблицаТоваров.КоличествоУпаковок
	|	КОНЕЦ * (ВЫБОР
	|		КОГДА ТаблицаТоваров.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Вес)
	|				И ТаблицаТоваров.Номенклатура.ВесИспользовать
	|				И ЕСТЬNULL(ТаблицаТоваров.Упаковка.Знаменатель, 0) <> 0
	|			ТОГДА ТаблицаТоваров.Упаковка.Числитель / ТаблицаТоваров.Упаковка.Знаменатель
	|		КОГДА ТаблицаТоваров.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Объем)
	|				И ТаблицаТоваров.Номенклатура.ВесИспользовать
	|				И ЕСТЬNULL(ТаблицаТоваров.Упаковка.Знаменатель, 0) <> 0
	|				И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ОбъемЕдиницаИзмерения.Числитель, 0) <> 0
	|				И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ОбъемЕдиницаИзмерения.Знаменатель, 0) <> 0
	|				И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ОбъемЧислитель, 0) <> 0
	|				И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ОбъемЗнаменатель, 0) <> 0
	|				И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ВесЗнаменатель, 0) <> 0
	|				И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ВесЕдиницаИзмерения.Знаменатель, 0) <> 0
	|			ТОГДА ТаблицаТоваров.Упаковка.Числитель / ТаблицаТоваров.Упаковка.Знаменатель / (ТаблицаТоваров.Номенклатура.ОбъемЕдиницаИзмерения.Числитель / ТаблицаТоваров.Номенклатура.ОбъемЕдиницаИзмерения.Знаменатель) / (ТаблицаТоваров.Номенклатура.ОбъемЧислитель / ТаблицаТоваров.Номенклатура.ОбъемЗнаменатель) * (ТаблицаТоваров.Номенклатура.ВесЧислитель / ТаблицаТоваров.Номенклатура.ВесЗнаменатель) * (ТаблицаТоваров.Номенклатура.ВесЕдиницаИзмерения.Числитель / ТаблицаТоваров.Номенклатура.ВесЕдиницаИзмерения.Знаменатель)
	|		КОГДА ТаблицаТоваров.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Площадь)
	|				И ТаблицаТоваров.Номенклатура.ВесИспользовать
	|				И ЕСТЬNULL(ТаблицаТоваров.Упаковка.Знаменатель, 0) <> 0
	|				И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ПлощадьЕдиницаИзмерения.Числитель, 0) <> 0
	|				И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ПлощадьЕдиницаИзмерения.Знаменатель, 0) <> 0
	|				И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ПлощадьЧислитель, 0) <> 0
	|				И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ПлощадьЗнаменатель, 0) <> 0
	|				И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ВесЗнаменатель, 0) <> 0
	|				И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ВесЕдиницаИзмерения.Знаменатель, 0) <> 0
	|			ТОГДА ТаблицаТоваров.Упаковка.Числитель / ТаблицаТоваров.Упаковка.Знаменатель / (ТаблицаТоваров.Номенклатура.ПлощадьЕдиницаИзмерения.Числитель / ТаблицаТоваров.Номенклатура.ПлощадьЕдиницаИзмерения.Знаменатель) / (ТаблицаТоваров.Номенклатура.ПлощадьЧислитель / ТаблицаТоваров.Номенклатура.ПлощадьЗнаменатель) * (ТаблицаТоваров.Номенклатура.ВесЧислитель / ТаблицаТоваров.Номенклатура.ВесЗнаменатель) * (ТаблицаТоваров.Номенклатура.ВесЕдиницаИзмерения.Числитель / ТаблицаТоваров.Номенклатура.ВесЕдиницаИзмерения.Знаменатель)
	|		КОГДА ТаблицаТоваров.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Длина)
	|				И ТаблицаТоваров.Номенклатура.ВесИспользовать
	|				И ЕСТЬNULL(ТаблицаТоваров.Упаковка.Знаменатель, 0) <> 0
	|				И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ДлинаЕдиницаИзмерения.Числитель, 0) <> 0
	|				И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ДлинаЕдиницаИзмерения.Знаменатель, 0) <> 0
	|				И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ДлинаЧислитель, 0) <> 0
	|				И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ДлинаЗнаменатель, 0) <> 0
	|				И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ВесЗнаменатель, 0) <> 0
	|				И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ВесЕдиницаИзмерения.Знаменатель, 0) <> 0
	|			ТОГДА ТаблицаТоваров.Упаковка.Числитель / ТаблицаТоваров.Упаковка.Знаменатель / (ТаблицаТоваров.Номенклатура.ДлинаЕдиницаИзмерения.Числитель / ТаблицаТоваров.Номенклатура.ДлинаЕдиницаИзмерения.Знаменатель) / (ТаблицаТоваров.Номенклатура.ДлинаЧислитель / ТаблицаТоваров.Номенклатура.ДлинаЗнаменатель) * (ТаблицаТоваров.Номенклатура.ВесЧислитель / ТаблицаТоваров.Номенклатура.ВесЗнаменатель) * (ТаблицаТоваров.Номенклатура.ВесЕдиницаИзмерения.Числитель / ТаблицаТоваров.Номенклатура.ВесЕдиницаИзмерения.Знаменатель)
	|		КОГДА ТаблицаТоваров.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Упаковка)
	|				И ЕСТЬNULL(ТаблицаТоваров.Упаковка.ВесЕдиницаИзмерения.Знаменатель, 0) <> 0
	|			ТОГДА ТаблицаТоваров.Упаковка.Вес * ТаблицаТоваров.Упаковка.ВесЕдиницаИзмерения.Числитель / ТаблицаТоваров.Упаковка.ВесЕдиницаИзмерения.Знаменатель
	|		КОГДА (ТаблицаТоваров.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук)
	|				ИЛИ ТаблицаТоваров.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.ПустаяСсылка)
	|				ИЛИ ЕСТЬNULL(ТаблицаТоваров.Упаковка.Ссылка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка))
	|				И ТаблицаТоваров.Номенклатура.ВесИспользовать
	|				И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ВесЗнаменатель, 0) <> 0
	|				И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ВесЕдиницаИзмерения.Знаменатель, 0) <> 0
	|			ТОГДА ТаблицаТоваров.Номенклатура.ВесЧислитель / ТаблицаТоваров.Номенклатура.ВесЗнаменатель * (ТаблицаТоваров.Номенклатура.ВесЕдиницаИзмерения.Числитель / ТаблицаТоваров.Номенклатура.ВесЕдиницаИзмерения.Знаменатель)
	|		ИНАЧЕ 0
	|	КОНЕЦ / 1) КАК МассаБрутто,
	|	ТаблицаТоваров.Количество * (ВЫБОР
	|		КОГДА ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Вес)
	|				И ТаблицаТоваров.Номенклатура.ВесИспользовать
	|				И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.Знаменатель, 0) <> 0
	|			ТОГДА ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.Числитель / ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.Знаменатель
	|		КОГДА ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Объем)
	|				И ТаблицаТоваров.Номенклатура.ВесИспользовать
	|				И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.Знаменатель, 0) <> 0
	|				И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ОбъемЕдиницаИзмерения.Числитель, 0) <> 0
	|				И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ОбъемЕдиницаИзмерения.Знаменатель, 0) <> 0
	|				И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ОбъемЧислитель, 0) <> 0
	|				И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ОбъемЗнаменатель, 0) <> 0
	|				И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ВесЗнаменатель, 0) <> 0
	|				И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ВесЕдиницаИзмерения.Знаменатель, 0) <> 0
	|			ТОГДА ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.Числитель / ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.Знаменатель / (ТаблицаТоваров.Номенклатура.ОбъемЕдиницаИзмерения.Числитель / ТаблицаТоваров.Номенклатура.ОбъемЕдиницаИзмерения.Знаменатель) / (ТаблицаТоваров.Номенклатура.ОбъемЧислитель / ТаблицаТоваров.Номенклатура.ОбъемЗнаменатель) * (ТаблицаТоваров.Номенклатура.ВесЧислитель / ТаблицаТоваров.Номенклатура.ВесЗнаменатель) * (ТаблицаТоваров.Номенклатура.ВесЕдиницаИзмерения.Числитель / ТаблицаТоваров.Номенклатура.ВесЕдиницаИзмерения.Знаменатель)
	|		КОГДА ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Площадь)
	|				И ТаблицаТоваров.Номенклатура.ВесИспользовать
	|				И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.Знаменатель, 0) <> 0
	|				И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ПлощадьЕдиницаИзмерения.Числитель, 0) <> 0
	|				И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ПлощадьЕдиницаИзмерения.Знаменатель, 0) <> 0
	|				И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ПлощадьЧислитель, 0) <> 0
	|				И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ПлощадьЗнаменатель, 0) <> 0
	|				И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ВесЗнаменатель, 0) <> 0
	|				И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ВесЕдиницаИзмерения.Знаменатель, 0) <> 0
	|			ТОГДА ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.Числитель / ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.Знаменатель / (ТаблицаТоваров.Номенклатура.ПлощадьЕдиницаИзмерения.Числитель / ТаблицаТоваров.Номенклатура.ПлощадьЕдиницаИзмерения.Знаменатель) / (ТаблицаТоваров.Номенклатура.ПлощадьЧислитель / ТаблицаТоваров.Номенклатура.ПлощадьЗнаменатель) * (ТаблицаТоваров.Номенклатура.ВесЧислитель / ТаблицаТоваров.Номенклатура.ВесЗнаменатель) * (ТаблицаТоваров.Номенклатура.ВесЕдиницаИзмерения.Числитель / ТаблицаТоваров.Номенклатура.ВесЕдиницаИзмерения.Знаменатель)
	|		КОГДА ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Длина)
	|				И ТаблицаТоваров.Номенклатура.ВесИспользовать
	|				И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.Знаменатель, 0) <> 0
	|				И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ДлинаЕдиницаИзмерения.Числитель, 0) <> 0
	|				И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ДлинаЕдиницаИзмерения.Знаменатель, 0) <> 0
	|				И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ДлинаЧислитель, 0) <> 0
	|				И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ДлинаЗнаменатель, 0) <> 0
	|				И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ВесЗнаменатель, 0) <> 0
	|				И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ВесЕдиницаИзмерения.Знаменатель, 0) <> 0
	|			ТОГДА ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.Числитель / ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.Знаменатель / (ТаблицаТоваров.Номенклатура.ДлинаЕдиницаИзмерения.Числитель / ТаблицаТоваров.Номенклатура.ДлинаЕдиницаИзмерения.Знаменатель) / (ТаблицаТоваров.Номенклатура.ДлинаЧислитель / ТаблицаТоваров.Номенклатура.ДлинаЗнаменатель) * (ТаблицаТоваров.Номенклатура.ВесЧислитель / ТаблицаТоваров.Номенклатура.ВесЗнаменатель) * (ТаблицаТоваров.Номенклатура.ВесЕдиницаИзмерения.Числитель / ТаблицаТоваров.Номенклатура.ВесЕдиницаИзмерения.Знаменатель)
	|		КОГДА ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Упаковка)
	|				И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.ВесЕдиницаИзмерения.Знаменатель, 0) <> 0
	|			ТОГДА ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.Вес * ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.ВесЕдиницаИзмерения.Числитель / ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.ВесЕдиницаИзмерения.Знаменатель
	|		КОГДА (ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук)
	|				ИЛИ ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.ПустаяСсылка)
	|				ИЛИ ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.Ссылка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка))
	|				И ТаблицаТоваров.Номенклатура.ВесИспользовать
	|				И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ВесЗнаменатель, 0) <> 0
	|				И ЕСТЬNULL(ТаблицаТоваров.Номенклатура.ВесЕдиницаИзмерения.Знаменатель, 0) <> 0
	|			ТОГДА ТаблицаТоваров.Номенклатура.ВесЧислитель / ТаблицаТоваров.Номенклатура.ВесЗнаменатель * (ТаблицаТоваров.Номенклатура.ВесЕдиницаИзмерения.Числитель / ТаблицаТоваров.Номенклатура.ВесЕдиницаИзмерения.Знаменатель)
	|		ИНАЧЕ 0
	|	КОНЕЦ / 1) КАК МассаНетто,
	|	КоэффициентыУпаковок.Количество / КоэффициентыУпаковок.КоэффициентВложеннойУпаковки КАК КоличествоМест,
	|	ТаблицаТоваров.СуммаБезНДС КАК Сумма,
	|	ТаблицаТоваров.СуммаНДС КАК СуммаНДС,
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	ЛОЖЬ КАК Весовой,
	|	ЛОЖЬ КАК ЭтоВозвратнаяТара
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	РеализацияТоваровУслугТаблицаТоваров КАК ТаблицаТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыУпаковок КАК КоэффициентыУпаковок
	|		ПО ТаблицаТоваров.Ссылка = КоэффициентыУпаковок.Ссылка
	|			И ТаблицаТоваров.НомерСтроки = КоэффициентыУпаковок.НомерСтроки
	|			И ТаблицаТоваров.КоличествоУпаковок = КоэффициентыУпаковок.КоличествоУпаковок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Ссылка КАК Ссылка,
	|	СУММА(Товары.МассаБрутто) КАК МассаБрутто,
	|	СУММА(Товары.МассаНетто) КАК МассаНетто,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Товары.Номенклатура) КАК КоличествоНаименований
	|ПОМЕСТИТЬ Вес
	|ИЗ
	|	Товары КАК Товары
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Шапка.Ссылка КАК Ссылка,
	|	Шапка.ПорядковыйНомер КАК ПорядковыйНомер,
	|	Шапка.Номер КАК Номер,
	|	Шапка.Дата КАК Дата,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Грузополучатель КАК Грузополучатель,
	|	Шапка.Грузоотправитель КАК Грузоотправитель,
	|	Шапка.Плательщик КАК Плательщик,
	|	Шапка.ЗаказчикПеревозки КАК ЗаказчикПеревозки,
	|	Шапка.Префикс КАК Префикс,
	|	Шапка.Кладовщик КАК Кладовщик,
	|	Шапка.ДолжностьКладовщика КАК ДолжностьКладовщика,
	|	Шапка.Руководитель КАК Руководитель,
	|	Шапка.ДолжностьРуководителя КАК ДолжностьРуководителя,
	|	Шапка.ГлавныйБухгалтер КАК ГлавныйБухгалтер,
	|	Шапка.БанковскийСчетПлательщика КАК БанковскийСчетПлательщика,
	|	Шапка.БанковскийСчетЗаказчикаПеревозки КАК БанковскийСчетЗаказчикаПеревозки,
	|	Шапка.БанковскийСчетПеревозчика КАК БанковскийСчетПеревозчика,
	|	Шапка.Перевозчик КАК Перевозчик,
	|	Шапка.Водитель КАК Водитель,
	|	Шапка.ВидПеревозки КАК ВидПеревозки,
	|	Шапка.ЛицензионнаяКарточкаРегистрационныйНомер КАК ЛицензионнаяКарточкаРегистрационныйНомер,
	|	Шапка.ЛицензионнаяКарточкаСерия КАК ЛицензионнаяКарточкаСерия,
	|	Шапка.ЛицензионнаяКарточкаНомер КАК ЛицензионнаяКарточкаНомер,
	|	Шапка.ЛицензионнаяКарточкаВид КАК ЛицензионнаяКарточкаВид,
	|	Шапка.МаркаАвтомобиля КАК МаркаАвтомобиля,
	|	Шапка.ГосНомерАвтомобиля КАК ГосНомерАвтомобиля,
	|	Шапка.Прицеп КАК Прицеп,
	|	Шапка.ГосНомерПрицепа КАК ГосНомерПрицепа,
	|	Шапка.ДоверенностьНомер КАК ДоверенностьНомер,
	|	Шапка.ДоверенностьДата КАК ДоверенностьДата,
	|	Шапка.ДоверенностьВыдана КАК ДоверенностьВыдана,
	|	Шапка.ДоверенностьЛицо КАК ДоверенностьЛицо,
	|	Шапка.Валюта КАК Валюта,
	|	Шапка.ПунктПогрузки КАК ПунктПогрузки,
	|	Шапка.ПунктРазгрузки КАК ПунктРазгрузки,
	|	Шапка.СрокДоставки КАК СрокДоставки,
	|	Шапка.ЗаданиеНаПеревозку КАК ЗаданиеНаПеревозку,
	|	Шапка.ВыводДанныхОТоварномСоставе КАК ВыводДанныхОТоварномСоставе,
	|	Шапка.УдостоверениеНомер КАК УдостоверениеНомер,
	|	Шапка.УдостоверениеСерия КАК УдостоверениеСерия,
	|	Вес.МассаБрутто КАК МассаБрутто,
	|	Вес.МассаНетто КАК МассаНетто,
	|	Вес.КоличествоНаименований КАК КоличествоНаименований,
	|	ЛОЖЬ КАК ЕстьНепроведенныеДокументыОснования
	|ИЗ
	|	Шапка КАК Шапка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Вес КАК Вес
	|		ПО Шапка.Ссылка = Вес.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Ссылка КАК ТранспортнаяНакладная,
	|	Товары.Ссылка.Номер КАК ПорядковыйНомер,
	|	1 КАК НомерСтрокиВТранспортнойНакладной,
	|	Товары.Ссылка КАК Ссылка,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.ТоварКод КАК ТоварКод,
	|	Товары.ТоварАртикул КАК ТоварАртикул,
	|	Товары.ТоварНаименование КАК ТоварНаименование,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Упаковка КАК Упаковка,
	|	Товары.Количество КАК Количество,
	|	Товары.ВидУпаковки КАК ВидУпаковки,
	|	Товары.БазоваяЕдиницаНаименование КАК БазоваяЕдиницаНаименование,
	|	Товары.Цена КАК Цена,
	|	Товары.МассаБрутто КАК МассаБрутто,
	|	0 КАК МассаНетто,
	|	Товары.КоличествоМест КАК КоличествоМест,
	|	Товары.Сумма КАК Сумма,
	|	Товары.СуммаНДС КАК СуммаНДС,
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	Товары.Весовой КАК Весовой,
	|	Товары.ЭтоВозвратнаяТара КАК ЭтоВозвратнаяТара
	|ИЗ
	|	Товары КАК Товары
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки
	|ИТОГИ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК ТранспортнаяНакладная,
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	|	РеализацияТоваровУслуг.Номер КАК Номер,
	|	РеализацияТоваровУслуг.Дата КАК Дата
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка";

	МассивРезультатов         	   = Запрос.ВыполнитьПакет();

	РезультатПоШапке          	   = МассивРезультатов[8];
	РезультатПоТабличнойЧасти	   = МассивРезультатов[9];
	РезультатПоНомерамНакладных    = МассивРезультатов[10];

	УстановитьПривилегированныйРежим(Ложь);

	СтруктураДанныхДляПечати = Новый Структура("РезультатПоШапке, РезультатПоТабличнойЧасти, РезультатПоНомерамНакладных",
		РезультатПоШапке, РезультатПоТабличнойЧасти, РезультатПоНомерамНакладных);

	Возврат СтруктураДанныхДляПечати;
КонецФункции

Процедура ЗаполнитьТабличныйДокументТТН(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати)
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	ЕдиницаИзмеренияВеса           = Константы.ЕдиницаИзмеренияВеса.Получить();
	КоэффициентПересчетаВТонны     = НоменклатураСервер.КоэффициентПересчетаВТонны(
		Константы.ЕдиницаИзмеренияВеса.Получить());

	ДанныеПечати      					  = ДанныеДляПечати.РезультатПоШапке.Выбрать();
	ВыборкаПоДокументам					  = ДанныеДляПечати.РезультатПоТабличнойЧасти.Выбрать(
		ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаПоНомерамТранспортныхНакладных = ДанныеДляПечати.РезультатПоНомерамНакладных.Выбрать();

	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.AMS_Продажи.ТТН");
	Макет.КодЯзыка = Метаданные.Языки.Русский.КодЯзыка;

	ПервыйДокумент = Истина;

	Пока ДанныеПечати.Следующий() Цикл
		// Если ТТН с доставкой и нашли связанные с доставкой ошибки - перейдем к следующему документу.
		СтруктураЗаданиеНаПеревозку = Новый Структура("НеНайденоЗаданиеНаПеревозку,
													  |БолееОдногоВхожденияВЗаданияНаПеревозку,
													  |РаспоряжениеНеПроведено", Ложь, Ложь, Ложь);
		ЕстьОшибкиДоставки = Ложь;
		ЗаполнитьЗначенияСвойств(СтруктураЗаданиеНаПеревозку, ДанныеПечати);
		Если СтруктураЗаданиеНаПеревозку.НеНайденоЗаданиеНаПеревозку Тогда
			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр(
				"ru = 'Для документа %1 не найдено задание на перевозку. Печать формы 1-Т для документов с доставкой возможна после включения документа в задание на перевозку.'"),
				ДанныеПечати.Ссылка);
			ОбщегоНазначения.СообщитьПользователю(
				Текст, ДанныеПечати.Ссылка);
			ЕстьОшибкиДоставки = Истина;
		КонецЕсли;
		Если СтруктураЗаданиеНаПеревозку.БолееОдногоВхожденияВЗаданияНаПеревозку Тогда
			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр(
				"ru = 'Невозможно напечатать форму 1-Т для %1, т.к. найдено более одного задания на перевозку, в которые включен этот документ.'"),
				ДанныеПечати.Ссылка);
			ОбщегоНазначения.СообщитьПользователю(
				Текст, ДанныеПечати.Ссылка);
			ЕстьОшибкиДоставки = Истина;
		КонецЕсли;
		Если СтруктураЗаданиеНаПеревозку.РаспоряжениеНеПроведено Тогда
			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Документ %1 не проведен. Печать товарно - транспортной накладной не будет выполнена.'"),
				ДанныеПечати.Ссылка);
			ОбщегоНазначения.СообщитьПользователю(
				Текст, ДанныеПечати.Ссылка);
			ЕстьОшибкиДоставки = Истина;
		КонецЕсли;
		Если ЕстьОшибкиДоставки Тогда
			Продолжить;
		КонецЕсли;
				
		// Найдем в выборке товары по текущему документу
		СтруктураПоиска = Новый Структура("ПорядковыйНомер", ДанныеПечати.ПорядковыйНомер);
		//@skip-check module-unused-local-variable
		НайденСледующий = ВыборкаПоДокументам.НайтиСледующий(СтруктураПоиска);
		СтрокаТовары = ВыборкаПоДокументам.Выбрать();
		КоличествоСтрок = СтрокаТовары.Количество();

		Если ДанныеПечати.ЕстьНепроведенныеДокументыОснования Тогда

			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр(
				"ru = 'В документе %1 присутствуют непроведенные документы-основания. Печать товарно - транспортной накладной невозможна.'"),
				ДанныеПечати.Ссылка);

			ОбщегоНазначения.СообщитьПользователю(Текст, ДанныеПечати.Ссылка);

			Продолжить;

		КонецЕсли;
		
		// Если в ТТН только услуги - перейдем к следующему документу
		Если КоличествоСтрок = 0 Тогда

			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'По документу %1 отсутствуют Товары. Печать товарно - транспортной накладной не требуется.'"),
				ДанныеПечати.Ссылка);

			ОбщегоНазначения.СообщитьПользователю(Текст, ДанныеПечати.Ссылка);

			Продолжить;
		КонецЕсли;

		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;

		ЗаполнитьРеквизитыШапкиТТН(ДанныеПечати, Макет, ТабличныйДокумент);

		НомерСтраницы = 1;
		ИтоговыеСуммы = СтруктураИтоговыеСуммыТТН();

		ДанныеСтроки = СтруктураДанныеСтрокиТТН();
		
		// Создаем массив для проверки вывода
		МассивВыводимыхОбластей = Новый Массив;
		
		// Выводим многострочную часть докмента
		ОбластьЗаголовокТаблицы      = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
		ОбластьМакета                = Макет.ПолучитьОбласть("Строка");
		ОбластьМакетаСтандарт        = Макет.ПолучитьОбласть("Строка");
		ОбластьИтоговПоСтранице      = Макет.ПолучитьОбласть("ИтогоПоСтранице");
		ОбластьВсего                 = Макет.ПолучитьОбласть("Всего");
		ОбластьПодвала               = Макет.ПолучитьОбласть("Подвал");
		ОбластьТранспортногоРаздела  = Макет.ПолучитьОбласть("ТранспортныйРаздел");
		ОбластьСведенийОГрузе        = Макет.ПолучитьОбласть("СведенияОГрузе");
		ОбластьПодвалаСведенийОГрузе = Макет.ПолучитьОбласть("ПодвалСведенийОГрузе");
		ОбластьПогрузочныхОпераций   = Макет.ПолучитьОбласть("ПогрузочныеОперации");
		ОбластьПрочихСведений        = Макет.ПолучитьОбласть("ПрочиеСведения");

		ИспользоватьНаборы = Ложь;
		Если ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(ВыборкаПоДокументам, "ЭтоНабор") Тогда
			ИспользоватьНаборы = Истина;
			ОбластьМакетаНабор         = Макет.ПолучитьОбласть("СтрокаНабор");
			ОбластьМакетаКомплектующие = Макет.ПолучитьОбласть("СтрокаКомплектующие");
		КонецЕсли;

		Если ДанныеПечати.ВыводДанныхОТоварномСоставе
			= Перечисления.ВариантыВыводаДанныхОТоварномСоставе.ТоварныйСостав Тогда

			Пока СтрокаТовары.Следующий() Цикл

				ДанныеСтроки.Номер = ДанныеСтроки.Номер + 1;

				Если НаборыСервер.ИспользоватьОбластьНабор(СтрокаТовары, ИспользоватьНаборы) Тогда
					ОбластьМакета = ОбластьМакетаНабор;
				ИначеЕсли НаборыСервер.ИспользоватьОбластьКомплектующие(СтрокаТовары, ИспользоватьНаборы) Тогда
					ОбластьМакета = ОбластьМакетаКомплектующие;
				Иначе
					ОбластьМакета = ОбластьМакетаСтандарт;
				КонецЕсли;

				ЗаполнитьРеквизитыСтрокиТовараТТН(ДанныеПечати, СтрокаТовары, ДанныеСтроки, ОбластьМакета,
					ЕдиницаИзмеренияВеса, КоэффициентПересчетаВТонны);

				Если ДанныеСтроки.Номер = 1 Тогда // первая строка

					ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
					ТабличныйДокумент.Вывести(ОбластьЗаголовокТаблицы);

				Иначе

					МассивВыводимыхОбластей.Очистить();
					МассивВыводимыхОбластей.Добавить(ОбластьМакета);
					МассивВыводимыхОбластей.Добавить(ОбластьИтоговПоСтранице);

					Если ДанныеСтроки.Номер = КоличествоСтрок Тогда

						МассивВыводимыхОбластей.Добавить(ОбластьВсего);
						МассивВыводимыхОбластей.Добавить(ОбластьПодвала);

					КонецЕсли;

					Если ДанныеСтроки.Номер <> 1 И Не ТабличныйДокумент.ПроверитьВывод(МассивВыводимыхОбластей) Тогда

						ОбластьИтоговПоСтранице.Параметры.Заполнить(ИтоговыеСуммы);
						ТабличныйДокумент.Вывести(ОбластьИтоговПоСтранице);
						
						// Очистим итоги по странице.
						ОбнулитьИтогиПоСтраницеТТН(ИтоговыеСуммы);

						НомерСтраницы = НомерСтраницы + 1;
						ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
						ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
						ТабличныйДокумент.Вывести(ОбластьЗаголовокТаблицы);

					КонецЕсли;

				КонецЕсли;

				ТабличныйДокумент.Вывести(ОбластьМакета);
				Если Не НаборыСервер.ИспользоватьОбластьКомплектующие(СтрокаТовары, ИспользоватьНаборы) Тогда
					РассчитатьИтоговыеСуммыТТН(ИтоговыеСуммы, ДанныеСтроки);
				КонецЕсли;

			КонецЦикла;
			КоличествоПорядковыхНомеровЗаписей = ДанныеСтроки.Номер;

		Иначе

			ДанныеСтроки.Номер = ДанныеСтроки.Номер + 1;

			ЗаполнитьНомераНакладныхВСтрокеТовараТТН(
					ДанныеПечати, ВыборкаПоНомерамТранспортныхНакладных, ДанныеСтроки, ОбластьМакета);
			ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
			ТабличныйДокумент.Вывести(ОбластьЗаголовокТаблицы);

			ТабличныйДокумент.Вывести(ОбластьМакета);

			КоличествоПорядковыхНомеровЗаписей = 0;

		КонецЕсли;
		
		// Выводим итоги по последней странице
		ОбластьИтоговПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтранице");
		ОбластьИтоговПоСтранице.Параметры.Заполнить(ИтоговыеСуммы);

		ТабличныйДокумент.Вывести(ОбластьИтоговПоСтранице);
		
		// Выводим итоги по документу в целом
		ОбластьМакета = Макет.ПолучитьОбласть("Всего");
		ОбластьМакета.Параметры.Заполнить(ИтоговыеСуммы);

		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Выводим подвал документа

		Если ДанныеПечати.ВыводДанныхОТоварномСоставе
			= Перечисления.ВариантыВыводаДанныхОТоварномСоставе.ТоварныйСостав Тогда
			ДобавитьИтоговыеДанныеПодвалаТТН(ИтоговыеСуммы, КоличествоПорядковыхНомеровЗаписей,
				ВалютаРегламентированногоУчета);
		Иначе
			ДобавитьИтоговыеДанныеПодвалаТТНДляНесколькихНакладных(ИтоговыеСуммы, КоличествоПорядковыхНомеровЗаписей,
				ВалютаРегламентированногоУчета);
		КонецЕсли;
		ЗаполнитьРеквизитыПодвалаТТН(ДанныеПечати, ИтоговыеСуммы, Макет, ТабличныйДокумент, ЕдиницаИзмеренияВеса,
			КоэффициентПересчетаВТонны);

		ЗаполнитьРеквизитыТранспортногоРазделаТТН(ДанныеПечати, Макет, ОбластьТранспортногоРаздела);

		МассивВыводимыхОбластей.Очистить();
		МассивВыводимыхОбластей.Добавить(ОбластьТранспортногоРаздела);
		МассивВыводимыхОбластей.Добавить(ОбластьСведенийОГрузе);
		МассивВыводимыхОбластей.Добавить(ОбластьПодвалаСведенийОГрузе);
		МассивВыводимыхОбластей.Добавить(ОбластьПогрузочныхОпераций);
		Если Не ТабличныйДокумент.ПроверитьВывод(МассивВыводимыхОбластей) Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьТранспортногоРаздела);
		ТабличныйДокумент.Вывести(ОбластьСведенийОГрузе);

		Если ТипЗнч(ДанныеПечати.Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			Обработки.ПечатьОбщихФорм.амсУстановитьПараметрыПечати(ДанныеПечати, ОбластьПодвалаСведенийОГрузе,
				"ТТН-СведенияОГрузе");
		КонецЕсли;

		ТабличныйДокумент.Вывести(ОбластьПодвалаСведенийОГрузе);
		ТабличныйДокумент.Вывести(ОбластьПогрузочныхОпераций);

		МассивВыводимыхОбластей.Очистить();
		МассивВыводимыхОбластей.Добавить(ОбластьПрочихСведений);
		Если Не ТабличныйДокумент.ПроверитьВывод(МассивВыводимыхОбластей) Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьПрочихСведений);

		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати,
			ДанныеПечати.Ссылка);
	КонецЦикла;
КонецПроцедуры // ЗаполнитьТабличныйДокументТТН()

Процедура ЗаполнитьРеквизитыШапкиТТН(ДанныеПечати, Макет, ТабличныйДокумент)
	РеквизитыШапки = Новый Структура;
	
	// Выводим общие реквизиты шапки
	СведенияОПокупателе       = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Плательщик, ДанныеПечати.Дата,
		, ДанныеПечати.БанковскийСчетПлательщика);
	СведенияОГрузополучателе  = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Грузополучатель,
		ДанныеПечати.Дата);
	СведенияОГрузоотправитель = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Грузоотправитель,
		ДанныеПечати.Дата);

	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Заполнить(ДанныеПечати);

	Имя = ДанныеПечати.Грузополучатель.Наименование;
	Если СтрНайти(Имя, "ПЕРЕКРЕСТОК") > 0 Или СтрНайти(Имя, "Тандер") > 0 Тогда
		ОбластьМакета.Параметры.НомерЗаказа = СокрЛП(ДанныеПечати.Ссылка.Основание);
		ОбластьМакета.Параметры.НомерУПД    = "Номер УПД " + ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(
			ДанныеПечати.Номер);
	КонецЕсли;

	РеквизитыШапки.Вставить("НомерДокумента", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеПечати.Номер));
	РеквизитыШапки.Вставить("ДатаДокумента", ДанныеПечати.Дата);

	ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ОбластьМакета,
		ДанныеПечати.Ссылка);

	ПредставлениеОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель,
		"ПолноеНаименование,ИНН,ЮридическийАдрес,Телефоны");

	ПредставлениеГрузополучателя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе,
		"ПолноеНаименование,ИНН,ЮридическийАдрес,Телефоны");

	ПредставлениеПлательщика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,
		"ПолноеНаименование,ЮридическийАдрес,НомерСчета,Банк,БИК,КоррСчет");

	РеквизитыШапки.Вставить("ПредставлениеОрганизации", ПредставлениеОрганизации);
	РеквизитыШапки.Вставить("ПредставлениеГрузополучателя", ПредставлениеГрузополучателя);
	РеквизитыШапки.Вставить("ПредставлениеПлательщика", ПредставлениеПлательщика);

	РеквизитыШапки.Вставить("ОрганизацияПоОКПО", СведенияОГрузоотправитель.КодПоОКПО);
	РеквизитыШапки.Вставить("ГрузополучательПоОКПО", СведенияОГрузополучателе.КодПоОКПО);
	РеквизитыШапки.Вставить("ПлательщикПоОКПО", СведенияОПокупателе.КодПоОКПО);

	ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, РеквизитыШапки);

	Если ТипЗнч(ДанныеПечати.Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Обработки.ПечатьОбщихФорм.амсУстановитьПараметрыПечати(ДанныеПечати, ОбластьМакета, "ТТН-Шапка");
	КонецЕсли;

	ТабличныйДокумент.Вывести(ОбластьМакета);

КонецПроцедуры // ЗаполнитьРеквизитыШапкиТТН()

Процедура ЗаполнитьРеквизитыСтрокиТовараТТН(ДанныеПечати, СтрокаТовары, ДанныеСтроки, ОбластьМакета,
	ЕдиницаИзмеренияВеса = Неопределено, КоэффициентПересчетаВТонны = 0)

	ДополнительныеПараметрыПолученияНаименованияДляПечати = НоменклатураКлиентСервер.ДополнительныеПараметрыПредставлениеНоменклатурыДляПечати();
	ДополнительныеПараметрыПолученияНаименованияДляПечати.ВозвратнаяТара = СтрокаТовары.ЭтоВозвратнаяТара;

	ОбластьМакета.Параметры.ТоварНаименование = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
		СтрокаТовары.ТоварНаименование, СтрокаТовары.Характеристика, , ,
		ДополнительныеПараметрыПолученияНаименованияДляПечати);

	ИспользоватьНаборы = ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(СтрокаТовары, "ЭтоНабор");
	
	//@skip-check structure-consructor-too-many-keys
	ДанныеДляРасчетаПостфикса = Новый Структура("ЭтоКомплектующие, ЭтоНабор, ПолныйНабор, 
												|ВариантПредставленияНабораВПечатныхФормах, ВариантРасчетаЦеныНабора, Количество");
	ЗаполнитьЗначенияСвойств(ДанныеДляРасчетаПостфикса, СтрокаТовары);
	ДанныеДляРасчетаПостфикса.Вставить("ЕдиницаИзмерения", СтрокаТовары.БазоваяЕдиницаНаименование);

	ПрефиксИПостфикс = НаборыСервер.ПолучитьПрефиксИПостфикс(ДанныеДляРасчетаПостфикса, ИспользоватьНаборы);

	ВыводитьЦены = Ложь;

	Если ИспользоватьНаборы И СтрокаТовары.ЭтоКомплектующие И СтрокаТовары.ВариантПредставленияНабораВПечатныхФормах
		= Перечисления.ВариантыПредставленияНаборовВПечатныхФормах.НаборИКомплектующие
		И (СтрокаТовары.ВариантРасчетаЦеныНабора = Перечисления.ВариантыРасчетаЦенНаборов.ЦенаЗадаетсяЗаНаборРаспределяетсяПоДолям
		Или СтрокаТовары.ВариантРасчетаЦеныНабора
		= Перечисления.ВариантыРасчетаЦенНаборов.ЦенаЗадаетсяЗаНаборРаспределяетсяПоЦенам) Тогда
		// Область должна остаться незаполненной
		ОбластьМакета.Параметры.Заполнить(НаборыСервер.ПустыеДанные());
	ИначеЕсли ИспользоватьНаборы И СтрокаТовары.ЭтоНабор И СтрокаТовары.ВариантПредставленияНабораВПечатныхФормах
		= Перечисления.ВариантыПредставленияНаборовВПечатныхФормах.НаборИКомплектующие И (СтрокаТовары.ВариантРасчетаЦеныНабора
		= Перечисления.ВариантыРасчетаЦенНаборов.РассчитываетсяИзЦенКомплектующих) Тогда
		// Область должна остаться незаполненной
		ОбластьМакета.Параметры.Заполнить(НаборыСервер.ПустыеДанные());
	Иначе
		ОбластьМакета.Параметры.Заполнить(СтрокаТовары);
		ВыводитьЦены = Истина;
	КонецЕсли;

	ПредставлениеНоменклатуры =  ПрефиксИПостфикс.Префикс + НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
			Строка(СтрокаТовары.ТоварНаименование), СтрокаТовары.Характеристика, , ,
		ДополнительныеПараметрыПолученияНаименованияДляПечати) + ПрефиксИПостфикс.Постфикс;

	ОбластьМакета.Параметры.ТоварНаименование = ПредставлениеНоменклатуры;

	Если ЕдиницаИзмеренияВеса <> Неопределено Тогда
		Если Не ЗначениеЗаполнено(ЕдиницаИзмеренияВеса) Тогда
			ДанныеСтроки.МассаБрутто = 0;
			ДанныеСтроки.МассаНетто = 0;
		Иначе
			ДанныеСтроки.МассаБрутто = СтрокаТовары.МассаБрутто;
			ДанныеСтроки.МассаНетто = СтрокаТовары.МассаНетто;
		КонецЕсли;
	КонецЕсли;

	ДанныеСтроки.Сумма = СтрокаТовары.Сумма + СтрокаТовары.СуммаНДС;
	ДанныеСтроки.Цена = ?(СтрокаТовары.Количество = 0, 0, ДанныеСтроки.Сумма / СтрокаТовары.Количество);

	Если СтрокаТовары.Весовой Тогда
		ДанныеСтроки.Мест = 0;
		ДанныеСтроки.Количество = 0;

		ОбластьМакета.Параметры.Количество = 0;
		ОбластьМакета.Параметры.КоличествоМест = 0;
		ОбластьМакета.Параметры.БазоваяЕдиницаНаименование = "";
		ОбластьМакета.Параметры.ВидУпаковки = "";

		Если ВыводитьЦены Тогда
			ОбластьМакета.Параметры.Цена = ДанныеСтроки.Цена / СтрокаТовары.КоэффициентПересчетаВТонны;
			ОбластьМакета.Параметры.Сумма = ДанныеСтроки.Сумма;
		КонецЕсли;
	Иначе
		Если СтрокаТовары.КоличествоМест - Цел(СтрокаТовары.КоличествоМест) > 0 Тогда
			ДанныеСтроки.Мест = Цел(СтрокаТовары.КоличествоМест) + 1;
		Иначе
			ДанныеСтроки.Мест = СтрокаТовары.КоличествоМест;
		КонецЕсли;
		ДанныеСтроки.Количество  = СтрокаТовары.Количество;

		ОбластьМакета.Параметры.Количество = ДанныеСтроки.Количество;
		ОбластьМакета.Параметры.КоличествоМест = ДанныеСтроки.Мест;
		ОбластьМакета.Параметры.БазоваяЕдиницаНаименование = СтрокаТовары.БазоваяЕдиницаНаименование;
		ОбластьМакета.Параметры.ВидУпаковки = СтрокаТовары.ВидУпаковки;

		Если ВыводитьЦены Тогда
			ОбластьМакета.Параметры.Цена = ДанныеСтроки.Цена;
			ОбластьМакета.Параметры.Сумма = ДанныеСтроки.Сумма;
		КонецЕсли;
	КонецЕсли;

	ОбластьМакета.Параметры.МассаНетто = Окр(СтрокаТовары.МассаНетто * КоэффициентПересчетаВТонны, 3,
		РежимОкругления.Окр15как20);

КонецПроцедуры // ЗаполнитьРеквизитыСтрокиТовара()

Процедура РассчитатьИтоговыеСуммыТТН(ИтоговыеСуммы, ДанныеСтроки)
	
	// Увеличим итоги по странице.
	ИтоговыеСуммы.ИтогоМестНаСтранице        = ИтоговыеСуммы.ИтогоМестНаСтранице + ДанныеСтроки.Мест;
	ИтоговыеСуммы.ИтогоКоличествоНаСтранице  = ИтоговыеСуммы.ИтогоКоличествоНаСтранице + ДанныеСтроки.Количество;
	ИтоговыеСуммы.ИтогоСуммаНаСтранице       = ИтоговыеСуммы.ИтогоСуммаНаСтранице + ДанныеСтроки.Сумма;
	ИтоговыеСуммы.ИтогоМассаБруттоНаСтранице = ИтоговыеСуммы.ИтогоМассаБруттоНаСтранице + ДанныеСтроки.МассаБрутто;
	ИтоговыеСуммы.ИтогоМассаНеттоНаСтранице  = ИтоговыеСуммы.ИтогоМассаНеттоНаСтранице + ДанныеСтроки.МассаНетто;
	
	// Увеличим итоги по документу.
	ИтоговыеСуммы.ИтогоМест        = ИтоговыеСуммы.ИтогоМест + ДанныеСтроки.Мест;
	ИтоговыеСуммы.ИтогоКоличество  = ИтоговыеСуммы.ИтогоКоличество + ДанныеСтроки.Количество;
	ИтоговыеСуммы.ИтогоСумма       = ИтоговыеСуммы.ИтогоСумма + ДанныеСтроки.Сумма;
	ИтоговыеСуммы.ИтогоМассаБрутто = ИтоговыеСуммы.ИтогоМассаБрутто + ДанныеСтроки.МассаБрутто;
	ИтоговыеСуммы.ИтогоМассаНетто  = ИтоговыеСуммы.ИтогоМассаНетто + ДанныеСтроки.МассаНетто;

КонецПроцедуры

Функция СтруктураИтоговыеСуммыТТН()

	Структура = Новый Структура;
	
	// Инициализация итогов по странице.
	Структура.Вставить("ИтогоМассаБруттоНаСтранице", 0);
	Структура.Вставить("ИтогоМестНаСтранице", 0);
	Структура.Вставить("ИтогоКоличествоНаСтранице", 0);
	Структура.Вставить("ИтогоСуммаНаСтранице", 0);
	Структура.Вставить("ИтогоМассаНеттоНаСтранице", 0);
	
	// Инициализация итогов по документу.
	Структура.Вставить("ИтогоМассаБрутто", 0);
	Структура.Вставить("ИтогоМест", 0);
	Структура.Вставить("ИтогоКоличество", 0);
	Структура.Вставить("ИтогоСумма", 0);
	Структура.Вставить("ИтогоМассаНетто", 0);

	Структура.Вставить("КоличествоПорядковыхНомеровЗаписейПрописью", 0);
	Структура.Вставить("СуммаПрописью", "");

	Возврат Структура;

КонецФункции // СтруктураИтоговыеСуммы()

Функция СтруктураДанныеСтрокиТТН()

	Структура = Новый Структура;
	Структура.Вставить("Номер", 0);
	Структура.Вставить("Мест", 0);
	Структура.Вставить("Количество", 0);
	Структура.Вставить("Цена", 0);
	Структура.Вставить("Сумма", 0);
	Структура.Вставить("МассаБрутто", 0);
	Структура.Вставить("МассаНетто", 0);

	Возврат Структура;

КонецФункции // СтруктураДанныеСтроки()

Процедура ОбнулитьИтогиПоСтраницеТТН(ИтоговыеСуммы)

	ИтоговыеСуммы.ИтогоМассаБруттоНаСтранице = 0;
	ИтоговыеСуммы.ИтогоМассаНеттоНаСтранице  = 0;
	ИтоговыеСуммы.ИтогоМестНаСтранице        = 0;
	ИтоговыеСуммы.ИтогоКоличествоНаСтранице  = 0;
	ИтоговыеСуммы.ИтогоСуммаНаСтранице       = 0;

КонецПроцедуры

Процедура ЗаполнитьНомераНакладныхВСтрокеТовараТТН(ДанныеПечати, ВыборкаНомеровТН, ДанныеСтроки, ОбластьМакета)

	СтрокаНомеровНакладных = НСтр("ru = 'Товары по накладным: %НомерНакладной%'", Метаданные.Языки.Русский.КодЯзыка);
	СтруктураПоиска = Новый Структура("ТранспортнаяНакладная", ДанныеПечати.Ссылка);

	ПредставленияНакладных = Новый Массив;

	Пока ВыборкаНомеровТН.НайтиСледующий(СтруктураПоиска) Цикл
		СтруктураШапки = Новый Структура("Дата, Номер");
		ЗаполнитьЗначенияСвойств(СтруктураШапки, ВыборкаНомеровТН);
		ПредставленияНакладных.Добавить(ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(СтруктураШапки));
	КонецЦикла;
	СтрокаНомеровНакладных = СтрЗаменить(СтрокаНомеровНакладных, "%НомерНакладной%", СтрСоединить(
		ПредставленияНакладных, ", "));

	ОбластьМакета.Параметры.ТоварНаименование = СтрокаНомеровНакладных;

	ОбластьМакета.Параметры.ТоварКод = "";

	ДанныеСтроки.МассаБрутто = 0;
	ДанныеСтроки.МассаНетто = 0;
	ДанныеСтроки.Сумма = 0;
	ДанныеСтроки.Цена = 0;
	ДанныеСтроки.Мест = 0;
	ДанныеСтроки.Количество  = 0;

	ОбластьМакета.Параметры.Цена = "";
	ОбластьМакета.Параметры.Сумма = "";
	ОбластьМакета.Параметры.Количество = "";
	ОбластьМакета.Параметры.КоличествоМест = "";
	ОбластьМакета.Параметры.БазоваяЕдиницаНаименование = "";
	ОбластьМакета.Параметры.ВидУпаковки = "";

КонецПроцедуры

Процедура ДобавитьИтоговыеДанныеПодвалаТТН(ИтоговыеСуммы, ВсегоНомеров, ВалютаРегламентированногоУчета)

	ИтоговыеСуммы.Вставить("КоличествоПорядковыхНомеровЗаписейПрописью", ЧислоПрописью(ВсегоНомеров, , ",,,,,,,,0"));
	ИтоговыеСуммы.Вставить("СуммаПрописью", РаботаСКурсамиВалют.СформироватьСуммуПрописью(ИтоговыеСуммы.ИтогоСумма,
		ВалютаРегламентированногоУчета));

КонецПроцедуры

Процедура ДобавитьИтоговыеДанныеПодвалаТТНДляНесколькихНакладных(ИтоговыеСуммы, ВсегоНомеров,
	ВалютаРегламентированногоУчета)

	ИтоговыеСуммы.Вставить("КоличествоПорядковыхНомеровЗаписейПрописью", ЧислоПрописью(ВсегоНомеров, , ",,,,,,,,0"));
	ИтоговыеСуммы.Вставить("СуммаПрописью", РаботаСКурсамиВалют.СформироватьСуммуПрописью(ИтоговыеСуммы.ИтогоСумма,
		ВалютаРегламентированногоУчета));

КонецПроцедуры

Процедура ЗаполнитьРеквизитыПодвалаТТН(ДанныеПечати, ИтоговыеСуммы, Макет, ТабличныйДокумент,
	ЕдиницаИзмеренияВеса = Неопределено, КоэффициентПересчетаВТонны = 0)

	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");

	ОбластьМакета.Параметры.ПолнаяДатаДокумента = Формат(ДанныеПечати.Дата, "ДЛФ=DD");
	
	// Главный бухгалтер
	ОбластьМакета.Параметры.ФИОГлавБухгалтера 	  = ДанныеПечати.ГлавныйБухгалтер;

	ОбластьМакета.Параметры.ФИОРуководителя 	  = ДанныеПечати.Руководитель;
	ОбластьМакета.Параметры.ДолжностьРуководителя = ДанныеПечати.ДолжностьРуководителя;

	ОбластьМакета.Параметры.ДолжностьКладовщика   = ДанныеПечати.Организация._ДолжностьКладовщика;
	ОбластьМакета.Параметры.ФИОКладовщика 		  = ДанныеПечати.Организация._Кладовщик;
	
	// Доверенность
	ОбластьМакета.Параметры.ДоверенностьНомер     = ДанныеПечати.ДоверенностьНомер;
	ОбластьМакета.Параметры.ДоверенностьДата      = Формат(ДанныеПечати.ДоверенностьДата, "ДЛФ=DD");
	ОбластьМакета.Параметры.ДоверенностьВыдана    = ДанныеПечати.ДоверенностьВыдана;
	ОбластьМакета.Параметры.ДоверенностьЧерезКого = ДанныеПечати.ДоверенностьЛицо;

	Если ИтоговыеСуммы.ИтогоМест > 0 Тогда
		ОбластьМакета.Параметры.ВсегоМестПрописью = ЧислоПрописью(ИтоговыеСуммы.ИтогоМест, , ",,,,,,,,0");
	КонецЕсли;
	
	МассаБрутто = AMS_Сервер.ПолучитьВесОбъемТоваров(ДанныеПечати.Ссылка.Товары.Выгрузить( , "Номенклатура,Количество"),
		ДанныеПечати.Ссылка.AMS_СпособПередачиТоваров).Вес;
	Если ЗначениеЗаполнено(ЕдиницаИзмеренияВеса) И МассаБрутто > 0 Тогда
		ПараметрыМассыПрописью = ПродажиСервер.ПараметрыМассыПрописью(МассаБрутто, 1);
		ОбластьМакета.Параметры.МассаГрузаБуттоПрописью = ЧислоПрописью(
			МассаБрутто * ПараметрыМассыПрописью.Коэффициент, "ДП=Истина", ПараметрыМассыПрописью.Формат);
		Если КоэффициентПересчетаВТонны <> 0 Тогда
			ОбластьМакета.Параметры.МассаГрузаБрутто = Окр(МассаБрутто, 3, РежимОкругления.Окр15как20);
		КонецЕсли;
	КонецЕсли;

	Если ЗначениеЗаполнено(ЕдиницаИзмеренияВеса) И ДанныеПечати.МассаНетто > 0 Тогда
		ПараметрыМассыПрописью = ПродажиСервер.ПараметрыМассыПрописью(ДанныеПечати.МассаНетто / 1000, 1);
		ОбластьМакета.Параметры.МассаГрузаНеттоПрописью = ЧислоПрописью(
			ДанныеПечати.МассаНетто / 1000 * ПараметрыМассыПрописью.Коэффициент, "ДП=Истина",
			ПараметрыМассыПрописью.Формат);
		Если КоэффициентПересчетаВТонны <> 0 Тогда
			ОбластьМакета.Параметры.МассаГрузаНетто = Окр(ДанныеПечати.МассаНетто / 1000, 3, РежимОкругления.Окр15как20);
		КонецЕсли;
	КонецЕсли;

	ОбластьМакета.Параметры.КоличествоПорядковыхНомеровЗаписейПрописью = ИтоговыеСуммы.КоличествоПорядковыхНомеровЗаписейПрописью;
	ОбластьМакета.Параметры.ВсегоНаименованийПрописью = ЧислоПрописью(ДанныеПечати.КоличествоНаименований, ,
		",,,,,,,,0");
	ОбластьМакета.Параметры.СуммаПрописью = ИтоговыеСуммы.СуммаПрописью;
	
	Если ТипЗнч(ДанныеПечати.Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Обработки.ПечатьОбщихФорм.амсУстановитьПараметрыПечати(ДанныеПечати, ОбластьМакета, "ТТН-Подвал");
	КонецЕсли;

	ТабличныйДокумент.Вывести(ОбластьМакета);

КонецПроцедуры // ЗаполнитьРеквизитыПодвалаТТН()

Процедура ЗаполнитьРеквизитыТранспортногоРазделаТТН(ДанныеПечати, Макет, ОбластьМакета)
	СведенияОПеревозчике = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Перевозчик, ДанныеПечати.Дата, ,
		ДанныеПечати.БанковскийСчетПеревозчика);
	СведенияОЗаказчикеПеревозок = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.ЗаказчикПеревозки,
		ДанныеПечати.Дата, , ДанныеПечати.БанковскийСчетЗаказчикаПеревозки);

	ОбластьМакета.Параметры.НомерДокумента = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеПечати.Номер);

	ОбластьМакета.Параметры.ПредставлениеПеревозчика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике,
		"ПолноеНаименование,ФактическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет");

	ОбластьМакета.Параметры.ПредставлениеЗаказчикаПеревозок	 = ФормированиеПечатныхФорм.ОписаниеОрганизации(
		СведенияОЗаказчикеПеревозок, "ПолноеНаименование,ФактическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет");

	ОбластьМакета.Параметры.ПредставлениеВодителя     = ДанныеПечати.Водитель;
	ОбластьМакета.Параметры.ВодительскоеУдостоверение = ОписаниеВодительскогоУдостоверения(
			ДанныеПечати.УдостоверениеСерия, ДанныеПечати.УдостоверениеНомер);

	ОбластьМакета.Параметры.Заполнить(ДанныеПечати);

	СтандартнаяКарточка  = ДанныеПечати.ЛицензионнаяКарточкаВид = "Стандартная";
	ОграниченнаяКарточка = ДанныеПечати.ЛицензионнаяКарточкаВид = "Ограниченная";

	Если СтандартнаяКарточка Или ОграниченнаяКарточка Тогда
		//@skip-check new-font
		ШрифтСтандарт   = Новый Шрифт(ОбластьМакета.Области.Стандарт.Шрифт, , , , , , Не СтандартнаяКарточка);
		//@skip-check new-font
		ШрифтОграничено = Новый Шрифт(ОбластьМакета.Области.Стандарт.Шрифт, , , , , , Не ОграниченнаяКарточка);
	КонецЕсли;

	ОбластьМакета.Области.Стандарт.Шрифт   = ШрифтСтандарт;
	ОбластьМакета.Области.Ограничено.Шрифт = ШрифтОграничено;

	Если ТипЗнч(ДанныеПечати.Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Обработки.ПечатьОбщихФорм.амсУстановитьПараметрыПечати(ДанныеПечати, ОбластьМакета, "ТТН-ТранспортныйРаздел");
	КонецЕсли;
КонецПроцедуры

Функция ОписаниеВодительскогоУдостоверения(Серия, Номер)

	ПредставлениеУдостоверения = "";
	Если Не ПустаяСтрока(Серия) Тогда
		ПредставлениеУдостоверения = СокрЛП(Серия) + ", ";
	КонецЕсли;

	ПредставлениеУдостоверения = ПредставлениеУдостоверения + Номер;

	Возврат ПредставлениеУдостоверения;

КонецФункции

#КонецОбласти

#Область Печать_СличительнаяВедомость

Функция СформироватьПечатнуюФормуСличительнаяВедомость(МассивОбъектов)
	УстановитьПривилегированныйРежим(Истина);

	ДокПересчет = МассивОбъектов[0];

	СКД        = УправлениеПечатью.МакетПечатнойФормы("Обработка.AMS_Продажи.скдСличительнаяВедомость");
	
	МакетШапки = УправлениеПечатью.МакетПечатнойФормы("Обработка.AMS_Продажи.СличительнаяВедомость");

	Настройки = СКД.НастройкиПоУмолчанию;
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Ссылка", ДокПересчет.Ссылка);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ВидыНоменклатурыПродукции", AMS_ВызовСервера.ВидыНоменклатурыПродукции());

	ДокументРезультат = Новый ТабличныйДокумент;

	ОбластьЗаголовок = МакетШапки.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовок.Параметры.НомерДокумента = ДокПересчет.Номер;
	ОбластьЗаголовок.Параметры.ДатаДокумента  = ДокПересчет.Дата;

	ДокументРезультат.Вывести(ОбластьЗаголовок);

	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;

	МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД, Настройки, ДанныеРасшифровки);

	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);

	ОбластьПодвал = МакетШапки.ПолучитьОбласть("Подвал");
	ДокументРезультат.Вывести(ОбластьПодвал);

	Возврат ДокументРезультат;
КонецФункции

#КонецОбласти

#Область Печать_ЭтикеткаПалетная

Функция СформироватьПалетнаяЭтикетка(МассивОбъектов)
	УстановитьПривилегированныйРежим(Истина);

	ДанныеДляПечати = ПолучитьДанныеДляПечатиПалетнаяЭтикетка(МассивОбъектов);

	ВыбПоШапке = ДанныеДляПечати.РезультатПоШапке.Выбрать();
	ВыбПоШапке.Следующий();

	ВыбПоНомерам = ДанныеДляПечати.РезультатПоНомерамУПД.Выбрать();
	УПД = "УПД: ";
	Пока ВыбПоНомерам.Следующий() Цикл
		УПД = УПД + ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ВыбПоНомерам.Номер) + " от " + Формат(
			ВыбПоНомерам.Дата, "ДЛФ=Д") + ", ";
	КонецЦикла;
	УПД = Лев(УПД, СтрДлина(УПД) - 2);

	КоличествоПалет = ВыбПоШапке.КоличествоПалет;

	ТабличныйДокумент = Новый ТабличныйДокумент;

	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.AMS_Продажи.ПалетнаяЭтикетка");

	ОбластьШапка      = Макет.ПолучитьОбласть("Шапка");
	ОбластьКлиент     = Макет.ПолучитьОбласть("Клиент");
	ОбластьПеревозчик = Макет.ПолучитьОбласть("Перевозчик");
	ОбластьПодвал     = Макет.ПолучитьОбласть("Подвал");

	ПервыйЛист = Истина;
	Для Сч = 1 По КоличествоПалет Цикл
		Если Не ПервыйЛист Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйЛист = Ложь;

		ОбластьШапка.Параметры.Организация = ВыбПоШапке.ОрганизацияНаименованиеСокращенное;
		ОбластьШапка.Параметры.Палета      = "ПАЛЕТА № " + Сч + "/" + ВыбПоШапке.КоличествоПалет;

		ОбластьШапка.Параметры.УПД = УПД;

		Если ВыбПоШапке.СпособПередачиТоваров = 0 Тогда
			ОбластьШапка.Параметры.Способ1 = "П";
			ОбластьШапка.Параметры.Способ2 = "ПАЛЕТАМИ";
		Иначе
			ОбластьШапка.Параметры.Способ1 = "К";
			ОбластьШапка.Параметры.Способ2 = "КОРОБКАМИ (КАНИСТРАМИ)";
		КонецЕсли;

		Если ВыбПоШапке.Обрешетка Тогда
			ОбластьШапка.Параметры.Способ3 = "С ОБРЕШЕТКОЙ";
		Иначе
			ОбластьШапка.Параметры.Способ3 = "БЕЗ ОБРЕШЕТКИ";
		КонецЕсли;

		ТабличныйДокумент.Вывести(ОбластьШапка);

		ОбластьКлиент.Параметры.Покупатель = ВыбПоШапке.ПокупательНаименованиеПолное + ", ИНН "
			+ ВыбПоШапке.ПокупательИНН + ?(ПустаяСтрока(ВыбПоШапке.ПокупательКПП), "", " / КПП "
			+ ВыбПоШапке.ПокупательКПП);

		Если ЗначениеЗаполнено(ВыбПоШапке.Грузополучатель) Тогда
			ОбластьКлиент.Параметры.Грузополучатель = ВыбПоШапке.ГрузополучательНаименованиеПолное + ", ИНН "
				+ ВыбПоШапке.ГрузополучательИНН + ?(ПустаяСтрока(ВыбПоШапке.ГрузополучательКПП), "", " / КПП "
				+ ВыбПоШапке.ГрузополучательКПП);
		Иначе
			ОбластьКлиент.Параметры.Грузополучатель = "он же";
		КонецЕсли;

		ТабличныйДокумент.Вывести(ОбластьКлиент);

		Если ЗначениеЗаполнено(ВыбПоШапке.Перевозчик) Тогда
			ОбластьПеревозчик.Параметры.Перевозчик = ВыбПоШапке.ПеревозчикНаименование;
			ОбластьПеревозчик.Параметры.АдресДоставкиДоПеревозчика = ВыбПоШапке.АдресДоставкиПеревозчика;

			ТабличныйДокумент.Вывести(ОбластьПеревозчик);
		КонецЕсли;

		ОбластьПодвал.Параметры.АдресДоставки    = ВыбПоШапке.АдресДоставки;
		ОбластьПодвал.Параметры.УсловияДоставки  = ВыбПоШапке.ДополнительнаяИнформацияПоДоставке;
		ОбластьПодвал.Параметры.Грузоотправитель = ВыбПоШапке.ОрганизацияНаименованиеСокращенное + ", ИНН "
			+ ВыбПоШапке.ОрганизацияИНН + " / КПП " + ВыбПоШапке.ОрганизацияКПП + ".";

		ТабличныйДокумент.Вывести(ОбластьПодвал);
	КонецЦикла;

	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.АвтоМасштаб        = Истина;

	Возврат ТабличныйДокумент;
КонецФункции

Функция ПолучитьДанныеДляПечатиПалетнаяЭтикетка(МассивОбъектов)
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОбЗагр.Партнер КАК Клиент,
	|	ОбЗагр.Партнер.НаименованиеПолное КАК ПартнерНаименованиеПолное,
	|	ОбЗагр.СпособДоставки КАК СпособДоставки,
	|	ОбЗагр.ВремяДоставкиС КАК ВремяДоставкиС,
	|	ОбЗагр.ВремяДоставкиПо КАК ВремяДоставкиПо,
	|	ОбЗагр.Обрешетка КАК Обрешетка,
	|	ОбЗагр.СпособПередачиТоваров КАК СпособПередачиТоваров,
	|	ОбЗагр.УсловияОтгрузки КАК УсловияОтгрузки,
	|	ОбЗагр.AMS_КоличествоПалет КАК КоличествоПалет,
	|	ОбЗагр.AMS_Вес КАК Вес,
	|	ОбЗагр.AMS_Объем КАК Объем,
	|	ОбЗагр.СуммаДокумента КАК СуммаДокумента,
	|	ОбЗагр.Ссылка КАК Ссылка,
	|	1 КАК Связь
	|ПОМЕСТИТЬ док1
	|ИЗ
	|	Документ.AMS_ОбъединеннаяЗагрузка КАК ОбЗагр
	|ГДЕ
	|	ОбЗагр.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Реал.Партнер,
	|	Реал.Партнер.НаименованиеПолное,
	|	Реал.СпособДоставки,
	|	Реал.ВремяДоставкиС,
	|	Реал.ВремяДоставкиПо,
	|	Реал.AMS_Обрешетка,
	|	Реал.AMS_СпособПередачиТоваров,
	|	Реал.AMS_УсловияОтгрузки,
	|	Реал.AMS_КоличествоПалет,
	|	Реал.AMS_Вес,
	|	Реал.AMS_Объем,
	|	Реал.СуммаДокумента,
	|	Реал.Ссылка,
	|	1
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК Реал
	|ГДЕ
	|	Реал.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбЗагр.Реализация КАК Реализация
	|ПОМЕСТИТЬ док2
	|ИЗ
	|	док1 КАК док1
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.AMS_ОбъединеннаяЗагрузка.Реализации КАК ОбЗагр
	|		ПО док1.Ссылка = ОбЗагр.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	док1.Ссылка
	|ИЗ
	|	док1 КАК док1
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК Реал
	|		ПО док1.Ссылка = Реал.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Реал.Организация КАК Организация,
	|	Реал.Контрагент КАК Покупатель,
	|	Реал.Грузополучатель КАК Грузополучатель,
	|	Реал.ПеревозчикПартнер КАК Перевозчик,
	|	Реал.ПеревозчикПартнер.НаименованиеПолное КАК ПеревозчикНаименование,
	|	Реал.АдресДоставкиПеревозчика КАК АдресДоставкиПеревозчика,
	|	Реал.ДополнительнаяИнформацияПоДоставке КАК ДополнительнаяИнформацияПоДоставке,
	|	Реал.АдресДоставки КАК АдресДоставки
	|ПОМЕСТИТЬ шапка
	|ИЗ
	|	док2 КАК док2
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК Реал
	|		ПО док2.Реализация = Реал.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	шапка.Организация.НаименованиеСокращенное КАК ОрганизацияНаименованиеСокращенное,
	|	шапка.Организация.ИНН КАК ОрганизацияИНН,
	|	шапка.Организация.КПП КАК ОрганизацияКПП,
	|	док1.КоличествоПалет КАК КоличествоПалет,
	|	шапка.Покупатель.НаименованиеПолное КАК ПокупательНаименованиеПолное,
	|	шапка.Покупатель.ИНН КАК ПокупательИНН,
	|	шапка.Покупатель.КПП КАК ПокупательКПП,
	|	шапка.Грузополучатель КАК Грузополучатель,
	|	шапка.Грузополучатель.НаименованиеПолное КАК ГрузополучательНаименованиеПолное,
	|	шапка.Грузополучатель.ИНН КАК ГрузополучательИНН,
	|	шапка.Грузополучатель.КПП КАК ГрузополучательКПП,
	|	шапка.Перевозчик КАК Перевозчик,
	|	шапка.ПеревозчикНаименование КАК ПеревозчикНаименование,
	|	шапка.АдресДоставкиПеревозчика КАК АдресДоставкиПеревозчика,
	|	шапка.АдресДоставки КАК АдресДоставки,
	|	шапка.ДополнительнаяИнформацияПоДоставке КАК ДополнительнаяИнформацияПоДоставке,
	|	док1.СпособПередачиТоваров КАК СпособПередачиТоваров,
	|	док1.Обрешетка КАК Обрешетка
	|ИЗ
	|	док1 КАК док1,
	|	шапка КАК шапка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Реал.Номер КАК Номер,
	|	Реал.Дата КАК Дата
	|ИЗ
	|	док2 КАК док2
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК Реал
	|		ПО док2.Реализация = Реал.Ссылка";

	Рез = Запрос.ВыполнитьПакет();
	РезультатПоШапке = Рез[3];
	РезультатПоНомерамУПД = Рез[4];

	Возврат Новый Структура("РезультатПоШапке,РезультатПоНомерамУПД", РезультатПоШапке, РезультатПоНомерамУПД);
КонецФункции

#КонецОбласти

#Область Печать_ЗаявкаПеревозчику

Функция СформироватьЗаявкаПеревозчику(МассивОбъектов) Экспорт
	УстановитьПривилегированныйРежим(Истина);

	ДанныеДляПечати = ПолучитьДанныеДляПечатиЗаявкаПеревозчику(МассивОбъектов);

	Шапка = ДанныеДляПечати.РезультатПоШапке.Выбрать();
	Шапка.Следующий();

	Табл = ДанныеДляПечати.РезультатПоНомерамУПД.Выгрузить();

	МассивРеализаций = Табл.ВыгрузитьКолонку("Реализация");
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивРеализаций", МассивРеализаций);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МИНИМУМ(д.AMS_СпособПередачиТоваров) КАК СпособПередачиТоваров
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК д
	|ГДЕ
	|	д.Ссылка В(&МассивРеализаций)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.Количество КАК Количество
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК т
	|ГДЕ
	|	т.Ссылка В(&МассивРеализаций)";

	Рез = Запрос.ВыполнитьПакет();

	Выб = Рез[0].Выбрать();
	Выб.Следующий();
	СпособПередачиТоваров = Выб.СпособПередачиТоваров;

	Товары = Рез[1].Выгрузить();

	Данные = AMS_Сервер.ПолучитьВесОбъемТоваров(Товары, СпособПередачиТоваров);

	УПД = "УПД №: ";
	Для Каждого Стр Из Табл Цикл
		УПД = УПД + ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Стр.Номер) + " от " + Формат(Стр.Дата, "ДЛФ=Д") + ", ";
	КонецЦикла;
	УПД = Лев(УПД, СтрДлина(УПД) - 2);

	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб        = Истина;

	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.AMS_Продажи.ЗаявкаПеревозчику");
	ОблШапка = Макет.ПолучитьОбласть("Шапка");

	ОблШапка.Параметры.Заполнить(Шапка);
	ОблШапка.Параметры.Дата = "Дата составления: " + Формат(Шапка.Дата, "ДЛФ=ДД");
	ОблШапка.Параметры.Номер = ?(ПустаяСтрока(Шапка.Номер), "№ б/н", "№ " + Шапка.Номер);
	ОблШапка.Параметры.ТелефонПеревозчика = AMS_ВызовСервера.ПолучитьТелефонПартнера(Шапка.Перевозчик);
	ОблШапка.Параметры.Контрагент = Шапка.КонтрагентНаименование + ", ИНН " + Шапка.КонтрагентИНН + ?(ПустаяСтрока(
		Шапка.КонтрагентКПП), "", " / КПП " + Шапка.КонтрагентКПП);
	ОблШапка.Параметры.Грузополучатель = Шапка.ГрузополучательНаименование + ", ИНН " + Шапка.ГрузополучательИНН + ?(
		ПустаяСтрока(Шапка.ГрузополучательКПП), "", " / КПП " + Шапка.ГрузополучательКПП);
	ОблШапка.Параметры.ТелефонПолучателя = AMS_ВызовСервера.ПолучитьТелефонПартнера(Шапка.Клиент);
	ОблШапка.Параметры.СпособПередачиТоваров = ?(Шапка.СпособПередачиТоваров = 0, "Палетами. ",
		"Коробками (канистрами). ");
	ОблШапка.Параметры.КоличествоУпаковок = ?(Шапка.СпособПередачиТоваров = 0, Шапка.КоличествоПалет, Данные.КоличествоУпаковок);
	ОблШапка.Параметры.Вес   = Окр(Данные.Вес, 3);
	ОблШапка.Параметры.Объем = Окр(Данные.Объем, 3);
	ОблШапка.Параметры.ВидТранспорта = ?(Шапка.ВидТранспорта = "Авто", "АВТО", "Ж/Д");
	ОблШапка.Параметры.Обрешетка = ?(Шапка.Обрешетка, "ДА", "НЕТ");
	ОблШапка.Параметры.Грузоотправитель = Шапка.ГрузоотправительНаименование + ", ИНН " + Шапка.ГрузоотправительИНН
		+ " / КПП " + Шапка.ГрузоотправительКПП;
	ОблШапка.Параметры.УПД = УПД;

	ТабДок.Вывести(ОблШапка);

	Возврат ТабДок;
КонецФункции

Функция ПолучитьДанныеДляПечатиЗаявкаПеревозчику(МассивОбъектов)
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОбЗагр.Дата КАК Дата,
	|	ОбЗагр.Партнер КАК Клиент,
	|	ОбЗагр.Партнер.НаименованиеПолное КАК ПартнерНаименованиеПолное,
	|	ОбЗагр.Обрешетка КАК Обрешетка,
	|	ОбЗагр.AMS_КоличествоПалет КАК КоличествоПалет,
	|	ОбЗагр.СпособПередачиТоваров КАК СпособПередачиТоваров,
	|	ОбЗагр.Ссылка КАК Ссылка,
	|	1 КАК Связь
	|ПОМЕСТИТЬ док1
	|ИЗ
	|	Документ.AMS_ОбъединеннаяЗагрузка КАК ОбЗагр
	|ГДЕ
	|	ОбЗагр.Ссылка В(&МассивОбъектов)
	|	И ОбЗагр.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Реал.Дата,
	|	Реал.Партнер,
	|	Реал.Партнер.НаименованиеПолное,
	|	Реал.AMS_Обрешетка,
	|	Реал.AMS_КоличествоПалет,
	|	Реал.AMS_СпособПередачиТоваров,
	|	Реал.Ссылка,
	|	1
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК Реал
	|ГДЕ
	|	Реал.Ссылка В(&МассивОбъектов)
	|	И Реал.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбЗагр.Реализация КАК Реализация
	|ПОМЕСТИТЬ док2
	|ИЗ
	|	док1 КАК док1
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.AMS_ОбъединеннаяЗагрузка.Реализации КАК ОбЗагр
	|		ПО док1.Ссылка = ОбЗагр.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	док1.Ссылка
	|ИЗ
	|	док1 КАК док1
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК Реал
	|		ПО док1.Ссылка = Реал.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Реал.AMS_НомерЗаявкиПеревозчика КАК Номер,
	|	Реал.ПеревозчикПартнер КАК Перевозчик,
	|	Реал.АдресДоставкиПеревозчика КАК АдресДоставкиПеревозчика,
	|	Реал.AMS_ВидТранспортаПеревозчика КАК ВидТранспорта,
	|	Реал.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА Реал.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Реал.Контрагент
	|		ИНАЧЕ Реал.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	Реал.АдресДоставки КАК АдресДоставки,
	|	Реал.Организация КАК Грузоотправитель,
	|	Реал.Менеджер КАК Менеджер,
	|	1 КАК Связь
	|ПОМЕСТИТЬ шапка
	|ИЗ
	|	док2 КАК док2
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК Реал
	|		ПО док2.Реализация = Реал.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	док1.Дата КАК Дата,
	|	шапка.Номер КАК Номер,
	|	шапка.Перевозчик КАК Перевозчик,
	|	Партнеры.НаименованиеПолное КАК ПеревозчикНаименование,
	|	шапка.АдресДоставкиПеревозчика КАК АдресДоставкиПеревозчика,
	|	шапка.ВидТранспорта КАК ВидТранспорта,
	|	док1.Клиент КАК Клиент,
	|	шапка.Контрагент КАК Контрагент,
	|	Контр1.НаименованиеПолное КАК КонтрагентНаименование,
	|	Контр1.ИНН КАК КонтрагентИНН,
	|	Контр1.КПП КАК КонтрагентКПП,
	|	шапка.Грузополучатель КАК Грузополучатель,
	|	Контр2.НаименованиеПолное КАК ГрузополучательНаименование,
	|	Контр2.ИНН КАК ГрузополучательИНН,
	|	Контр2.КПП КАК ГрузополучательКПП,
	|	шапка.АдресДоставки КАК АдресДоставки,
	|	док1.СпособПередачиТоваров КАК СпособПередачиТоваров,
	|	док1.КоличествоПалет КАК КоличествоПалет,
	|	док1.Обрешетка КАК Обрешетка,
	|	шапка.Грузоотправитель КАК Грузоотправитель,
	|	Орг.НаименованиеСокращенное КАК ГрузоотправительНаименование,
	|	Орг.ИНН КАК ГрузоотправительИНН,
	|	Орг.КПП КАК ГрузоотправительКПП,
	|	шапка.Менеджер КАК Менеджер
	|ИЗ
	|	док1 КАК док1
	|		ЛЕВОЕ СОЕДИНЕНИЕ шапка КАК шапка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры КАК Партнеры
	|			ПО шапка.Перевозчик = Партнеры.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контр1
	|			ПО шапка.Контрагент = Контр1.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контр2
	|			ПО шапка.Грузополучатель = Контр2.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Орг
	|			ПО шапка.Грузоотправитель = Орг.Ссылка
	|		ПО док1.Связь = шапка.Связь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	док2.Реализация КАК Реализация,
	|	Реал.Номер КАК Номер,
	|	Реал.Дата КАК Дата
	|ИЗ
	|	док2 КАК док2
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК Реал
	|		ПО док2.Реализация = Реал.Ссылка";

	Рез = Запрос.ВыполнитьПакет();
	РезультатПоШапке = Рез[3];
	РезультатПоНомерамУПД = Рез[4];

	Возврат Новый Структура("РезультатПоШапке,РезультатПоНомерамУПД", РезультатПоШапке, РезультатПоНомерамУПД);
КонецФункции

#КонецОбласти

#Область Печать_ПрайсЛист

Функция СформироватьПрайсЛист(Парам) Экспорт
	Результат = Новый ТабличныйДокумент;
	Результат.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	Результат.АвтоМасштаб        = Истина;

	ТипПрайса     = Парам.ТипПрайса;
	ВариантПрайса = Парам.ВариантПрайса;

	ПрайсБазовый = Не (ВариантПрайса = 1 Или ВариантПрайса = 2 Или ВариантПрайса = 3 Или ВариантПрайса = 4);

	ИмяМакета = "Обработка._ПрайсЛист.ПрайсЛист";
	Если ПрайсБазовый Тогда
		ИмяМакета = ИмяМакета + Парам.ВариантПрайса;
	КонецЕсли;
	Макет = УправлениеПечатью.МакетПечатнойФормы(ИмяМакета);

	ЦеноваяГруппа = Парам.ЦеноваяГруппа;
	Если Парам.Организация = AMS_ВызовСервера.ОрганизацияТД() Тогда
		Если ЦеноваяГруппа.Количество() = 2 Тогда
			ОблЗаголовок = Макет.ПолучитьОбласть("ТД_ЗМ");
		Иначе
			Если ЦеноваяГруппа[0] = AMS_ВызовСервера.ЦеноваяГруппаМЕГА() Тогда
				ОблЗаголовок = Макет.ПолучитьОбласть("ТД_М");
			Иначе
				ОблЗаголовок = Макет.ПолучитьОбласть("ТД_З");
			КонецЕсли;
		КонецЕсли;

	Иначе
		Если ЦеноваяГруппа.Количество() = 2 Тогда
			ОблЗаголовок = Макет.ПолучитьОбласть("Кемикал_ЗМ");
		Иначе
			Если ЦеноваяГруппа[0] = AMS_ВызовСервера.ЦеноваяГруппаМЕГА() Тогда
				ОблЗаголовок = Макет.ПолучитьОбласть("Кемикал_М");
			Иначе
				ОблЗаголовок = Макет.ПолучитьОбласть("Кемикал_З");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	ОблЗаголовок.Параметры.Дата = "Действителен с " + Формат(Парам.Дата, "ДЛФ=ДД");
	Результат.Вывести(ОблЗаголовок);

	Табл = ПолучитьСтруктуруПродукции(ВариантПрайса, ЦеноваяГруппа);

	Если ТипПрайса = 1 Тогда
		ВывестиПрайсЛистТип1(Результат, Макет, Табл, Парам);

	ИначеЕсли ТипПрайса = 2 Тогда
		ВывестиПрайсЛистТип2(Результат, Макет, Табл, Парам);

	ИначеЕсли ТипПрайса = 3 Тогда
		ВывестиПрайсЛистТип3(Результат, Макет, Табл, Парам);

		КолСтр = Результат.ВысотаТаблицы;
		КолКол = Результат.ШиринаТаблицы;

		Для Стр = 1 По КолСтр Цикл
			Для Кол = 1 По КолКол Цикл
				ОбластьКартинки = Результат.Область(Стр, Кол);
				ФайлКартинки    = ОбластьКартинки.Расшифровка;

				Если ЗначениеЗаполнено(ФайлКартинки) И ТипЗнч(ФайлКартинки) = Тип(
					"СправочникСсылка.НоменклатураПрисоединенныеФайлы") Тогда
					ПутьКФайлу = "\\AMSSERVN\1sbdb\1C_DB\1C_Filestoms\" + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
						ФайлКартинки, "ПутьКФайлу");
					Картинка = Новый Картинка(ПутьКФайлу);
					КартинкаВДокументе = Результат.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
					КартинкаВДокументе.Картинка = Картинка;
					КартинкаВДокументе.РазмерКартинки = РазмерКартинки.АвтоРазмер;

					КартинкаВДокументе.Расположить(ОбластьКартинки);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	Возврат Результат;
КонецФункции

Процедура ВывестиПрайсЛистТип1(Результат, Макет, Табл, Парам)
	МассивВыводимыхОбластей = Новый Массив;

	ОблШапка  = Макет.ПолучитьОбласть("Шапка");
	ОблПодвал = Макет.ПолучитьОбласть("Подвал");

	Результат.Вывести(ОблШапка);

	Номер = 0;
	НомерГруппы = 0;
	КолСтрок    = Табл.Количество();
	Для Каждого Стр Из Табл Цикл
		НомерСтроки = Табл.Индекс(Стр) + 1;

		ЭтоГруппа = Не ЗначениеЗаполнено(Стр.ВидПродукции);

		Если ЭтоГруппа Тогда
			НомерГруппы = НомерГруппы + 1;
			Обл = Макет.ПолучитьОбласть("Родитель");
			Обл.Параметры.Родитель = Стр.Родитель;

			МассивВыводимыхОбластей.Добавить(Обл);

		Иначе
			Если Стр.ВидПродукции.Товары.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;

			Номер = Номер + 1;

			Обл = Макет.ПолучитьОбласть(Стр.Макет);

			ПараметрыОбласти = Обл.Параметры;

			ЗаполнитьЗначенияСвойств(ПараметрыОбласти, Стр);

			ПараметрыОбласти.Номер = Номер;
			
			//@skip-check query-in-loop
			ДополнитьПараметрыОбласти(ПараметрыОбласти, Стр, Парам);

			МассивВыводимыхОбластей.Добавить(Обл);
		КонецЕсли;

		Если ЭтоГруппа Тогда
			Если Парам.ВариантПрайса <= 3 Тогда //По соглашению и Произвольные цены
				Если НомерГруппы = 3 Или НомерГруппы = 14 Тогда
					Результат.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЕсли;

			ИначеЕсли Парам.ВариантПрайса = 5 Тогда //Базовые цены
				Если НомерГруппы = 2 Тогда
					Результат.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЕсли;

			ИначеЕсли Парам.ВариантПрайса = 6 Тогда //Оптовые цены
				Если НомерГруппы = 3 Тогда
					Результат.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЕсли;

			ИначеЕсли Парам.ВариантПрайса = 7 Тогда //Базовые цены МЕГА
				Если НомерГруппы = 5 Тогда
					Результат.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;

		Если Не Результат.ПроверитьВывод(МассивВыводимыхОбластей) Тогда
			Результат.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		Если НомерСтроки = КолСтрок Тогда
			МассивВыводимыхОбластей.Добавить(ОблПодвал);

			Если Не Результат.ПроверитьВывод(МассивВыводимыхОбластей) Тогда
				Результат.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
		КонецЕсли;

		Результат.Вывести(Обл);

		МассивВыводимыхОбластей.Очистить();
	КонецЦикла;

	Если Парам.Организация = AMS_ВызовСервера.ОрганизацияАМСНовая() Тогда
		ОблПодвал.Параметры.Директор = "Директор ___________________________ /Огнев Эдуард Викторович/";
	Иначе
		ОблПодвал.Параметры.Директор = "Генеральный директор ___________________________ /Огнев Эдуард Викторович/";
	КонецЕсли;

	Результат.Вывести(ОблПодвал);
КонецПроцедуры

Процедура ВывестиПрайсЛистТип2(Результат, Макет, Табл, Парам)
	ОблШапка  = Макет.ПолучитьОбласть("Шапка");
	ОблГруппа = Макет.ПолучитьОбласть("Родитель");
	ОблСтрока = Макет.ПолучитьОбласть("Строка");
	ОблПодвал = Макет.ПолучитьОбласть("Подвал");

	Результат.Вывести(ОблШапка);

	Номер = 0;
	НомерГруппы = 0;
	Для Каждого Стр Из Табл Цикл

		ЭтоГруппа = Не ЗначениеЗаполнено(Стр.ВидПродукции);

		Если ЭтоГруппа Тогда
			НомерГруппы = НомерГруппы + 1;
			ОблГруппа.Параметры.Родитель = Стр.Родитель;
			Результат.Вывести(ОблГруппа);

		Иначе
			//@skip-check query-in-loop
			Товары = ПолучитьЦенуПродукции(Стр.ВидПродукции, Парам);

			Для Каждого Выб Из Товары Цикл
				Номер = Номер + 1;
				ЗаполнитьЗначенияСвойств(ОблСтрока.Параметры, Выб);
				ОблСтрока.Параметры.Номер = Номер;
				Результат.Вывести(ОблСтрока);
			КонецЦикла;
		КонецЕсли;

	КонецЦикла;

	Если Парам.Организация = AMS_ВызовСервера.ОрганизацияАМСНовая() Тогда
		ОблПодвал.Параметры.Директор = "Директор _______________ /Огнев Эдуард Викторович/";
	Иначе
		ОблПодвал.Параметры.Директор = "Генеральный директор ________________ /Огнев Эдуард Викторович/";
	КонецЕсли;
	Результат.Вывести(ОблПодвал);
КонецПроцедуры

Процедура ВывестиПрайсЛистТип3(Результат, Макет, Табл, Парам)
	ОблШапка  = Макет.ПолучитьОбласть("Шапка");
	ОблГруппа = Макет.ПолучитьОбласть("Родитель");
	ОблПодвал = Макет.ПолучитьОбласть("Подвал");
	ОблСтрока   = Макет.ПолучитьОбласть("Строка3");

	Результат.Вывести(ОблШапка);

	Номер = 0;
	НомерГруппы = 0;
	Для Каждого Стр Из Табл Цикл
		ЭтоГруппа = Не ЗначениеЗаполнено(Стр.ВидПродукции);

		Если ЭтоГруппа Тогда
			НомерГруппы = НомерГруппы + 1;
			ОблГруппа.Параметры.Родитель = Стр.Родитель;
			Результат.Вывести(ОблГруппа);

		Иначе
			//@skip-check query-in-loop
			Товары = ПолучитьЦенуПродукции(Стр.ВидПродукции, Парам);

			Для Каждого Выб Из Товары Цикл
				Номер = Номер + 1;
				ЗаполнитьЗначенияСвойств(ОблСтрока.Параметры, Выб);
				ОблСтрока.Параметры.Номер = Номер;
				Результат.Вывести(ОблСтрока);
			КонецЦикла;
		КонецЕсли;

	КонецЦикла;

	Если Парам.Организация = AMS_ВызовСервера.ОрганизацияАМСНовая() Тогда
		ОблПодвал.Параметры.Директор = "Директор _______________ /Огнев Эдуард Викторович/";
	Иначе
		ОблПодвал.Параметры.Директор = "Генеральный директор ________________ /Огнев Эдуард Викторович/";
	КонецЕсли;
	Результат.Вывести(ОблПодвал);
КонецПроцедуры

Процедура ДополнитьПараметрыОбласти(ПараметрыОбласти, Стр, Парам)
	ВидПродукции = Стр.ВидПродукции;

	Товары = ПолучитьЦенуПродукции(ВидПродукции, Парам);

	Для Каждого Выб Из Товары Цикл
		Сч = Выб.НомерСтроки;

		Попытка
			ПараметрыОбласти["Артикул" + Сч] = Выб.Артикул;
		Исключение
			// Обработка исключения не требуется
			А = 1;
		КонецПопытки;

		Попытка
			ПараметрыОбласти["Наименование" + Сч] = Выб.Наименование;
		Исключение
			// Обработка исключения не требуется
			А = 1;
		КонецПопытки;

		Попытка
			ПараметрыОбласти["Вес" + Сч] = ПреобразоватьСтроку(Выб.Вес);
		Исключение
			// Обработка исключения не требуется
			А = 1;
		КонецПопытки;

		Попытка
			ПараметрыОбласти["Количество" + Сч] = ПреобразоватьСтроку(Выб.Количество);
		Исключение
			// Обработка исключения не требуется
			А = 1;
		КонецПопытки;

		Попытка
			ПараметрыОбласти["Цена1БезНДС" + Сч] = Выб.Цена1БезНДС;
			ПараметрыОбласти["Цена1СНДС" + Сч]   = Выб.Цена1СНДС;
			ПараметрыОбласти["Цена2БезНДС" + Сч] = Выб.Цена2БезНДС;
			ПараметрыОбласти["Цена2СНДС" + Сч]   = Выб.Цена2СНДС;
			ПараметрыОбласти["Цена3БезНДС" + Сч] = Выб.Цена3БезНДС;
			ПараметрыОбласти["Цена3СНДС" + Сч]   = Выб.Цена3СНДС;
			ПараметрыОбласти["Цена4БезНДС" + Сч] = Выб.Цена4БезНДС;
			ПараметрыОбласти["Цена4СНДС" + Сч]   = Выб.Цена4СНДС;
			ПараметрыОбласти["Цена5БезНДС" + Сч] = Выб.Цена5БезНДС;
			ПараметрыОбласти["Цена5СНДС" + Сч]   = Выб.Цена5СНДС;
			ПараметрыОбласти["Цена6БезНДС" + Сч] = Выб.Цена6БезНДС;
			ПараметрыОбласти["Цена6СНДС" + Сч]   = Выб.Цена6СНДС;
		Исключение
			// Обработка исключения не требуется
			Если А = 1 Тогда
				А = 1;
			КонецЕсли;
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьЦенуПродукции(ВидПродукции, Парам)
	Цены = Новый ТаблицаЗначений;
	Цены.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Цены.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число"));

	ЦеныСоглашения = Парам.ЦеныСоглашения;
	Для Каждого Стр Из ЦеныСоглашения Цикл
		НовСтр = Цены.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Стр);
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидПродукции", ВидПродукции);
	Запрос.УстановитьПараметр("ТипПрайса", Парам.ТипПрайса);
	Запрос.УстановитьПараметр("Период", КонецДня(Парам.Период));
	Запрос.УстановитьПараметр("ВидЦены1", Парам.ВидЦены1);
	Запрос.УстановитьПараметр("ВидЦены2", Парам.ВидЦены2);
	Запрос.УстановитьПараметр("ВидЦены3", Парам.ВидЦены3);
	Запрос.УстановитьПараметр("ВидЦены4", Парам.ВидЦены4);
	Запрос.УстановитьПараметр("ВидЦены5", Парам.ВидЦены5);
	Запрос.УстановитьПараметр("ВидЦены6", Парам.ВидЦены6);
	Запрос.УстановитьПараметр("Цены", Цены);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.Цена КАК Цена
	|ПОМЕСТИТЬ ц
	|ИЗ
	|	&Цены КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА &ТипПрайса = 1
	|			ТОГДА т.НомерСтроки
	|		ИНАЧЕ т.Номер
	|	КОНЕЦ КАК НомерСтроки,
	|	т.Наименование КАК Наименование,
	|	т.Вес КАК Вес,
	|	т.Количество КАК Количество,
	|	т.Номенклатура КАК Номенклатура,
	|	ном.НаименованиеПолное КАК Представление,
	|	ном.Артикул КАК Артикул,
	|	ном.ВесЧислитель КАК ВесУпак,
	|	ном.КоэффициентЕдиницыДляОтчетов КАК КолУпак,
	|	ном.ФайлКартинки КАК ФайлКартинки
	|ПОМЕСТИТЬ тов
	|ИЗ
	|	Справочник._ПродукцияКомпании.Товары КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК ном
	|		ПО т.Номенклатура = ном.Ссылка
	|ГДЕ
	|	т.Ссылка = &ВидПродукции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(т.Период) КАК Период,
	|	т.ВидЦены КАК ВидЦены,
	|	т.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ вц1
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры КАК т
	|ГДЕ
	|	т.ВидЦены В (&ВидЦены1)
	|	И т.Период <= &Период
	|	И т.Номенклатура В
	|		(ВЫБРАТЬ
	|			т.Номенклатура КАК Номенклатура
	|		ИЗ
	|			тов КАК т)
	|СГРУППИРОВАТЬ ПО
	|	т.ВидЦены,
	|	т.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(т.Период) КАК Период,
	|	т.ВидЦены КАК ВидЦены,
	|	т.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ вц2
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры КАК т
	|ГДЕ
	|	т.ВидЦены В (&ВидЦены2)
	|	И т.Период <= &Период
	|	И т.Номенклатура В
	|		(ВЫБРАТЬ
	|			т.Номенклатура КАК Номенклатура
	|		ИЗ
	|			тов КАК т)
	|СГРУППИРОВАТЬ ПО
	|	т.ВидЦены,
	|	т.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(т.Период) КАК Период,
	|	т.ВидЦены КАК ВидЦены,
	|	т.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ вц3
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры КАК т
	|ГДЕ
	|	т.ВидЦены В (&ВидЦены3)
	|	И т.Период <= &Период
	|	И т.Номенклатура В
	|		(ВЫБРАТЬ
	|			т.Номенклатура КАК Номенклатура
	|		ИЗ
	|			тов КАК т)
	|СГРУППИРОВАТЬ ПО
	|	т.ВидЦены,
	|	т.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(т.Период) КАК Период,
	|	т.ВидЦены КАК ВидЦены,
	|	т.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ вц4
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры КАК т
	|ГДЕ
	|	т.ВидЦены В (&ВидЦены4)
	|	И т.Период <= &Период
	|	И т.Номенклатура В
	|		(ВЫБРАТЬ
	|			т.Номенклатура КАК Номенклатура
	|		ИЗ
	|			тов КАК т)
	|СГРУППИРОВАТЬ ПО
	|	т.ВидЦены,
	|	т.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(т.Период) КАК Период,
	|	т.ВидЦены КАК ВидЦены,
	|	т.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ вц5
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры КАК т
	|ГДЕ
	|	т.ВидЦены В (&ВидЦены5)
	|	И т.Период <= &Период
	|	И т.Номенклатура В
	|		(ВЫБРАТЬ
	|			т.Номенклатура КАК Номенклатура
	|		ИЗ
	|			тов КАК т)
	|СГРУППИРОВАТЬ ПО
	|	т.ВидЦены,
	|	т.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(т.Период) КАК Период,
	|	т.ВидЦены КАК ВидЦены,
	|	т.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ вц6
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры КАК т
	|ГДЕ
	|	т.ВидЦены В (&ВидЦены6)
	|	И т.Период <= &Период
	|	И т.Номенклатура В
	|		(ВЫБРАТЬ
	|			т.Номенклатура КАК Номенклатура
	|		ИЗ
	|			тов КАК т)
	|СГРУППИРОВАТЬ ПО
	|	т.ВидЦены,
	|	т.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вц1.Номенклатура КАК Номенклатура,
	|	т.Цена КАК Цена
	|ПОМЕСТИТЬ ц1
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вц1 КАК вц1
	|		ПО т.ВидЦены = вц1.ВидЦены
	|		И т.Номенклатура = вц1.Номенклатура
	|		И т.Период = вц1.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вц2.Номенклатура КАК Номенклатура,
	|	т.Цена КАК Цена
	|ПОМЕСТИТЬ ц2
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вц2 КАК вц2
	|		ПО т.ВидЦены = вц2.ВидЦены
	|		И т.Номенклатура = вц2.Номенклатура
	|		И т.Период = вц2.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вц3.Номенклатура КАК Номенклатура,
	|	т.Цена КАК Цена
	|ПОМЕСТИТЬ ц3
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вц3 КАК вц3
	|		ПО т.ВидЦены = вц3.ВидЦены
	|		И т.Номенклатура = вц3.Номенклатура
	|		И т.Период = вц3.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вц4.Номенклатура КАК Номенклатура,
	|	т.Цена КАК Цена
	|ПОМЕСТИТЬ ц4
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вц4 КАК вц4
	|		ПО т.ВидЦены = вц4.ВидЦены
	|		И т.Номенклатура = вц4.Номенклатура
	|		И т.Период = вц4.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вц5.Номенклатура КАК Номенклатура,
	|	т.Цена КАК Цена
	|ПОМЕСТИТЬ ц5
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вц5 КАК вц5
	|		ПО т.ВидЦены = вц5.ВидЦены
	|		И т.Номенклатура = вц5.Номенклатура
	|		И т.Период = вц5.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вц6.Номенклатура КАК Номенклатура,
	|	т.Цена КАК Цена
	|ПОМЕСТИТЬ ц6
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вц6 КАК вц6
	|		ПО т.ВидЦены = вц6.ВидЦены
	|		И т.Номенклатура = вц6.Номенклатура
	|		И т.Период = вц6.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тов.НомерСтроки КАК НомерСтроки,
	|	тов.Наименование КАК Наименование,
	|	тов.Вес КАК Вес,
	|	тов.Количество КАК Количество,
	|	тов.Номенклатура КАК Номенклатура,
	|	тов.Артикул КАК Артикул,
	|	тов.Представление КАК Представление,
	|	тов.ВесУпак КАК ВесУпак,
	|	тов.КолУпак КАК КолУпак,
	|	тов.ФайлКартинки КАК ФайлКартинки,
	|	ЕСТЬNULL(ц.Цена, ц1.Цена) КАК Цена1БезНДС,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ц.Цена, ц1.Цена) * 1.2 КАК ЧИСЛО(10, 2)) КАК Цена1СНДС,
	|	ЕСТЬNULL(ц2.Цена, 0) КАК Цена2БезНДС,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ц2.Цена, 0) * 1.2 КАК ЧИСЛО(10, 2)) КАК Цена2СНДС,
	|	ЕСТЬNULL(ц3.Цена, 0) КАК Цена3БезНДС,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ц3.Цена, 0) * 1.2 КАК ЧИСЛО(10, 2)) КАК Цена3СНДС,
	|	ЕСТЬNULL(ц4.Цена, 0) КАК Цена4БезНДС,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ц4.Цена, 0) * 1.2 КАК ЧИСЛО(10, 2)) КАК Цена4СНДС,
	|	ЕСТЬNULL(ц5.Цена, 0) КАК Цена5БезНДС,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ц5.Цена, 0) * 1.2 КАК ЧИСЛО(10, 2)) КАК Цена5СНДС,
	|	ЕСТЬNULL(ц6.Цена, 0) КАК Цена6БезНДС,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ц6.Цена, 0) * 1.2 КАК ЧИСЛО(10, 2)) КАК Цена6СНДС
	|ИЗ
	|	тов КАК тов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ц1 КАК ц1
	|		ПО тов.Номенклатура = ц1.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ц2 КАК ц2
	|		ПО тов.Номенклатура = ц2.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ц3 КАК ц3
	|		ПО тов.Номенклатура = ц3.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ц4 КАК ц4
	|		ПО тов.Номенклатура = ц4.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ц5 КАК ц5
	|		ПО тов.Номенклатура = ц5.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ц6 КАК ц6
	|		ПО тов.Номенклатура = ц6.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ц КАК ц
	|		ПО тов.Номенклатура = ц.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	тов.НомерСтроки";

	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ПолучитьСтруктуруПродукции(ВариантПрайса, ЦеноваяГруппа)
	УстановитьПривилегированныйРежим(Истина);

	СКД  = Справочники._ПродукцияКомпании.ПолучитьМакет("МакетПрайс");
	Табл = Новый ТаблицаЗначений;

	Если ЦеноваяГруппа.Количество() = 1 Тогда
		Настройки = СКД.НастройкиПоУмолчанию;
		ОтборЭтоМега = Настройки.Отбор.Элементы.Получить(0);
		ОтборЭтоМега.Использование = Истина;

		Если ЦеноваяГруппа[0] = AMS_ВызовСервера.ЦеноваяГруппаМЕГА() Тогда
			ОтборЭтоМега.ПравоеЗначение = Истина;
		Иначе
			ОтборЭтоМега.ПравоеЗначение = Ложь;
		КонецЕсли;

		мср.ПолучитьДанныеНаОснованииСКД(СКД, Табл, Настройки, Неопределено);
	Иначе
		мср.ПолучитьДанныеНаОснованииСКД(СКД, Табл, Неопределено, Неопределено);
	КонецЕсли;

	Возврат Табл;
КонецФункции

Функция ПреобразоватьСтроку(Стр)
	Поз = СтрНайти(Стр, "Туба");
	Если Поз > 0 Тогда
		Возврат "Туба" + Символы.ПС + Сред(Стр, 6);
	КонецЕсли;

	Поз = СтрНайти(Стр, "Банка");
	Если Поз > 0 Тогда
		Возврат "Банка" + Символы.ПС + Сред(Стр, 7);
	КонецЕсли;

	Поз = СтрНайти(Стр, "Пакет");
	Если Поз > 0 Тогда
		Возврат "Пакет" + Символы.ПС + Сред(Стр, 7);
	КонецЕсли;

	Поз = СтрНайти(Стр, "Коробка");
	Если Поз > 0 Тогда
		Возврат "Коробка" + Символы.ПС + Сред(Стр, 9);
	КонецЕсли;

	Поз = СтрНайти(Стр, "Спайка");
	Если Поз > 0 Тогда
		Возврат "Спайка" + Символы.ПС + Сред(Стр, Поз + 7);
	КонецЕсли;

	Поз = СтрНайти(Стр, "Пуш-пул");
	Если Поз > 0 Тогда
		Возврат "Пуш-пул" + Символы.ПС + Сред(Стр, 9);
	КонецЕсли;

	Поз = СтрНайти(Стр, "Флип-топ");
	Если Поз > 0 Тогда
		Возврат "Флип-топ" + Символы.ПС + Сред(Стр, 10);
	КонецЕсли;

	Поз = СтрНайти(Стр, "Дозатор");
	Если Поз > 0 Тогда
		Возврат "Дозатор" + Символы.ПС + Сред(Стр, 9);
	КонецЕсли;

	Поз = СтрНайти(Стр, "Триггер");
	Если Поз > 0 Тогда
		Возврат "Триггер" + Символы.ПС + Сред(Стр, 9);
	КонецЕсли;

	Поз = СтрНайти(Стр, "Смен.блок");
	Если Поз > 0 Тогда
		Возврат "Сменный" + Символы.ПС + "блок" + Символы.ПС + Сред(Стр, Поз + 10);
	КонецЕсли;

	Поз = СтрНайти(Стр, "Шоу-бокс");
	Если Поз > 0 Тогда
		Возврат "Шоу-бокс" + Символы.ПС + Сред(Стр, Поз + 9);
	КонецЕсли;

	Возврат Стр;
КонецФункции

#КонецОбласти

#Область Печать_НакладнаяНаПеремещениеПалет

Функция СформироватьНакладнаяНаПалеты(МассивОбъектов) Экспорт
	УстановитьПривилегированныйРежим(Истина);

	ТабДок = Новый ТабличныйДокумент;

	Рез = ПолучитьДанныеДляПечатиНакладнаяНаПалеты(МассивОбъектов[0]);

	РезультатПоШапке = Рез[1];
	РезультатПоТЧ    = Рез[2];

	Если Не РезультатПоШапке.Пустой() Тогда
		ТабДок.АвтоМасштаб         = Истина;
		ТабДок.ОриентацияСтраницы  = ОриентацияСтраницы.Портрет;
		ТабДок.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_НакладнаяНаПалеты";

		Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.AMS_Продажи.НакладнаяНаПалеты");
		ОблШапка1  = Макет.ПолучитьОбласть("Шапка1");
		ОблШапка2  = Макет.ПолучитьОбласть("Шапка2");
		ОблСтрока1 = Макет.ПолучитьОбласть("Строка1");
		ОблСтрока2 = Макет.ПолучитьОбласть("Строка2");
		ОблПодвал  = Макет.ПолучитьОбласть("Подвал");
		Для а = 1 По 3 Цикл
			Выб = РезультатПоШапке.Выбрать();
			Выб.Следующий();

			Парам = Новый Структура;
			Парам.Вставить("УПД", "к УПД № " + ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выб.Номер) + " от "
				+ Формат(Выб.Дата, "ДЛФ=Д"));
			Парам.Вставить("Отправитель", Выб.Организация);
			Парам.Вставить("Покупатель", Выб.Партнер);
			Парам.Вставить("Водитель", ?(Выб.Водитель = Null, "", Строка(Выб.Водитель) + ", " + Строка(
				Выб.ТранспортноеСредство)));
			ОблШапка1.Параметры.Заполнить(Парам);

			ТабДок.Вывести(ОблШапка1);

			Сч = 0;
			Выб = РезультатПоТЧ.Выбрать();
			Пока Выб.Следующий() Цикл
				Сч = Сч + 1;
				ОблСтрока1.Параметры.Сч           = Сч;
				ОблСтрока1.Параметры.Номенклатура = Выб.Номенклатура;
				ОблСтрока1.Параметры.Количество = Строка(Выб.Количество) + " ("
					+ ФормированиеПечатныхФорм.КоличествоПрописью(Выб.Количество) + ")";
				ТабДок.Вывести(ОблСтрока1);
			КонецЦикла;

			ТабДок.Вывести(ОблШапка2);

			Сч = 0;
			Выб = РезультатПоТЧ.Выбрать();
			Пока Выб.Следующий() Цикл
				Сч = Сч + 1;
				ОблСтрока2.Параметры.Сч           = Сч;
				ОблСтрока2.Параметры.Номенклатура = Выб.Номенклатура;
				ТабДок.Вывести(ОблСтрока2);
			КонецЦикла;

			ТабДок.Вывести(ОблПодвал);
		КонецЦикла;
	КонецЕсли;

	Возврат ТабДок;
КонецФункции

Функция ПолучитьДанныеДляПечатиНакладнаяНаПалеты(Ссылка)
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Ссылка КАК Ссылка,
	|	т.Номенклатура КАК Номенклатура,
	|	т.Количество КАК Количество
	|ПОМЕСТИТЬ Палеты
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК т
	|ГДЕ
	|	т.Ссылка = &Ссылка
	|	И т.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Реал.Номер КАК Номер,
	|	Реал.Дата КАК Дата,
	|	Реал.Организация.НаименованиеСокращенное КАК Организация,
	|	Реал.Партнер.НаименованиеПолное КАК Партнер,
	|	ЛогЛистРаспоряжения.ТранспортноеСредство КАК ТранспортноеСредство,
	|	ЛогЛистРейсы.Водитель КАК Водитель
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК Реал
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.AMS_ЛогистическийЛист.Распоряжения КАК ЛогЛистРаспоряжения
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.AMS_ЛогистическийЛист.Рейсы КАК ЛогЛистРейсы
	|			ПО ЛогЛистРаспоряжения.Ссылка = ЛогЛистРейсы.Ссылка
	|				И ЛогЛистРаспоряжения.ТранспортноеСредство = ЛогЛистРейсы.ТранспортноеСредство
	|		ПО Реал.Ссылка = ЛогЛистРаспоряжения.Распоряжение
	|ГДЕ
	|	Реал.Ссылка В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				т.Ссылка КАК Ссылка
	|			ИЗ
	|				Палеты КАК т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Палеты.Номенклатура КАК Номенклатура,
	|	Палеты.Количество КАК Количество
	|ИЗ
	|	Палеты КАК Палеты";

	Возврат Запрос.ВыполнитьПакет();
КонецФункции

#КонецОбласти

#Область Печать_АктПереводаНаименований

Функция СформироватьАктПереводаНаименований(МассивОбъектов)
	УстановитьПривилегированныйРежим(Истина);

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ПолеСлева = 5;
	ТабличныйДокумент.ПолеСправа = 5;
	ТабличныйДокумент.РазмерКолонтитулаСверху = 0;
	ТабличныйДокумент.РазмерКолонтитулаСнизу = 0;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;

	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ__АктПереводаНаименований";

	ДанныеДляПечати = ПолучитьДанныеДляПечатиАктПереводаНаименований(МассивОбъектов);

	ЗаполнитьТабДокАктПереводаНаименований(ТабличныйДокумент, ДанныеДляПечати);

	Возврат ТабличныйДокумент;
КонецФункции

Функция ПолучитьДанныеДляПечатиАктПереводаНаименований(МассивОбъектов)
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	д.Организация КАК Организация,
	|	д.Организация._ДолжностьРуководителя КАК ДолжностьРуководителя,
	|	д.Организация._Руководитель КАК ИмяРуководителя,
	|	д.Партнер КАК Партнер,
	|	д.Номер КАК Номер,
	|	д.Дата КАК Дата,
	|	д.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
	|	д.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
	|	т.Склад КАК Склад,
	|	т.Склад.ТекущийОтветственный КАК НачальникСклада,
	|	т.НоменклатураПартнера.НаименованиеНоменклатуры КАК НоменклатураПоставщика,
	|	т.НоменклатураПартнера.КодОКЕИБазовойЕдиницыИзмерения КАК ЕдПоставщикаКод,
	|	т.НоменклатураПартнера.НаименованиеУпаковки КАК ЕдПоставщика,
	|	т.Номенклатура.Наименование КАК Номенклатура,
	|	т.Номенклатура.ЕдиницаИзмерения.Код КАК ЕдКод,
	|	ВЫБОР
	|		КОГДА т.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА т.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ т.Упаковка
	|	КОНЕЦ КАК Ед,
	|	т.Количество КАК Количество,
	|	т.Цена КАК Цена
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг.Товары КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг КАК д
	|		ПО т.Ссылка = д.Ссылка
	|ГДЕ
	|	т.Ссылка В(&МассивОбъектов)
	|	И т.НоменклатураПартнера.НаименованиеНоменклатуры <> т.Номенклатура.Наименование
	|ИТОГИ ПО
	|	Склад";

	Возврат Запрос.Выполнить();
КонецФункции

Процедура ЗаполнитьТабДокАктПереводаНаименований(ТабличныйДокумент, ДанныеДляПечати)
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.AMS_Продажи.АктПереводаНаименований");

	Шапка  = Макет.ПолучитьОбласть("Шапка");
	Строка = Макет.ПолучитьОбласть("Строка");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ПерваяСтраница = Истина;

	ВыборкаСклад = ДанныеДляПечати.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаСклад.Следующий() Цикл
		Если Не ПерваяСтраница Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ПерваяСтраница = Ложь;

		НомерСтроки = 0;

		Выб = ВыборкаСклад.Выбрать();

		КоличествоСтрок = Выб.Количество();

		Пока Выб.Следующий() Цикл
			НомерСтроки = НомерСтроки + 1;

			Если НомерСтроки = 1 Тогда
				Шапка.Параметры.ДолжностьРуководителя = Выб.ДолжностьРуководителя;
				Шапка.Параметры.ИмяРуководителя       = Выб.ИмяРуководителя;

				Шапка.Параметры.Номер = "№ " + ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выб.Номер) + " от "
					+ Формат(Выб.Дата, "ДЛФ=Д") + " г.";

				Шапка.Параметры.Организация = Выб.Организация;
				Шапка.Параметры.Партнер     = Выб.Партнер;

				Шапка.Параметры.ГлавныйИнженер  = "главный инженер Голощапов В.И.,";
				Шапка.Параметры.НачальникСклада = "начальник склада " + Выб.НачальникСклада + ",";
				Шапка.Параметры.БухгалтерСклада = "бухгалтер склада Субботина А.М.,";

				Шапка.Параметры.НомерПоставщика = "№ " + Выб.НомерВходящегоДокумента + " от " + Формат(
					Выб.ДатаВходящегоДокумента, "ДЛФ=Д") + " г.";

				ТабличныйДокумент.Вывести(Шапка);
			КонецЕсли;

			Строка.Параметры.Заполнить(Выб);
			Строка.Параметры.НомерСтроки = НомерСтроки;

			ТабличныйДокумент.Вывести(Строка);

			Если НомерСтроки = КоличествоСтрок Тогда
				Подвал.Параметры.ГлавныйИнженер  = "Голощапов В.И.";
				Подвал.Параметры.НачальникСклада = Выб.НачальникСклада;
				Подвал.Параметры.БухгалтерСклада = "Субботина А.М.";
				Подвал.Параметры.Кладовщик       = "Субботина А.М.";

				ТабличныйДокумент.Вывести(Подвал);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область Печать_ЛогистическийЛист

Функция СформироватьЛогистическийЛист(МассивДокументов, Парам)
	Док    = МассивДокументов[0];

	Рез    = ПолучитьДанныеЛогистическогоЛиста(Док, Парам.Доставка);

	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.АвтоМасштаб        = Истина;

	Макет = Документы.AMS_ЛогистическийЛист.ПолучитьМакет("ЛогистическийЛист");

	ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
	ОбластьАвто   = Макет.ПолучитьОбласть("Авто");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьИтог   = Макет.ПолучитьОбласть("Итого");

	МассивВыводимыхОбластей = Новый Массив;

	ТабДок.НачатьАвтогруппировкуСтрок();
	
	ОбластьШапка.Параметры.Заголовок  = "Логистический лист № " + Док.Номер + " от " + Формат(Док.Дата, "ДЛФ=ДД");
	ТабДок.Вывести(ОбластьШапка);

	Выб1 = Рез.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Выб1.Следующий();
	ОбластьИтог.Параметры.Заполнить(Выб1);

	Выб2 = Выб1.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выб2.Следующий() Цикл
		ОбластьАвто.Параметры.Заполнить(Выб2);
		
		Если Выб2.НаименованиеАвто = "Самовывоз" Тогда
			Авто = Выб2.НаименованиеАвто;
		Иначе
			Авто = Выб2.НаименованиеАвто + ", " + Выб2.Водитель + ", тел. "	+ Выб2.Телефон + " (перевозчик: " + Выб2.Перевозчик + ")";
		КонецЕсли;
		
		ОбластьАвто.Параметры.ТранспортноеСредство = Авто;

		МассивВыводимыхОбластей.Очистить();
		МассивВыводимыхОбластей.Добавить(ОбластьАвто);

		Выб3 = Выб2.Выбрать();
		Пока Выб3.Следующий() Цикл
			ОбластьСтрока.Параметры.Заполнить(Выб3);
			МассивВыводимыхОбластей.Добавить(ОбластьСтрока);
		КонецЦикла;

		Если Не ТабДок.ПроверитьВывод(МассивВыводимыхОбластей) Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьАвто, 1, "Авто", Истина);

		Выб3.Сбросить();
		Пока Выб3.Следующий() Цикл
			ОбластьСтрока.Параметры.Заполнить(Выб3);

			Если Выб2.НаименованиеАвто = "Самовывоз" Тогда
				ОбластьСтрока.Параметры.НомерСтроки = "";
				ОбластьСтрока.Параметры.АдресДоставки = "";
			КонецЕсли;

			ТабДок.Вывести(ОбластьСтрока, 2, "Документ", Истина);
		КонецЦикла;
	КонецЦикла;
	
	ТабДок.Вывести(ОбластьИтог);

	ТабДок.ЗакончитьАвтогруппировкуСтрок();

	Возврат ТабДок;
КонецФункции

Функция ПолучитьДанныеЛогистическогоЛиста(Док, Доставка)
	ПоказатьСамовывоз = Ложь;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Док.Дата);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	т.Номер КАК Номер
	|ИЗ
	|	Документ.AMS_ЛогистическийЛист КАК т
	|ГДЕ
	|	т.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	|	И НЕ т.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номер";
	Рез = Запрос.Выполнить();
	Выб = Рез.Выбрать();
	Пока Выб.Следующий() Цикл
		Если Док.Номер = Выб.Номер Тогда
			ПоказатьСамовывоз = Истина;
		КонецЕсли;
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Док.Дата);
	Запрос.УстановитьПараметр("Ссылка", Док);
	Запрос.УстановитьПараметр("Доставка", Доставка);
	Запрос.УстановитьПараметр("ПоказатьСамовывоз", ПоказатьСамовывоз);

	Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Тран._Перевозчик КАК Перевозчик,
	|	Рейсы.ТранспортноеСредство КАК ТранспортноеСредство,
	|	Тран.Наименование КАК НаименованиеАвто,
	|	Тран.ГрузоподъемностьВТоннах КАК Тоннаж,
	|	Рейсы.Водитель КАК Водитель,
	|	Физл.Представление КАК Телефон,
	|	Рейсы.ВремяЗагрузки КАК ВремяЗагрузки,
	|	Рейсы.ВремяЗагрузкиФакт КАК ВремяЗагрузкиФакт,
	|	Рейсы.Отправлено КАК Отправлено,
	|	Распоряжения.Распоряжение КАК Распоряжение,
	|	Распоряжения.Распоряжение ССЫЛКА Документ.ЗаказКлиента
	|		ИЛИ Распоряжения.Распоряжение ССЫЛКА Документ.РеализацияТоваровУслуг
	|		ИЛИ Распоряжения.Распоряжение ССЫЛКА Документ.ОтгрузкаТоваровКлиенту
	|		ИЛИ Распоряжения.Распоряжение ССЫЛКА Документ.ПередачаТоваровХранителю
	|		ИЛИ Распоряжения.Распоряжение ССЫЛКА Документ.AMS_ПередачаВПереработку КАК Доставка,
	|	Распоряжения.ПорядокВМаршруте КАК НомерСтроки
	|ПОМЕСТИТЬ ЛогЛист
	|ИЗ
	|	Документ.AMS_ЛогистическийЛист.Рейсы КАК Рейсы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.AMS_ЛогистическийЛист.Распоряжения КАК Распоряжения
	|		ПО Рейсы.Ссылка = Распоряжения.Ссылка
	|			И Рейсы.ТранспортноеСредство = Распоряжения.ТранспортноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТранспортныеСредства КАК Тран
	|		ПО Рейсы.ТранспортноеСредство = Тран.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.КонтактнаяИнформация КАК Физл
	|		ПО Рейсы.Водитель = Физл.Ссылка
	|			И (Физл.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонМобильныйФизическиеЛица))
	|ГДЕ
	|	Рейсы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	т.Ссылка КАК Распоряжение,
	|	т.Номер КАК Номер,
	|	т.Дата КАК Дата,
	|	т.Автор КАК Менеджер,
	|	ВЫБОР
	|		КОГДА т.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу)
	|			ТОГДА т.АдресДоставкиПеревозчика
	|		ИНАЧЕ т.АдресДоставки
	|	КОНЕЦ КАК АдресДоставки,
	|	т.ВремяДоставкиС КАК ВремяДоставкиС,
	|	т.ВремяДоставкиПо КАК ВремяДоставкиПо,
	|	т.Партнер КАК Партнер,
	|	т.AMS_КоличествоПалет КАК КоличествоПалет,
	|	т.AMS_Вес КАК Вес
	|ПОМЕСТИТЬ МыВезем
	|ИЗ
	|	ЛогЛист КАК ЛогЛист
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК т
	|		ПО ЛогЛист.Распоряжение = т.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	т.Ссылка КАК Распоряжение,
	|	т.Номер КАК Номер,
	|	т.Дата КАК Дата,
	|	т.Автор КАК Менеджер,
	|	ВЫБОР
	|		КОГДА т.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу)
	|			ТОГДА т.АдресДоставкиПеревозчика
	|		ИНАЧЕ т.АдресДоставки
	|	КОНЕЦ КАК АдресДоставки,
	|	т.ВремяДоставкиС КАК ВремяДоставкиС,
	|	т.ВремяДоставкиПо КАК ВремяДоставкиПо,
	|	т.Партнер КАК Партнер,
	|	т.AMS_КоличествоПалет КАК КоличествоПалет,
	|	т.AMS_Вес КАК Вес
	|ИЗ
	|	ЛогЛист КАК ЛогЛист
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК т
	|		ПО ЛогЛист.Распоряжение = т.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	т.Ссылка КАК Распоряжение,
	|	т.Номер КАК Номер,
	|	т.Дата КАК Дата,
	|	т.Автор КАК Менеджер,
	|	ВЫБОР
	|		КОГДА т.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу)
	|			ТОГДА т.АдресДоставкиПеревозчика
	|		ИНАЧЕ т.АдресДоставки
	|	КОНЕЦ КАК АдресДоставки,
	|	т.ВремяДоставкиС КАК ВремяДоставкиС,
	|	т.ВремяДоставкиПо КАК ВремяДоставкиПо,
	|	т.Партнер КАК Партнер,
	|	т.AMS_КоличествоПалет КАК КоличествоПалет,
	|	т.AMS_Вес КАК Вес
	|ИЗ
	|	ЛогЛист КАК ЛогЛист
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтгрузкаТоваровКлиенту КАК т
	|		ПО ЛогЛист.Распоряжение = т.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Передача.Ссылка,
	|	Передача.Номер,
	|	Передача.Дата,
	|	Передача.Автор,
	|	Передача.АдресДоставки,
	|	Передача.ВремяДоставкиС,
	|	Передача.ВремяДоставкиПо,
	|	Передача.Партнер,
	|	Передача.AMS_КоличествоПалет,
	|	Передача.AMS_Вес
	|ИЗ
	|	ЛогЛист КАК ЛогЛист
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю КАК Передача
	|		ПО ЛогЛист.Распоряжение = Передача.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Переработка.Ссылка,
	|	Переработка.Номер,
	|	Переработка.Дата,
	|	Переработка.Ответственный,
	|	Переработка.АдресДоставки,
	|	Переработка.ВремяДоставкиС,
	|	Переработка.ВремяДоставкиПо,
	|	Переработка.Партнер,
	|	Переработка.AMS_КоличествоПалет,
	|	Переработка.AMS_Вес
	|ИЗ
	|	ЛогЛист КАК ЛогЛист
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.AMS_ПередачаВПереработку КАК Переработка
	|		ПО ЛогЛист.Распоряжение = Переработка.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказПоставщику.Ссылка,
	|	ЗаказПоставщику.Номер,
	|	ЗаказПоставщику.Дата,
	|	ЗаказПоставщику.Автор,
	|	ЗаказПоставщику.АдресДоставки,
	|	ЗаказПоставщику.ВремяДоставкиС,
	|	ЗаказПоставщику.ВремяДоставкиПо,
	|	ЗаказПоставщику.Партнер,
	|	ЗаказПоставщику.AMS_КоличествоПалет,
	|	ЗаказПоставщику.AMS_Вес
	|ИЗ
	|	ЛогЛист КАК ЛогЛист
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК ЗаказПоставщику
	|		ПО ЛогЛист.Распоряжение = ЗаказПоставщику.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаявкаНаВозврат.Ссылка,
	|	ЗаявкаНаВозврат.Номер,
	|	ЗаявкаНаВозврат.Дата,
	|	ЗаявкаНаВозврат.Автор,
	|	ЗаявкаНаВозврат.АдресДоставки,
	|	ЗаявкаНаВозврат.ВремяДоставкиС,
	|	ЗаявкаНаВозврат.ВремяДоставкиПо,
	|	ЗаявкаНаВозврат.Партнер,
	|	ЗаявкаНаВозврат.AMS_КоличествоПалет,
	|	ЗаявкаНаВозврат.AMS_Вес
	|ИЗ
	|	ЛогЛист КАК ЛогЛист
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаВозвратТоваровОтКлиента КАК ЗаявкаНаВозврат
	|		ПО ЛогЛист.Распоряжение = ЗаявкаНаВозврат.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЛогЛист.Перевозчик КАК Перевозчик,
	|	ЛогЛист.ТранспортноеСредство КАК ТранспортноеСредство,
	|	ЛогЛист.НаименованиеАвто КАК НаименованиеАвто,
	|	ЛогЛист.Тоннаж КАК Тоннаж,
	|	ЛогЛист.Водитель КАК Водитель,
	|	ЛогЛист.Телефон КАК Телефон,
	|	ЛогЛист.ВремяЗагрузки КАК ВремяЗагрузки,
	|	ЛогЛист.ВремяЗагрузкиФакт КАК ВремяЗагрузкиФакт,
	|	ЛогЛист.Отправлено КАК Отправлено,
	|	ЛогЛист.Распоряжение КАК Распоряжение,
	|	ЛогЛист.Доставка КАК Доставка,
	|	ЛогЛист.НомерСтроки КАК НомерСтроки,
	|	МыВезем.Номер КАК Номер,
	|	МыВезем.Дата КАК Дата,
	|	МыВезем.Менеджер КАК Менеджер,
	|	МыВезем.АдресДоставки КАК АдресДоставки,
	|	МыВезем.ВремяДоставкиС КАК ВремяДоставкиС,
	|	МыВезем.ВремяДоставкиПо КАК ВремяДоставкиПо,
	|	МыВезем.Партнер КАК Партнер,
	|	МыВезем.КоличествоПалет КАК КоличествоПалет,
	|	МыВезем.Вес КАК Вес
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	ЛогЛист КАК ЛогЛист
	|		ЛЕВОЕ СОЕДИНЕНИЕ МыВезем КАК МыВезем
	|		ПО ЛогЛист.Распоряжение = МыВезем.Распоряжение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Реал.Партнер,
	|	ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.Самовывоз),
	|	""Самовывоз"",
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	Реал.Ссылка,
	|	ИСТИНА,
	|	1,
	|	Реал.Номер,
	|	Реал.Дата,
	|	Реал.Автор,
	|	Реал.АдресДоставки,
	|	Реал.ВремяДоставкиС,
	|	Реал.ВремяДоставкиПо,
	|	Реал.Партнер,
	|	Реал.AMS_КоличествоПалет,
	|	Реал.AMS_Вес
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК Реал
	|ГДЕ
	|	Реал.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.Самовывоз)
	|	И Реал.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	|	И &ПоказатьСамовывоз
	|	И Реал.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.Распоряжение КАК Распоряжение,
	|	СУММА(ЕСТЬNULL(т.КоличествоУпаковок, 0)) КАК КоличествоУпаковок
	|ПОМЕСТИТЬ упак
	|ИЗ
	|	вт КАК вт
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК т
	|		ПО вт.Распоряжение = т.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	вт.Распоряжение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.Перевозчик КАК Перевозчик,
	|	вт.ТранспортноеСредство КАК ТранспортноеСредство,
	|	вт.НаименованиеАвто КАК НаименованиеАвто,
	|	вт.Тоннаж КАК Тоннаж,
	|	вт.Водитель КАК Водитель,
	|	вт.Телефон КАК Телефон,
	|	вт.ВремяЗагрузки КАК ВремяЗагрузки,
	|	вт.ВремяЗагрузкиФакт КАК ВремяЗагрузкиФакт,
	|	вт.Отправлено КАК Отправлено,
	|	вт.Распоряжение КАК Распоряжение,
	|	вт.Доставка КАК Доставка,
	|	вт.НомерСтроки КАК НомерСтроки,
	|	вт.Номер КАК Номер,
	|	вт.Дата КАК Дата,
	|	вт.Менеджер КАК Менеджер,
	|	вт.АдресДоставки КАК АдресДоставки,
	|	вт.ВремяДоставкиС КАК ВремяДоставкиС,
	|	вт.ВремяДоставкиПо КАК ВремяДоставкиПо,
	|	вт.Партнер КАК Партнер,
	|	вт.КоличествоПалет КАК КоличествоПалет,
	|	вт.Вес КАК Вес,
	|	упак.КоличествоУпаковок КАК КоличествоУпаковок
	|ИЗ
	|	вт КАК вт
	|		ЛЕВОЕ СОЕДИНЕНИЕ упак КАК упак
	|		ПО вт.Распоряжение = упак.Распоряжение";

	Если Не Доставка = Неопределено Тогда
		Текст = Текст + "
						|ГДЕ
						|	вт.Доставка = &Доставка
						|";
	КонецЕсли;

	Текст = Текст + "
					|УПОРЯДОЧИТЬ ПО
					|	Тоннаж УБЫВ,
					|	НаименованиеАвто,
					|	НомерСтроки
					|ИТОГИ
					|	МАКСИМУМ(Перевозчик),
					|	МАКСИМУМ(НаименованиеАвто),
					|	МАКСИМУМ(Тоннаж),
					|	МАКСИМУМ(Водитель),
					|	МАКСИМУМ(Телефон),
					|	МАКСИМУМ(ВремяЗагрузки),
					|	МАКСИМУМ(ВремяЗагрузкиФакт),
					|	МАКСИМУМ(Отправлено),
					|	СУММА(КоличествоПалет),
					|	СУММА(Вес),
					|	СУММА(КоличествоУпаковок)
					|ПО
					|	ОБЩИЕ,
					|	ТранспортноеСредство";

	Запрос.Текст = Текст;

	Возврат Запрос.Выполнить();
КонецФункции

#КонецОбласти

#Область Печать_ДопСоглашение

Функция СформироватьДопСоглашение(МассивОбъектов)
	Док    = МассивОбъектов[0];
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Док);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	д.Дата КАК Дата,
	|	д.Договор.Номер КАК ДоговорНомер,
	|	д.Договор.Дата КАК ДоговорДата,
	|	д.Организация.НаименованиеПолное КАК Заказчик,
	|	д.Партнер.НаименованиеПолное КАК Перевозчик
	|ИЗ
	|	Документ._ТранспортныеУслуги КАК д
	|ГДЕ
	|	д.Ссылка = &Ссылка";	
	Рез = Запрос.Выполнить();
	Выб = Рез.Выбрать();
	Выб.Следующий();

	Таб = ПолучитьТаблицуМаршрутов(Док);

	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб        = Истина;

	Макет = Документы._ТранспортныеУслуги.ПолучитьМакет("ДопСоглашение");

	ОблШапка  = Макет.ПолучитьОбласть("Шапка");
	ОблСтрока = Макет.ПолучитьОбласть("Строка");
	ОблПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ОблШапка.Параметры.Номер = Выб.ДоговорНомер;
	ОблШапка.Параметры.Дата  = Формат(Выб.ДоговорДата, "ДЛФ=ДД");
	
	ТабДок.Вывести(ОблШапка);
	
	НомерСтроки = 0;
	Для каждого Стр Из Таб Цикл
		НомерСтроки = НомерСтроки + 1;
		ОблСтрока.Параметры.Заполнить(Стр);
		ОблСтрока.Параметры.НомерСтроки = НомерСтроки;
		
		ТабДок.Вывести(ОблСтрока);
	КонецЦикла;
	
	
	ОблПодвал.Параметры.Дата       = Формат(Выб.Дата, "ДЛФ=ДД");
	ОблПодвал.Параметры.Заказчик   = Выб.Заказчик;
	ОблПодвал.Параметры.Перевозчик = Выб.Перевозчик;
		
	ТабДок.Вывести(ОблПодвал);
	
	Возврат ТабДок;
КонецФункции

Функция ПолучитьТаблицуМаршрутов(Док)
	АдресСклада = "МО, г. Лосино-Петровский";

	Таб = Новый ТаблицаЗначений;
	Таб.Колонки.Добавить("Тип");
	Таб.Колонки.Добавить("Маршрут");
	Таб.Колонки.Добавить("Стоимость");
	Таб.Колонки.Добавить("Справка");

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Док);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.ЛогистическийЛист КАК ЛогистическийЛист,
	|	т.ТранспортноеСредство КАК ТранспортноеСредство,
	|	авто.Тип КАК Тип,
	|	т.СтоимостьДоставки КАК СтоимостьДоставки,
	|	т.Водитель КАК Водитель
	|ПОМЕСТИТЬ ДокТУ
	|ИЗ
	|	Документ._ТранспортныеУслуги.Рейсы КАК т
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТранспортныеСредства КАК авто
	|		ПО т.ТранспортноеСредство = авто.Ссылка
	|ГДЕ
	|	т.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокТУ.ЛогистическийЛист КАК ЛогистическийЛист,
	|	ДокТУ.ТранспортноеСредство КАК ТранспортноеСредство,
	|	Заказы.АдресДоставки КАК АдресДоставки,
	|	Заказы.Подвоз КАК Подвоз
	|ПОМЕСТИТЬ Адреса
	|ИЗ
	|	ДокТУ КАК ДокТУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.AMS_ЛогистическийЛист.Распоряжения КАК Заказы
	|		ПО ДокТУ.ЛогистическийЛист = Заказы.Ссылка
	|			И ДокТУ.ТранспортноеСредство = Заказы.ТранспортноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокТУ.ЛогистическийЛист КАК ЛогистическийЛист,
	|	ДокТУ.ТранспортноеСредство КАК ТранспортноеСредство,
	|	ДокТУ.Водитель КАК Водитель,
	|	ДокТУ.Тип КАК Тип,
	|	ДокТУ.СтоимостьДоставки КАК Стоимость,
	|	Адреса.АдресДоставки КАК Адрес,
	|	Адреса.Подвоз КАК Подвоз
	|ИЗ
	|	ДокТУ КАК ДокТУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Адреса КАК Адреса
	|		ПО ДокТУ.ЛогистическийЛист = Адреса.ЛогистическийЛист
	|			И ДокТУ.ТранспортноеСредство = Адреса.ТранспортноеСредство
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДокТУ.ЛогистическийЛист.МоментВремени
	|ИТОГИ
	|	МАКСИМУМ(Водитель),
	|	МАКСИМУМ(Тип),
	|	МАКСИМУМ(Стоимость)
	|ПО
	|	ЛогистическийЛист,
	|	ТранспортноеСредство";

	Рез = Запрос.Выполнить();

	Выб1 = Рез.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выб1.Следующий() Цикл
		
		Выб2 = Выб1.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока Выб2.Следующий() Цикл
			Стр = Таб.Добавить();

			Стр.Тип       = Выб2.Тип;
			Стр.Стоимость = Выб2.Стоимость;
			Стр.Справка   = "" + Выб2.ТранспортноеСредство + " (" + Выб2.Водитель + ")";

			ПервыйАдрес = Истина;
			Маршрут     = "";
			Подвоз      = Ложь;


			Выб3 = Выб2.Выбрать();
			Пока Выб3.Следующий() Цикл
				Подвоз = Выб3.Подвоз;

				Если ПервыйАдрес И Не Выб3.Подвоз Тогда
					Маршрут = АдресСклада;

					ПервыйАдрес = Ложь;
				КонецЕсли;

				Маршрут = Маршрут + " - " + Выб3.Адрес;
			КонецЦикла;

			Если Подвоз Тогда
				Маршрут = Маршрут + " - " + АдресСклада;
			КонецЕсли;

			Стр.Маршрут = Маршрут;
		КонецЦикла;
	КонецЦикла;

	Возврат Таб;
КонецФункции

#КонецОбласти

#Область Печать_СпецификацияЭкпорт

Функция СформироватьПечатнуюФормуСпецификацияЭкпорт(МассивОбъектов, ОбъектыПечати, ПараметрыПечати, КомплектыПечати = Неопределено) Экспорт
	УстановитьПривилегированныйРежим(Истина);

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ПолеСлева = 5;
	ТабличныйДокумент.ПолеСправа = 5;
	ТабличныйДокумент.РазмерКолонтитулаСверху = 0;
	ТабличныйДокумент.РазмерКолонтитулаСнизу = 0;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;

	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_УЛ";

	ЗаполнитьТабДокСпецификацияЭкпорт(ТабличныйДокумент, МассивОбъектов, ОбъектыПечати, ПараметрыПечати, КомплектыПечати);

	Возврат ТабличныйДокумент;
КонецФункции

Процедура ЗаполнитьТабДокСпецификацияЭкпорт(ТабличныйДокумент, МассивОбъектов, ОбъектыПечати, ПараметрыПечати, КомплектыПечати = Неопределено)
	Реализация = МассивОбъектов[0];
	
	Если ТипЗнч(Реализация) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда 
		ДанныеРеализации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Реализация,
			"Номер, Дата, Организация, Договор, Валюта, Контрагент, Грузополучатель, AMS_КоличествоПалет, Ссылка");
	Иначе
		Возврат;
	КонецЕсли;		

	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.AMS_Продажи.СпецификацияЭкспорт");

	ОбластьШапка    = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапкаТаб = Макет.ПолучитьОбласть("ЗаголовокТаб");
	ОбластьСтрока   = Макет.ПолучитьОбласть("Строка"); 
	ОбластьПодвал   = Макет.ПолучитьОбласть("Подвал");

	
	Парам = ОбластьШапка.Параметры;
	
	Парам.Документ         = "Спецификация № " + ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеРеализации.Номер) 
								+ " от " + Формат(ДанныеРеализации.Дата, "ДЛФ=ДД") + " к " + ДанныеРеализации.Договор;
	Парам.Организация      = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(
								ДанныеРеализации.Организация, ДанныеРеализации.Дата), "ПолноеНаименование");
	Парам.ОрганизацияАдрес = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(
								ДанныеРеализации.Организация, ДанныеРеализации.Дата), "ЮридическийАдрес");
	Парам.ОрганизацияИНН   = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(
								ДанныеРеализации.Организация, ДанныеРеализации.Дата), "ИНН");
	Парам.Покупатель       = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(
								ДанныеРеализации.Контрагент, ДанныеРеализации.Дата), "ПолноеНаименование");
	Парам.ПокупательАдрес  = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(
								ДанныеРеализации.Контрагент, ДанныеРеализации.Дата), "ЮридическийАдрес");
	Парам.ПокупательИНН    = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(
								ДанныеРеализации.Контрагент, ДанныеРеализации.Дата), "ИНН");

	Если Не ЗначениеЗаполнено(ДанныеРеализации.Грузополучатель) 
		Или ДанныеРеализации.Грузополучатель = ДанныеРеализации.Контрагент Тогда
		Парам.Грузополучатель = "он же";
	Иначе
		Парам.Грузополучатель = ФормированиеПечатныхФорм.ОписаниеОрганизации(
			ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеРеализации.Грузополучатель, ДанныеРеализации.Дата), "ПолноеНаименование");
	КонецЕсли;

	Парам.Оплата   = "Оплата производится Покупателем путём перечисления 100% предоплаты на расчётный счет Поставщика";
	Парам.Поставка = "FCA - Москва, автомабильный, оплата российский рубль. " + ДанныеРеализации.Договор;

	ТабличныйДокумент.Вывести(ОбластьШапка);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Реализация", Реализация);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	СУММА(т.Количество) КАК Количество,
	|	МАКСИМУМ(т.Цена) КАК Цена
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК т
	|ГДЕ
	|	т.Ссылка = &Реализация
	|СГРУППИРОВАТЬ ПО
	|	т.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ном.Артикул КАК Артикул,
	|	Ном.НаименованиеПолное КАК Номенклатура,
	|	Ном.ЕдиницаИзмерения КАК Ед,
	|	Ном.КоэффициентЕдиницыДляОтчетов КАК Кфц,
	|	Товары.Количество КАК Количество,
	|	Товары.Количество / Ном.КоэффициентЕдиницыДляОтчетов КАК КоличествоУпаковок,
	|	Товары.Цена / Ном.КоэффициентЕдиницыДляОтчетов КАК Цена,
	|	Товары.Цена * Товары.Количество / Ном.КоэффициентЕдиницыДляОтчетов КАК Сумма,
	|	Ном.ВесЧислитель * Товары.Количество КАК ВесНетто,
	|	Ном._Упаковка.Вес * Товары.Количество / Ном.КоэффициентЕдиницыДляОтчетов КАК ВесБрутто,
	|	Ном.СтранаПроисхождения КАК СтранаПроисхождения,
	|	Ном.КодТНВЭД КАК КодТНВЭД
	|ИЗ
	|	Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|		ПО Товары.Номенклатура = Ном.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ном.Наименование";
	
	Табл = Запрос.Выполнить().Выгрузить();
	
	КоличествоСтрок = Табл.Количество();
	
	ВыводШапки    = 0;
	НомерСтроки   = 0;
	
	ИтогоКоличество  = 0;
	ИтогоКолУпаковок = 0;
	ИтогоСумма       = 0;
	ИтогоВесНетто    = 0;
	ИтогоВесБрутто   = 0;

	НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1; 
	
	МассивВыводимыхОбластей = Новый Массив; // Создаем массив для проверки вывода

	ВыводШапки = 0;
	
	Для каждого Стр Из Табл Цикл
		НомерСтроки = НомерСтроки + 1;
		
		ИтогоКоличество  = ИтогоКоличество  + Стр.Количество;
		ИтогоКолУпаковок = ИтогоКолУпаковок + Стр.КоличествоУпаковок;
		ИтогоСумма       = ИтогоСумма       + Стр.Сумма;
		ИтогоВесНетто    = ИтогоВесНетто    + Стр.ВесНетто;
		ИтогоВесБрутто   = ИтогоВесБрутто   + Стр.ВесБрутто; 
		
		ОбластьСтрока.Параметры.Заполнить(Стр);
		ОбластьСтрока.Параметры.НомСтр = НомерСтроки;

		Если НомерСтроки = 0 И ВыводШапки <> 2 Тогда
			ВыводШапки = 1;
		КонецЕсли;

		Если (НомерСтроки = 1 И ВыводШапки = 0) Или (НомерСтроки = 0 И ВыводШапки = 1) Тогда
			ВыводШапки = 2;
			ТабличныйДокумент.Вывести(ОбластьШапкаТаб);
		КонецЕсли;

		МассивВыводимыхОбластей.Очистить();
		
		МассивВыводимыхОбластей.Добавить(ОбластьСтрока);
		
		Если НомерСтроки = КоличествоСтрок Тогда
			ОбластьПодвал.Параметры.Количество         = ИтогоКоличество;
			ОбластьПодвал.Параметры.КоличествоУпаковок = ИтогоКолУпаковок;
			ОбластьПодвал.Параметры.Сумма              = ИтогоСумма;
			ОбластьПодвал.Параметры.ВесНетто           = ИтогоВесНетто;
			ОбластьПодвал.Параметры.ВесБрутто          = ИтогоВесБрутто;
			
			ОбластьПодвал.Параметры.Мест = "Количество мест " + ИтогоКолУпаковок + "шт."; 
			ОбластьПодвал.Параметры.Вес  = "Вес НЕТТО: " + ИтогоВесНетто + " кг.,      Вес БРУТТО: " + ИтогоВесБрутто + " кг."; 
			ОбластьПодвал.Параметры.СуммаПрописью = "Всего отгружено на сумму: " 
											+ РаботаСКурсамиВалют.СформироватьСуммуПрописью(ИтогоСумма, ДанныеРеализации.Валюта); 
			ОбластьПодвал.Параметры.Упаковано = "Упаковано на  " + ДанныеРеализации.AMS_КоличествоПалет + " палетах"; 

			МассивВыводимыхОбластей.Добавить(ОбластьПодвал);
		КонецЕсли;

		Если Не ТабличныйДокумент.ПроверитьВывод(МассивВыводимыхОбластей) Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			ТабличныйДокумент.Вывести(ОбластьШапкаТаб);
		КонецЕсли;

		ТабличныйДокумент.Вывести(ОбластьСтрока);
	КонецЦикла;
	
	ТабличныйДокумент.Вывести(ОбластьПодвал);

	УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеРеализации.Ссылка);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли