
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    ВремяДоставкиС = Параметры.ВремяДоставкиС;
    ВремяДоставкиПо = Параметры.ВремяДоставкиПо;
    
	ДоставкаТоваровКлиентСервер.ЗаполнитьСписокВыбораПоляВремени(Элементы.ВремяДоставкиС);
	ДоставкаТоваровКлиентСервер.ЗаполнитьСписокВыбораПоляВремени(Элементы.ВремяДоставкиПо);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВремяДоставкиСПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры
&НаКлиенте
Процедура ВремяДоставкиПоПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Записать(Команда)
    ПеренестиИзмененияВДокумент();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПеренестиИзмененияВДокумент()
	Парам = Новый Структура;
	Парам.Вставить("ВремяДоставкиС",ВремяДоставкиС);
	Парам.Вставить("ВремяДоставкиПо",ВремяДоставкиПо);
    
	//Снятие модифицированности, т.к. перед закрытием признак проверяется.
	Модифицированность = Ложь;
	
	Закрыть(Парам);
КонецПроцедуры

#КонецОбласти
