
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда 
		Возврат;
	КонецЕсли;
	
	Дата         = Параметры.Дата;
	Склад        = Параметры.Склад;
	Номенклатура = Параметры.Продукция;
	Статус       = Параметры.Статус;
	
	МассивПродукция = Параметры.МассивПродукция;
	Для каждого Стр Из МассивПродукция Цикл
		НовСтр = тчПродукция.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,Стр);
	КонецЦикла;
	
	Строки = тчПродукция.НайтиСтроки(Новый Структура("Номенклатура",Номенклатура));
	
	Если Строки.Количество() > 0 Тогда 
		Стр = Строки[0];
		Спецификация   = Стр.Спецификация;
		КоличествоПлан = Стр.КоличествоПлан;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Спецификация) Тогда
		Спецификация = AMS_ВызовСервера.ПолучитьОсновнуюСпецификацию(Номенклатура);
	КонецЕсли;
	
	ЗаполнитьМатериалы();
	
	НастройкаФормы(Статус);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СпецификацияПриИзменении(Элемент)
	Модифицированность = Истина;
	ЗаполнитьМатериалы();
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПланПриИзменении(Элемент)
	Модифицированность = Истина;
	ЗаполнитьМатериалы();
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПланРегулирование(Элемент, Направление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Модифицированность   = Истина;
	
	КоличествоПлан = КоличествоПлан + Направление;
	
	ЗаполнитьМатериалы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	ПеренестиВДокументНаКлиенте();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастройкаФормы(Статус)
	РазрешитьИзменятьСпецификацииВидетьЦену = Пользователи.РолиДоступны("_ГлавныйБухгалтер,_Технолог,ДобавлениеИзменениеНоменклатуры");

	Элементы.Спецификация.ТолькоПросмотр   = Не РазрешитьИзменятьСпецификацииВидетьЦену;
    Элементы.КоличествоПлан.ТолькоПросмотр = Не РазрешитьИзменятьСпецификацииВидетьЦену;
	
	Элементы.Цена.Видимость              = РазрешитьИзменятьСпецификацииВидетьЦену;
	Элементы.Сумма.Видимость             = РазрешитьИзменятьСпецификацииВидетьЦену;
	
	Элементы.УпаковкаЦена.Видимость = РазрешитьИзменятьСпецификацииВидетьЦену;
	Элементы.УпаковкаСумма.Видимость = РазрешитьИзменятьСпецификацииВидетьЦену;
	
	Элементы.КоличествоПлан.ТолькоПросмотр = УправлениеДоступом.ЕстьРоль("_НачальникЦеха")
		И (Статус=ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление._СтатусыПроизводства.Выполнено")
			Или Статус=ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление._СтатусыПроизводства.РасчётЗарплаты"));;
КонецПроцедуры

// Заполнить материалы.
&НаСервере
Процедура ЗаполнитьМатериалы()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Продукция"          , тчПродукция.Выгрузить());
	Запрос.УстановитьПараметр("ТекущаяПродукция"   , Номенклатура);
	Запрос.УстановитьПараметр("ТекущаяСпецификация", Спецификация);
	Запрос.УстановитьПараметр("ТекущееКоличество"  , КоличествоПлан);
	Запрос.УстановитьПараметр("Дата"               , Дата);
	Запрос.УстановитьПараметр("Склад"              , Склад);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.Спецификация КАК Спецификация,
	|	т.КоличествоПлан КАК КоличествоПлан
	|ПОМЕСТИТЬ ТЧ
	|ИЗ
	|	&Продукция КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ТекущаяПродукция КАК Номенклатура,
	|	&ТекущаяСпецификация КАК Спецификация,
	|	&ТекущееКоличество КАК Количество
	|ПОМЕСТИТЬ ПродТек
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.Спецификация КАК Спецификация,
	|	т.КоличествоПлан КАК Количество
	|ПОМЕСТИТЬ ПродДруг
	|ИЗ
	|	ТЧ КАК т
	|ГДЕ
	|	НЕ т.Номенклатура = &ТекущаяПродукция
	|	И т.КоличествоПлан > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Спец.Номенклатура КАК Номенклатура,
	|	Спец.Количество КАК Норма,
	|	Спец.Количество * ПродТек.Количество КАК Количество
	|ПОМЕСТИТЬ МатПродТек
	|ИЗ
	|	ПродТек КАК ПродТек
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры.Товары КАК Спец
	|		ПО ПродТек.Спецификация = Спец.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Спец.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(Спец.Количество) КАК Норма,
	|	СУММА(Спец.Количество * ПродДруг.Количество) КАК Количество
	|ПОМЕСТИТЬ МатПродДруг
	|ИЗ
	|	ПродДруг КАК ПродДруг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры.Товары КАК Спец
	|		ПО ПродДруг.Спецификация = Спец.Ссылка
	|ГДЕ
	|	Спец.Номенклатура В
	|		(ВЫБРАТЬ
	|			т.Номенклатура КАК Номенклатура
	|		ИЗ
	|			МатПродТек КАК т)
	|СГРУППИРОВАТЬ ПО
	|	Спец.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МатПродТек.Номенклатура КАК Номенклатура,
	|	МатПродТек.Норма КАК Норма,
	|	МатПродТек.Количество КАК РасходТек,
	|	МатПродДруг.Количество КАК РасходДруг
	|ПОМЕСТИТЬ Мат
	|ИЗ
	|	МатПродТек КАК МатПродТек
	|		ЛЕВОЕ СОЕДИНЕНИЕ МатПродДруг КАК МатПродДруг
	|		ПО МатПродТек.Номенклатура = МатПродДруг.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Мат.Номенклатура КАК Номенклатура,
	|	Ном.ЕдиницаДляОтчетов КАК Ед,
	|	Мат.Норма КАК Норма,
	|	Мат.РасходДруг КАК РасходЗаСмену,
	|	Мат.РасходТек КАК Количество,
	|	Ном.КоэффициентЕдиницыДляОтчетов КАК Кфц,
	|	Ном.Наименование КАК Наименование
	|ПОМЕСТИТЬ Тов
	|ИЗ
	|	Мат КАК Мат
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|		ПО Мат.Номенклатура = Ном.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ост.Номенклатура КАК Номенклатура,
	|	Ост.ВНаличииОстаток КАК ВНаличииОстаток
	|ПОМЕСТИТЬ Ост
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(&Дата, Склад = &Склад
	|	И Номенклатура В
	|		(ВЫБРАТЬ
	|			т.Номенклатура КАК Номенклатура
	|		ИЗ
	|			Тов КАК т)) КАК Ост
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Тов.Номенклатура КАК Номенклатура,
	|	Тов.Наименование КАК Наименование,
	|	Тов.Ед КАК Ед,
	|	Тов.Норма / Тов.Кфц КАК Норма,
	|	Тов.Кфц КАК Кфц,
	|	ЕСТЬNULL(Ост.ВНаличииОстаток, 0) / Тов.Кфц КАК Остаток,
	|	Тов.РасходЗаСмену / Тов.Кфц КАК РасходЗаСмену,
	|	Тов.Количество / Тов.Кфц КАК Количество,
	|	(ЕСТЬNULL(Ост.ВНаличииОстаток, 0) - ЕСТЬNULL(Тов.РасходЗаСмену, 0) - ЕСТЬNULL(Тов.Количество, 0)) / Тов.Кфц КАК
	|		ОстатокПосле
	|ИЗ
	|	Тов КАК Тов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Ост КАК Ост
	|		ПО Тов.Номенклатура = Ост.Номенклатура";
	
	Товары = Запрос.Выполнить().Выгрузить();
	
	Парам = Новый Структура;
	Парам.Вставить("Дата", Дата);
	Парам.Вставить("Номенклатура", Товары.ВыгрузитьКолонку("Номенклатура"));
		
	МВТ = Новый МенеджерВременныхТаблиц;

	AMS_ВызовСервера.ПолучитьСтоимостьТовара(МВТ, Парам);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.УстановитьПараметр("Товары", Товары);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.Наименование КАК Наименование,
	|	т.Ед КАК Ед,
	|	т.Норма КАК Норма,
	|	т.Кфц КАК Кфц,
	|	т.Остаток КАК Остаток,
	|	т.РасходЗаСмену КАК РасходЗаСмену,
	|	т.Количество КАК Количество,
	|	т.ОстатокПосле КАК ОстатокПосле
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	&Товары КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	вт.Номенклатура КАК Номенклатура,
	|	вт.Наименование КАК Наименование,
	|	вт.Ед КАК Ед,
	|	вт.Норма КАК Норма,
	|	вт.Кфц КАК Кфц,
	|	вт.Остаток КАК Остаток,
	|	вт.РасходЗаСмену КАК РасходЗаСмену,
	|	вт.Количество КАК Количество,
	|	вт.ОстатокПосле КАК ОстатокПосле,
	|	ЕСТЬNULL(ЦенаТовара.Цена, 0) * вт.Кфц КАК Цена,
	|	ЕСТЬNULL(ЦенаТовара.Цена, 0) * вт.Количество * вт.Кфц КАК Сумма
	|ИЗ
	|	вт КАК вт
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЦенаТовара КАК ЦенаТовара
	|		ПО вт.Номенклатура = ЦенаТовара.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	
	Материалы.Очистить();
	
	Рез = Запрос.Выполнить();
	Выб = Рез.Выбрать();
	
	НомерСтроки = 0; 

	Пока Выб.Следующий() Цикл
		Стр = Материалы.Добавить();
		
		НомерСтроки = НомерСтроки + 1;
		ЗаполнитьЗначенияСвойств(Стр, Выб);
		Стр.НомерСтроки = НомерСтроки;
	КонецЦикла;
	
	Сумма = Материалы.Итог("Сумма");
	Цена = Сумма / ?(КоличествоПлан=0,1,КоличествоПлан);
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокументНаКлиенте()
	Парам = Новый Структура;
	Парам.Вставить("Номенклатура"  ,Номенклатура);
	Парам.Вставить("Спецификация"  ,Спецификация);
	Парам.Вставить("КоличествоПлан",КоличествоПлан);
	Парам.Вставить("Цена"          ,Цена);
	
	//Снятие модифицированности, т.к. перед закрытием признак проверяется.
	Модифицированность = Ложь;
	
	Закрыть(Парам);
КонецПроцедуры

#КонецОбласти