#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда 
		Возврат;
	КонецЕсли;
	
	Номенклатура = Неопределено;
	
	Если Параметры.Свойство("Номенклатура",Номенклатура) Тогда
		Данные = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Номенклатура, "Наименование, НаименованиеПолное");
		
		РабочееНаименование = Данные.Наименование;
		НаименованиеПолное  = Данные.НаименованиеПолное;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаименованиеПолноеПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура РабочееНаименованиеПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Записать(Команда)
	Если Модифицированность = Истина Тогда
		Модифицированность = Ложь;
		Закрыть(Новый Структура("Номенклатура, Наименование, НаименованиеПолное", Номенклатура, РабочееНаименование, НаименованиеПолное));
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
