#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НастройкаФормы();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	МассивСтрок = Объект.Товары.Выгрузить(,"Номенклатура").ВыгрузитьКолонку("Номенклатура");
	ПроверитьДубли(Объект.Ссылка,МассивСтрок,Отказ);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастройкаФормы()
	Элементы.Макет.Видимость = AMS_ВызовСервера.ЭтоKhors();
КонецПроцедуры

&НаСервере
Процедура ПроверитьДубли(Ссылка,МассивСтрок,Отказ)
	Запрос = Новый Запрос;
	                               
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	д.Ссылка КАК Продукция,
	|	т.Номенклатура КАК Номенклатура,
	|	т.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Справочник._ПродукцияКомпании.Товары КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник._ПродукцияКомпании КАК д
	|		ПО т.Ссылка = д.Ссылка
	|ГДЕ
	|	т.Номенклатура В(&Номенклатура)" + ?(ЗначениеЗаполнено(Ссылка)," И д.Ссылка <> &Ссылка","");
	
	Запрос.УстановитьПараметр("Ссылка"      , Ссылка);
	Запрос.УстановитьПараметр("Номенклатура", МассивСтрок);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(
				НСтр("ru = 'Номенклатура ""%1"" уже введена для продукции ""%2"" в строке %3'"),
				Выборка.Номенклатура,Выборка.Продукция,Выборка.НомерСтроки),,,,Отказ);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
