
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Данные = ПолучитьИзВременногоХранилища(Параметры.Адрес);
	
	Заголовок   = Данные.Заголовок;
	Организация = Данные.Организация;
	СкладЦех1   = AMS_ВызовСервера.Цех1();
	СкладЦех2   = AMS_ВызовСервера.Цех2();
	СкладЦех3   = AMS_ВызовСервера.Цех3();
	СкладРМ     = AMS_ВызовСервера.СкладРасходныхМатериалов();
	
	СоздатьУсловноеОформление();
	
	ПодготовитьИсходныеДанные(Данные);
	
	ПоказатьТабТовары();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура фЦех1ПриИзменении(Элемент)
	Если фЦех1 = Ложь И фЦех1+фЦех2+фЦех3+фРасходный = 0 Тогда
		фЦех1 = Истина;
		Возврат;
	КонецЕсли;
	
	ПоказатьТабТовары();
	ПересчитатьТаблицу();
	УправлениеЭлементамиФормы();
КонецПроцедуры

&НаКлиенте
Процедура фЦех2ПриИзменении(Элемент)
	Если фЦех2 = Ложь И фЦех1+фЦех2+фЦех3+фРасходный = 0 Тогда
		фЦех2 = Истина;
		Возврат;
	КонецЕсли;
	
	ПоказатьТабТовары();
	ПересчитатьТаблицу();
	УправлениеЭлементамиФормы();
КонецПроцедуры

&НаКлиенте
Процедура фЦех3ПриИзменении(Элемент)
	Если фЦех3 = Ложь И фЦех1+фЦех2+фЦех3+фРасходный = 0 Тогда
		фЦех3 = Истина;
		Возврат;
	КонецЕсли;
	
	ПоказатьТабТовары();
	ПересчитатьТаблицу();
	УправлениеЭлементамиФормы();
КонецПроцедуры

&НаКлиенте
Процедура фРасходныйПриИзменении(Элемент)
	Если фРасходный = Ложь И фЦех1+фЦех2+фЦех3+фРасходный = 0 Тогда
		фРасходный = Истина;
		Возврат;
	КонецЕсли;
	
	ПоказатьТабТовары();
	ПересчитатьТаблицу();
	УправлениеЭлементамиФормы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормытТовары

&НаКлиенте
Процедура тТоварыЦех1ПриИзменении(Элемент)
	Стр = ТекущийЭлемент.ТекущиеДанные;
	
	Номенклатура = Стр.Номенклатура;
	Количество   = Стр.Цех1;
	
	Запомнить(Номенклатура,Количество,"Цех1");
	
	ПересчитатьСтроку(Стр);
	РассчитатьИтог()
КонецПроцедуры

&НаКлиенте
Процедура тТоварыЦех2ПриИзменении(Элемент)
	Стр = ТекущийЭлемент.ТекущиеДанные;
	
	Номенклатура = Стр.Номенклатура;
	Количество   = Стр.Цех2;
	
	Запомнить(Номенклатура,Количество,"Цех2");
	
	ПересчитатьСтроку(Стр);
	РассчитатьИтог()
КонецПроцедуры

&НаКлиенте
Процедура тТоварыЦех3ПриИзменении(Элемент)
	Стр = ТекущийЭлемент.ТекущиеДанные;
	
	Номенклатура = Стр.Номенклатура;
	Количество   = Стр.Цех3;
	
	Запомнить(Номенклатура,Количество,"Цех3");
	
	ПересчитатьСтроку(Стр);
	РассчитатьИтог()
КонецПроцедуры

&НаКлиенте
Процедура тТоварыРасходныйПриИзменении(Элемент)
	Стр = ТекущийЭлемент.ТекущиеДанные;
	
	Номенклатура = Стр.Номенклатура;
	Количество   = Стр.Расходный;
	
	Запомнить(Номенклатура,Количество,"Расходный");
	
	ПересчитатьСтроку(Стр);
	РассчитатьИтог()
КонецПроцедуры

&НаКлиенте
Процедура тТоварыУслугиПриИзменении(Элемент)
	Стр=ТекущийЭлемент.ТекущиеДанные;
	
	Стр.Сумма=Стр.Цена*Стр.Услуги;
	
	РассчитатьИтог()
КонецПроцедуры

&НаКлиенте
Процедура тТоварыЦенаПриИзменении(Элемент)
	Стр=ТекущийЭлемент.ТекущиеДанные;
	
	Если Стр.Номенклатура.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга") Тогда
		Стр.Сумма=Стр.Цена*Стр.Услуги;
	Иначе	
		Стр.Сумма=Стр.Цена*Стр.Количество;
	КонецЕсли; 
	
	РассчитатьИтог()
КонецПроцедуры

&НаКлиенте
Процедура тТоварыСуммаПриИзменении(Элемент)
	Стр=ТекущийЭлемент.ТекущиеДанные;
	
	Стр.Цена=Стр.Сумма/Стр.Итого;
	
	РассчитатьИтог()
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	ПеренестиДанныеВДокумент();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СоздатьУсловноеОформление()
	ЦветФона = ЦветаСтиля.ЦветФонаКнопки;
	
	УсловноеОформление.Элементы.Очистить();
	
	//Доступность ячеек в колонке Цех1
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("тТоварыЦех1");
	
	Отбор = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("тТовары.фЦех1");
	Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Отбор.ПравоеЗначение = Ложь;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветФона);
	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);

	//Доступность ячеек в колонке Цех2
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("тТоварыЦех2");
	
	Отбор = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("тТовары.фЦех2");
	Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Отбор.ПравоеЗначение = Ложь;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветФона);
	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
	
	//Доступность ячеек в колонке Цех3
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("тТоварыЦех3");
	
	Отбор = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("тТовары.фЦех3");
	Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Отбор.ПравоеЗначение = Ложь;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветФона);
	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
	
	//Доступность ячеек в колонке Расходный
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("тТоварыРасходный");
	
	Отбор = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("тТовары.фРасходный");
	Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Отбор.ПравоеЗначение = Ложь;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветФона);
	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
	
	//Доступность ячеек в колонке Услуги
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("тТоварыУслуги");
	
	Отбор = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("тТовары.фУслуги");
	Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Отбор.ПравоеЗначение = Ложь;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветФона);
	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
	
	//Доступность ячеек в колонке Сумма
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("тТоварыСумма");
	
	Отбор = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("тТовары.Итого");
	Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Отбор.ПравоеЗначение = 0;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветФона);
	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
КонецПроцедуры

&НаСервере
Процедура ПодготовитьИсходныеДанные(Данные)
	Флаг = Новый Структура;
	Флаг.Вставить("фЦех1",Ложь);
	Флаг.Вставить("фЦех2",Ложь);
	Флаг.Вставить("фЦех3",Ложь);
	Флаг.Вставить("фРасходный",Ложь);
	Флаг.Вставить("фУслуги",Ложь);
	
	Склад = Данные.Склад;
	
	Результат = ПолучитьДанныеЗапроса(Данные);
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
	   	НовСтр = тТоварыКлиента.Добавить();
		
		ЗаполнитьЗначенияСвойств(НовСтр,Выборка);
		
		Если Выборка.Цех1 > 0 Тогда фЦех1 = Истина;	КонецЕсли;
		Если Выборка.Цех2 > 0 Тогда фЦех2 = Истина;	КонецЕсли;
		Если Выборка.Цех3 > 0 Тогда фЦех3 = Истина;	КонецЕсли;
		Если Выборка.Расходный > 0 Тогда фРасходный = Истина; КонецЕсли;
		
		Если Выборка.фЦех1 Тогда Флаг.фЦех1 = Истина;	КонецЕсли;
		Если Выборка.фЦех2 Тогда Флаг.фЦех2 = Истина;	КонецЕсли;
		Если Выборка.фЦех3 Тогда Флаг.фЦех3 = Истина;	КонецЕсли;
		Если Выборка.фРасходный Тогда Флаг.фРасходный = Истина; КонецЕсли;
		Если Выборка.фУслуги Тогда Флаг.фУслуги = Истина; КонецЕсли;
	КонецЦикла;
	
	КоличествоВыбранныхСкладов = фЦех1 + фЦех2 + фЦех3 + фРасходный;
	
	Элементы.тТоварыУслуги.Видимость = Флаг.фУслуги;
	
	Если КоличествоВыбранныхСкладов = 0 Тогда
		Если НЕ ЗначениеЗаполнено(Склад) Тогда
			фЦех1      = Флаг.фЦех1;
			фЦех2      = Флаг.фЦех2;
			фЦех3      = Флаг.фЦех3;
			фРасходный = Флаг.фРасходный;
				
		ИначеЕсли Склад = Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор("1fe241fb-1785-11e2-8e90-001e67078c9d")) Тогда //Цеха
			фЦех1      = Флаг.фЦех1;
			фЦех2      = Флаг.фЦех2;
			фЦех3      = Флаг.фЦех3;
			фРасходный = Флаг.фРасходный;
			
		Иначе
			фЦех1      = (Склад = СкладЦех1);
			фЦех2      = (Склад = СкладЦех2);
			фЦех3      = (Склад = СкладЦех3);
			фРасходный = (Склад = СкладРМ);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеЗапроса(Данные)
    УстановитьПривилегированныйРежим(Истина);
	
    Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаТекДок", Данные.ДатаТекДок);
	Запрос.УстановитьПараметр("Товары"    , Данные.Товары);
	Запрос.УстановитьПараметр("Партнер"   , Данные.Партнер);
	Запрос.УстановитьПараметр("СкладРМ"   , СкладРМ);
	Запрос.УстановитьПараметр("Цех1"      , СкладЦех1);
	Запрос.УстановитьПараметр("Цех2"      , СкладЦех2);
	Запрос.УстановитьПараметр("Цех3"      , СкладЦех3);
	Запрос.УстановитьПараметр("Старые"    , Справочники.Номенклатура.НайтиПоКоду("01-0000812"));
	
	Запрос.УстановитьПараметр("ВидНоменклатурыРасходные", AMS_ВызовСервера.ВидНоменклатурыРасходные());
	
	Запрос.УстановитьПараметр("СегментМатериалыЦеха1", AMS_ВызовСервера.СегментыНоменклатурыМатериалыЦеха1());
	Запрос.УстановитьПараметр("СегментМатериалыЦеха2", AMS_ВызовСервера.СегментыНоменклатурыМатериалыЦеха2());
	Запрос.УстановитьПараметр("СегментМатериалыЦеха3", AMS_ВызовСервера.СегментыНоменклатурыМатериалыЦеха3());
	
	Запрос.УстановитьПараметр("СегментУпаковкаЦеха1", AMS_ВызовСервера.СегментыНоменклатурыУпаковкаЦеха1());
	Запрос.УстановитьПараметр("СегментУпаковкаЦеха2", AMS_ВызовСервера.СегментыНоменклатурыУпаковкаЦеха2());
	Запрос.УстановитьПараметр("СегментУпаковкаЦеха3", AMS_ВызовСервера.СегментыНоменклатурыУпаковкаЦеха3());

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	т.Склад КАК Склад,
	|	т.Номенклатура КАК Номенклатура,
	|	т.Количество КАК Количество,
	|	т.Сумма КАК Сумма
	|ПОМЕСТИТЬ т
	|ИЗ
	|	&Товары КАК т
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Склад КАК Склад,
	|	т.Номенклатура КАК Номенклатура,
	|	СпрНом.ТипНоменклатуры КАК ТипНоменклатуры,
	|	СУММА(т.Количество) КАК Количество,
	|	СУММА(т.Сумма) КАК Сумма
	|ПОМЕСТИТЬ тч
	|ИЗ
	|	т КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНом
	|		ПО т.Номенклатура = СпрНом.Ссылка
	|СГРУППИРОВАТЬ ПО
	|	т.Склад,
	|	т.Номенклатура,
	|	СпрНом.ТипНоменклатуры
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Ссылка КАК Номенклатура
	|ПОМЕСТИТЬ стар
	|ИЗ
	|	Справочник.Номенклатура КАК т
	|ГДЕ
	|	т.Родитель = &Старые
	|	И НЕ т.ЭтоГруппа
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	тов.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ н
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг.Товары КАК тов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг КАК док
	|		ПО тов.Ссылка = док.Ссылка
	|ГДЕ
	|	док.Партнер = &Партнер
	|	И НЕ тов.Номенклатура В
	|		(ВЫБРАТЬ
	|			стар.Номенклатура
	|		ИЗ
	|			стар КАК стар)
	|	И док.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	тч.Номенклатура
	|ИЗ
	|	тч КАК тч
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	н.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ но
	|ИЗ
	|	н КАК н
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	но.Номенклатура КАК Номенклатура,
	|	СпрНом.ЕдиницаДляОтчетов КАК ЕдиницаДляОтчетов,
	|	СпрНом.КоэффициентЕдиницыДляОтчетов КАК Кфц,
	|	СпрНом.Наименование
	|ПОМЕСТИТЬ ном
	|ИЗ
	|	но КАК но
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНом
	|		ПО но.Номенклатура = СпрНом.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ном.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(Док.Ссылка) КАК Ссылка
	|ПОМЕСТИТЬ ц
	|ИЗ
	|	ном КАК ном
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг.Товары КАК Тов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг КАК Док
	|			ПО Тов.Ссылка = Док.Ссылка
	|		ПО ном.Номенклатура = Тов.Номенклатура
	|ГДЕ
	|	НЕ Док.ПометкаУдаления
	|	И Док.Дата < &ДатаТекДок
	|	И Док.Партнер = &Партнер
	|СГРУППИРОВАТЬ ПО
	|	ном.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Тов.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(Тов.Сумма / ЕСТЬNULL(Тов.Количество, 1)) КАК Цена
	|ПОМЕСТИТЬ цен
	|ИЗ
	|	ном КАК ном
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ц КАК ц
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг.Товары КАК Тов
	|			ПО ц.Ссылка = Тов.Ссылка
	|			И ц.Номенклатура = Тов.Номенклатура
	|		ПО ном.Номенклатура = ц.Номенклатура
	|СГРУППИРОВАТЬ ПО
	|	Тов.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	ИСТИНА КАК фЦех1
	|ПОМЕСТИТЬ сег1
	|ИЗ
	|	ном КАК ном
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК т
	|		ПО ном.Номенклатура = т.Номенклатура
	|ГДЕ
	|	т.Сегмент В (&СегментМатериалыЦеха1, &СегментУпаковкаЦеха1)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	ИСТИНА КАК фЦех2
	|ПОМЕСТИТЬ сег2
	|ИЗ
	|	ном КАК ном
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК т
	|		ПО ном.Номенклатура = т.Номенклатура
	|ГДЕ
	|	т.Сегмент В (&СегментМатериалыЦеха2, &СегментУпаковкаЦеха2)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	ИСТИНА КАК фЦех3
	|ПОМЕСТИТЬ сег3
	|ИЗ
	|	ном КАК ном
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК т
	|		ПО ном.Номенклатура = т.Номенклатура
	|ГДЕ
	|	т.Сегмент В (&СегментМатериалыЦеха3, &СегментУпаковкаЦеха3)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Ссылка КАК Номенклатура,
	|	ИСТИНА КАК фРасходный
	|ПОМЕСТИТЬ сег4
	|ИЗ
	|	ном КАК ном
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК т
	|		ПО ном.Номенклатура = т.Ссылка
	|ГДЕ
	|	т.ВидНоменклатуры = &ВидНоменклатурыРасходные
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Ссылка КАК Номенклатура,
	|	ИСТИНА КАК фУслуги
	|ПОМЕСТИТЬ сег5
	|ИЗ
	|	ном КАК ном
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК т
	|		ПО ном.Номенклатура = т.Ссылка
	|ГДЕ
	|	т.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тч.Номенклатура КАК Номенклатура,
	|	тч.Количество КАК Цех1
	|ПОМЕСТИТЬ к1
	|ИЗ
	|	тч КАК тч
	|ГДЕ
	|	тч.Склад = &Цех1
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тч.Номенклатура КАК Номенклатура,
	|	тч.Количество КАК Цех2
	|ПОМЕСТИТЬ к2
	|ИЗ
	|	тч КАК тч
	|ГДЕ
	|	тч.Склад = &Цех2
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тч.Номенклатура КАК Номенклатура,
	|	тч.Количество КАК Цех3
	|ПОМЕСТИТЬ к3
	|ИЗ
	|	тч КАК тч
	|ГДЕ
	|	тч.Склад = &Цех3
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тч.Номенклатура КАК Номенклатура,
	|	тч.Количество КАК Расходный
	|ПОМЕСТИТЬ к4
	|ИЗ
	|	тч КАК тч
	|ГДЕ
	|	тч.Склад = &СкладРМ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тч.Номенклатура КАК Номенклатура,
	|	тч.Количество КАК Услуги
	|ПОМЕСТИТЬ к5
	|ИЗ
	|	тч КАК тч
	|ГДЕ
	|	тч.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ном.Номенклатура КАК Номенклатура,
	|	ном.Наименование КАК Наименование,
	|	ном.ЕдиницаДляОтчетов КАК Упаковка,
	|	ВЫБОР
	|		КОГДА тч.Количество ЕСТЬ NULL
	|		ИЛИ тч.Количество = 0
	|		ИЛИ тч.Сумма = 0
	|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(цен.Цена * ном.Кфц, 0) КАК ЧИСЛО(10, 2))
	|		ИНАЧЕ ВЫРАЗИТЬ(тч.Сумма / тч.Количество КАК ЧИСЛО(10, 2))
	|	КОНЕЦ КАК Цена,
	|	ЕСТЬNULL(тч.Сумма, 0) КАК Сумма,
	|	ЕСТЬNULL(сег1.фЦех1, ЛОЖЬ) КАК фЦех1,
	|	ЕСТЬNULL(сег2.фЦех2, ЛОЖЬ) КАК фЦех2,
	|	ЕСТЬNULL(сег3.фЦех3, ЛОЖЬ) КАК фЦех3,
	|	ЕСТЬNULL(сег4.фРасходный, ЛОЖЬ) КАК фРасходный,
	|	ЕСТЬNULL(сег5.фУслуги, ЛОЖЬ) КАК фУслуги,
	|	ВЫБОР
	|		КОГДА тч.Склад = &Цех1
	|			ТОГДА ЕСТЬNULL(к1.Цех1 / ном.Кфц, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Цех1,
	|	ВЫБОР
	|		КОГДА тч.Склад = &Цех2
	|			ТОГДА ЕСТЬNULL(к2.Цех2 / ном.Кфц, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Цех2,
	|	ВЫБОР
	|		КОГДА тч.Склад = &Цех3
	|			ТОГДА ЕСТЬNULL(к3.Цех3 / ном.Кфц, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Цех3,
	|	ВЫБОР
	|		КОГДА тч.Склад = &СкладРМ
	|			ТОГДА ЕСТЬNULL(к4.Расходный / ном.Кфц, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Расходный,
	|	ВЫБОР
	|		КОГДА тч.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|			ТОГДА ЕСТЬNULL(к5.Услуги, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Услуги,
	|	ЕСТЬNULL(к1.Цех1 / ном.Кфц, 0) + ЕСТЬNULL(к2.Цех2 / ном.Кфц, 0) + ЕСТЬNULL(к3.Цех3 / ном.Кфц, 0) +
	|		ЕСТЬNULL(к4.Расходный / ном.Кфц, 0) КАК Количество,
	|	ЕСТЬNULL(к1.Цех1 / ном.Кфц, 0) + ЕСТЬNULL(к2.Цех2 / ном.Кфц, 0) + ЕСТЬNULL(к3.Цех3 / ном.Кфц, 0) +
	|		ЕСТЬNULL(к4.Расходный / ном.Кфц, 0) КАК Итого
	|ИЗ
	|	ном КАК ном
	|		ЛЕВОЕ СОЕДИНЕНИЕ цен КАК цен
	|		ПО ном.Номенклатура = цен.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ тч КАК тч
	|		ПО ном.Номенклатура = тч.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ сег1 КАК сег1
	|		ПО ном.Номенклатура = сег1.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ сег2 КАК сег2
	|		ПО ном.Номенклатура = сег2.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ сег3 КАК сег3
	|		ПО ном.Номенклатура = сег3.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ сег4 КАК сег4
	|		ПО ном.Номенклатура = сег4.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ сег5 КАК сег5
	|		ПО ном.Номенклатура = сег5.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ к1 КАК к1
	|		ПО ном.Номенклатура = к1.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ к2 КАК к2
	|		ПО ном.Номенклатура = к2.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ к3 КАК к3
	|		ПО ном.Номенклатура = к3.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ к4 КАК к4
	|		ПО ном.Номенклатура = к4.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ к5 КАК к5
	|		ПО ном.Номенклатура = к5.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат;
КонецФункции

&НаСервере
Процедура ПоказатьТабТовары()
	Табл = РеквизитФормыВЗначение("тТовары");
	
	Табл.Очистить();
	
	Результат = ПолучитьДанныеПоТоварам();
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
	   	НовСтр = Табл.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,Выборка);
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(Табл,"тТовары");
	
	Всего=тТовары.Итог("Сумма");
	
	УправлениеЭлементамиФормы();
КонецПроцедуры

&НаСервере
Процедура УправлениеЭлементамиФормы()
	Элементы.ГруппаЦеха.Видимость = (Флаг.фЦех1+Флаг.фЦех2+Флаг.фЦех3+Флаг.фРасходный>1);
	
	Элементы.фЦех1.Видимость     = Флаг.фЦех1;
	Элементы.фЦех2.Видимость     = Флаг.фЦех2;
	Элементы.фЦех3.Видимость     = Флаг.фЦех3;
	Элементы.фРасходный.Видимость= Флаг.фРасходный;
	
	Элементы.тТоварыЦех1.Видимость     = фЦех1;
	Элементы.тТоварыЦех2.Видимость     = фЦех2;
	Элементы.тТоварыЦех3.Видимость     = фЦех3;
	Элементы.тТоварыРасходный.Видимость=фРасходный;
	
	Элементы.тТоварыЦеха.Видимость  = (фЦех1+фЦех2+фЦех3+фРасходный>0);
	Элементы.тТоварыИтого.Видимость = (фЦех1+фЦех2+фЦех3+фРасходный>1);
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеПоТоварам()
    УстановитьПривилегированныйРежим(Истина);
	
    Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Товары"       ,тТовары.Выгрузить());
	Запрос.УстановитьПараметр("ТоварыКлиента",тТоварыКлиента.Выгрузить());
	Запрос.УстановитьПараметр("СкладРМ"      ,СкладРМ);
	Запрос.УстановитьПараметр("фЦех1"        ,фЦех1);
	Запрос.УстановитьПараметр("фЦех2"        ,фЦех2);
	Запрос.УстановитьПараметр("фЦех3"        ,фЦех3);
	Запрос.УстановитьПараметр("фРасходный"   ,фРасходный);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	т.Номенклатура,
	|	т.Упаковка,
	|	т.Цена,
	|	т.Сумма,
	|	т.Цех1,
	|	т.Цех2,
	|	т.Цех3,
	|	т.Расходный,
	|	т.Услуги
	|ПОМЕСТИТЬ док
	|ИЗ
	|	&Товары КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	т.Номенклатура,
	|	т.Упаковка,
	|	т.Цена,
	|	т.Сумма,
	|	т.Цех1,
	|	т.Цех2,
	|	т.Цех3,
	|	т.Расходный,
	|	т.Услуги,
	|	т.фЦех1,
	|	т.фЦех2,
	|	т.фЦех3,
	|	т.фРасходный,
	|	т.фУслуги
	|ПОМЕСТИТЬ спр
	|ИЗ
	|	&ТоварыКлиента КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА спр.Номенклатура ЕСТЬ NULL 
	|			ТОГДА док.Номенклатура
	|		ИНАЧЕ спр.Номенклатура
	|	КОНЕЦ КАК Номенклатура
	|ПОМЕСТИТЬ тов
	|ИЗ
	|	док КАК док
	|		ПОЛНОЕ СОЕДИНЕНИЕ спр КАК спр
	|		ПО док.Номенклатура = спр.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тов.Номенклатура,
	|	спр.Упаковка КАК Упаковка,
	|	ВЫБОР
	|		КОГДА док.Цена ЕСТЬ NULL 
	|			ТОГДА спр.Цена
	|		ИНАЧЕ док.Цена
	|	КОНЕЦ КАК Цена,
	|	ВЫБОР
	|		КОГДА док.Сумма ЕСТЬ NULL 
	|			ТОГДА спр.Сумма
	|		ИНАЧЕ док.Сумма
	|	КОНЕЦ КАК Сумма,
	|	ЕСТЬNULL(спр.фЦех1, ЛОЖЬ) КАК фЦех1,
	|	ЕСТЬNULL(спр.фЦех2, ЛОЖЬ) КАК фЦех2,
	|	ЕСТЬNULL(спр.фЦех3, ЛОЖЬ) КАК фЦех3,
	|	ЕСТЬNULL(спр.фРасходный, ЛОЖЬ) КАК фРасходный,
	|	ЕСТЬNULL(спр.фУслуги, ЛОЖЬ) КАК фУслуги,
	|	ВЫБОР КОГДА док.Цех1 ЕСТЬ NULL 
	|		  ТОГДА ВЫБОР КОГДА &фЦех1 ТОГДА спр.Цех1 ИНАЧЕ 0 КОНЕЦ
	|		  ИНАЧЕ док.Цех1
	|	КОНЕЦ КАК Цех1,
	|	ВЫБОР КОГДА док.Цех2 ЕСТЬ NULL 
	|		  ТОГДА ВЫБОР КОГДА &фЦех2 ТОГДА спр.Цех2 ИНАЧЕ 0 КОНЕЦ
	|		  ИНАЧЕ док.Цех2
	|	КОНЕЦ КАК Цех2,
	|	ВЫБОР КОГДА док.Цех3 ЕСТЬ NULL 
	|		  ТОГДА ВЫБОР КОГДА &фЦех3 ТОГДА спр.Цех3 ИНАЧЕ 0 КОНЕЦ 
	|		  ИНАЧЕ док.Цех3
	|	КОНЕЦ КАК Цех3,
	|	ВЫБОР КОГДА док.Расходный ЕСТЬ NULL 
	|		  ТОГДА ВЫБОР КОГДА &фРасходный ТОГДА спр.Расходный ИНАЧЕ 0 КОНЕЦ
	|		  ИНАЧЕ док.Расходный
	|	КОНЕЦ КАК Расходный,
	|	ВЫБОР
	|		КОГДА док.Услуги ЕСТЬ NULL 
	|			ТОГДА спр.Услуги
	|		ИНАЧЕ док.Услуги
	|	КОНЕЦ КАК Услуги
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	тов КАК тов
	|		ЛЕВОЕ СОЕДИНЕНИЕ спр КАК спр
	|		ПО тов.Номенклатура = спр.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ док КАК док
	|		ПО тов.Номенклатура = док.Номенклатура
	|ГДЕ
	|	(спр.фЦех1
	|				И &фЦех1
	|			ИЛИ спр.фЦех2
	|				И &фЦех2
	|			ИЛИ спр.фЦех3
	|				И &фЦех3
	|			ИЛИ спр.фРасходный
	|				И &фРасходный
	|			ИЛИ спр.фУслуги)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.Номенклатура,
	|	вт.Упаковка,
	|	вт.Цена,
	|	вт.Сумма,
	|	вт.фЦех1,
	|	вт.фЦех2,
	|	вт.фЦех3,
	|	вт.фРасходный,
	|	вт.фУслуги,
	|	вт.Цех1,
	|	вт.Цех2,
	|	вт.Цех3,
	|	вт.Расходный,
	|	вт.Услуги,
	|	ЕСТЬNULL(вт.Цех1, 0) + ЕСТЬNULL(вт.Цех2, 0) + ЕСТЬNULL(вт.Цех3, 0) + ЕСТЬNULL(вт.Расходный, 0) + ЕСТЬNULL(вт.Услуги, 0) КАК Итого
	|ИЗ
	|	вт КАК вт
	|
	|УПОРЯДОЧИТЬ ПО
	|	вт.Номенклатура.Наименование
	|";
	Результат = Запрос.Выполнить();
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ПеренестиДанныеВДокумент()
	// Снятие модифицированности, т.к. перед закрытием признак проверяется.
	Модифицированность = Ложь;

	Данные = ПолучитьДанныеПодбора();
	
	Закрыть(Данные);
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеПодбора()
	Сумма1 = 0; Сумма2 = 0;	Сумма3 = 0;	Сумма4 = 0;
	мЦех1 = Ложь; мЦех2 = Ложь; мЦех3 = Ложь; мРасходный = Ложь;
	
	Товары.Очистить();
	
	Для каждого Стр Из тТовары Цикл
        Если Стр.Услуги > 0 Тогда 
            ДобавитьСтроку(Стр,Стр.Услуги,Стр.Сумма,Справочники.Склады.ПустаяСсылка());
			
		Иначе
			Если Стр.Итого = 0 Тогда
				Продолжить;
	        КонецЕсли;
			
			Цена = Окр(Стр.Сумма / Стр.Итого,2);
			
			Если фЦех1 И Стр.Цех1 > 0 Тогда
				Сумма1 = Цена * Стр.Цех1;
				Край = 1;
	        КонецЕсли;
			
			Если фЦех2 И Стр.Цех2 > 0 Тогда 
				Сумма2 = Цена * Стр.Цех2;
				Край = 2;
	        КонецЕсли;
			
			Если фЦех3 И Стр.Цех3 > 0 Тогда 
				Сумма3 = Цена * Стр.Цех3;
				Край = 3;
	        КонецЕсли;
			
			Если фРасходный И Стр.Расходный > 0 Тогда 
				Сумма4 = Цена * Стр.Расходный;
				Край = 4;
	        КонецЕсли;
			
			Если Край = 1 Тогда
				Остаток = Стр.Сумма - 0;
				Сумма1 = Остаток;
			ИначеЕсли Край = 2 Тогда
				Остаток = Стр.Сумма - Сумма1;
				Сумма2 = Остаток;
			ИначеЕсли Край = 3 Тогда
				Остаток = Стр.Сумма - Сумма1 - Сумма2;
				Сумма3 = Остаток;
			ИначеЕсли Край = 4 Тогда
				Остаток = Стр.Сумма - Сумма1 - Сумма2 - Сумма3;
				Сумма4 = Остаток;
	        КонецЕсли;
			
			Если фЦех1 И Стр.Цех1 > 0 Тогда 
	            ДобавитьСтроку(Стр,Стр.Цех1,Сумма1,СкладЦех1);
				мЦех1 = Истина;
	        КонецЕсли;
			
			Если фЦех2 И Стр.Цех2 > 0 Тогда 
	            ДобавитьСтроку(Стр,Стр.Цех2,Сумма2,СкладЦех2);
				мЦех2 = Истина;
	        КонецЕсли;
			
			Если фЦех3 И Стр.Цех3 > 0 Тогда 
	            ДобавитьСтроку(Стр,Стр.Цех3,Сумма3,СкладЦех3);
				мЦех3 = Истина;
	        КонецЕсли;
			
			Если фРасходный И Стр.Расходный > 0 Тогда 
	            ДобавитьСтроку(Стр,Стр.Расходный,Сумма4,СкладРМ);
				мРасходный = Истина;
	        КонецЕсли;
        КонецЕсли;
    КонецЦикла;
	
	Табл = РеквизитФормыВЗначение("Товары");
	
	МассивСтрок = Новый Массив;
	Для каждого Стр Из Табл Цикл
		МассивСтрок.Добавить(ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Стр));
	КонецЦикла;
    
    //Определить Склад
	СкладГруппа = Ложь;
	КоличествоСкладов = мЦех1 + мЦех2 + мЦех3 + мРасходный;
	Если КоличествоСкладов > 1 Тогда
		СкладГруппа = Истина;
		Склад = Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор("1fe241fb-1785-11e2-8e90-001e67078c9d")); //Цеха
		
	ИначеЕсли КоличествоСкладов = 1 Тогда
		Если мЦех1 Тогда
			Склад = СкладЦех1;
			
		ИначеЕсли мЦех2 Тогда
			Склад = СкладЦех2;
			
		ИначеЕсли мЦех3 Тогда
			Склад = СкладЦех2;
			
		ИначеЕсли мРасходный Тогда
			Склад = СкладРМ;
		КонецЕсли;
		
	ИначеЕсли КоличествоСкладов = 0 Тогда
		Склад = Справочники.Склады.ПустаяСсылка();
	КонецЕсли;
	
	Данные = Новый Структура;
	Данные.Вставить("Склад",Склад);
	Данные.Вставить("СкладГруппа",СкладГруппа);
	Данные.Вставить("МассивСтрок",МассивСтрок);
	
	Возврат Данные;
КонецФункции

&НаСервере
Процедура ДобавитьСтроку(Стр,Количество,Сумма,Склад)
    НовСтр = Товары.Добавить();
    
    Номенклатура = Стр.Номенклатура;
    
    ДанныеНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Номенклатура,"ТипНоменклатуры,_СтатьяРасходов");
    
    НовСтр.Номенклатура       = Номенклатура;
    НовСтр.Упаковка           = Стр.Упаковка;
    НовСтр.КоличествоУпаковок = Количество;
    НовСтр.Сумма              = Сумма;
    НовСтр.ТипНоменклатуры    = ДанныеНоменклатуры.ТипНоменклатуры;
    НовСтр.Склад              = Склад;
    НовСтр.КодСтроки          = 0;
    
    Если Склад = Справочники.Склады.ПустаяСсылка() Тогда //Услуга
        НовСтр.АналитикаРасходовОбязательна = Истина;
        НовСтр.Подразделение                = AMS_ВызовСервера.ПодразделениеПроизводство();
        НовСтр.СтатьяРасходов               = ДанныеНоменклатуры._СтатьяРасходов;
		НовСтр.АналитикаРасходов            = Организация;
    Иначе 
        НовСтр.АналитикаРасходовОбязательна = Ложь;
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьТаблицу()
	Для каждого Стр Из тТовары Цикл
		ПересчитатьСтроку(Стр);
	КонецЦикла;
	
	РассчитатьИтог()
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСтроку(Стр)
	Итого = ?(фЦех1,Стр.Цех1,0) + ?(фЦех2,Стр.Цех2,0) + ?(фЦех3,Стр.Цех3,0) + ?(фРасходный,Стр.Расходный,0) + Стр.Услуги;
	
	Стр.Итого = Итого;
	Стр.Сумма = Стр.Цена*Итого;
КонецПроцедуры

&НаСервере
Процедура РассчитатьИтог()
	Всего=тТовары.Итог("Сумма");
КонецПроцедуры

&НаСервере
Процедура Запомнить(Номенклатура,Количество,Колонка)
	Табл = РеквизитФормыВЗначение("тТоварыКлиента");
	
	Стр = Табл.Найти(Номенклатура,"Номенклатура");
	
	Стр[Колонка] = Количество;
	
	Итого = ?(фЦех1,Стр.Цех1,0) + ?(фЦех2,Стр.Цех2,0) + ?(фЦех3,Стр.Цех3,0) + ?(фРасходный,Стр.Расходный,0) + Стр.Услуги;
	Стр.Сумма = Стр.Цена*Итого;
	
	ЗначениеВРеквизитФормы(Табл,"тТоварыКлиента");
КонецПроцедуры

#КонецОбласти
