#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "ТоварыНоменклатураНаименованиеПолное" Тогда
		ПараметрыФормы = Новый Структура("Номенклатура", Элемент.ТекущиеДанные.Номенклатура);
		ОткрытьФорму("Справочник.AMS_Продукция.Форма.ФормаНаименований", ПараметрыФормы, , , , ,
			Новый ОписаниеОповещения("РедактированиеНаименованийЗавершение", ЭтотОбъект),
			РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РедактированиеНаименованийЗавершение(Результат, ДополнительныеПераметры) Экспорт
	Если Не Результат = Неопределено Тогда
		ЗаписатьИзменениеНаименований(Результат);
		Прочитать();
		ОбновитьИнтерфейс();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИзменениеНаименований(Результат)
	УстановитьПривилегированныйРежим(Истина);
	
	Продукция = Результат.Номенклатура.ПолучитьОбъект();
	
	Продукция.Наименование       = Результат.Наименование;		
	Продукция.НаименованиеПолное = Результат.НаименованиеПолное;

	Продукция.Записать();
КонецПроцедуры

#КонецОбласти