#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Не ЗначениеЗаполнено(Склад) Тогда
		Склад = AMS_ВызовСервера.Цех1();
	КонецЕсли;

	НастройкаФормы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	НастройкаФормы();
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	НастройкаФормы();
	Если ТекущаяСтраница = Элементы.СтраницаСтоимостьРабот Тогда
		ПоказатьСтоимостьРабот();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	НастройкаФормы();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастройкаФормы()
	ТекущаяСтраница = Элементы.Страницы.ТекущаяСтраница;

	Если Склад = AMS_ВызовСервера.СкладПродукции() Тогда
		Элементы.СтраницаСтоимостьФасовки.Видимость = Ложь;

		Если ТекущаяСтраница = Элементы.СтраницаСтоимостьРабот Тогда
			ПоказатьСтоимостьРабот();
		КонецЕсли;

	Иначе
		Элементы.СтраницаСтоимостьФасовки.Видимость = Истина;

		Если ТекущаяСтраница = Элементы.СтраницаСтоимостьРабот Тогда
			ПоказатьСтоимостьРабот();
		КонецЕсли;

		Если ТекущаяСтраница = Элементы.СтраницаСтоимостьФасовки Тогда
			ПоказатьСтоимостьФасовки();
		КонецЕсли;
	КонецЕсли;

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Склад", Склад,
		ВидСравненияКомпоновкиДанных.Равно, , ЗначениеЗаполнено(Склад));
КонецПроцедуры

&НаСервере
Процедура ПоказатьСтоимостьРабот()
	СКД = Документы._УстановкаСтоимостиРабот.ПолучитьМакет("скдСтоимостьРабот");

	Настройки = СКД.НастройкиПоУмолчанию;

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Настройки.Отбор, "Склад", Склад,
		ВидСравненияКомпоновкиДанных.Равно, , ЗначениеЗаполнено(Склад));

	Работы.Очистить();

	Данные = Новый Структура;
	Данные.Вставить("СКД", СКД);
	Данные.Вставить("Результат", Работы);
	Данные.Вставить("Настройки", Настройки);

	AMS_ВызовСервера.ВыполнитьСКД(Данные);
КонецПроцедуры

&НаСервере
Процедура ПоказатьСтоимостьФасовки()
	СКД = Документы._УстановкаСтоимостиРабот.ПолучитьМакет("скдСтоимостьФасовки");

	Настройки = СКД.НастройкиПоУмолчанию;

	Парам = Новый Структура;
	Парам.Вставить("СегментыПродукцияКомпании", AMS_ВызовСервера.СегментыНоменклатурыПродукцияКомпании());

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Настройки.Отбор, "ВидНоменклатуры",
		мср.СоответствиеЦехВидНоменклатуры().Получить(Склад), ВидСравненияКомпоновкиДанных.ВСписке,,ЗначениеЗаполнено(Склад));

	Товары.Очистить();

	Данные = Новый Структура;
	Данные.Вставить("СКД", СКД);
	Данные.Вставить("Результат", Товары);
	Данные.Вставить("Параметры", Парам);
	Данные.Вставить("Настройки", Настройки);

	AMS_ВызовСервера.ВыполнитьСКД(Данные);
КонецПроцедуры

#КонецОбласти


