#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда	

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	// Если это рекурсивный вызов – ничего не делать.
	Если НЕ Параметры.Свойство("Рекурсия") 
		И Пользователи.РолиДоступны("_НачальникСклада") 
		И Не AMS_ВызовСервера.ЭтоKhors() Тогда
			
		СтандартнаяОбработка = Ложь;

		// Получить стандартный список выбора.
		Параметры.Вставить("Рекурсия");

		Список = ПолучитьДанныеВыбора(Параметры);

		Список.Очистить();

		Список.Добавить(Погрузка);
		Список.Добавить(Отправлено);
			
		ДанныеВыбора = Список;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти		

#КонецЕсли
