
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекстЗапроса = Параметры.ТекстЗапроса;
	ИсходныйДокумент = Параметры.ИсходныйДокумент;
	Ссылка = Параметры.Ссылка;
	Номенклатура = Параметры.Номенклатура;

	СформироватьОтчетНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьОтчетНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьОтчетНаСервере()
	
	ОбъектОтчет = РеквизитФормыВЗначение("Отчет");
	СхемаКомпоновкиДанных = ОбъектОтчет.ПолучитьМакет("РасшифровкаПоКоробам");
	СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1.Запрос = ТекстЗапроса;
	
	НастройкиКомпановки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	ПараметрыДанных = НастройкиКомпановки.ПараметрыДанных.Элементы;
	
	Элемент = ПараметрыДанных.Добавить();
	Элемент.Значение = Ссылка;
	Элемент.Использование = Истина;
	Элемент.Параметр = Новый ПараметрКомпоновкиДанных("Ссылка");
	
	Элемент = ПараметрыДанных.Добавить();
	Элемент.Значение = ИсходныйДокумент;
	Элемент.Использование = Истина;
	Элемент.Параметр = Новый ПараметрКомпоновкиДанных("ИсходныйДокумент");
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		Отборы = НастройкиКомпановки.Отбор.Элементы;
		Элемент = Отборы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура");
		Элемент.ПравоеЗначение = Номенклатура;
	КонецЕсли;
	
	КомпоновщикМакетаОСКД = Новый КомпоновщикМакетаКомпоновкиДанных;
	Макет = КомпоновщикМакетаОСКД.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпановки);
	ПроцессорКомпоновкиОСКД = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиОСКД.Инициализировать(Макет);
	Результат.Очистить();
	
	ПроцессорВыводаОСКД = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВыводаОСКД.УстановитьДокумент(Результат);
	ПроцессорВыводаОСКД.Вывести(ПроцессорКомпоновкиОСКД);
	
	Результат.ПоказатьУровеньГруппировокСтрок(1);
	
КонецПроцедуры

#КонецОбласти

