
Процедура ИзменитьДанныеЗаписи(СтруктураСтроки, СтруктураПоиска, ТаблицаДанных, ЭтоОтменаСтроки)

	СтруктураПоиска.ИдентификаторСтроки = СтруктураСтроки.ИдентификаторСтроки;
	
	МассивСтрок = ТаблицаДанных.НайтиСтроки(СтруктураПоиска);
	
	Если МассивСтрок.Количество() Тогда
		
		Для Каждого СтрокаМассива Из МассивСтрок Цикл
			
			Если Не ЭтоОтменаСтроки Тогда
				СтрокаМассива.КоличествоНаборов = 1;
			Иначе
				СтрокаМассива.КоличествоНаборов = -1;	
			КонецЕсли;	
			Прервать;
			
		КонецЦикла;	
		
	КонецЕсли;
	
КонецПроцедуры

// Обновление данных количества маркируемых наборов в ТЧ Подбора документа ТСД.
// 
// Параметры:
//  ДокументТСД - СправочникОбъект.ДатаМобайл_ДокументыТСД - обрабатываемый документ ТСД.
//  СтруктураСтроки - Структура - структура данных передаваемой строки.
//	ЭтоОтменаСтроки - Булево - признак отмены строки.
Процедура ОбновлениеДанныхНаборов(ДокументТСД, СтруктураСтроки, ЭтоОтменаСтроки) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст =     
	
	"ВЫБРАТЬ
	|	ВТ.КМНабораСсылка КАК КМНабораСсылка,
	|	ВТ.ВариантКомплектацииНабора КАК ВариантКомплектацииНабора,
	|	ВТ.Номенклатура КАК Номенклатура,
	|	ВТ.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ.Количество * ВТ.КоэффициентЕдиницы КАК Количество
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&ВТ КАК ВТ
	|;
	|//////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Данные.КМНабораСсылка КАК КМНабораСсылка,
	|	Данные.ВариантКомплектацииНабора КАК ВариантКомплектацииНабора,
	|	Данные.Номенклатура КАК Номенклатура,
	|	Данные.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СУММА(Данные.Количество) КАК Количество
	|ПОМЕСТИТЬ ДанныеПодбора
	|ИЗ
	|	ВТ КАК Данные
	|ГДЕ
	|	НЕ Данные.ВариантКомплектацииНабора = ЗНАЧЕНИЕ(Справочник.ВариантыКомплектацииНоменклатуры.ПустаяСсылка)
	|   И Данные.КМНабораСсылка = &КМНабораСсылка                    
	|
	|СГРУППИРОВАТЬ ПО
	|	Данные.КМНабораСсылка,
	|	Данные.ВариантКомплектацииНабора,
	|	Данные.Номенклатура,
	|	Данные.ХарактеристикаНоменклатуры 
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВариантКомплектацииНабора,
	|	Номенклатура,
	|	ХарактеристикаНоменклатуры
    |
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка КАК Ссылка,
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК Номенклатура,
	|	ВариантыКомплектацииНоменклатурыТовары.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА СУММА(ВариантыКомплектацииНоменклатурыТовары.Ссылка.Количество) = 0
	|			ТОГДА 0
	|		ИНАЧЕ СУММА(ВариантыКомплектацииНоменклатурыТовары.Количество) / СУММА(ВариантыКомплектацииНоменклатурыТовары.Ссылка.Количество)
	|	КОНЕЦ КАК КоличествоВНаборе
	|ПОМЕСТИТЬ Состав
	|ИЗ
	|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
	|ГДЕ
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				ДанныеПодбора.ВариантКомплектацииНабора КАК ВариантКомплектацииНабора
	|			ИЗ
	|				ДанныеПодбора КАК ДанныеПодбора)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка,
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура,
	|	ВариантыКомплектацииНоменклатурыТовары.Характеристика
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеПодбора.КМНабораСсылка КАК КМНабораСсылка,
	|	ДанныеПодбора.ВариантКомплектацииНабора КАК ВариантКомплектацииНабора,
	|	Состав.Ссылка КАК Ссылка,
	|	Состав.Номенклатура КАК Номенклатура,
	|	Состав.Характеристика КАК Характеристика,
	|	Состав.КоличествоВНаборе КАК КоличествоВНаборе
	|ПОМЕСТИТЬ ДетализацияНабораПоСоставу
	|ИЗ
	|	ДанныеПодбора КАК ДанныеПодбора
	|		ЛЕВОЕ СОЕДИНЕНИЕ Состав КАК Состав
	|		ПО ДанныеПодбора.ВариантКомплектацииНабора = Состав.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДетализацияНабораПоСоставу.КМНабораСсылка КАК КМНабораСсылка,
	|	ДетализацияНабораПоСоставу.ВариантКомплектацииНабора КАК ВариантКомплектацииНабора,
	|	ДетализацияНабораПоСоставу.Ссылка КАК Ссылка,
	|	ДетализацияНабораПоСоставу.Номенклатура КАК Номенклатура,
	|	ДетализацияНабораПоСоставу.Характеристика КАК Характеристика,
	|	ДетализацияНабораПоСоставу.КоличествоВНаборе КАК КоличествоВНаборе,
	|	ДанныеПодбора.Количество КАК Количество
	|ПОМЕСТИТЬ ИтоговыеДанные
	|ИЗ
	|	ДетализацияНабораПоСоставу КАК ДетализацияНабораПоСоставу
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПодбора КАК ДанныеПодбора
	|		ПО ДетализацияНабораПоСоставу.КМНабораСсылка = ДанныеПодбора.КМНабораСсылка
	|			И ДетализацияНабораПоСоставу.Номенклатура = ДанныеПодбора.Номенклатура
	|			И ДетализацияНабораПоСоставу.Характеристика = ДанныеПодбора.ХарактеристикаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИтоговыеДанные.КМНабораСсылка КАК КМНабораСсылка,
	|	СУММА(ИтоговыеДанные.КоличествоВНаборе) КАК КоличествоВНаборе,
	|	СУММА(ИтоговыеДанные.Количество) КАК Количество
	|ИЗ
	|	ИтоговыеДанные КАК ИтоговыеДанные
	|СГРУППИРОВАТЬ ПО
	|	ИтоговыеДанные.КМНабораСсылка
	|ИМЕЮЩИЕ 
	|	СУММА(ИтоговыеДанные.КоличествоВНаборе) = СУММА(ИтоговыеДанные.Количество)";		
	
	ТаблицаДанных = ДокументТСД.СобранныеДанныеПодбор.Выгрузить();
	Запрос.УстановитьПараметр("ВТ", ТаблицаДанных); 
	Запрос.УстановитьПараметр("КМНабораСсылка", СтруктураСтроки.КМНабораСсылка);
	
	Результат = Запрос.Выполнить(); 
	
	СтруктураПоиска = Новый Структура; 
	СтруктураПоиска.Вставить("ИдентификаторСтроки", 0);
	
	Если Не Результат.Пустой() Тогда 
		
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ИзменитьДанныеЗаписи(СтруктураСтроки, СтруктураПоиска, ТаблицаДанных, ЭтоОтменаСтроки);
			
		КонецЦикла;   
		
		ДокументТСД.СобранныеДанныеПодбор.Загрузить(ТаблицаДанных);
		
	КонецЕсли;
	
	Если ЭтоОтменаСтроки Тогда
		
		Запрос.Текст = 
		
		"ВЫБРАТЬ
		|	ВТ.КМНабораСсылка КАК КМНабораСсылка,
		|	ВТ.КоличествоНаборов КАК КоличествоНаборов
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&ВТ КАК ВТ
		|;
		|//////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Данные.КМНабораСсылка КАК КМНабораСсылка,
		|	СУММА(Данные.КоличествоНаборов) - 1 КАК КоличествоНаборов
		|ИЗ
		|	ВТ КАК Данные
		|ГДЕ
		|   Данные.КМНабораСсылка = &КМНабораСсылка                    
		|
		|СГРУППИРОВАТЬ ПО
		|	Данные.КМНабораСсылка
		|
		|ИМЕЮЩИЕ
		|	СУММА(Данные.КоличествоНаборов) -1 >= 0";
		
		Результат = Запрос.Выполнить();
		
		Если НЕ Результат.Пустой() Тогда
			
			ИзменитьДанныеЗаписи(СтруктураСтроки, СтруктураПоиска, ТаблицаДанных, ЭтоОтменаСтроки);
						
			ДокументТСД.СобранныеДанныеПодбор.Загрузить(ТаблицаДанных);
			
		КонецЕсли;
		
	КонецЕсли;	
		
КонецПроцедуры

// Обновление данных количества наборов в ТЧ Подбора документа ТСД.
// 
// Параметры:
//   ДокументТСД - СправочникОбъект.ДатаМобайл_ДокументыТСД - обрабатываемый документ ТСД.
// 
Процедура ОбновлениеДанныхНаборовОбычныхТоваров(ДокументТСД) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.НомерСтроки КАК НомерСтроки,
	|	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.GS1 КАК GS1,
	|	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.KM_DecodedMrc КАК KM_DecodedMrc,
	|	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.KM_GTIN КАК KM_GTIN,
	|	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.KM_RawMrc КАК KM_RawMrc,
	|	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.KM_TNVED КАК KM_TNVED,
	|	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.PDF КАК PDF,
	|	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.ВариантКомплектацииНабора КАК ВариантКомплектацииНабора,
	|	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.Дата КАК Дата,
	|	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.ЕгаисДатаРозлива КАК ЕгаисДатаРозлива,
	|	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.ЕгаисМарка КАК ЕгаисМарка,
	|	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.ЕгаисПолныйКод КАК ЕгаисПолныйКод,
	|	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.ЕгаисСправкаА КАК ЕгаисСправкаА,
	|	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.ЕгаисСправкаБ КАК ЕгаисСправкаБ,
	|	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.КМНабора КАК КМНабора,
	|	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.КМНабораСсылка КАК КМНабораСсылка,
	|	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.КМСсылка КАК КМСсылка,
	|	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.КодТовара КАК КодТовара,
	|	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.Количество КАК Количество,
	|	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.КоличествоВУпаковке КАК КоличествоВУпаковке,
	|	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.КоличествоМест КАК КоличествоМест,
	|	0 КАК КоличествоНаборов,
	|	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.Короб КАК Короб,
	|	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.КоробСсылка КАК КоробСсылка,
	|	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.КоэффициентЕдиницы КАК КоэффициентЕдиницы,
	|	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.НазваниеТовара КАК НазваниеТовара,
	|	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.НоваяЦена КАК НоваяЦена,
	|	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.Номенклатура КАК Номенклатура,
	|	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.НоменклатураЕГАИС КАК НоменклатураЕГАИС,
	|	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.НомерДокумента КАК НомерДокумента,
	|	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.ПолныйКодМаркировки КАК ПолныйКодМаркировки,
	|	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.Пользователь КАК Пользователь,
	|	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.ПризнакПовторнойВыгрузки КАК ПризнакПовторнойВыгрузки,
	|	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.СерийныйНомер КАК СерийныйНомер,
	|	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.СерияСсылка КАК СерияСсылка,
	|	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.СсылкаНаИзображение КАК СсылкаНаИзображение,
	|	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.ТСД КАК ТСД,
	|	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.УпаковочныйЛист КАК УпаковочныйЛист,
	|	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.УпаковочныйЛистАтрибуты КАК УпаковочныйЛистАтрибуты,
	|	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.УпаковочныйЛистСсылка КАК УпаковочныйЛистСсылка,
	|	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.ЦРПТМарка КАК ЦРПТМарка,
	|	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.ЦРПТМарка_Длина КАК ЦРПТМарка_Длина,
	|	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.ШтрихКод КАК ШтрихКод,
	|	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.Ячейка КАК Ячейка,
	|	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.ЯчейкаСсылка КАК ЯчейкаСсылка
	|ПОМЕСТИТЬ ДанныеДокумента
	|ИЗ
	|	&ВТ КАК ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Данные.КМНабораСсылка КАК КМНабораСсылка,
	|	Данные.ВариантКомплектацииНабора КАК ВариантКомплектацииНабора,
	|	Данные.Номенклатура КАК Номенклатура,
	|	Данные.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СУММА(Данные.Количество * Данные.КоэффициентЕдиницы) КАК Количество
	|ПОМЕСТИТЬ ДанныеПодбора
	|ИЗ
	|	ДанныеДокумента КАК Данные
	|ГДЕ
	|	НЕ Данные.ВариантКомплектацииНабора = ЗНАЧЕНИЕ(Справочник.ВариантыКомплектацииНоменклатуры.ПустаяСсылка)
	|	И Данные.КМНабораСсылка = ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	Данные.КМНабораСсылка,
	|	Данные.ВариантКомплектацииНабора,
	|	Данные.Номенклатура,
	|	Данные.ХарактеристикаНоменклатуры
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВариантКомплектацииНабора,
	|	Номенклатура,
	|	ХарактеристикаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка КАК Ссылка,
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК Номенклатура,
	|	ВариантыКомплектацииНоменклатурыТовары.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА СУММА(ВариантыКомплектацииНоменклатурыТовары.Ссылка.Количество) = 0
	|			ТОГДА 0
	|		ИНАЧЕ СУММА(ВариантыКомплектацииНоменклатурыТовары.Количество) / СУММА(ВариантыКомплектацииНоменклатурыТовары.Ссылка.Количество)
	|	КОНЕЦ КАК КоличествоВНаборе
	|ПОМЕСТИТЬ Состав
	|ИЗ
	|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
	|ГДЕ
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				ДанныеПодбора.ВариантКомплектацииНабора КАК ВариантКомплектацииНабора
	|			ИЗ
	|				ДанныеПодбора КАК ДанныеПодбора)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка,
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура,
	|	ВариантыКомплектацииНоменклатурыТовары.Характеристика
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеПодбора.КМНабораСсылка КАК КМНабораСсылка,
	|	Состав.Ссылка КАК ВариантКомплектацииНабора,
	|	Состав.Номенклатура КАК Номенклатура,
	|	Состав.Характеристика КАК ХарактеристикаНоменклатуры,
	|	ЕСТЬNULL(ДанныеПодбора.Количество, 0) КАК КоличествоФакт,
	|	Состав.КоличествоВНаборе КАК КоличествоНабор
	|ПОМЕСТИТЬ ИтоговыеДанные
	|ИЗ
	|	ДанныеПодбора КАК ДанныеПодбора
	|		ПРАВОЕ СОЕДИНЕНИЕ Состав КАК Состав
	|		ПО ДанныеПодбора.ВариантКомплектацииНабора = Состав.Ссылка
	|			И ДанныеПодбора.Номенклатура = Состав.Номенклатура
	|			И ДанныеПодбора.ХарактеристикаНоменклатуры = Состав.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИтоговыеДанные.ВариантКомплектацииНабора КАК ВариантКомплектацииНабора,
	|	МИНИМУМ(ИтоговыеДанные.КоличествоФакт / ИтоговыеДанные.КоличествоНабор) КАК КоличествоФакт
	|ИЗ
	|	ИтоговыеДанные КАК ИтоговыеДанные
	|
	|СГРУППИРОВАТЬ ПО
	|	ИтоговыеДанные.ВариантКомплектацииНабора
	|
	|ИМЕЮЩИЕ
	|	МИНИМУМ(ИтоговыеДанные.КоличествоФакт / ИтоговыеДанные.КоличествоНабор) >= 1";
	
	Запрос.УстановитьПараметр("ВТ", ДокументТСД.СобранныеДанныеПодбор.Выгрузить());
	МассивРезультатов = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	ТаблицаДанных = МассивРезультатов[0].Выгрузить();
	
	СтруктураПоиска = Новый Структура; 
	СтруктураПоиска.Вставить("ВариантКомплектацииНабора", Справочники.ВариантыКомплектацииНоменклатуры.ПустаяСсылка());
	
	Если Не МассивРезультатов[4].Пустой() Тогда 
		
		Выборка = МассивРезультатов[4].Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			СтруктураПоиска.ВариантКомплектацииНабора = Выборка.ВариантКомплектацииНабора;
			
			МассивСтрок = ТаблицаДанных.НайтиСтроки(СтруктураПоиска);
			
			Если МассивСтрок.Количество() Тогда
				
				МассивСтрок[0].КоличествоНаборов = Окр(Выборка.КоличествоФакт, 0, РежимОкругления.Окр15как10);		
				
			КонецЕсли;			
			
			Продолжить;
			
		КонецЦикла;   
		
		ДокументТСД.СобранныеДанныеПодбор.Загрузить(ТаблицаДанных);
		
	КонецЕсли;	
	
КонецПроцедуры