
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Отключение механизма регистрации объектов.
	ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
	
	ПараметрыШаблона = Справочники.ДатаМобайл_ШаблоныДокументов.ПолучитьПараметрыШаблона(Шаблон, "ВидДокумента, ВидДокументаНового");
	
	// Если в шаблоне изменили вид документа   
	Попытка 
		Если Не ЗначениеЗаполнено(ДатаЗавершения) Тогда
			Если ЗначениеЗаполнено(ИсходныйДокумент) Тогда
				МетаданныеДок = ИсходныйДокумент.Метаданные();
				Если МетаданныеДок.Имя <> ПараметрыШаблона.ВидДокумента Тогда 
					ИсходныйДокумент = Неопределено;	
				КонецЕсли;  
			КонецЕсли;
			
			Если ЗначениеЗаполнено(НовыйДокумент) Тогда
				МетаданныеНовыйДок = НовыйДокумент.Метаданные();
				Если МетаданныеНовыйДок.Имя <> ПараметрыШаблона.ВидДокументаНового Тогда 
					НовыйДокумент = Неопределено;	
				КонецЕсли; 
			КонецЕсли;	
		КонецЕсли; 
	Исключение
	КонецПопытки;
	
	Если Не ЗначениеЗаполнено(ДатаСоздания) Тогда
		ДатаСоздания = ДатаМобайл_ОбщийМодуль.ПолучитьТекущуюДату();
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(ДатаСоздания) Тогда
		ДатаМобайл_ОбщийМодуль.СообщитьПользователю("Не заполнена дата создания документа!");
		Отказ = Истина;
	КонецЕсли;	
	
	Попытка
		ОбъектМодифицирован = ОбъектМодифицирован(ЭтотОбъект, Истина, Истина);
		Если ОбменДанными.Получатели.АвтоЗаполнение Тогда
			ОбменДанными.Получатели.Очистить();
			
			Если Не ЗначениеЗаполнено(Ссылка) Тогда //новый объект
				Если Не ЗначениеЗаполнено(ТСД) Тогда
					Если СписокТерминалов.Количество() = 0 Тогда
						ОбменДанными.Получатели.Заполнить();
					Иначе
						Для каждого СтрокаТерминал Из СписокТерминалов Цикл
							ОбменДанными.Получатели.Добавить(СтрокаТерминал.ТСД);	
						КонецЦикла;
					КонецЕсли;
				Иначе	
					ОбменДанными.Получатели.Добавить(ТСД);
				КонецЕсли;	
			Иначе
				Если ОбъектМодифицирован Тогда
					Если Не ЗначениеЗаполнено(ТСД) Или Не ЗначениеЗаполнено(Ссылка.ТСД) Тогда
						Если СписокТерминалов.Количество() = 0 Тогда
							ОбменДанными.Получатели.Заполнить();
						Иначе
							Для каждого СтрокаТерминал Из СписокТерминалов Цикл
								ОбменДанными.Получатели.Добавить(СтрокаТерминал.ТСД);	
							КонецЦикла;
						КонецЕсли;
					Иначе	
						ОбменДанными.Получатели.Добавить(ТСД);
						ОбменДанными.Получатели.Добавить(Ссылка.ТСД);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Попытка
		Если СокрЛП(Номер) = "" Тогда
			Если Шаблон.РаспределениеТоваров = 2 И Не ЗначениеЗаполнено(РодительскийДокумент) Тогда 
				Номер = "Групповой";
			Иначе
				Если ЗначениеЗаполнено(ИсходныйДокумент) Тогда
					Номер = СокрЛП(ИсходныйДокумент.Номер);
				Иначе
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;
		
		Если СокрЛП(Номер) = "" Тогда
			Если ЗначениеЗаполнено(ИсходныйДокумент) Тогда
				Номер = СокрЛП(ИсходныйДокумент.Код);
			Иначе
			КонецЕсли;	
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Попытка
		Если Дата = Дата(1,1,1) Тогда
			Если Шаблон.РаспределениеТоваров = 2 И Не ЗначениеЗаполнено(РодительскийДокумент) Тогда 
				Дата = ДатаМобайл_ОбщийМодуль.ПолучитьТекущуюДату();
			Иначе
				Если ЗначениеЗаполнено(ИсходныйДокумент) Тогда
					Дата = ИсходныйДокумент.Дата;
				Иначе
					Дата = ДатаМобайл_ОбщийМодуль.ПолучитьТекущуюДату();
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Попытка
		Если Шаблон.РаспределениеТоваров = 2 И Не ЗначениеЗаполнено(РодительскийДокумент) Тогда
			Комментарий = "";				
			Для каждого стр Из СписокДокументов Цикл
				Если ЗначениеЗаполнено(стр.ИсходныйДокумент) Тогда
					Попытка Комментарий = Комментарий + стр.ИсходныйДокумент.Номер + " от " + стр.ИсходныйДокумент.Дата + " "; Исключение КонецПопытки;
				КонецЕсли;
			КонецЦикла;	
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Попытка
		Если СокрЛП(Комментарий) = "" Тогда
			Если ЗначениеЗаполнено(ИсходныйДокумент) Тогда
				Комментарий = СокрЛП(ИсходныйДокумент.Комментарий);
			КонецЕсли;	
		КонецЕсли;	
	Исключение
	КонецПопытки;
		
	Попытка
		Если Не ЗначениеЗаполнено(Клиент) Тогда
			Если ТипЗнч(ИсходныйДокумент) = Тип("ДокументСсылка.УведомлениеОбОтгрузкеМДЛП") Тогда
				Попытка Клиент = ИсходныйДокумент.Грузополучатель; Исключение КонецПопытки;	
			ИначеЕсли ТипЗнч(ИсходныйДокумент) = Тип("ДокументСсылка.УведомлениеОПриемкеМДЛП") Тогда					
				Попытка Клиент = ИсходныйДокумент.Грузоотправитель; Исключение КонецПопытки;		
			КонецЕсли;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Клиент) Тогда
			Если ДатаМобайл_ОбщийМодуль.ЕстьАСТ() Тогда
				Попытка Клиент = ИсходныйДокумент.СсылкаНаДокумент.Партнер Исключение КонецПопытки;			
			КонецЕсли;
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Попытка
		Если ТипЗнч(ИсходныйДокумент) = Тип("ДокументСсылка.ДвижениеПродукцииИМатериалов") Тогда					
			Если Не ЗначениеЗаполнено(Склад) Тогда
				Попытка Склад = ИсходныйДокумент.Отправитель; Исключение КонецПопытки;
			КонецЕсли;	
			Если Не ЗначениеЗаполнено(СкладПолучатель) Тогда
				Попытка СкладПолучатель = ИсходныйДокумент.Получатель; Исключение КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	Исключение
	КонецПопытки;	
	
	Попытка	
		Если Не ЗначениеЗаполнено(Клиент) Тогда
			Попытка Клиент = ИсходныйДокумент.Распоряжение.Партнер; Исключение КонецПопытки;
		КонецЕсли;

		Если Не ЗначениеЗаполнено(Клиент) Тогда
			Попытка Клиент = ИсходныйДокумент.Распоряжение.Отправитель; Исключение КонецПопытки;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Клиент) Тогда
			Попытка Клиент = ИсходныйДокумент.Распоряжение.Получатель; Исключение КонецПопытки;
		КонецЕсли;		

		Если Не ЗначениеЗаполнено(Клиент) Тогда
			Попытка Клиент = ИсходныйДокумент.Партнер; Исключение КонецПопытки;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Клиент) Тогда
			Попытка Клиент = ИсходныйДокумент.Отправитель; Исключение КонецПопытки;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Клиент) Тогда
			Попытка Клиент = ИсходныйДокумент.Получатель; Исключение КонецПопытки;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Клиент) Тогда
			Попытка Клиент = ИсходныйДокумент.Грузополучатель.Контрагент; Исключение КонецПопытки;
		КонецЕсли;		
	Исключение
	КонецПопытки;
		
		
	Попытка
		Если Не ЗначениеЗаполнено(Склад) Тогда
			Попытка Склад = ИсходныйДокумент.ТорговыйОбъект; Исключение КонецПопытки;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Склад) Тогда
			Попытка Склад = ИсходныйДокумент.Помещение.Владелец; Исключение КонецПопытки;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Склад) Тогда
			Попытка Склад = ИсходныйДокумент.Склад; Исключение КонецПопытки;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Склад) Тогда
			Попытка Склад = ИсходныйДокумент.СкладОтправитель; Исключение КонецПопытки;
		КонецЕсли;
	Исключение
	КонецПопытки;     
	
	Если Не ЗначениеЗаполнено(СкладПолучатель) Тогда
		Попытка СкладПолучатель = ИсходныйДокумент.СкладПолучатель; Исключение КонецПопытки;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Помещение) Тогда
		Попытка Помещение = ИсходныйДокумент.Помещение; Исключение КонецПопытки;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Попытка Организация = ИсходныйДокумент.Организация; Исключение КонецПопытки;
	КонецЕсли;
	
	Попытка
		Если Не ЗначениеЗаполнено(Склад) Тогда
			Для каждого НовЗнач Из Шаблон.НовыеЗначенияРеквизитов Цикл
				Если НовЗнач.ИмяРеквизита = "Склад" Тогда
					Склад = НовЗнач.ЗначениеРеквизита;
				КонецЕсли;	
			КонецЦикла;	
		КонецЕсли;
	Исключение
	КонецПопытки;
		
	// Запрос в ЦРПТ приёмка
	Попытка
		ЗапросВСервисЧЗ = Истина;
		Если ДатаЗавершенияСбора <> Дата(1,1,1) Тогда
			ЗапросВСервисЧЗ	= Ложь;	
		КонецЕсли;
		Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ЗапросВСервисЧЗ") <> Ложь Тогда
			ЗапросВСервисЧЗ	= Ложь;
		КонецЕсли;
		Если ЭтотОбъект.ДополнительныеСвойства.Свойство("НеобращатьсяВСервисЧЗ") <> Ложь Тогда
			ЗапросВСервисЧЗ	= Ложь;
		КонецЕсли;
		Если ЗапросВСервисЧЗ Тогда			
			ПроверкаКлючаИЗапросВСервис();	
		КонецЕсли;
	Исключение
		Json = ОписаниеОшибки();
		ДатаМобайл_ОбщийМодуль.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
	
	// ГРУППОВОЙ ДОКУМЕНТ (ТСД)
	Попытка
		Если Шаблон.РаспределениеТоваров = 2 И Не ЗначениеЗаполнено(РодительскийДокумент) Тогда
			ЗаписатьГрупповойДокумент(Отказ);
		КонецЕсли;	
	Исключение
	КонецПопытки;
	
	// ГРУППОВОЙ ДОКУМЕНТ (1С)
	Попытка
		Если Шаблон.РаспределениеТоваров = 1 И Задания.Количество() > 0 Тогда
			Попытка
				ЗаполнитьСкладыИКонтрагентыПоДокументам();
				//Склад = Задания[0].Склад;
				Клиент = Задания[0].Контрагент;	
			Исключение 
				ДатаМобайл_ОбщийМодуль.СообщитьПользователю("Не удалось заполнить склады и контрагенты по вложенным документам. ");
			КонецПопытки;
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	// ВЫГРУЗКА СТРОК ПОДБОРА
	Попытка
		Если Шаблон.ЗагрузкаСтрокПодбораСДокументами И ЗначениеЗаполнено(ИсходныйДокумент) И СобранныеДанныеПодбор.Количество() = 0 И СобранныеДанныеПриемка.Количество() = 0 Тогда		
			НайтиЗаписатьПрошлыеСтрокиПодбора(Отказ);					
		КонецЕсли;
	Исключение
	КонецПопытки;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	// Отключение механизма регистрации объектов.
	ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
	
	// ГРУППОВОЙ ДОКУМЕНТ
	Если Шаблон.РаспределениеТоваров = 2 И Не ЗначениеЗаполнено(РодительскийДокумент) Тогда
		УдалитьГрупповойДокумент(Отказ);
	КонецЕсли;
	
	Попытка
		Если Не ЗначениеЗаполнено(ТСД) Или Не ЗначениеЗаполнено(Ссылка.ТСД) Тогда
			ОбменДанными.Получатели.Заполнить();
		Иначе	
			ОбменДанными.Получатели.Добавить(ТСД);
			ОбменДанными.Получатели.Добавить(Ссылка.ТСД);
		КонецЕсли;
	Исключение
	КонецПопытки; 
	
	Если Не Отказ Тогда
		ДатаМобайл_ОбщийМодуль.ОчиститьЗаписиГрупповогоДокумента(Ссылка);
		ДатаМобайл_ОбщийМодуль.ОчиститьЗаписиТСДГрупповогоДокумента(Ссылка);
		ДатаМобайл_ОбщийМодуль.ОчиститьЗаписиЗначенийДополнительныхФорм(Ссылка);
	КонецЕсли;
	
	// удаление регистрации со всех узлов
	Если Не Отказ Тогда 
		ДатаМобайл_ОбщийМодуль.УдалитьРегистрациюОбъекта(ЭтотОбъект, Ложь, Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании()
	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбъектМодифицирован(Объект, ПроверятьТабличныеЧасти = Истина, ПроверятьСтандартные = Истина) 
	
	Попытка 
		
		СсылкаОбъекта = Объект.Ссылка;
		Метаданное = Ссылка.Метаданные();
		
		Для каждого Реквизит Из Метаданное.Реквизиты Цикл
			Если Объект[Реквизит.Имя] <> СсылкаОбъекта[Реквизит.Имя] Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если ПроверятьСтандартные Тогда
			Для каждого Реквизит Из Метаданное.СтандартныеРеквизиты Цикл
				Если Объект[Реквизит.Имя] <> СсылкаОбъекта[Реквизит.Имя] Тогда
					Возврат Истина;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
				
		Если ПроверятьТабличныеЧасти Тогда
			Для каждого ТЧ Из Метаданное.ТабличныеЧасти Цикл
				
				Если Объект[ТЧ.Имя].Количество() <> СсылкаОбъекта[ТЧ.Имя].Количество() Тогда
					Возврат Истина;
				КонецЕсли;
				
				Для Индекс = 0 По Объект[ТЧ.Имя].Количество() - 1 Цикл
					ОбъектСтрокаТЧ = Объект[ТЧ.Имя][Индекс];
					СсылкаСтрокаТЧ = СсылкаОбъекта[ТЧ.Имя][Индекс];
					Для каждого РеквизитТЧ Из ТЧ.Реквизиты Цикл
						Если ОбъектСтрокаТЧ[РеквизитТЧ.Имя] <> СсылкаСтрокаТЧ[РеквизитТЧ.Имя] Тогда
							Возврат Истина;
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
				
			КонецЦикла;        
		КонецЕсли;
		
		Возврат Ложь;
		
	Исключение
		
		Возврат Истина;
		
	КонецПопытки;	
		
КонецФункции

Процедура ПроверкаКлючаИЗапросВСервис() Экспорт
	
	СсылкаНаДокВСервис 	= ИсходныйДокумент;
	ЭтоТабак 			= Ложь;
	
	Если Не ЗначениеЗаполнено(СсылкаНаДокВСервис) Или Не ТребуетсяЗапросВЦРПТ(Шаблон) Тогда
		Возврат;	
	КонецЕсли; 
	
	Если ПометкаУдаления Или СсылкаНаДокВСервис.ПометкаУдаления Тогда
		ДатаМобайл_ОбщийМодуль.СообщитьПользователю("Документ помечен на удаление. Выполнение в ЧЗ прервано.");
		Json = "Документ помечен на удаление. Выполнение в ЧЗ прервано.";
		Возврат;		
	КонецЕсли;
	
	Модуль_ОбщегоНазначения = ДатаМобайл_ОбщийМодуль.ОбщийМодуль("ОбщегоНазначения");
		
	ЗначенияРеквизитовШаблон = Справочники.ДатаМобайл_ШаблоныДокументов.ПолучитьПараметрыШаблона(Шаблон, "ВидДокумента, ИмяТабличнойЧастиПодбор, МаркировкаСоздаватьВФоне, МаркировкаРежимОСУ");
	ВидДокумента = ЗначенияРеквизитовШаблон.ВидДокумента;
	ИмяТабличнойЧастиПодбор = ЗначенияРеквизитовШаблон.ИмяТабличнойЧастиПодбор;
	
	ВидМаркируемойПродукцииДокументаМассив = ДатаМобайл_Маркировка.ПолучитьВидПродукцииИСДокумента(СсылкаНаДокВСервис, ИмяТабличнойЧастиПодбор);
	ВидМаркируемойПродукцииДокумента       = ВидМаркируемойПродукцииДокументаМассив[0];
	
	Если ВидМаркируемойПродукцииДокумента = Неопределено Тогда
		Возврат;	
	КонецЕсли; 
		
	Модуль_ИнтерфейсАвторизацииИСМПВызовСервера = ДатаМобайл_ОбщийМодуль.ОбщийМодуль("ИнтерфейсАвторизацииИСМПВызовСервера");
	
	Попытка
		Модуль_ИнтерфейсИСМПКлиентСервер = ДатаМобайл_ОбщийМодуль.ОбщийМодуль("ИнтерфейсИСМПКлиентСервер");
		Модуль_ИнтерфейсМОТПКлиентСервер = ДатаМобайл_ОбщийМодуль.ОбщийМодуль("ИнтерфейсМОТПКлиентСервер");
	Исключение
		Модуль_ИнтерфейсИСМПКлиентСервер = ДатаМобайл_ОбщийМодуль.ОбщийМодуль("ОбщегоНазначенияИСМПКлиентСервер");
		Модуль_ИнтерфейсМОТПКлиентСервер = ДатаМобайл_ОбщийМодуль.ОбщийМодуль("ОбщегоНазначенияИСМПКлиентСервер");	
	КонецПопытки;
	
	Модуль_ОбщегоНазначенияИСМПКлиентСервер 	= ДатаМобайл_ОбщийМодуль.ОбщийМодуль("ОбщегоНазначенияИСМПКлиентСервер");
	
	Если Модуль_ИнтерфейсАвторизацииИСМПВызовСервера = Неопределено Тогда
		ДатаМобайл_ОбщийМодуль.СообщитьПользователю("Конфигурация 1С не поддерживает работу с Маркировкой");
		Возврат;
	КонецЕсли;
	
	Попытка 
		Организация = СсылкаНаДокВСервис.Организация;
	Исключение 
	КонецПопытки;  
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Возврат;	
	КонецЕсли; 

	
	// Табак
	Если ДатаМобайл_Маркировка.ЭтоТабакПоВидыПродукцииИС(ВидМаркируемойПродукцииДокумента) Тогда
		ЭтоТабак = Истина;
		Попытка
			ТребуетсяОбновлениеКлючаСессии = Модуль_ИнтерфейсАвторизацииИСМПВызовСервера.ТребуетсяОбновлениеКлючаСессии(
			Модуль_ИнтерфейсМОТПКлиентСервер.ПараметрыЗапросаКлючаСессии(Организация));			
		Исключение
			ТребуетсяОбновлениеКлючаСессии = Модуль_ИнтерфейсАвторизацииИСМПВызовСервера.ТребуетсяОбновлениеКлючаСессии(
			Модуль_ОбщегоНазначенияИСМПКлиентСервер.ПараметрыЗапросаКлючаСессии(Организация));
		КонецПопытки;
	Иначе
		Попытка
			ТребуетсяОбновлениеКлючаСессии = Модуль_ИнтерфейсАвторизацииИСМПВызовСервера.ТребуетсяОбновлениеКлючаСессии(
			Модуль_ИнтерфейсИСМПКлиентСервер.ПараметрыЗапросаКлючаСессии(Организация));
		Исключение
			ТребуетсяОбновлениеКлючаСессии = Модуль_ИнтерфейсАвторизацииИСМПВызовСервера.ТребуетсяОбновлениеКлючаСессии(
			Модуль_ОбщегоНазначенияИСМПКлиентСервер.ПараметрыЗапросаКлючаСессии(Организация));
		КонецПопытки;
	КонецЕсли; 
			
	Если ТребуетсяОбновлениеКлючаСессии Тогда	
		ДатаМобайл_ОбщийМодуль.СообщитьПользователю("Не получилось обновить ключ сессии. Проверьте настройки подключения к ИС.");
		Json = "Не получилось обновить ключ сессии. Проверьте настройки подключения к ИС.";
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьТребуетсяВыгрузкаМарок(ЭтотОбъект) Тогда
		Возврат;	
	КонецЕсли;
			
	МаркиСоздавались 		= Ложь;
	МаркиБылиНайдены 		= Ложь;
	ОшибкаПриСозданииМарки 	= Ложь;
	
	СсылкаНаДокОбъект = СсылкаНаДокВСервис.ПолучитьОбъект();
	
	Если ВидДокумента = "ЗаказНаЭмиссиюКодовМаркировкиСУЗ" Тогда
		ШтрихкодыУпаковок = ДатаМобайл_Маркировка.ПолучитьКМИзПулаПоЗаказНаЭмиссию(СсылкаНаДокВСервис);
	Иначе
		ШтрихкодыУпаковок = СсылкаНаДокОбъект.ШтрихкодыУпаковок;
	КонецЕсли;
	
	ДанныеНоменклатурыПоДаннымУПД = Неопределено;
	
	Если СсылкаНаДокВСервис <> Неопределено Тогда
		Если ТипЗнч(СсылкаНаДокВСервис) <> Тип("ДокументСсылка.ПриемкаТоваровИСМП") Тогда	
			Модуль_ШтрихкодированиеИСМПСлужебный = ДатаМобайл_ОбщийМодуль.ОбщийМодуль("ШтрихкодированиеИСМПСлужебный");
			ДанныеНоменклатурыПоДаннымУПД = Модуль_ШтрихкодированиеИСМПСлужебный.ДанныеМаркируемойНоменклатурыПоДаннымУПД(СсылкаНаДокВСервис);
		КонецЕсли;	
	КонецЕсли;

	Если ЗначенияРеквизитовШаблон.МаркировкаСоздаватьВФоне Тогда		
		ЗапросВИСМПЧерезМассивКМ(СсылкаНаДокОбъект, СсылкаНаДокОбъект.ШтрихкодыУпаковок, ВидМаркируемойПродукцииДокументаМассив, ЗначенияРеквизитовШаблон);
		Возврат;
	КонецЕсли;
	
	Для каждого СтрШтрихкод Из ШтрихкодыУпаковок Цикл
		
		Если ЗначениеЗаполнено(СтрШтрихкод.ШтрихкодУпаковки) Тогда
			Продолжить;
		КонецЕсли;
		
		ЭтоУпаковка = Истина;
		
		// Если это упаковка и ее нет в базе, тогда обращаемся в исмп/мотп
		ЗначениеШтрихкода 	= СтрШтрихкод.ЗначениеШтрихкода;
		ДанныеУпаковки  	= Справочники.ШтрихкодыУпаковокТоваров.ПолучитьДанныеУпаковкиПоЗначениюШтрихкода(ЗначениеШтрихкода);
		
		Если СтрДлина(ЗначениеШтрихкода) = 18 Тогда   // обувная продукция с 18
			//ЭтоУпаковка = Истина;
			
			Если ДанныеУпаковки = Неопределено Тогда
				ДанныеУпаковки = Справочники.ШтрихкодыУпаковокТоваров.ПолучитьДанныеУпаковкиПоЗначениюШтрихкода("(00)" + ЗначениеШтрихкода);
				Если ВидМаркируемойПродукцииДокумента <> Перечисления.ВидыПродукцииИС.Антисептики Тогда //ограничил на антисептики, не формировались упаковки с "(00)"
					ЗначениеШтрихкода = "(00)" + ЗначениеШтрихкода;	
				КонецЕсли;
			КонецЕсли; 
			
		ИначеЕсли СтрДлина(ЗначениеШтрихкода) = 20 И (СтрНачинаетсяС(ЗначениеШтрихкода, "00") Или СтрНачинаетсяС(ЗначениеШтрихкода, "01")) Тогда //обувная продукция с 20	
			//ЭтоУпаковка = Истина;
		ИначеЕсли СтрДлина(ЗначениеШтрихкода) = 21 И (СтрНачинаетсяС(ЗначениеШтрихкода, "00") Или СтрНачинаетсяС(ЗначениеШтрихкода, "01")) Тогда	
			//ЭтоУпаковка = Истина;	
		ИначеЕсли СтрДлина(ЗначениеШтрихкода) = 22 И (СтрНачинаетсяС(ЗначениеШтрихкода, "(00)") Или СтрНачинаетсяС(ЗначениеШтрихкода, "(01)")) Тогда //обувная продукция с 22	
			//ЭтоУпаковка = Истина;
		ИначеЕсли Не ЭтоТабак И СтрДлина(ЗначениеШтрихкода) = 27 Тогда	
			//ЭтоУпаковка = Истина;	
		ИначеЕсли Не ЭтоТабак И СтрДлина(ЗначениеШтрихкода) = 31 Тогда	
			//ЭтоУпаковка = Истина;
		ИначеЕсли СтрДлина(ЗначениеШтрихкода) = 39 Тогда
			//ЭтоУпаковка = Истина;	
		ИначеЕсли Не ЭтоТабак И СтрДлина(ЗначениеШтрихкода) = 66 Тогда	
			//ЭтоУпаковка = Истина;	
		ИначеЕсли ЭтоТабак И СтрДлина(ЗначениеШтрихкода) > 21 Тогда  // табак
			//ЭтоУпаковка = Истина;
			
			Если СтрДлина(ЗначениеШтрихкода) = 34 Или СтрДлина(ЗначениеШтрихкода) = 35 И ДанныеУпаковки = Неопределено Тогда
				Поз = Найти(ЗначениеШтрихкода, "8005");
				Если Поз > 0 Тогда
					ЗначениеКМ = Лев(ЗначениеШтрихкода, Поз - 1);
					ДанныеУпаковки = Справочники.ШтрихкодыУпаковокТоваров.ПолучитьДанныеУпаковкиПоЗначениюШтрихкода(ЗначениеКМ);
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли; 
		
		//Если Не ЭтоУпаковка Тогда
		//	Продолжить;	
		//КонецЕсли; 
		
		Если (ДанныеУпаковки = Неопределено Или ДанныеУпаковки.Ссылка.ВложенныеШтрихкоды.Количество() = 0) И ЭтоУпаковка Тогда
			
			ОшибкаПриОбращении = "";
			
			СсылкаНаШтрихкод = ДатаМобайл_Маркировка.СформироватьЗапросКСервисуМОТПилиИСМПиСоздатьСправочникСсылкаМарка(ЗначениеШтрихкода,,,, ЭтоТабак, СсылкаНаДокВСервис, 
								ВидМаркируемойПродукцииДокумента,, Шаблон, Истина, ОшибкаПриОбращении, ДанныеНоменклатурыПоДаннымУПД);
			
			Если ОшибкаПриОбращении <> "" Тогда 
				Json = ОшибкаПриОбращении;
				ОшибкаПриСозданииМарки = Истина;
				Прервать;
			ИначеЕсли СсылкаНаШтрихкод <> ПредопределенноеЗначение("Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка") Тогда 
				СтрШтрихкод.ШтрихкодУпаковки = СсылкаНаШтрихкод;
				МаркиСоздавались = Истина; 
			КонецЕсли;
			
		ИначеЕсли (ДанныеУпаковки <> Неопределено Или ДанныеУпаковки.Ссылка.ВложенныеШтрихкоды.Количество() > 0) И ЭтоУпаковка Тогда
			СтрШтрихкод.ШтрихкодУпаковки = ДанныеУпаковки.Ссылка;
			МаркиБылиНайдены = Истина;	
		КонецЕсли;	
		
	КонецЦикла; 								
		
	Если ОшибкаПриСозданииМарки Тогда
		
	ИначеЕсли МаркиСоздавались Тогда
		Json = "Групповые упаковки созданы";
	ИначеЕсли МаркиБылиНайдены Тогда 
		Json = "Групповые упаковки найдены";
	КонецЕсли; 
	
	СсылкаНаДокОбъект.Записать();
	
КонецПроцедуры

Функция ТребуетсяЗапросВЦРПТ(Шаблон)
	
	Если Шаблон.МаркировкаЗапросВЦРПТ И Шаблон.ИспользоватьМаркировку Тогда
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ПроверитьТребуетсяВыгрузкаМарок(СсылкаНаДок)
	
	ВидДокумента = СсылкаНаДок.Шаблон.ВидДокумента;
	
	Если ВидДокумента = "ПриобретениеТоваровУслуг" 
		Или ВидДокумента = "ПриемкаТоваровИСМП" 
		Или ВидДокумента = "ЗаказНаЭмиссиюКодовМаркировкиСУЗ" Тогда
		Возврат Истина;
		
	ИначеЕсли ВидДокумента = "ВозвратТоваровОтКлиента"	Тогда
		
		МаркиУказаныПоставщиком = Ложь;
		
		Если СсылкаНаДок.ИсходныйДокумент.ШтрихкодыУпаковок.Количество() > 0 Тогда
			МаркиУказаныПоставщиком = Истина;
		КонецЕсли;
		
		Если МаркиУказаныПоставщиком Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;	
		
	ИначеЕсли ВидДокумента = "УведомлениеОПриемкеМДЛП" Тогда
		ПрямойАкцепт = Ложь;
		Попытка 
			Если СсылкаНаДок.ИсходныйДокумент.СхемаАкцептования = Перечисления.СхемыАкцептованияМДЛП.ПрямойПорядок Тогда
				ПрямойАкцепт = Истина;
			КонецЕсли;
		Исключение
		КонецПопытки;
		
		Если ПрямойАкцепт Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	ИначеЕсли ВидДокумента = "ПриходныйОрдерНаТовары" Тогда
		ВыгружатьМарки = Ложь;
		
		Попытка
			Если СсылкаНаДок.ИсходныйДокумент.ШтрихкодыУпаковок.Количество() > 0 Тогда
				ВыгружатьМарки = Истина;
			КонецЕсли;
		Исключение КонецПопытки;
		Возврат ВыгружатьМарки;	
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции // ()

Процедура ЗаписатьГрупповойДокумент(Отказ)
	
	Если ЭтоНовый() Тогда
		лРодительскийДокумент = Справочники.ДатаМобайл_ДокументыТСД.ПолучитьСсылку();
		УстановитьСсылкуНового(лРодительскийДокумент);
	Иначе	
		лРодительскийДокумент = Ссылка;	
	КонецЕсли;
	
	МассивСкладов = Новый Массив();
	МассивСкладовПолучателей = Новый Массив();
	МассивПомещений = Новый Массив();
	
	Для каждого СтрокаДокументов Из СписокДокументов Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаДокументов.ДокументТСД) И ЗначениеЗаполнено(СтрокаДокументов.ИсходныйДокумент) Тогда
			ДочернийДокумент = ПолучитьДочернийДокумент(СтрокаДокументов.ИсходныйДокумент, лРодительскийДокумент);
			Если Не ЗначениеЗаполнено(ДочернийДокумент) Тогда
				ДочернийДокумент = СоздатьДочернийДокумент(СтрокаДокументов.ИсходныйДокумент, лРодительскийДокумент);
			Иначе
				ДочернийДокумент = ОбновитьДочернийДокумент(ДочернийДокумент, лРодительскийДокумент);
			КонецЕсли;		
			СтрокаДокументов.ДокументТСД = ДочернийДокумент; 		
		ИначеЕсли ЗначениеЗаполнено(СтрокаДокументов.ДокументТСД) Тогда	
			ДочернийДокумент = ОбновитьДочернийДокумент(СтрокаДокументов.ДокументТСД, лРодительскийДокумент);
		КонецЕсли;	
		
		Если МассивСкладов.Найти(СтрокаДокументов.ДокументТСД.Склад) = Неопределено тогда 
			МассивСкладов.Добавить(СтрокаДокументов.ДокументТСД.Склад);
		КонецЕсли;
		
		Если МассивСкладовПолучателей.Найти(СтрокаДокументов.ДокументТСД.СкладПолучатель) = Неопределено тогда 
			МассивСкладовПолучателей.Добавить(СтрокаДокументов.ДокументТСД.СкладПолучатель);
		КонецЕсли;
		
		Если МассивПомещений.Найти(СтрокаДокументов.ДокументТСД.Помещение) = Неопределено тогда 
			МассивПомещений.Добавить(СтрокаДокументов.ДокументТСД.Помещение);
		КонецЕсли;  
		
		Попытка ОбработатьПометкуУдаленияГрупповойДокумент(СтрокаДокументов); Исключение КонецПопытки;
		Попытка ОбработатьУстановкуДатГрупповойДокумент(СтрокаДокументов); Исключение КонецПопытки;
				
	КонецЦикла;  
	
	Если МассивСкладов.Количество() = 1 тогда  
		Если Склад<>МассивСкладов[0] тогда
			Склад = МассивСкладов[0];
		КонецЕсли;
	Иначе
		Если ЗначениеЗаполнено(Склад) тогда
			Склад = Неопределено;
		КонецЕсли;		
	КонецЕсли;
	
	Если МассивСкладовПолучателей.Количество() = 1 тогда  
		Если СкладПолучатель<>МассивСкладовПолучателей[0] тогда
			СкладПолучатель = МассивСкладовПолучателей[0];
		КонецЕсли;
	Иначе
		Если ЗначениеЗаполнено(СкладПолучатель) тогда
			СкладПолучатель = Неопределено;
		КонецЕсли;		
	КонецЕсли;
	
	Если МассивПомещений.Количество() = 1 тогда  
		Если Помещение<>МассивПомещений[0] тогда
			Помещение = МассивПомещений[0];
		КонецЕсли;
	Иначе
		Если ЗначениеЗаполнено(Помещение) тогда
			Помещение = Неопределено;
		КонецЕсли;		
	КонецЕсли;

КонецПроцедуры
Процедура УдалитьГрупповойДокумент(Отказ)
	
	Для каждого СтрокаДокументов Из СписокДокументов Цикл		
		Попытка ОбработатьУдалениеГрупповойДокумент(СтрокаДокументов); Исключение КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработатьПометкуУдаленияГрупповойДокумент(СтрокаДокументов) 
	
	Если ЗначениеЗаполнено(СтрокаДокументов.ДокументТСД) Тогда
		Если ПометкаУдаления И Не СтрокаДокументов.ДокументТСД.ПометкаУдаления Тогда
			ДочернийДокументОбъект = СтрокаДокументов.ДокументТСД.ПолучитьОбъект();
			ДочернийДокументОбъект.ПометкаУдаления = Истина;
			ДочернийДокументОбъект.Записать();
		ИначеЕсли Не ПометкаУдаления И СтрокаДокументов.ДокументТСД.ПометкаУдаления Тогда
			ДочернийДокументОбъект = СтрокаДокументов.ДокументТСД.ПолучитьОбъект();
			ДочернийДокументОбъект.ПометкаУдаления = Ложь;
			ДочернийДокументОбъект.Записать();			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
Процедура ОбработатьУстановкуДатГрупповойДокумент(СтрокаДокументов) 
		
	Если ЗначениеЗаполнено(СтрокаДокументов.ДокументТСД) Тогда
		Если ЗначениеЗаполнено(ДатаЗавершенияСбора) И Не ЗначениеЗаполнено(СтрокаДокументов.ДокументТСД.ДатаЗавершенияСбора) Тогда
			ДочернийДокументОбъект = СтрокаДокументов.ДокументТСД.ПолучитьОбъект();
			ДочернийДокументОбъект.ДатаЗавершенияСбора = ДатаЗавершенияСбора;
			ДочернийДокументОбъект.Записать();			
		КонецЕсли;
		Если ЗначениеЗаполнено(ДатаПриемкиОператором) И Не ЗначениеЗаполнено(СтрокаДокументов.ДокументТСД.ДатаПриемкиОператором) Тогда
			ДочернийДокументОбъект = СтрокаДокументов.ДокументТСД.ПолучитьОбъект();
			ДочернийДокументОбъект.ДатаПриемкиОператором = ДатаПриемкиОператором;
			ДочернийДокументОбъект.Записать();			
		КонецЕсли;
		Если ЗначениеЗаполнено(ДатаЗавершения) И Не ЗначениеЗаполнено(СтрокаДокументов.ДокументТСД.ДатаЗавершения) Тогда
			ДочернийДокументОбъект = СтрокаДокументов.ДокументТСД.ПолучитьОбъект();
			ДочернийДокументОбъект.ДатаЗавершения = ДатаЗавершения;
			ДочернийДокументОбъект.Записать();			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
Процедура ОбработатьУдалениеГрупповойДокумент(СтрокаДокументов) 
		
	Если ЗначениеЗаполнено(СтрокаДокументов.ДокументТСД) Тогда
		ДочернийДокументОбъект = СтрокаДокументов.ДокументТСД.ПолучитьОбъект();
		ДочернийДокументОбъект.Удалить();			
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьДочернийДокумент(лИсходныйДокумент, лРодительскийДокумент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДатаМобайл_ДокументыТСД.Ссылка
	|ИЗ
	|	Справочник.ДатаМобайл_ДокументыТСД КАК ДатаМобайл_ДокументыТСД
	|ГДЕ
	|	ДатаМобайл_ДокументыТСД.ИсходныйДокумент = &ИсходныйДокумент
	|	И ДатаМобайл_ДокументыТСД.РодительскийДокумент = &РодительскийДокумент
	|	И НЕ ДатаМобайл_ДокументыТСД.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ИсходныйДокумент", лИсходныйДокумент);
	Запрос.УстановитьПараметр("РодительскийДокумент", лРодительскийДокумент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Справочники.ДатаМобайл_ДокументыТСД.ПустаяСсылка();	
	КонецЕсли;	
	
КонецФункции

Функция СоздатьДочернийДокумент(лДокумент, лРодительскийДокумент)
	
	НовыйДочернийДокумент = Справочники.ДатаМобайл_ДокументыТСД.СоздатьЭлемент();
	
	НовыйДочернийДокумент.Шаблон = Шаблон;
	НовыйДочернийДокумент.ИсходныйДокумент = лДокумент;
	НовыйДочернийДокумент.ТСД = ТСД;	
	НовыйДочернийДокумент.СписокТерминалов.Загрузить(СписокТерминалов.Выгрузить());	
	НовыйДочернийДокумент.РодительскийДокумент = лРодительскийДокумент;
	НовыйДочернийДокумент.Записать();
	
	Возврат НовыйДочернийДокумент.Ссылка; 
	
КонецФункции

Функция ОбновитьДочернийДокумент(лДочернийДокумент, лРодительскийДокумент)
	
	ДочернийДокументОбъект = лДочернийДокумент.ПолучитьОбъект();
	
	ДочернийДокументОбъект.Шаблон = Шаблон;
	ДочернийДокументОбъект.ТСД = ТСД;	
	ДочернийДокументОбъект.СписокТерминалов.Загрузить(СписокТерминалов.Выгрузить());	
	ДочернийДокументОбъект.РодительскийДокумент = лРодительскийДокумент;
	ДочернийДокументОбъект.Записать();
	
	Возврат ДочернийДокументОбъект.Ссылка; 
	
КонецФункции

Процедура ЗаполнитьСкладыИКонтрагентыПоДокументам()
	
	ТЧ = Задания;
	
	Для каждого Стр Из ТЧ Цикл
		
		ТекущийИсходныйДокумент = Стр.Задание;
		
		Попытка	
			
			Попытка Стр.Контрагент = ТекущийИсходныйДокумент.Партнер; Исключение КонецПопытки;
			
			Если Не ЗначениеЗаполнено(Стр.Контрагент) Тогда
				Попытка Стр.Контрагент = ТекущийИсходныйДокумент.Получатель; Исключение КонецПопытки;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Стр.Контрагент) Тогда
				Попытка Стр.Контрагент = ТекущийИсходныйДокумент.Распоряжение.Партнер; Исключение КонецПопытки;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Стр.Контрагент) Тогда
				Попытка Стр.Контрагент = ТекущийИсходныйДокумент.Распоряжение.Отправитель; Исключение КонецПопытки;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Стр.Контрагент) Тогда
				Попытка Стр.Контрагент = ТекущийИсходныйДокумент.Распоряжение.Получатель; Исключение КонецПопытки;
			КонецЕсли;
						
			Если Не ЗначениеЗаполнено(Стр.Контрагент) Тогда
				Попытка Стр.Контрагент = ТекущийИсходныйДокумент.Отправитель; Исключение КонецПопытки;
			КонецЕсли;		
			
		Исключение
		КонецПопытки;
		
		Попытка
			Если ТипЗнч(ТекущийИсходныйДокумент) = Тип("ДокументСсылка.ПеремещениеТоваров") Или
				ТипЗнч(ТекущийИсходныйДокумент) = Тип("ДокументСсылка.ДвижениеПродукцииИМатериалов") Тогда					
				Если Не ЗначениеЗаполнено(Стр.Контрагент) Тогда
					Попытка Стр.Контрагент = ТекущийИсходныйДокумент.СкладПолучатель; Исключение КонецПопытки;
				КонецЕсли;
				Если Не ЗначениеЗаполнено(Стр.Контрагент) Тогда
					Попытка Стр.Контрагент = ТекущийИсходныйДокумент.Получатель; Исключение КонецПопытки;
				КонецЕсли;
				Если Не ЗначениеЗаполнено(Стр.Контрагент) Тогда
					Попытка Стр.Контрагент = ТекущийИсходныйДокумент.Получатель; Исключение КонецПопытки;
				КонецЕсли;
				Если Не ЗначениеЗаполнено(Стр.Склад) Тогда
					Попытка Стр.Склад = ТекущийИсходныйДокумент.Отправитель; Исключение КонецПопытки;
				КонецЕсли;		
			КонецЕсли;
		Исключение
		КонецПопытки;
				
		Попытка
			Попытка Стр.Склад = ТекущийИсходныйДокумент.Склад; Исключение КонецПопытки;
			
			Если Не ЗначениеЗаполнено(Стр.Склад) Тогда
				Попытка Стр.Склад = ТекущийИсходныйДокумент.ТорговыйОбъект; Исключение КонецПопытки;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Стр.Склад) Тогда
				Попытка Стр.Склад = ТекущийИсходныйДокумент.Помещение.Владелец; Исключение КонецПопытки;
			КонецЕсли;
						
			Если Не ЗначениеЗаполнено(Стр.Склад) Тогда
				Попытка Склад = ТекущийИсходныйДокумент.СкладОтправитель; Исключение КонецПопытки;
			КонецЕсли;		
		Исключение
		КонецПопытки;
		
		Попытка
			// При создании группового документа ТСД с видом исходного документа «Расходный ордер на товары» 
			// необходимо изменять статус всех исходных документов с «К проверке» на «В процессе проверки».
			Если ТипЗнч(ТекущийИсходныйДокумент) = Тип("ДокументСсылка.РасходныйОрдерНаТовары") Тогда	
				Если ТекущийИсходныйДокумент.Статус = Перечисления.СтатусыРасходныхОрдеров.КПроверке Тогда
					ТекущийИсходныйДокументОбъект = ТекущийИсходныйДокумент.ПолучитьОбъект();
					ТекущийИсходныйДокументОбъект.Статус = Перечисления.СтатусыРасходныхОрдеров.ВПроцессеПроверки;
					ТекущийИсходныйДокументОбъект.Записать();
				КонецЕсли;
			КонецЕсли;			
		Исключение
		КонецПопытки;
		
		Попытка
			Если ЗначениеЗаполнено(Склад) И Склад <> Стр.Склад Тогда
				Склад = Неопределено;	
			КонецЕсли;
		Исключение КонецПопытки;
		
		Попытка
			Если ЗначениеЗаполнено(Помещение) И Помещение <> ТекущийИсходныйДокумент.Помещение Тогда
				Помещение = Неопределено;	
			КонецЕсли;
		Исключение КонецПопытки;
		
	КонецЦикла;
			
КонецПроцедуры

Процедура НайтиЗаписатьПрошлыеСтрокиПодбора(Отказ)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ДатаМобайл_ДокументыТСД.Ссылка
	                      |ИЗ
	                      |	Справочник.ДатаМобайл_ДокументыТСД КАК ДатаМобайл_ДокументыТСД
	                      |ГДЕ
	                      |	ДатаМобайл_ДокументыТСД.ИсходныйДокумент = &ИсходныйДокумент
	                      |	И ДатаМобайл_ДокументыТСД.Шаблон = &Шаблон
	                      |	И ДатаМобайл_ДокументыТСД.ДатаЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	                      |	И ДатаМобайл_ДокументыТСД.Ссылка <> &Ссылка
	                      |	И НЕ ДатаМобайл_ДокументыТСД.ПометкаУдаления
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ДатаМобайл_ДокументыТСД.ДатаЗавершения УБЫВ");
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Шаблон", Шаблон);
	Запрос.УстановитьПараметр("ИсходныйДокумент", ИсходныйДокумент);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ТаблицаПовторнойВыгрузкиПодбор = Выборка.Ссылка.СобранныеДанныеПодбор.Выгрузить();
		Для каждого СтараяСтрокаПовторнойВыгрузкиПодбор Из ТаблицаПовторнойВыгрузкиПодбор Цикл
			НоваяСтрокаПовторнойВыгрузкиПодбор = СобранныеДанныеПодбор.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаПовторнойВыгрузкиПодбор, СтараяСтрокаПовторнойВыгрузкиПодбор);
			НоваяСтрокаПовторнойВыгрузкиПодбор.ПризнакПовторнойВыгрузки = Истина;
		КонецЦикла;
		
		ТаблицаПовторнойВыгрузкиПриемка = Выборка.Ссылка.СобранныеДанныеПриемка.Выгрузить();
		Для каждого СтараяСтрокаПовторнойВыгрузкиПриемка Из ТаблицаПовторнойВыгрузкиПриемка Цикл
			НоваяСтрокаПовторнойВыгрузкиПриемка = СобранныеДанныеПриемка.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаПовторнойВыгрузкиПриемка, СтараяСтрокаПовторнойВыгрузкиПриемка);
			НоваяСтрокаПовторнойВыгрузкиПриемка.ПризнакПовторнойВыгрузки = Истина;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗапросВИСМПЧерезМассивКМ(СсылкаНаДокОбъект, ШтрихкодыУпаковок, МассивПродукцийПоДокументу, ЗначенияРеквизитовШаблон)
	
	ЗаписатьДокумент = Ложь;
	ЭтоУпаковка = Ложь;
	МассивКМ = Новый Массив;
	
	Для каждого СтрШтрихкод Из ШтрихкодыУпаковок Цикл
		
		Если ЗначениеЗаполнено(СтрШтрихкод.ШтрихкодУпаковки) Тогда
			Продолжить;
		КонецЕсли;					
		
		ЭтоУпаковка = Истина;
		
		//если это упаковка и ее нету в базе, тогда обращаемся в исмп\мотп
		ЗначениеШтрихкода 	= СтрШтрихкод.ЗначениеШтрихкода;
		ДанныеУпаковки  	= Справочники.ШтрихкодыУпаковокТоваров.ПолучитьДанныеУпаковкиПоЗначениюШтрихкода(ЗначениеШтрихкода);
		
		Если ЗначенияРеквизитовШаблон.МаркировкаРежимОСУ = 1 Тогда
			Если (СтрНайти(ЗначениеШтрихкода, "02") = 1 И СтрНайти(ЗначениеШтрихкода, "37") = 17) Или
				(СтрНайти(ЗначениеШтрихкода, "(02)") = 1 И СтрНайти(ЗначениеШтрихкода, "(37)") = 19) Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;	
		
		Если СтрДлина(ЗначениеШтрихкода) = 18 Тогда   //обувная продукция с 18
			//ЭтоУпаковка = Истина;
			
			Если ДанныеУпаковки = Неопределено Тогда
				ДанныеУпаковки = Справочники.ШтрихкодыУпаковокТоваров.ПолучитьДанныеУпаковкиПоЗначениюШтрихкода("(00)" + ЗначениеШтрихкода);
				ЗначениеШтрихкода = "(00)" + ЗначениеШтрихкода;
			КонецЕсли; 
			
		ИначеЕсли СтрДлина(ЗначениеШтрихкода) = 20 И (СтрНачинаетсяС(ЗначениеШтрихкода, "00") Или СтрНачинаетсяС(ЗначениеШтрихкода, "01")) Тогда //обувная продукция с 20	
			//ЭтоУпаковка = Истина;
			
			Если ДанныеУпаковки = Неопределено Тогда
				Если СтрНачинаетсяС(ЗначениеШтрихкода, "00") Тогда
					ЗначениеШтрихкода = "(00)" + Прав(ЗначениеШтрихкода, 18);
				ИначеЕсли СтрНачинаетсяС(ЗначениеШтрихкода, "01") Тогда
					ЗначениеШтрихкода = "(01)" + Прав(ЗначениеШтрихкода, 18);	
				КонецЕсли;
				ДанныеУпаковки = Справочники.ШтрихкодыУпаковокТоваров.ПолучитьДанныеУпаковкиПоЗначениюШтрихкода(ЗначениеШтрихкода);
			КонецЕсли;
		ИначеЕсли СтрДлина(ЗначениеШтрихкода) = 22 И (СтрНачинаетсяС(ЗначениеШтрихкода, "(00)") Или СтрНачинаетсяС(ЗначениеШтрихкода, "(01)")) Тогда //обувная продукция с 22	
			//ЭтоУпаковка = Истина;
		ИначеЕсли СтрДлина(ЗначениеШтрихкода) = 26 Тогда
			//ЭтоУпаковка = Истина;	
		ИначеЕсли СтрДлина(ЗначениеШтрихкода) = 27 Тогда	
			//ЭтоУпаковка = Истина;	
		ИначеЕсли СтрДлина(ЗначениеШтрихкода) = 31 Тогда	
			//ЭтоУпаковка = Истина;
		ИначеЕсли СтрДлина(ЗначениеШтрихкода) = 35 Тогда	
			//ЭтоУпаковка = Истина;
		ИначеЕсли СтрДлина(ЗначениеШтрихкода) = 36 Тогда	
			//ЭтоУпаковка = Истина;	
		ИначеЕсли СтрДлина(ЗначениеШтрихкода) = 39 Тогда
			//ЭтоУпаковка = Истина;	
		ИначеЕсли СтрДлина(ЗначениеШтрихкода) = 66 Тогда	
			//ЭтоУпаковка = Истина;			
		КонецЕсли; 
		
		Если ДанныеУпаковки <> Неопределено Тогда
			СтрШтрихкод.ШтрихкодУпаковки = ДанныеУпаковки.Ссылка;
			ЗаписатьДокумент = Истина;
			Если ЭтоУпаковка Тогда
				Если ДанныеУпаковки.Ссылка.ВложенныеШтрихкоды.Количество() > 1 Тогда
					Продолжить;	
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если Не ЭтоУпаковка Тогда
			Продолжить;
		Иначе
			МассивКМ.Добавить(ЗначениеШтрихкода);
		КонецЕсли; 
						
	КонецЦикла;	
	
	Если МассивКМ.Количество() И ЭтоУпаковка Тогда
		
		ОшибкаПриОбращении = "";
		
		ДлительнаяОперация = ДатаМобайл_Маркировка.СформироватьЗапросКСервису(МассивКМ, СсылкаНаДокОбъект.Ссылка, Шаблон, МассивПродукцийПоДокументу, ОшибкаПриОбращении);
		
		Если ДлительнаяОперация <> Неопределено Тогда
			Если ЗначениеЗаполнено(ДлительнаяОперация.ИдентификаторЗадания) Тогда
				ИдентификаторФоновогоЗадания = ДлительнаяОперация.ИдентификаторЗадания;	
			КонецЕсли; 	
		КонецЕсли;
					
	КонецЕсли;
	
	Если ЗаписатьДокумент Тогда
		СсылкаНаДокОбъект.Записать();
	КонецЕсли;
	
КонецПроцедуры	

Процедура ПриЗаписи(Отказ)
	
	ЗначенияРеквизитовШаблон = Справочники.ДатаМобайл_ШаблоныДокументов.ПолучитьПараметрыШаблона(Шаблон,
	"МаркировкаПовторныйВводКМИзДругихДокументов,ОтсылатьГотовуюЗаписьНаСерверПодбор");
	
	Если СобранныеДанныеПодбор.Количество() 
		И ЗначениеЗаполнено(ДатаЗавершенияСбора) 
		И ЗначенияРеквизитовШаблон.МаркировкаПовторныйВводКМИзДругихДокументов = 1
		И Не ЗначенияРеквизитовШаблон.ОтсылатьГотовуюЗаписьНаСерверПодбор Тогда 
		
		Если Не ПометкаУдаления Тогда
			
			ДанныеТЧ = СобранныеДанныеПодбор.Выгрузить();
			ДанныеТЧ.Свернуть("УпаковочныйЛист, ЦРПТМарка", "Количество");
			
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ВТ.УпаковочныйЛист КАК УпаковочныйЛист,
			|	ВТ.ЦРПТМарка КАК ЦРПТМарка,
			|	&ДокументТСД КАК ДокументТСД,
			|	&Дата КАК Дата,
			|	&ИсходныйДокумент КАК ИсходныйДокумент,
			|	ВТ.Количество КАК Количество
			|ПОМЕСТИТЬ НачальнаяВТ
			|ИЗ
			|	&ВТ КАК ВТ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	НачальнаяВТ.УпаковочныйЛист КАК УпаковочныйЛист,
			|	НачальнаяВТ.ЦРПТМарка КАК ЦРПТМарка,
			|	НачальнаяВТ.ДокументТСД КАК ДокументТСД,
			|	НачальнаяВТ.Дата КАК Дата,
			|	НачальнаяВТ.ИсходныйДокумент КАК ИсходныйДокумент,
			|	СУММА(НачальнаяВТ.Количество) КАК Количество
			|ПОМЕСТИТЬ ВТ
			|ИЗ
			|	НачальнаяВТ КАК НачальнаяВТ
			|ГДЕ
			|	НЕ НачальнаяВТ.УпаковочныйЛист = """"
			|				ИЛИ НЕ НачальнаяВТ.ЦРПТМарка = """"
			|
			|СГРУППИРОВАТЬ ПО
			|	НачальнаяВТ.УпаковочныйЛист,
			|	НачальнаяВТ.ЦРПТМарка,
			|	НачальнаяВТ.ДокументТСД,
			|	НачальнаяВТ.Дата,
			|	НачальнаяВТ.ИсходныйДокумент
			|
			|ИМЕЮЩИЕ
			|	СУММА(НачальнаяВТ.Количество) > 0
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ.УпаковочныйЛист КАК УпаковочныйЛист,
			|	ВТ.ЦРПТМарка КАК ЦРПТМарка,
			|	ВТ.ДокументТСД КАК ДокументТСД,
			|	ВТ.Дата КАК Дата,
			|	ВТ.ИсходныйДокумент КАК ИсходныйДокумент
			|ПОМЕСТИТЬ Итог
			|ИЗ
			|	ВТ КАК ВТ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Итог.УпаковочныйЛист КАК УпаковочныйЛист,
			|	Итог.ЦРПТМарка КАК ЦРПТМарка,
			|	Итог.ДокументТСД КАК ДокументТСД,
			|	МИНИМУМ(Итог.Дата) КАК Дата,
			|	Итог.ИсходныйДокумент КАК ИсходныйДокумент
			|ИЗ
			|	Итог КАК Итог
			|
			|СГРУППИРОВАТЬ ПО
			|	Итог.УпаковочныйЛист,
			|	Итог.ЦРПТМарка,
			|	Итог.ДокументТСД,
			|	Итог.ИсходныйДокумент"; 
			
			Запрос.УстановитьПараметр("ВТ", ДанныеТЧ);
			Запрос.УстановитьПараметр("ДокументТСД", Ссылка);
			Запрос.УстановитьПараметр("ИсходныйДокумент", ИсходныйДокумент);				
			Запрос.УстановитьПараметр("Дата", ДатаМобайл_ОбщийМодуль.ПолучитьТекущуюДату());
			
			Результат = Запрос.Выполнить().Выгрузить();
			
			НаборЗаписей = РегистрыСведений.ДатаМобайл_УчетКМ.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ДокументТСД.Установить(Ссылка);
			НаборЗаписей.Прочитать();
			НаборЗаписей.Загрузить(Результат);
			
			Попытка
				НаборЗаписей.Записать(Истина);	
			Исключение
				ДатаМобайл_ОбщийМодуль.ОбработатьИсключение(0, "ПриЗаписи", ОписаниеОшибки());     
			КонецПопытки;
			
		Иначе
			
			НаборЗаписей = РегистрыСведений.ДатаМобайл_УчетКМ.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ДокументТСД.Установить(Ссылка);
			НаборЗаписей.Прочитать();
			НаборЗаписей.Очистить();		
			Попытка
				НаборЗаписей.Записать(Истина);	
			Исключение
				ДатаМобайл_ОбщийМодуль.ОбработатьИсключение(0, "ПриЗаписи", ОписаниеОшибки());     
			КонецПопытки;		
			
		КонецЕсли;
		
	КонецЕсли;	
				
	
КонецПроцедуры

#КонецОбласти