#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ФормаПечатьКомплектДокументов.Видимость = Пользователи.РолиДоступны("_БухгалтерСклада")
		Или AMS_ВызовСервера.ЭтоKhors();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Элементы.Список.Обновить();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	Элементы.ФормаПечатьКомплектДокументов.Доступность = 
		Не Элемент.ТекущиеДанные.Статус = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление._СтатусыДоставки.План");
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПоказатьЗначение( , Элемент.ТекущаяСтрока);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	Элементы.Список.Обновить();
КонецПроцедуры
&НаКлиенте
Процедура Создать(Команда)
	ОткрытьФорму("Документ.AMS_ЛогистическийЛист.ФормаОбъекта");
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЛогистическийЛист(Команда)
	Парам = Новый Структура("Доставка", Неопределено);
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.AMS_Продажи", "ЛогистическийЛист",
		Элементы.Список.ВыделенныеСтроки, Неопределено, Парам);
КонецПроцедуры
&НаКлиенте
Процедура ПечатьЛогистическийЛистДоставка(Команда)
	Парам = Новый Структура("Доставка", Истина);
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.AMS_Продажи", "ЛогистическийЛистДоставка",
		Элементы.Список.ВыделенныеСтроки, Неопределено, Парам);
КонецПроцедуры
&НаКлиенте
Процедура ПечатьЛогистическийЛистПодвоз(Команда)
	Парам = Новый Структура("Доставка", Ложь);
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.AMS_Продажи", "ЛогистическийЛистПодвоз",
		Элементы.Список.ВыделенныеСтроки, Неопределено, Парам);
КонецПроцедуры
&НаКлиенте
Процедура ПечатьКомплектДокументов(Команда)
	ОткрытьФорму("Документ.AMS_ЛогистическийЛист.Форма.ФормаПечать", Новый Структура("ЛогистическийЛист",
		Элементы.Список.ТекущаяСтрока));
КонецПроцедуры
&НаКлиенте
Процедура ПечатьТН(Команда)
	ЛогистическийЛист = Элементы.Список.ТекущаяСтрока;

	Если ЗначениеЗаполнено(ЛогистическийЛист) Тогда
		МассивОбъектов = Новый Массив;
		МассивОбъектов.Добавить(ЛогистическийЛист);

		Парам = Новый Структура("ТранспортноеСредство,Распоряжение,Образец", Неопределено, Неопределено, Ложь);

		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.AMS_Продажи", "ТН", МассивОбъектов, Неопределено, Парам);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтчетРазвозы(Команда)
	ОткрытьФорму("Отчет._Логистика.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ОтчетОтменыДоставки(Команда)
	ОткрытьФорму("Отчет._ОтменыДоставки.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ОтчетЛогиста(Команда)
	ОткрытьФорму("Отчет.AMS_ОтчетЛогиста.Форма");
КонецПроцедуры

#КонецОбласти
