
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	

КонецПроцедуры

&НаКлиенте
Процедура ТоварыЕдиницаИзмеренияПриИзменении(Элемент)
	СТР = Элементы.Товары.текущиеданные;
	          
	Стр.Коэффициент = ВернутьКоэффициент(Стр.Номенклатура, Стр.Упаковка);	
	Стр.Штрихкод = ПолучитьШтрихкодТовара(Стр.Номенклатура, Стр.Упаковка);
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)

	Результат =  SendPackToPrint();
	Сообщить (Результат);
	
КонецПроцедуры

&НаСервере
Функция SendPackToPrint()
	
	УзелПО = Объект.ТСД;	
	СсылкаНаДок=Объект.Ссылка;
	
	Если УзелПО.ОнлайнСвязьСПринтсервером тогда	
		АдресПринтсервера = УзелПО.АдресПринтсервера;
		ПортПринтсервера = УзелПО.ПортПринтсервера;
		КаталогСохранения = ""; 
		Если АдресПринтсервера = "" или ПортПринтсервера=0 тогда
			Сообщение="В обработке АРМ для терминала не указаны настройки онлайн связи с принтсервером. ";
			Возврат Сообщение;
		КонецЕсли;	
	Иначе
		АдресПринтсервера = "";
		ПортПринтсервера = 0;
		КаталогСохранения = УзелПО.КаталогВыгрузкиФайлаПечати;
		Если КаталогСохранения = "" тогда
			Сообщение="В обработке АРМ для терминала не указан каталог сохранения файлов печати. ";
			Возврат Сообщение;
		КонецЕсли;
	КонецЕсли;
	
	
	
	СтруктураПоиска = Новый Структура("ТипОперации", "Печать упаковочного листа");
	СтрокиРеквизитов = УзелПО.Печать.НайтиСтроки(СтруктураПоиска);	
	Если СтрокиРеквизитов.Количество() = 0 тогда
		Сообщение="В обработке АРМ для терминала не указан шаблон печати упак. листа. ";
		Возврат Сообщение;
	КонецЕсли;	
	
	
	
	ЗаписьXML = Новый ЗаписьXML;
	
	Если НЕ УзелПО.ОнлайнСвязьСПринтсервером тогда
		ИмяФайла = ПолучитьНовоеИмяФайла();	
		Попытка
			ЗаписьXML.ОткрытьФайл(КаталогСохранения+ИмяФайла+".xml", "UTF-8");
		Исключение
			Сообщение = "Не удалось сохранить файл печати в каталоге: "+КаталогСохранения+" по причине: " + ОписаниеОшибки();
			Возврат Сообщение;
		КонецПопытки;
	Иначе
		ЗаписьXML.УстановитьСтроку("UTF-8");
	КонецЕсли;
	
	
	ЗаписьXML.ЗаписатьОбъявлениеXML();	
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("PrintData");
	
		ЗаписьXML.ЗаписатьНачалоЭлемента("PrinterName");
			ЗаписьXML.ЗаписатьТекст(СтрокиРеквизитов[0].ИмяПринтера);
		ЗаписьXML.ЗаписатьКонецЭлемента();		

		ЗаписьXML.ЗаписатьНачалоЭлемента("TemplateName");
			ЗаписьXML.ЗаписатьТекст(СтрокиРеквизитов[0].ИмяШаблона);
		ЗаписьXML.ЗаписатьКонецЭлемента();		
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Count");
			ЗаписьXML.ЗаписатьТекст(Строка(1));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Head");
	
		
	ЗаписьXML.ЗаписатьНачалоЭлемента("Date");
	ЗаписьXML.ЗаписатьТекст(ДатаМобайл_ОбщийМодуль.ЧистаяСтрока(СсылкаНаДок.Дата));
	ЗаписьXML.ЗаписатьКонецЭлемента();//Date
	
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Number");
	ЗаписьXML.ЗаписатьТекст(ДатаМобайл_ОбщийМодуль.ЧистаяСтрока("UPL"+СсылкаНаДок.Номер));
	ЗаписьXML.ЗаписатьКонецЭлемента();//Number
	
	
	//
	ЗаписьXML.ЗаписатьНачалоЭлемента("Barcode");
	ЗаписьXML.ЗаписатьТекст(ДатаМобайл_ОбщийМодуль.ЧистаяСтрока(СсылкаНаДок.Номер));
	ЗаписьXML.ЗаписатьКонецЭлемента();//Number
	
	
	ЗаписьXML.ЗаписатьКонецЭлемента();//Head
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Detail");
	
	Для Каждого СтрокаТЧ ИЗ СсылкаНаДок.Товары Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("Item");
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ArtName");
		ЗаписьXML.ЗаписатьТекст(ДатаМобайл_ОбщийМодуль.ЧистаяСтрока(СтрокаТЧ.Номенклатура.Наименование));
		ЗаписьXML.ЗаписатьКонецЭлемента();//Param1
		ЗаписьXML.ЗаписатьНачалоЭлемента("Barcode");
		ЗаписьXML.ЗаписатьТекст(ДатаМобайл_ОбщийМодуль.ЧистаяСтрока(СтрокаТЧ.ШтрихКод));
		ЗаписьXML.ЗаписатьКонецЭлемента();//Param2              
		ЗаписьXML.ЗаписатьНачалоЭлемента("QNT");
		ЗаписьXML.ЗаписатьТекст(ДатаМобайл_ОбщийМодуль.ЧистаяСтрока(СтрокаТЧ.Количество));
		ЗаписьXML.ЗаписатьКонецЭлемента();//Param3              
		
		
		//
		Если НЕ СтрокаТЧ.Серия.Пустая() тогда
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Param1");
			ЗаписьXML.ЗаписатьТекст(ДатаМобайл_ОбщийМодуль.ЧистаяСтрока(СтрокаТЧ.Серия.Номер));
			ЗаписьXML.ЗаписатьКонецЭлемента();//    
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Param2");
			ЗаписьXML.ЗаписатьТекст(ДатаМобайл_ОбщийМодуль.ЧистаяСтрока(Формат(СтрокаТЧ.Серия.ГоденДо,"ДФ=dd.MM.yyyy")));
			ЗаписьXML.ЗаписатьКонецЭлемента(); 
		Иначе 
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Param1");
			ЗаписьXML.ЗаписатьТекст("");
			ЗаписьXML.ЗаписатьКонецЭлемента();//    
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Param2");
			ЗаписьXML.ЗаписатьТекст("");
			ЗаписьXML.ЗаписатьКонецЭлемента(); 
			
			
		КонецЕсли;
		
		
		ЗаписьXML.ЗаписатьКонецЭлемента();//Item
	КонецЦикла;
	
	
	ЗаписьXML.ЗаписатьКонецЭлемента();//Detail
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Footer");
	
	
	Год = Строка(Формат(Год(ТекущаяДата()),"ЧГ="));
	Месяц = Строка(Месяц(ТекущаяДата()));
	День = Строка(День(ТекущаяДата()));
	ДатаСтрока = ГОД+Строка(Месяц)+Строка(День);
	ЗаписьXML.ЗаписатьНачалоЭлемента("Date");	
	ЗаписьXML.ЗаписатьТекст(ДатаМобайл_ОбщийМодуль.ЧистаяСтрока(ГОД+Месяц+ДЕНЬ));
	ЗаписьXML.ЗаписатьКонецЭлемента();//Date
	ЗаписьXML.ЗаписатьНачалоЭлемента("User");	
	ЗаписьXML.ЗаписатьТекст(ДатаМобайл_ОбщийМодуль.ЧистаяСтрока(СсылкаНаДок.Ответственный));
	ЗаписьXML.ЗаписатьКонецЭлемента();//User
	ЗаписьXML.ЗаписатьКонецЭлемента();//Footer
	
	ЗаписьXML.ЗаписатьКонецЭлемента();//PrintData
	
	
	Если НЕ УзелПО.ОнлайнСвязьСПринтсервером тогда
		ЗаписьXML.Закрыть();
		Сообщение = "Документ отправлен на печать";
		Возврат Сообщение;
	Иначе
		СтрокаДляЗапроса = ЗаписьXML.Закрыть();
		ТекстОшибки="";
		ОтправитьДанныеНаПринтсервер(УзелПО,СтрокаДляЗапроса,ТекстОшибки);
		Если ЗначениеЗаполнено(ТекстОшибки) тогда
			Сообщение = ТекстОшибки;
		Иначе	
			Сообщение = "Документ отправлен на печать";
		КонецЕсли;

		Возврат Сообщение;
		
	КонецЕсли;

	
	
	
	
КонецФункции

&НаСервере
Процедура ОтправитьДанныеНаПринтсервер(УзелПО,СтрокаДляЗапроса,ТекстОшибки);

АдресПринтсервера = УзелПО.АдресПринтсервера;
ПортПринтсервера = УзелПО.ПортПринтсервера;
	
Соединение = Новый HTTPСоединение(АдресПринтсервера,ПортПринтсервера,,,,1,);

РесурсНаСервере = "/printFile/";
HTTPЗапрос = Новый HTTPЗапрос(РесурсНаСервере);
HTTPЗапрос.Заголовки.Вставить("Content-type", "application/xml");
HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаДляЗапроса,КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);

ЕстьОшибка = Ложь;

Попытка 
	Результат = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
Исключение
	ЕстьОшибка = Истина;
	ТекстОшибки = "Ошибка онлайн соединения c сервером печати, проверьте настройки.";
КонецПопытки;

Соединение = Неопределено;

Если ЕстьОшибка тогда
Иначе
	ТекстСообщения  = "" + Результат.КодСостояния +  " " + Результат.ПолучитьТелоКакСтроку();
	Если СтрНайти(Результат.ПолучитьТелоКакСтроку(),"File Uploaded")>0 тогда
		//Успешная отправка данных
	Иначе
		ЕстьОшибка = Истина;
		ТекстОшибки = "Ошибка отправки данных на печать: "+ТекстСообщения + ", проверьте настройки.";
	КонецЕсли;
КонецЕсли;

КонецПроцедуры

	
&НаСервере
Функция ПолучитьНовоеИмяФайла(ПорядковыйНомер=0)
	
	ИмяФайла = СтрЗаменить(ТекущаяДата(),":","");
	ИмяФайла = СтрЗаменить(ИмяФайла, ".","");
	ИмяФайла = СтрЗаменить(ИмяФайла, " ","");
	ИмяФайла = СтрЗаменить(ИмяФайла, "/","");
	ИмяФайла = СтрЗаменить(ИмяФайла, "\","");
	
	Генератор = Новый ГенераторСлучайныхЧисел(1);
	ИдентификаторФайла = Генератор.СлучайноеЧисло(1, 1000);
	
	ИмяФайла = ИмяФайла + ИдентификаторФайла + ПорядковыйНомер;
	
	Возврат ИмяФайла;
	
КонецФункции // ()

//&НаСервере
//Функция ВернутьМакет(ТабДок)
//	
//		Макет = Документы.ДатаМобайл_УпаковочныйЛист.ПолучитьМакет("Паклист");
//	// Заголовок
//	Область = Макет.ПолучитьОбласть("Заголовок");
//	ТабДок.Вывести(Область);
//	// Шапка
//	Шапка = Макет.ПолучитьОбласть("Шапка");
//	
//		Шапка.Параметры.Заполнить(ЭтотОбъект);
//		Шапка.Рисунки.Штрихкод.Объект.АвтоТип = Истина;
//		Шапка.Рисунки.Штрихкод.Объект.ТипКода = 4;
//		Шапка.Рисунки.Штрихкод.Объект.ОтображатьТекст = Ложь;
//		Шапка.Рисунки.Штрихкод.Объект.Сообщение = СокрЛП(Объект.Номер);
//		Шапка.Рисунки.Штрихкод.Объект.ТекстКода= СокрЛП(Объект.Номер);
//		

//	ТабДок.Вывести(Шапка);
//	// Товары
//	Область = Макет.ПолучитьОбласть("ТоварыШапка");
//	ТабДок.Вывести(Область);
//	ОбластьТовары = Макет.ПолучитьОбласть("Товары");
//	ОбластьИТогоТовар = Макет.ПолучитьОбласть("ИтогоТовар");
//	ТЗТовары = Объект.Товары.Выгрузить(,"Номенклатура");
//	ТЗТовары.Свернуть("Номенклатура");
//	ТЗТовары.Сортировать("Номенклатура");
//	Для Каждого СтрокаТовара ИЗ ТЗТовары Цикл
//		ИтогоКолво = 0;
//		ИтогоКолвоМест = 0;
//	Для Каждого ТекСтрокаТовары Из Объект.Товары Цикл
//		Если ТекСтрокаТовары.Номенклатура = СтрокаТовара.Номенклатура Тогда		
//		ОбластьТовары.Параметры.Заполнить(ТекСтрокаТовары);
//		ОбластьТовары.Параметры.КоличествоМест = ТекСтрокаТовары.Количество;
//		ОбластьТовары.Параметры.ЕдиницаИзмеренияМест = ТекСтрокаТовары.Упаковка;
//		ОбластьТовары.Параметры.ХарактеристикаНоменклатуры = ТекСтрокаТовары.Характеристика;
//		ОбластьТовары.Параметры.Количество = ТекСтрокаТовары.Коэффициент*ТекСтрокаТовары.Количество;
//		ОбластьТовары.Параметры.ЕдиницаИзмерения = ТекСтрокаТовары.Номенклатура.ЕдиницаИзмерения;
//		ТабДок.Вывести(ОбластьТовары);
//		ИтогоКолво = ИтогоКолво + ТекСтрокаТовары.Коэффициент*ТекСтрокаТовары.Количество;
//		ИтогоКолвоМест = ИтогоКолвоМест+ТекСтрокаТовары.Количество; 
//	КонецЕсли;
//	КонецЦикла;
//	
//	ОбластьИТогоТовар.Параметры.ИтогоКолВо = ИтогоКолВо;
//	ОбластьИТогоТовар.Параметры.ИтогоКолВоМест = ИтогоКолВоМест;
//	ОбластьИТогоТовар.Параметры.ИтогоЕдиницаИзмерения = СтрокаТовара.Номенклатура.ЕдиницаИзмерения;
//	ТабДок.Вывести(ОбластьИТогоТовар);
//	
//	КонецЦикла;

//	
//КонецФункции

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	СТР = Элементы.Товары.текущиеданные;	
	Стр.Штрихкод = ПолучитьШтрихкодТовара(Стр.Номенклатура, Стр.Упаковка);
	Стр.Характеристика = НайтиХарактеристикуНоменклатуры(Стр.номенклатура);
	Стр.Упаковка = НайтиЕдиницуНоменклатуры(Стр.номенклатура);
	Стр.Коэффициент = ВернутьКоэффициент(Стр.Номенклатура, Стр.Упаковка);
	
КонецПроцедуры

&НаСервере
Функция НайтиЕдиницуНоменклатуры(Товар)
	
	Возврат Товар.ЕдиницаИзмерения;
	
КонецФункции

&НаСервере
Функция НайтиХарактеристикуНоменклатуры(Товар)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("товар", Товар);

	Запрос.Текст = "ВЫБРАТЬ
	               |	ХарактеристикиНоменклатуры.Ссылка
	               |ИЗ
	               |	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	               |ГДЕ
	               |	ХарактеристикиНоменклатуры.Владелец = &Товар";
				   
	Выборка = ЗАпрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;
	
КонецФункции

&НаСервере
Функция НайтиСериюНоменклатуры(Товар)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("товар", Товар.ВидНоменклатуры);

	Запрос.Текст = "ВЫБРАТЬ
	               |	СерииНоменклатуры.Ссылка
	               |ИЗ
	               |	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	               |ГДЕ
	               |	СерииНоменклатуры.ВидНоменклатуры = &Товар";
				   
	Выборка = ЗАпрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;
	
КонецФункции

&НаСервере
Функция ВернутьКоэффициент(Номенклатура, ЕдиницаИзмерения)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Товар", Номенклатура);
	Запрос.УстановитьПараметр("ЕдиницаИЗмерения", ЕдиницаИзмерения);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫБОР
				   |		КОГДА УпаковкиНоменклатуры.Знаменатель=0 ИЛИ УпаковкиНоменклатуры.Числитель=0 ТОГДА 1
				   |		ИНАЧЕ
				   |				ЕСТЬNULL(УпаковкиНоменклатуры.Числитель/УпаковкиНоменклатуры.Знаменатель,1)
				   |		КОНЕЦ КАК Коэффициент	 
	               |ИЗ
	               |	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиНоменклатуры
	               |ГДЕ
	               |	УпаковкиНоменклатуры.ЕдиницаИзмерения = &ЕдиницаИзмерения
	               |	И УпаковкиНоменклатуры.Владелец = &Товар";
				   
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Возврат Выборка.Коэффициент;
		
	КонецЦикла;
	
	    Возврат 1;
		
КонецФУнкции

&НаСервере
Функция ПолучитьШтрихкодТовара(Товар, ЕдиницаИзмерения)
	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Товар", Товар);
	Запрос.УстановитьПараметр("ЕдиницаИзмерения", ЕдиницаИзмерения);
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Штрихкоды.Штрихкод
	               |ПОМЕСТИТЬ тШтрихкод
	               |ИЗ
	               |	РегистрСведений.ШтрихкодыНоменклатуры КАК Штрихкоды
	               |ГДЕ
	               |	Штрихкоды.Номенклатура = &Товар
	               |	И Штрихкоды.Упаковка.ЕдиницаИзмерения = &ЕдиницаИзмерения
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	тШтрихкод.Штрихкод
	               |ИЗ
	               |	тШтрихкод КАК тШтрихкод";
				   
	Выборка = ЗАпрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Штрихкод;
	КонецЦикла;
	
	
КонецФункции





