#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	МассивСтрок = Параметры.МассивСтрок;

	Для Каждого Стр Из МассивСтрок Цикл
		НовСтр = Спецификации.Добавить();
		НовСтр.Флаг = Истина;
		ЗаполнитьЗначенияСвойств(НовСтр, Стр);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСпецификации

&НаКлиенте
Процедура СпецификацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "СпецификацииФлаг" Тогда
		Возврат;
	КонецЕсли;

	СтандартнаяОбработка = Ложь;

	Стр = Элемент.ТекущиеДанные;
	ПоказатьЗначение( , Стр.Спецификация);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Печать(Команда)
	МассивРецептур = Новый Массив;

	Для Каждого Стр Из Спецификации Цикл
		Если Стр.Флаг Тогда
			МассивРецептур.Добавить(Стр.Спецификация);
		КонецЕсли;
	КонецЦикла;

	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.AMS_ПроизводствоЗаСмену", "Рецептуры", МассивРецептур,
		Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	УстановитьФлажкиСервер();
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	СнятьФлажкиСервер();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьФлажкиСервер()
	Табл = РеквизитФормыВЗначение("Спецификации");
	Табл.ЗаполнитьЗначения(Истина, "Флаг");
	ЗначениеВРеквизитФормы(Табл, "Спецификации");
КонецПроцедуры

&НаСервере
Процедура СнятьФлажкиСервер()
	Табл = РеквизитФормыВЗначение("Спецификации");
	Табл.ЗаполнитьЗначения(Ложь, "Флаг");
	ЗначениеВРеквизитФормы(Табл, "Спецификации");
КонецПроцедуры

#КонецОбласти