
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ТоварыУтверждено.Видимость = Не Параметры.Склад = AMS_ВызовСервера.Цех4();

	МассивСтрок = Параметры.МассивСтрок;
    
    Для каждого СтрСтроки Из МассивСтрок Цикл
    	Стр = Товары.Добавить();
        
        ЗаполнитьЗначенияСвойств(Стр, СтрСтроки);
        
        Стр.Количество = Стр.КоличествоФакт;
        Стр.Остаток    = ?(Стр.Утверждено = 0, Стр.КоличествоПлан, Стр.Утверждено)  - Стр.Количество;
    КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоДобавитьПриИзменении(Элемент)
    Модифицированность = Истина;
    
    Стр = ТекущийЭлемент.ТекущиеДанные;
    
    Стр.Количество = Стр.КоличествоФакт + Стр.КоличествоДобавить;
    Стр.Остаток = ?(Стр.Утверждено = 0, Стр.КоличествоПлан, Стр.Утверждено) - Стр.Количество;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
    Модифицированность = Истина;
    
    Стр = ТекущийЭлемент.ТекущиеДанные;
    
    Стр.КоличествоДобавить = Стр.Количество - Стр.КоличествоФакт;
    Стр.Остаток = ?(Стр.Утверждено = 0, Стр.КоличествоПлан, Стр.Утверждено) - Стр.Количество;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
    Модифицированность = Ложь;
    
    Закрыть(ПолучитьДанныеПодбора());
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьДанныеПодбора()
	МассивСтрок = Новый Массив();
	
	Табл = РеквизитФормыВЗначение("Товары");
	
	Для каждого Стр Из Табл Цикл
		МассивСтрок.Добавить(ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Стр));
	КонецЦикла;

	Возврат МассивСтрок;
КонецФункции

#КонецОбласти