#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НомерБригады = Параметры.НомерБригады;
	МассивСтрок  = Параметры.МассивСтрок;
	СуммаБригады = Параметры.СуммаБригады;

	Для Каждого Стр Из МассивСтрок Цикл
		НовСтр = мБригада.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Стр);
	КонецЦикла;
	мБригада.Сортировать("НомерГруппы,Сотрудник");

	Если Не (Пользователи.РолиДоступны("_НачальникЦеха") Или AMS_ВызовСервера.ЭтоKhors()) Тогда
		Элементы.БригадаНомерГруппы.ТолькоПросмотр = Истина;
		Элементы.БригадаНомерГруппы.ЦветФона = ЦветаСтиля.ЦветФонаШапкиОтчета;
	КонецЕсли;

	УстановитьУсловноеОформление();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПоказатьСписокСотрудников();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если Модифицированность Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект), НСтр(
			"ru = 'Данные были изменены. Перенести изменения в документ?'"), РежимДиалогаВопрос.ДаНет);
	Иначе
		ПеренестиВДокументНаКлиенте();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПоказатьВсехПриИзменении(Элемент)
	ПоказатьСписокСотрудников();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыБригада

&НаКлиенте
Процедура БригадаМеткаПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура БригадаНомерГруппыПриИзменении(Элемент)
	ТекущиеДанные = ТекущийЭлемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ИзменитьНомерГруппыСотрудника(ТекущиеДанные.Сотрудник, ТекущиеДанные.НомерГруппы);
КонецПроцедуры

&НаКлиенте
Процедура БригадаПодработкаПриИзменении(Элемент)
	ПересчитатьСумму();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	ПеренестиВДокументНаКлиенте();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	УсловноеОформление.Элементы.Очистить();

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Бригада.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Бригада.Включен");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветРамки);
КонецПроцедуры

&НаСервере
Процедура ПоказатьСписокСотрудников()
	Бригада.Очистить();

	НомерСтроки = 0;
	Для Каждого Стр Из мБригада Цикл
		Если Не ПоказатьВсех И Стр.Включен Тогда
			Продолжить;
		КонецЕсли;

		НомерСтроки = НомерСтроки + 1;

		НовСтр = Бригада.Добавить();

		ЗаполнитьЗначенияСвойств(НовСтр, Стр);

		НовСтр.НомерСтроки = НомерСтроки;
	КонецЦикла;

	ИтогоСумма = Бригада.Итог("Сумма");
КонецПроцедуры

&НаСервере
Процедура ИзменитьНомерГруппыСотрудника(Сотрудник, НомерГруппы)
	УстановитьПривилегированныйРежим(Истина);

	Строки = мБригада.НайтиСтроки(Новый Структура("Сотрудник", Сотрудник));

	Стр = Строки[0];

	Если Не Стр.НомерГруппы = НомерГруппы Тогда
		СотрудникОбъект = Сотрудник.ПолучитьОбъект();
		СотрудникОбъект._НомерГруппы = НомерГруппы;
		СотрудникОбъект.Записать();

		Стр.НомерГруппы = НомерГруппы;
		мБригада.Сортировать("НомерГруппы,Сотрудник");
		ПоказатьСписокСотрудников();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПеренестиВДокументНаКлиенте();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокументНаКлиенте()
	Парам = Новый Структура;
	Парам.Вставить("НомерБригады", НомерБригады);
	Парам.Вставить("МассивСтрок", ПолучитьМассивСтрок());
    
	//Снятие модифицированности, т.к. перед закрытием признак проверяется.
	Модифицированность = Ложь;

	Закрыть(Парам);
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивСтрок()
	МассивСтрок = Новый Массив;
	Для Каждого Стр Из Бригада Цикл
		Если Стр.Метка Тогда
			МассивСтрок.Добавить(Новый Структура("НомерБригады,Сотрудник,Подработка", НомерБригады, Стр.Сотрудник,
				Стр.Подработка));
		КонецЕсли;
	КонецЦикла;

	Возврат МассивСтрок;
КонецФункции

&НаСервере
Процедура ПересчитатьСумму()
	Строки = Бригада.НайтиСтроки(Новый Структура("Метка", Истина));

	КоличествоВБригаде = Строки.Количество();

	Сумма = СуммаБригады / КоличествоВБригаде;

	Если КоличествоВБригаде > 0 Тогда
		Для Каждого Стр Из Бригада Цикл
			Если Стр.Метка Тогда
				Стр.Сумма = Сумма * Стр.Подработка;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	ИтогоСумма = Бригада.Итог("Сумма");
КонецПроцедуры

#КонецОбласти