 
#Область ОписаниеПеременных

&НаКлиенте
Перем ТекМенеджер;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтатусНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Если AMS_ВызовСервера.ЭтоKhors() Или AMS_ВызовСервера.ДоступнаРоль("AMS_Аналитик, _Директор, _ГлавныйБухгалтер") Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыПланов.ВПодготовке"));
	СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыПланов.НаУтверждении")); 
	
	ДанныеВыбора = СписокВыбора;
КонецПроцедуры

&НаКлиенте
Процедура МенеджерНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ТекМенеджер = Объект.Менеджер;
КонецПроцедуры

&НаКлиенте
Процедура МенеджерПриИзменении(Элемент)
	Если Объект.Клиенты.Количество() > 0 Тогда 
		Оповещение = Новый ОписаниеОповещения("МенеджерПриИзмененииЗавершение", ЭтотОбъект);
		
		ПоказатьВопрос(Оповещение, "Табличная часть документа будет очищена. Продолжить выполнение операции?", РежимДиалогаВопрос.ДаНет);
		
	Иначе 
		ЗаполнитьСписокКлиентовНаСервере();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКлиенты

&НаКлиенте
Процедура КлиентыПартнерыПриИзменении(Элемент)
	Стр = Элементы.Клиенты.ТекущиеДанные; 
	
	Если ЗначениеЗаполнено(Стр.Партнер) Тогда
		ГоловноеПредприятие	= ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Стр.Партнер, "Родитель"); 
		
		Если ЗначениеЗаполнено(ГоловноеПредприятие) Тогда
			ИдентификаторСтроки = Стр.ПолучитьИдентификатор();
			
			ТекСтр = Объект.Клиенты.НайтиПоИдентификатору(ИдентификаторСтроки);
			
			ТекСтр.Партнер = ГоловноеПредприятие;
			
			Объект.Клиенты.Сортировать("Партнер");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьСписокКлиентов(Команда)
	Если Объект.Клиенты.Количество() > 0 Тогда 
//		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект);
//		
//		ПоказатьВопрос(Оповещение, "Табличная часть документа будет очищена. Продолжить выполнение операции?", РежимДиалогаВопрос.ДаНет);
//		
	Иначе 
		ЗаполнитьСписокКлиентовНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДвижениеДокумента(Команда)
	СсылкаНаОбъект = Объект.Ссылка;
	Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ВидимостьКомандВариантовОтчетов", Ложь);
		ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
		ПараметрыФормы.Вставить("ПараметрКоманды", СсылкаНаОбъект);

		ОткрытьФорму("Отчет.ДвиженияДокумента.Форма", ПараметрыФормы, ЭтотОбъект, Истина);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура МенеджерПриИзмененииЗавершение(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Объект.Менеджер = ТекМенеджер;
		
	Иначе
		ЗаполнитьСписокКлиентовНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокКлиентовЗавершение(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьСписокКлиентовНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокКлиентовНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВЫБОР
		|		КОГДА т.Родитель = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
		|			ТОГДА т.Ссылка
		|		ИНАЧЕ т.Родитель
		|	КОНЕЦ КАК Партнер,
		|	ВЫБОР
		|		КОГДА т.Родитель = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
		|			ТОГДА т.Наименование
		|		ИНАЧЕ т.Родитель.Наименование
		|	КОНЕЦ КАК Наименование,
		|	т.ОсновнойМенеджер КАК ОсновнойМенеджер
		|ИЗ
		|	Справочник.Партнеры КАК т
		|ГДЕ
		|	НЕ т._Закрыт
		|	И т.Клиент
		|	И т.ОсновнойМенеджер = &ОсновнойМенеджер
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование";
	
	Запрос.УстановитьПараметр("ОсновнойМенеджер", Объект.Менеджер);
	
	Объект.Клиенты.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

#КонецОбласти
