
#Область ОписаниеПеременных

&НаКлиенте
Перем ТекДата;

&НаКлиенте
Перем ТекСмена;

&НаКлиенте
Перем ТекСтатус;

&НаКлиенте
Перем ТекЦех;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Организация = AMS_ВызовСервера.ПолучитьОсновнуюОрганизацию();
	
	Элементы.Склад.СписокВыбора.Добавить(AMS_ВызовСервера.Цех1());
	Элементы.Склад.СписокВыбора.Добавить(AMS_ВызовСервера.Цех2());
	Элементы.Склад.СписокВыбора.Добавить(AMS_ВызовСервера.Цех3());
	Элементы.Склад.СписокВыбора.Добавить(AMS_ВызовСервера.Цех4());
	
	Цех1 = Объект.Склад = AMS_ВызовСервера.Цех1();
	Цех2 = Объект.Склад = AMS_ВызовСервера.Цех2();
	Цех3 = Объект.Склад = AMS_ВызовСервера.Цех3();
	Цех4 = Объект.Склад = AMS_ВызовСервера.Цех4();
	
	Элементы.Утвержден.Видимость           = Не Цех4;
	Элементы.ПродукцияУтверждено.Видимость = Не Цех4;
	Элементы.ПродукцияГруппа1.Видимость    = Не Цех4;
	
	РольЦех1 = Пользователи.РолиДоступны("_Цех1");
	РольЦех2 = Пользователи.РолиДоступны("_Цех2");
	РольЦех3 = Пользователи.РолиДоступны("_Цех3");
	РольЦех4 = Пользователи.РолиДоступны("_Цех4");
	ЭтоБух   = Пользователи.РолиДоступны("AMS_БухгалтерПроизводства, _ГлавныйБухгалтер");
	Khors    = AMS_ВызовСервера.ЭтоKhors();
	
	ЭтоМойДок = (РольЦех1 И Цех1) Или (РольЦех2 И Цех2) Или (РольЦех3 И Цех3) Или (РольЦех4 И Цех4)
				Или ЭтоБух Или Khors;
				
	Элементы.ГруппаДокументы.Видимость = Khors;
	 
	УстановитьУсловноеОформление();

	Если Объект.Статус = Перечисления._СтатусыПроизводства.Выполнено Тогда
		Элементы.Статус.Доступность = Khors Или ЭтоБух;
	КонецЕсли;

	Элементы.Склад.Доступность = Khors Или ЭтоБух Или (РольЦех2 И РольЦех4);

	ПоказатьТолькоОтрицательныеОстаткиПоСырью    = Не Khors;
	ПоказатьТолькоОтрицательныеОстаткиПоУпаковке = Не Khors;

	Сотрудники = ПолучитьСотрудников(Объект.Склад);
	Элементы.ЗамесчикиСотрудник.СписокВыбора.ЗагрузитьЗначения(Сотрудники);
	Элементы.МеханикиСотрудник.СписокВыбора.ЗагрузитьЗначения(Сотрудники);
	Элементы.КладовщикиСотрудник.СписокВыбора.ЗагрузитьЗначения(Сотрудники);
	Элементы.ГрузчикиСотрудник.СписокВыбора.ЗагрузитьЗначения(Сотрудники);
	Элементы.ДопРаботыСотрудник.СписокВыбора.ЗагрузитьЗначения(Сотрудники);

	Если Объект.Склад = AMS_ВызовСервера.Цех1() Тогда
		Элементы.ЗамесчикиРабота.СписокВыбора.Добавить(Справочники._Работы.Замесчик1);

		Элементы.МеханикиРабота.СписокВыбора.Добавить(Справочники._Работы.Механик1);
		Элементы.МеханикиРабота.СписокВыбора.Добавить(Справочники._Работы.Механик1_);
		Элементы.МеханикиРабота.СписокВыбора.Добавить(Справочники._Работы.ПолучитьСсылку(Новый УникальныйИдентификатор("5968ae54-e76b-11ee-8e26-a4bf015601f8")));
		Элементы.МеханикиРабота.СписокВыбора.Добавить(Справочники._Работы.ПолучитьСсылку(Новый УникальныйИдентификатор("75a89fe7-b3da-11ef-8e35-a4bf015601f8")));

		Элементы.КладовщикиРабота.СписокВыбора.Добавить(Справочники._Работы.Кладовщик1);

		Элементы.ГрузчикиРабота.СписокВыбора.Добавить(Справочники._Работы.Грузчик1);
		Элементы.ГрузчикиРабота.СписокВыбора.Добавить(Справочники._Работы.Грузчик1_);

	ИначеЕсли Объект.Склад = AMS_ВызовСервера.Цех2() Тогда
		Элементы.ЗамесчикиРабота.СписокВыбора.Добавить(Справочники._Работы.Замесчик2);

		Элементы.МеханикиРабота.СписокВыбора.Добавить(Справочники._Работы.Механик2);
		Элементы.МеханикиРабота.СписокВыбора.Добавить(Справочники._Работы.ПолучитьСсылку(Новый УникальныйИдентификатор("fd5b6fa3-e76b-11ee-8e26-a4bf015601f8")));

		Элементы.КладовщикиРабота.СписокВыбора.Добавить(Справочники._Работы.Кладовщик2);

		Элементы.ГрузчикиРабота.СписокВыбора.Добавить(Справочники._Работы.Грузчик2);

	ИначеЕсли Объект.Склад = AMS_ВызовСервера.Цех3() Тогда
		Элементы.ЗамесчикиРабота.СписокВыбора.Добавить(Справочники._Работы.Замесчик3);

		Элементы.МеханикиРабота.СписокВыбора.Добавить(Справочники._Работы.Механик3_1);
		Элементы.МеханикиРабота.СписокВыбора.Добавить(Справочники._Работы.Механик3_2);
		Элементы.МеханикиРабота.СписокВыбора.Добавить(Справочники._Работы.Механик3_3);
		Элементы.МеханикиРабота.СписокВыбора.Добавить(Справочники._Работы.НайтиПоНаименованию("Наладчик производственного оборудования (механик 4 кат. цех 3)", Истина));

		Элементы.КладовщикиРабота.СписокВыбора.Добавить(Справочники._Работы.Кладовщик3);

		Элементы.ГрузчикиРабота.СписокВыбора.Добавить(Справочники._Работы.Грузчик3);
	КонецЕсли;

	Элементы.ДопРаботыРабота.СписокВыбора.ЗагрузитьЗначения(ПолучитьДопРаботы(Объект.Склад));

	ПоказатьТовары();
	ПоказатьСтраницуФасовка();
	ПолучитьДокументыПроизводстваПродукции();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "Запись_ПеремещениеТоваров" Тогда
		ПоказатьТовары();
		ПолучитьДокументыПроизводстваПродукции();
		ПоказатьОтчетПередачаПродукции();
	
	ИначеЕсли ИмяСобытия = "Запись_ПроизводствоЗаСмену" Тогда
		ОбновитьОтображениеДанных();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("РежимЗаписи", ПараметрыЗаписи.РежимЗаписи);

	Оповестить("Запись_ПроизводствоТоваровЗаСмену", ПараметрыОповещения, Объект.Ссылка);

	Если Объект.Статус = ПредопределенноеЗначение("Перечисление._СтатусыПроизводства.Выполнено") Или Объект.Статус
		= ПредопределенноеЗначение("Перечисление._СтатусыПроизводства.РасчётЗарплаты") Тогда
		ЗаписатьСтоимостьПродукции(НачалоДня(Объект.Дата));
	КонецЕсли;

	Если Открыта() Тогда
		ПодключитьОбработчикОжидания("ПослеЗаписиОбработчикОжидания", 0.1, Истина);
	КонецЕсли;

	Состояние();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекДата = Объект.Дата;
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если НачалоДня(Объект.Дата) = НачалоДня(ТекДата) Тогда
		Объект.Дата = ТекДата;
		Возврат;
	КонецЕсли;

	Стр = ПолучитьНаличиеДокументовНаДату(Объект.Дата, Объект.Склад, Объект.Ссылка);

	СменаДневная  = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление._ПроизводственныеСмены.Дневная");
	СменаВечерняя = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление._ПроизводственныеСмены.Вечерняя");

	ЦехОсновной       = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление._МестаПроизводства.Основной");
	ЦехДополнительный = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление._МестаПроизводства.Дополнительный");

	Если Не Стр.ОсновнойДневная Тогда
		Объект.Дата  = НачалоДня(Объект.Дата) + AMS_ВызовСервера.ПолучитьВремя(9, 0);
		Объект.Цех   = ЦехОсновной;
		Объект.Смена = СменаДневная;

	ИначеЕсли Не Стр.ОсновнойВечерняя Тогда
		Объект.Дата  = НачалоДня(Объект.Дата) + AMS_ВызовСервера.ПолучитьВремя(12, 0);
		Объект.Цех   = ЦехОсновной;
		Объект.Смена = СменаВечерняя;

	ИначеЕсли Не Стр.ДополнительныйДневная Тогда
		Объект.Дата  = НачалоДня(Объект.Дата) + AMS_ВызовСервера.ПолучитьВремя(9, 5);
		Объект.Цех   = ЦехДополнительный;
		Объект.Смена = СменаДневная;

	ИначеЕсли Не Стр.ДополнительныйВечерняя Тогда
		Объект.Дата  = НачалоДня(Объект.Дата) + AMS_ВызовСервера.ПолучитьВремя(12, 5);
		Объект.Цех   = ЦехДополнительный;
		Объект.Смена = СменаВечерняя;

	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("На " + Формат(Объект.Дата, "ДЛФ=Д") + " все документы созданы.");
		Объект.Дата = ТекДата;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СменаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекСмена = Объект.Смена;
КонецПроцедуры

&НаКлиенте
Процедура СменаПриИзменении(Элемент)
	Если Объект.Смена = ТекСмена Тогда
		Возврат;
	КонецЕсли;

	Стр = ПолучитьНаличиеДокументовНаДату(Объект.Дата, Объект.Склад, Объект.Ссылка);

	СменаДневная  = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление._ПроизводственныеСмены.Дневная");
	СменаВечерняя = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление._ПроизводственныеСмены.Вечерняя");

	ЦехОсновной       = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление._МестаПроизводства.Основной");
	ЦехДополнительный = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление._МестаПроизводства.Дополнительный");

	Если (Объект.Цех = ЦехОсновной И Объект.Смена = СменаДневная И Стр.ОсновнойДневная) Или (Объект.Цех
		= ЦехОсновной И Объект.Смена = СменаВечерняя И Стр.ОсновнойВечерняя) Или (Объект.Цех = ЦехДополнительный
		И Объект.Смена = СменаДневная И Стр.ДополнительныйДневная) Или (Объект.Цех = ЦехДополнительный И Объект.Смена
		= СменаВечерняя И Стр.ДополнительныйВечерняя) Тогда

		ОбщегоНазначенияКлиент.СообщитьПользователю("На " + Формат(Объект.Дата, "ДЛФ=Д")
			+ " такой документ уже созданы.");

		Объект.Смена = ТекСмена;
	КонецЕсли;
	
	УправлениеЭлементамиФормы();
КонецПроцедуры

&НаКлиенте
Процедура ЦехНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекЦех = Объект.Цех;
КонецПроцедуры

&НаКлиенте
Процедура ЦехПриИзменении(Элемент)
	Если Объект.Цех = ТекЦех Тогда
		Возврат;
	КонецЕсли;

	Стр = ПолучитьНаличиеДокументовНаДату(Объект.Дата, Объект.Склад, Объект.Ссылка);

	СменаДневная  = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление._ПроизводственныеСмены.Дневная");
	СменаВечерняя = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление._ПроизводственныеСмены.Вечерняя");

	ЦехОсновной       = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление._МестаПроизводства.Основной");
	ЦехДополнительный = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление._МестаПроизводства.Дополнительный");

	Если (Объект.Цех = ЦехОсновной И Объект.Смена = СменаДневная И Стр.ОсновнойДневная) Или (Объект.Цех
		= ЦехОсновной И Объект.Смена = СменаВечерняя И Стр.ОсновнойВечерняя) Или (Объект.Цех = ЦехДополнительный
		И Объект.Смена = СменаДневная И Стр.ДополнительныйДневная) Или (Объект.Цех = ЦехДополнительный И Объект.Смена
		= СменаВечерняя И Стр.ДополнительныйВечерняя) Тогда

		ОбщегоНазначенияКлиент.СообщитьПользователю("На " + Формат(Объект.Дата, "ДЛФ=Д")
			+ " такой документ уже созданы.");

		Объект.Цех = ТекЦех;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	ПоказатьТовары();
КонецПроцедуры

&НаКлиенте
Процедура СтатусНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекСтатус = Объект.Статус;
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	Если AMS_ВызовСервера.ЭтоKhors() Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоЦех4 = (Объект.Склад = AMS_ВызовСервера.Цех4());

	Отказ = Ложь;

	Если Объект.Статус = ПредопределенноеЗначение("Перечисление._СтатусыПроизводства.Проект") Тогда
		Если Не ЭтоЦех4 И Объект.Утвержден Тогда
			ТекстОшибки = "Установка статуса ""Проект"" утверждённого плана запрещена.";
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , , , Отказ);
		КонецЕсли;

		Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
			ПроверкаНаличияДокументовПередачиПродукции(Объект.Ссылка, Отказ);
		КонецЕсли;

	ИначеЕсли Объект.Статус = ПредопределенноеЗначение("Перечисление._СтатусыПроизводства.План") Тогда
		ПроверкаРанееДокументВСтатусеПроект(Отказ);

	ИначеЕсли Объект.Статус = ПредопределенноеЗначение("Перечисление._СтатусыПроизводства.ВРаботе") Тогда
		ПроверкаРанееНеЗакрытыхДокументов(Отказ);
		ПроверкаРанееДокументВСтатусеПроектПлан(Отказ);

		Если Не ЭтоЦех4 И Не Объект.Утвержден Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Документ не утверждён.", , , , Отказ);
		КонецЕсли;

	ИначеЕсли Объект.Статус = ПредопределенноеЗначение("Перечисление._СтатусыПроизводства.Выполнено") 
		Или Объект.Статус = ПредопределенноеЗначение("Перечисление._СтатусыПроизводства.РасчётЗарплаты") Тогда

		Если Не ЭтоЦех4 И Не Объект.Утвержден Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Документ не утверждён.", , , , Отказ);
		КонецЕсли;

		Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо предварительно провести документ в статусе ""В работе"".", , , , Отказ);
		КонецЕсли;

		Если Объект.Склад = AMS_ВызовСервера.Цех1() Или Объект.Склад = AMS_ВызовСервера.Цех2() Или Объект.Склад = AMS_ВызовСервера.Цех4() Тогда

			Массив = ПолучитьМассивНеотгруженныхТоваров(Объект.Ссылка);
			Если Массив.Количество() > 0 Тогда
				Для Каждого Стр Из Массив Цикл
					ТекстОшибки = "Не сдан на склад товар """ + Стр.Номенклатура + """ " + Стр.Количество + " "
						+ Стр.Упаковка + ".";
					ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , , , Отказ);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Если Отказ Тогда
		Объект.Статус = ТекСтатус;
	Иначе
		УправлениеЭлементамиФормы();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УтвержденПриИзменении(Элемент)
	Для Каждого Стр Из Объект.Продукция Цикл
		Если Объект.Утвержден Тогда
			Стр.Утверждено = Стр.КоличествоПлан;
		Иначе
			Стр.Утверждено = 0;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Стр Из Продукция Цикл
		Если Объект.Утвержден Тогда
			Стр.Утверждено = Стр.План;
		Иначе
			Стр.Утверждено = 0;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПередачаПродукцииОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура КоличествоБригадФасовкиПриИзменении(Элемент)
	ПоказатьСтраницуФасовка();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьТолькоОтрицательныеОстаткиПоСырьюПриИзменении(Элемент)
	ПоказатьРасходМатериалов();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьТолькоОтрицательныеОстаткиПоУпаковкеПриИзменении(Элемент)
	ПоказатьРасходМатериалов();
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ПолучитьДокументыПроизводстваПродукции();
КонецПроцедуры

&НаКлиенте
Процедура СтраницыРаботаПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница = Элементы.СтрСтоимостьРабот Тогда
		ПоказатьСтоимостьРабот();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодработкаПриИзменении(Элемент)
	ПодработкаПриИзмененииНаСервере();
	ПоказатьБригады();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПродукция

&НаКлиенте
Процедура ПродукцияПриАктивизацииСтроки(Элемент)
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Товар = Элемент.ТекущиеДанные.Номенклатура;
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ИмяПоля = Поле.Имя; 
	
	Если Не ЭтоМойДок Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Номенклатура = Элемент.ТекущиеДанные.Номенклатура;

	Если ИмяПоля = "ПродукцияНомерСтроки" Или ИмяПоля = "ПродукцияНоменклатура" 
		Или ИмяПоля = "ПродукцияСпецификация" Или ИмяПоля = "ПродукцияЕд" Тогда
		
		Если AMS_ВызовСервера.ЭтоKhors() Или ЭтоБух Тогда
			ОткрытьФормуПланированияПроизводства(Номенклатура);

		ИначеЕсли AMS_ВызовСервера.ЕстьПравоАМС(ПредопределенноеЗначение("Перечисление.AMS_Права.Продукция_ПроизводствоПередача")) Тогда
			ОткрытьФормуПланированияПроизводства(Номенклатура);
		КонецЕсли;
	
	ИначеЕсли ИмяПоля = "ПродукцияФакт" 
		И (AMS_ВызовСервера.ЕстьПравоАМС(ПредопределенноеЗначение("Перечисление.AMS_Права.Продукция_ПроизводствоПередача"))
			Или AMS_ВызовСервера.ЕстьПравоАМС(ПредопределенноеЗначение("Перечисление.AMS_Права.Продукция_ПередачаНаСклад")))
		И (Объект.Статус = ПредопределенноеЗначение("Перечисление._СтатусыПроизводства.ВРаботе")
			Или AMS_ВызовСервера.ЭтоKhors())Тогда
		
		Парам = Новый Структура();
		Парам.Вставить("МассивСтрок", ПолучитьМассивСтрокПродукцияФакт());
		Парам.Вставить("Склад", Объект.Склад);
			
		ОткрытьФорму("Документ.AMS_ПроизводствоЗаСмену.Форма.ФормаПодбораФакт", Парам, , , , ,
			Новый ОписаниеОповещения("ОткрытьФормаПодбораФактЗавершение", ЭтотОбъект, Новый Структура("Номенклатура", Номенклатура)), 
			РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	ИначеЕсли ИмяПоля = "ПродукцияПлан" Или ИмяПоля = "ПродукцияУтверждено" Тогда
		ПоказатьДвижениеТовара(Номенклатура, Объект.Склад);

	ИначеЕсли ИмяПоля = "ПродукцияНачОстаток" Или ИмяПоля = "ПродукцияСдано" Или ИмяПоля = "ПродукцияКонОстаток" Тогда
		ПоказатьДвижениеТовара(Номенклатура, AMS_ВызовСервера.СкладПродукции());
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияУтвержденоПриИзменении(Элемент)
	Номенклатура = Элементы.Продукция.ТекущиеДанные.Номенклатура;
	Утверждено   = Элементы.Продукция.ТекущиеДанные.Утверждено;
	
	Строки = Объект.Продукция.НайтиСтроки(Новый Структура("Номенклатура",Номенклатура));
	Строки[0].Утверждено = Утверждено;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыФабрикаты

&НаКлиенте
Процедура ФабрикатыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;

	Номенклатура  = Элемент.ТекущиеДанные.Номенклатура;

	ПоказатьДвижениеТовара(Номенклатура, Объект.Склад);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРасходСырья

&НаКлиенте
Процедура РасходСырьяПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("РасходСырьяПриАктивизацииСтрокиОбработчикОжидания", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура РасходСырьяВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ИмяПоля = Поле.Имя;
	Номенклатура = Элемент.ТекущиеДанные.Номенклатура;

	Если ИмяПоля = "РасходСырьяНачОстатокЦ" Или ИмяПоля = "РасходСырьяПриходЦ" Или ИмяПоля = "РасходСырьяРасходЦ"
		Или ИмяПоля = "РасходСырьяКонОстатокЦ" Тогда
			
		Если Объект.Склад = AMS_ВызовСервера.Цех1() Тогда
			Склад = AMS_ВызовСервера.Цех1_МатериалыВПроизводстве();

		ИначеЕсли Объект.Склад = AMS_ВызовСервера.Цех2() Тогда
			Склад = AMS_ВызовСервера.Цех2_МатериалыВПроизводстве();

		ИначеЕсли Объект.Склад = AMS_ВызовСервера.Цех3() Тогда
			Склад = AMS_ВызовСервера.Цех3_МатериалыВПроизводстве();
		КонецЕсли;

	Иначе
		Склад = Объект.Склад;
	КонецЕсли;

	ПоказатьДвижениеТовара(Номенклатура, Склад);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРасходУпаковки

&НаКлиенте
Процедура РасходУпаковкиПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("РасходУпаковкиПриАктивизацииСтрокиОбработчикОжидания", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура РасходУпаковкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ИмяПоля = Поле.Имя;
	Номенклатура = Элемент.ТекущиеДанные.Номенклатура;

	Если ИмяПоля = "РасходУпаковкиНачОстатокЦ" Или ИмяПоля = "РасходУпаковкиПриходЦ" Или ИмяПоля
		= "РасходУпаковкиРасходЦ" Или ИмяПоля = "РасходУпаковкиКонОстатокЦ" Тогда
			
		Если Объект.Склад = AMS_ВызовСервера.Цех1() Тогда
			Склад = AMS_ВызовСервера.Цех1_МатериалыВПроизводстве();

		ИначеЕсли Объект.Склад = AMS_ВызовСервера.Цех2() Тогда
			Склад = AMS_ВызовСервера.Цех2_МатериалыВПроизводстве();

		ИначеЕсли Объект.Склад = AMS_ВызовСервера.Цех2() Тогда
			Склад = AMS_ВызовСервера.Цех3_МатериалыВПроизводстве();
		КонецЕсли;

	Иначе
		Склад = Объект.Склад;
	КонецЕсли;

	ПоказатьДвижениеТовара(Номенклатура, Склад);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДокументыПроизводства

&НаКлиенте
Процедура ДокументыПроизводстваПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("ДокументыПроизводстваПриАктивизацииСтрокиОбработчикОжидания", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПроизводстваВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;

	Стр = Элемент.ТекущиеДанные;

	Если Стр = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ПоказатьЗначение( , Стр.ДокСсылка);
КонецПроцедуры

#КонецОбласти   


#Область ОбработчикиСобытийЭлементовТаблицыФормыЗамесчики

&НаКлиенте
Процедура ЗамесчикиСотрудникПриИзменении(Элемент)
	Стр = ТекущийЭлемент.ТекущиеДанные;

	Если Объект.Смена = ПредопределенноеЗначение("Перечисление._ПроизводственныеСмены.Дневная") Тогда
		Количество = 8;
	Иначе
		Количество = 6;
	КонецЕсли;

	Стр.Работа     = ?(ЗначениеЗаполнено(Стр.Работа), Стр.Работа, ПолучитьРабота(1, Объект.Склад));
	Стр.Подработка = ?(Стр.Подработка = 0, 1, Стр.Подработка);
	Стр.Количество = ?(Стр.Количество = 0, Количество, Стр.Количество);

	ПересчитатьСтроку(ТекущийЭлемент.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ЗамесчикиРаботаПриИзменении(Элемент)
	ПересчитатьСтроку(ТекущийЭлемент.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ЗамесчикиПодработкаПриИзменении(Элемент)
	ПересчитатьСтроку(ТекущийЭлемент.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ЗамесчикиКоличествоПриИзменении(Элемент)
	ПересчитатьСтроку(ТекущийЭлемент.ТекущиеДанные);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыМеханики

&НаКлиенте
Процедура МеханикиСотрудникПриИзменении(Элемент)
	Стр = ТекущийЭлемент.ТекущиеДанные;

	Если Объект.Смена = ПредопределенноеЗначение("Перечисление._ПроизводственныеСмены.Дневная") Тогда
		Количество = 8;
	Иначе
		Количество = 6;
	КонецЕсли;

	Стр.Работа     = ?(ЗначениеЗаполнено(Стр.Работа), Стр.Работа, ПолучитьРабота(2, Объект.Склад));
	Стр.Подработка = ?(Стр.Подработка = 0, 1, Стр.Подработка);
	Стр.Количество = ?(Стр.Количество = 0, Количество, Стр.Количество);

	ПересчитатьСтроку(ТекущийЭлемент.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура МеханикиРаботаПриИзменении(Элемент)
	ПересчитатьСтроку(ТекущийЭлемент.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура МеханикиПодработкаПриИзменении(Элемент)
	ПересчитатьСтроку(ТекущийЭлемент.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура МеханикиКоличествоПриИзменении(Элемент)
	ПересчитатьСтроку(ТекущийЭлемент.ТекущиеДанные);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКладовщики

&НаКлиенте
Процедура КладовщикиСотрудникПриИзменении(Элемент)
	Стр = ТекущийЭлемент.ТекущиеДанные;

	Если Объект.Смена = ПредопределенноеЗначение("Перечисление._ПроизводственныеСмены.Дневная") Тогда
		Количество = 8;
	Иначе
		Количество = 6;
	КонецЕсли;

	Стр.Работа = ?(ЗначениеЗаполнено(Стр.Работа), Стр.Работа, ПолучитьРабота(3, Объект.Склад));
	Стр.Подработка = ?(Стр.Подработка = 0, 1, Стр.Подработка);
	Стр.Количество = ?(Стр.Количество = 0, Количество, Стр.Количество);

	ПересчитатьСтроку(ТекущийЭлемент.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура КладовщикиРаботаПриИзменении(Элемент)
	ПересчитатьСтроку(ТекущийЭлемент.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура КладовщикиПодработкаПриИзменении(Элемент)
	ПересчитатьСтроку(ТекущийЭлемент.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура КладовщикиКоличествоПриИзменении(Элемент)
	ПересчитатьСтроку(ТекущийЭлемент.ТекущиеДанные);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыГрузчики

&НаКлиенте
Процедура ГрузчикиСотрудникПриИзменении(Элемент)
	Стр = ТекущийЭлемент.ТекущиеДанные;

	Если Объект.Смена = ПредопределенноеЗначение("Перечисление._ПроизводственныеСмены.Дневная") Тогда
		Количество = 8;
	Иначе
		Количество = 6;
	КонецЕсли;

	Стр.Работа = ?(ЗначениеЗаполнено(Стр.Работа), Стр.Работа, ПолучитьРабота(4, Объект.Склад));
	Стр.Подработка = ?(Стр.Подработка = 0, 1, Стр.Подработка);
	Стр.Количество = ?(Стр.Количество = 0, Количество, Стр.Количество);

	ПересчитатьСтроку(Стр);
КонецПроцедуры

&НаКлиенте
Процедура ГрузчикиРаботаПриИзменении(Элемент)
	ПересчитатьСтроку(ТекущийЭлемент.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ГрузчикиПодработкаПриИзменении(Элемент)
	ПересчитатьСтроку(ТекущийЭлемент.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ГрузчикиКоличествоПриИзменении(Элемент)
	ПересчитатьСтроку(ТекущийЭлемент.ТекущиеДанные);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДопРаботы

&НаКлиенте
Процедура ДопРаботыПриИзменении(Элемент)
	ПодсчетКоличествоРаботы();
КонецПроцедуры

&НаКлиенте
Процедура ДопРаботыСотрудникПриИзменении(Элемент)
	Стр = ТекущийЭлемент.ТекущиеДанные;

	Если Объект.Смена = ПредопределенноеЗначение("Перечисление._ПроизводственныеСмены.Дневная") Тогда
		Стр.Подработка = ?(Стр.Подработка = 0, 1, Стр.Подработка);
	Иначе
		Стр.Подработка = ?(Стр.Подработка = 0, 1.5, Стр.Подработка);
	КонецЕсли;

	Стр.Количество = ?(Стр.Количество = 0, 1, Стр.Количество);

	ПересчитатьСтроку(ТекущийЭлемент.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ДопРаботыРаботаПриИзменении(Элемент)
	ПересчитатьСтроку(ТекущийЭлемент.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ДопРаботыПодработкаПриИзменении(Элемент)
	ПересчитатьСтроку(ТекущийЭлемент.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ДопРаботыКоличествоПриИзменении(Элемент)
	ПересчитатьСтроку(ТекущийЭлемент.ТекущиеДанные);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьПродукцию(Команда)
	Если Не ЗначениеЗаполнено(Объект.Склад) Тогда
		ТекстСообщения = НСтр("ru = 'Перед добавлением номенклатуры необходимо выбрать склад.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, ,"Склад", "Объект.Склад");
		Возврат;
	КонецЕсли;
	
	Парам = Новый Структура;
	Парам.Вставить("Организация", Объект.Организация);
	Парам.Вставить("Склад", Объект.Склад);
	Парам.Вставить("Товар", Товар);

	ОткрытьФорму("Документ.AMS_ПроизводствоЗаСмену.Форма.ФормаВыбораТовара", Парам, , , , ,
		Новый ОписаниеОповещения("ОткрытьФормуВыбораТовараЗавершение", ЭтотОбъект, ),
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьПродукцию(Команда)
	Стр = Элементы.Продукция.ТекущиеДанные;
	Если Стр = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Стр.Утверждено > 0 Тогда
		ТекстОшибки = "Документ утверждён, удаление запрещено.";
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(Стр.Номенклатура) Тогда
		ТекстВопроса = ПолучитьТекстВопросаУдалитьПродукцию(Стр.Номенклатура);
		ПоказатьВопрос(Новый ОписаниеОповещения("ОбратоткаКомандыУдалитьПродукциюЗавершение", ЭтотОбъект,
			Новый Структура("Продукция, Фабрикат", Стр.Номенклатура, Стр.Фабрикат)), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПеремещениеТоваров(Команда)
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Дата", ОбщегоНазначенияКлиент.ДатаСеанса());
	ДанныеЗаполнения.Вставить("СкладОтправитель", Объект.Склад);
	
	Если Не Объект.Склад = AMS_ВызовСервера.Цех4() Тогда
		ДанныеЗаполнения.Вставить("СкладПолучатель", AMS_ВызовСервера.СкладПродукции());
	КонецЕсли;
	
	ДанныеЗаполнения.Вставить("Организация", Объект.Организация);
	ДанныеЗаполнения.Вставить("_Основание", Объект.Ссылка);
	ДанныеЗаполнения.Вставить("_ОперацияПроизводства", ПредопределенноеЗначение("Перечисление.AMS_ОперацииПроизводства.ПеремещениеПроизведеннойПродукции"));

	ДополнительныеПараметры = Новый Структура("ЗначенияЗаполнения", ДанныеЗаполнения);

	Если Модифицированность Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ДобавитьПеремещениеТоваровВопросЗавершение", ЭтотОбъект,
			ДополнительныеПараметры), НСтр("ru = 'Документ был изменён. Записать изменения и продолжить?'"),
			РежимДиалогаВопрос.ДаНет);

	Иначе
		ОткрытьФорму("Документ.ПеремещениеТоваров.ФормаОбъекта", ДополнительныеПараметры);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗамесчики(Команда)
	Если Объект.Замесчики.Количество() = 0 Тогда
		ЗаполнитьЗамесчикиНаСервере();
		Модифицированность = Истина;
	Иначе
		ТекстВопроса = "Данные в таблице будут очищены. Продолжить?";
		ПоказатьВопрос(Новый ОписаниеОповещения("ОбратоткаКомандыЗаполнитьЗамесчикиЗавершение", ЭтотОбъект),
			ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМеханики(Команда)
	Если Объект.Механики.Количество() = 0 Тогда
		ЗаполнитьТабМеханикиНаСервере();
		Модифицированность = Истина;
	Иначе
		ТекстВопроса = "Данные в таблице будут очищены. Продолжить?";
		ПоказатьВопрос(Новый ОписаниеОповещения("ОбратоткаКомандыЗаполнитьМеханикиЗавершение", ЭтотОбъект),
			ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКладовщики(Команда)
	Если Объект.Кладовщики.Количество() = 0 Тогда
		ЗаполнитьКладовщикиНаСервере();
		Модифицированность = Истина;
	Иначе
		ТекстВопроса = "Данные в таблице будут очищены. Продолжить?";
		ПоказатьВопрос(Новый ОписаниеОповещения("ОбратоткаКомандыЗаполнитьКладовщикиЗавершение", ЭтотОбъект),
			ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьГрузчики(Команда)
	Если Объект.Грузчики.Количество() = 0 Тогда
		ЗаполнитьГрузчикиНаСервере();
		Модифицированность = Истина;
	Иначе
		ТекстВопроса = "Данные в таблице будут очищены. Продолжить?";
		ПоказатьВопрос(Новый ОписаниеОповещения("ОбратоткаКомандыЗаполнитьГрузчикиЗавершение", ЭтотОбъект),
			ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
КонецПроцедуры

#Область КомандыПечати

&НаКлиенте
Процедура ПечатьЗаданиеНаОтгрузку(Команда)
	Если Модифицированность Тогда
		ПоказатьПредупреждение(Неопределено, "Необходимо предварительно записать документ.");
		Возврат;
	КонецЕсли;

	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(Объект.Ссылка);

	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.AMS_ПроизводствоЗаСмену", "ЗаданиеНаОтгрузку", МассивОбъектов,
		Неопределено);
КонецПроцедуры

#КонецОбласти

#Область КомандыОтчеты

&НаКлиенте
Процедура ОтчетРасходМатериалов(Команда)
	Если Модифицированность Тогда
		ПоказатьПредупреждение(Неопределено, "Необходимо предварительно записать документ.");
		Возврат;
	КонецЕсли;

	Отбор = Новый Структура;
	Отбор.Вставить("Ссылка", Объект.Ссылка);

	Парам = Новый Структура;
	Парам.Вставить("Отбор", Отбор);
	Парам.Вставить("Ссылка", Объект.Ссылка);
	Парам.Вставить("ВидыНоменклатуры", AMS_ВызовСервера.ВидыНоменклатурыФабрикаты());

	Парам.Вставить("КлючНазначенияИспользования", "РасходМатериалов");
	Парам.Вставить("СформироватьПриОткрытии", Истина);

	ОткрытьФорму("Отчет._ПроизводствоРасходМатериалов.Форма", Парам, ЭтотОбъект, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ОтчетНачисленоЗаСмену(Команда)
	Если Модифицированность Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ОтчетНачисленоЗаСменуЗавершение", ЭтотОбъект), НСтр(
			"ru = 'Документ изменён. Записать документ и продолжить?'"), РежимДиалогаВопрос.ДаНет);

	Иначе
		ПоказатьНачисленоЗаСмену();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтчетНачисленоСотруднику(Команда)
	Если Модифицированность Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ОтчетНачисленоСотрудникуЗавершение", ЭтотОбъект), НСтр(
			"ru = 'Документ изменён. Записать документ и продолжить?'"), РежимДиалогаВопрос.ДаНет);

	Иначе
		ПоказатьНачисленоСотруднику();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтчетНачисленоЗаПериод(Команда)
	Если Модифицированность Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ОтчетНачисленоЗаПериодЗавершение", ЭтотОбъект), НСтр(
			"ru = 'Документ изменён. Записать документ и продолжить?'"), РежимДиалогаВопрос.ДаНет);

	Иначе
		ПоказатьНачисленоЗаПериод();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтчетОДвиженииТовара(Команда)
	ОткрытьФорму("Отчет.AMS_ДвижениеТоваров.Форма", , ЭтотОбъект, "Движение" + ОбщегоНазначенияКлиент.ДатаСеанса(), , , ,
		РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура ДвижениеДокумента(Команда)
	СсылкаНаОбъект = Объект.Ссылка;

	Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ВидимостьКомандВариантовОтчетов", Ложь);
		ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
		ПараметрыФормы.Вставить("ПараметрКоманды", СсылкаНаОбъект);

		ОткрытьФорму("Отчет.ДвиженияДокумента.Форма", ПараметрыФормы, ЭтотОбъект, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеДокументы(Команда)
	МенюОтчетыУТКлиент.СтруктураПодчиненности(Объект.Ссылка, Неопределено);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьНаличиеДокументовНаДату(Дата, Склад, Ссылка)
	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.AMS_ПроизводствоЗаСмену КАК т
	|ГДЕ
	|	т.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	|	И НЕ т.Ссылка = &Ссылка
	|	И т.Склад = &Склад
	|	И т.Цех = ЗНАЧЕНИЕ(Перечисление._МестаПроизводства.Основной)
	|	И т.Смена = ЗНАЧЕНИЕ(Перечисление._ПроизводственныеСмены.Дневная)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.AMS_ПроизводствоЗаСмену КАК т
	|ГДЕ
	|	т.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	|	И НЕ т.Ссылка = &Ссылка
	|	И т.Склад = &Склад
	|	И т.Цех = ЗНАЧЕНИЕ(Перечисление._МестаПроизводства.Основной)
	|	И т.Смена = ЗНАЧЕНИЕ(Перечисление._ПроизводственныеСмены.Вечерняя)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.AMS_ПроизводствоЗаСмену КАК т
	|ГДЕ
	|	т.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	|	И НЕ т.Ссылка = &Ссылка
	|	И т.Склад = &Склад
	|	И т.Цех = ЗНАЧЕНИЕ(Перечисление._МестаПроизводства.Дополнительный)
	|	И т.Смена = ЗНАЧЕНИЕ(Перечисление._ПроизводственныеСмены.Дневная)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.AMS_ПроизводствоЗаСмену КАК т
	|ГДЕ
	|	т.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	|	И НЕ т.Ссылка = &Ссылка
	|	И т.Склад = &Склад
	|	И т.Цех = ЗНАЧЕНИЕ(Перечисление._МестаПроизводства.Дополнительный)
	|	И т.Смена = ЗНАЧЕНИЕ(Перечисление._ПроизводственныеСмены.Вечерняя)";
	Рез = Запрос.ВыполнитьПакет();

	Стр = Новый Структура;
	Стр.Вставить("ОсновнойДневная", Не Рез[0].Пустой());
	Стр.Вставить("ОсновнойВечерняя", Не Рез[1].Пустой());
	Стр.Вставить("ДополнительныйДневная", Не Рез[2].Пустой());
	Стр.Вставить("ДополнительныйВечерняя", Не Рез[3].Пустой());

	Возврат Стр;
КонецФункции

&НаСервере
Процедура ПолучитьДокументыПроизводстваПродукции()
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Табл = AMS_Сервер.ПолучитьДокументыПроизводстваПродукции(Объект.Ссылка);
		ДокументыПроизводства.Загрузить(Табл);
	КонецЕсли;
КонецПроцедуры

#Область Производство

&НаКлиенте
Процедура ОткрытьФормуПланированияПроизводства(Номенклатура)
	ПараметрыФормы = ПолучитьПараметрыНоменклатуры(Номенклатура);

	Если ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Номенклатура, "_ИспользуетФабрикат") Тогда
		ОткрытьФорму("Документ.AMS_ПроизводствоЗаСмену.Форма.ФормаПродукцияСФабрикатом", ПараметрыФормы, , , , ,
			Новый ОписаниеОповещения("ОткрытьФормуСФабрикатомЗавершение", ЭтотОбъект, Новый Структура("Номенклатура",
			Номенклатура)), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

	Иначе
		ОткрытьФорму("Документ.AMS_ПроизводствоЗаСмену.Форма.ФормаПродукцияБезФабриката", ПараметрыФормы, , , , ,
			Новый ОписаниеОповещения("ОткрытьФормуБезФабрикатаЗавершение", ЭтотОбъект, Новый Структура("Номенклатура",
			Номенклатура)), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПоказатьТовары()
	Если Не ЗначениеЗаполнено(Объект.Склад) Тогда
		Возврат;
	КонецЕсли;
	
	Табл = ПолучитьТаблицуФабрикаты();

	Фабрикаты.Загрузить(Табл);

	Табл = ПолучитьТаблицуПродукция();

	Продукция.Загрузить(Табл);

	ПоказатьРасходМатериалов();

	ПоказатьОтчетПередачаПродукции();

	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ПроизводствоЗаСмену", Объект.Ссылка);

		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ т.Ссылка) КАК Количество
		|ИЗ
		|	Документ.ПрочееОприходованиеТоваров КАК т
		|ГДЕ
		|	т._Основание = &ПроизводствоЗаСмену
		|	И т._ОперацияПроизводства = ЗНАЧЕНИЕ(Перечисление.AMS_ОперацииПроизводства.ПроизводствоПродукции)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ т.Ссылка) КАК Количество
		|ИЗ
		|	Документ.ПеремещениеТоваров КАК т
		|ГДЕ
		|	т._Основание = &ПроизводствоЗаСмену
		|	И т._ОперацияПроизводства = ЗНАЧЕНИЕ(Перечисление.AMS_ОперацииПроизводства.ПеремещениеПроизведеннойПродукции)";

		Рез = Запрос.ВыполнитьПакет();

		КоличествоПроизводство = Рез[0].Выгрузить().ВыгрузитьКолонку("Количество")[0];
		КоличествоПеремещения = Рез[1].Выгрузить().ВыгрузитьКолонку("Количество")[0];
	КонецЕсли;

	УправлениеЭлементамиФормы();
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуФабрикаты()
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Фабрикаты", Объект.Фабрикаты.Выгрузить());
	Запрос.УстановитьПараметр("Склад", Объект.Склад);
	Если Объект.Смена = Перечисления._ПроизводственныеСмены.Дневная Тогда
		Запрос.УстановитьПараметр("ДатаОстатков", НачалоДня(Объект.Дата) + AMS_ВызовСервера.ПолучитьВремя(8, 55));
	Иначе
		Запрос.УстановитьПараметр("ДатаОстатков", НачалоДня(Объект.Дата) + AMS_ВызовСервера.ПолучитьВремя(11, 55));
	КонецЕсли;

	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	т.НомерСтроки КАК НомерСтроки,
	|	т.Номенклатура КАК Номенклатура,
	|	т.Спецификация КАК Спецификация,
	|	т.КоличествоПлан КАК КоличествоПлан,
	|	т.КоличествоФакт КАК КоличествоФакт,
	|	т.Цена КАК Цена
	|ПОМЕСТИТЬ ф
	|ИЗ
	|	&Фабрикаты КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ф.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(Ост.ВНаличииОстаток, 0) КАК ВНаличииОстаток
	|ПОМЕСТИТЬ Остаток
	|ИЗ
	|	ф КАК ф
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(&ДатаОстатков, Склад = &Склад) КАК Ост
	|		ПО ф.Номенклатура = Ост.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ф.НомерСтроки КАК НомерСтроки,
	|	ф.Номенклатура КАК Номенклатура,
	|	ф.Спецификация КАК Спецификация,
	|	ЕСТЬNULL(Остаток.ВНаличииОстаток, 0) КАК НачОстаток,
	|	ф.КоличествоПлан КАК Приход,
	|	ф.КоличествоФакт КАК Расход,
	|	ЕСТЬNULL(Остаток.ВНаличииОстаток, 0) + ф.КоличествоПлан - ф.КоличествоФакт КАК КонОстаток,
	|	ф.Цена КАК Цена,
	|	ф.КоличествоПлан * ф.Цена КАК Сумма
	|ИЗ
	|	ф КАК ф
	|		ЛЕВОЕ СОЕДИНЕНИЕ Остаток КАК Остаток
	|		ПО ф.Номенклатура = Остаток.Номенклатура";

	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

&НаСервере
Функция ПолучитьТаблицуПродукция()
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Продукция", Объект.Продукция.Выгрузить());
	Запрос.УстановитьПараметр("СкладПродукции", AMS_ВызовСервера.СкладПродукции());
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("СсылкаЗаполнена", ЗначениеЗаполнено(Объект.Ссылка));
	Если Объект.Смена = Перечисления._ПроизводственныеСмены.Дневная Тогда
		Запрос.УстановитьПараметр("Дата", НачалоДня(Объект.Дата) + AMS_ВызовСервера.ПолучитьВремя(8, 55));
	Иначе
		Запрос.УстановитьПараметр("Дата", НачалоДня(Объект.Дата) + AMS_ВызовСервера.ПолучитьВремя(11, 55));
	КонецЕсли;

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.НомерСтроки КАК НомерСтроки,
	|	т.Фабрикат КАК Фабрикат,
	|	т.Номенклатура КАК Номенклатура,
	|	т.Спецификация КАК Спецификация,
	|	т.Утверждено КАК Утверждено,
	|	т.КоличествоПлан КАК КоличествоПлан,
	|	т.КоличествоФакт КАК КоличествоФакт,
	|	т.Цена КАК Цена
	|ПОМЕСТИТЬ п
	|ИЗ
	|	&Продукция КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	СУММА(т.Количество) КАК Количество
	|ПОМЕСТИТЬ Сдано
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК д
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров.Товары КАК т
	|		ПО д.Ссылка = т.Ссылка
	|ГДЕ
	|	д.Проведен
	|	И д.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПеремещенийТоваров.Принято)
	|	И д._Основание = &Ссылка
	|	И д._ОперацияПроизводства = ЗНАЧЕНИЕ(Перечисление.AMS_ОперацииПроизводства.ПеремещениеПроизведеннойПродукции)
	|	И &СсылкаЗаполнена
	|
	|СГРУППИРОВАТЬ ПО
	|	т.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	п.НомерСтроки КАК НомерСтроки,
	|	п.Фабрикат КАК Фабрикат,
	|	п.Номенклатура КАК Номенклатура,
	|	п.Спецификация КАК Спецификация,
	|	Ном._Упаковка КАК Ед,
	|	п.Утверждено КАК Утверждено,
	|	п.КоличествоПлан КАК План,
	|	п.КоличествоФакт КАК Факт,
	|	ЕСТЬNULL(Ост.ВНаличииОстаток, 0) / Ном.КоэффициентЕдиницыДляОтчетов КАК НачОстаток,
	|	ЕСТЬNULL(Сдано.Количество, 0) / Ном.КоэффициентЕдиницыДляОтчетов КАК Сдано,
	|	(ЕСТЬNULL(Ост.ВНаличииОстаток, 0) + ЕСТЬNULL(Сдано.Количество, 0)) / Ном.КоэффициентЕдиницыДляОтчетов КАК КонОстаток,
	|	п.Цена КАК Цена,
	|	ЕСТЬNULL(п.КоличествоПлан, 0) * п.Цена КАК Сумма,
	|	Ном.Наименование КАК Наименование
	|ИЗ
	|	п КАК п
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(&Дата, Склад = &СкладПродукции) КАК Ост
	|		ПО п.Номенклатура = Ост.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|		ПО п.Номенклатура = Ном.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Сдано КАК Сдано
	|		ПО п.Номенклатура = Сдано.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";

	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

&НаСервере
Функция ПолучитьМассивСтрокПродукцияФакт()
	МассивСтрок = Новый Массив();
	Для Каждого Стр Из Объект.Продукция Цикл
		СтрСтроки = Новый Структура();
		СтрСтроки.Вставить("НомерСтроки", Стр.НомерСтроки);
		СтрСтроки.Вставить("Номенклатура", Стр.Номенклатура);
		СтрСтроки.Вставить("Утверждено", Стр.Утверждено);
		СтрСтроки.Вставить("КоличествоПлан", Стр.КоличествоПлан);
		СтрСтроки.Вставить("КоличествоФакт", Стр.КоличествоФакт);
		
		МассивСтрок.Добавить(СтрСтроки);
	КонецЦикла;

	Возврат МассивСтрок;
КонецФункции

&НаСервере
Процедура ПоказатьРасходМатериалов()
	Рез = РеквизитФормыВЗначение("Объект").ПолучитьДанныхПоРасходуМатериалов(ПоказатьТолькоОтрицательныеОстаткиПоСырью,
		ПоказатьТолькоОтрицательныеОстаткиПоУпаковке);

	Если Не Рез = Неопределено Тогда
		РасходСырья.Загрузить(Рез.Сырье);
		
		КоличествоСырья = РасходСырья.Количество();

		РасходУпаковки.Загрузить(Рез.Упаковка);
		
		КоличествоУпаковки = РасходУпаковки.Количество();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПоказатьОтчетПередачаПродукции()
	ПередачаПродукции.Очистить();

	Парам = Новый Структура;
	Парам.Вставить("Ссылка", Объект.Ссылка);

	СКД = Документы.AMS_ПроизводствоЗаСмену.ПолучитьМакет("скдПередачаПродукции");

	Настройки = СКД.НастройкиПоУмолчанию;
	
	УстановитьПривилегированныйРежим(Истина);
	
	мср.ПолучитьДанныеНаОснованииСКД(СКД, ПередачаПродукции, Настройки, Парам);
КонецПроцедуры

&НаСервере
Процедура ПоказатьОтчетРасшифровкаРасходСырья(Номенклатура)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МатериалыФабриката", Объект.МатериалыФабриката.Выгрузить( ,
		"Фабрикат,Номенклатура,КоличествоПлан"));
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Фабрикат КАК Фабрикат,
	|	т.Номенклатура КАК Номенклатура,
	|	т.КоличествоПлан КАК Количество
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	&МатериалыФабриката КАК т
	|ГДЕ
	|	т.Номенклатура = &Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.Фабрикат КАК Фабрикат,
	|	вт.Номенклатура КАК Номенклатура,
	|	вт.Количество КАК Количество
	|ИЗ
	|	вт КАК вт";

	РаспределениеСырья.Загрузить(Запрос.Выполнить().Выгрузить());

	ИнфоМатериал           = Номенклатура;
	ИнфоМатериалКоличество = РаспределениеСырья.Итог("Количество");
КонецПроцедуры

&НаСервере
Процедура ПоказатьОтчетРасшифровкаРасходУпаковки(Номенклатура)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МатериалыПродукции", Объект.МатериалыПродукции.Выгрузить( ,
		"Продукция,Номенклатура,КоличествоПлан"));
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Продукция КАК Продукция,
	|	т.КоличествоПлан КАК Количество
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	&МатериалыПродукции КАК т
	|ГДЕ
	|	т.Номенклатура = &Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.Продукция КАК Продукция,
	|	вт.Количество КАК Количество
	|ИЗ
	|	вт КАК вт";

	РаспределениеУпаковки.Загрузить(Запрос.Выполнить().Выгрузить());

	ИнфоУпаковка           = Номенклатура;
	ИнфоУпаковкаКоличество = РаспределениеУпаковки.Итог("Количество");
КонецПроцедуры  

&НаСервере
Процедура ПоказатьТоварыДокументыПроизводства(Ссылка, Операция)
	ИмяСсылка = Ссылка.Метаданные().Имя;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка); 
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.НомерСтроки КАК НомерСтроки,
	|	т.Номенклатура КАК Номенклатура,
	|	т.Номенклатура.ЕдиницаИзмерения КАК Ед,
	|	т.Количество КАК Количество,
	|	т.Количество / т.Номенклатура.КоэффициентЕдиницыДляОтчетов КАК КоличествоУпаковок,
	|	ВЫБОР
	|		КОГДА т.Номенклатура._Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА т.Номенклатура.ЕдиницаДляОтчетов
	|		ИНАЧЕ т.Номенклатура._Упаковка
	|	КОНЕЦ КАК Упаковка
	|ИЗ
	|	Документ." + ИмяСсылка + ".Товары КАК т
	|ГДЕ
	|	т.Ссылка = &Ссылка"; 
	
	ДокументыПроизводстваТовары.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры  

&НаСервере
Процедура УправлениеЭлементамиФормы()
	Проект         = Объект.Статус = ПредопределенноеЗначение("Перечисление._СтатусыПроизводства.Проект");
	План           = Объект.Статус = ПредопределенноеЗначение("Перечисление._СтатусыПроизводства.План");
	ВРаботе        = Объект.Статус = ПредопределенноеЗначение("Перечисление._СтатусыПроизводства.ВРаботе");
	РасчётЗарплаты = Объект.Статус = ПредопределенноеЗначение("Перечисление._СтатусыПроизводства.РасчётЗарплаты");
	Выполнено      = Объект.Статус = ПредопределенноеЗначение("Перечисление._СтатусыПроизводства.Выполнено");
	
	Если AMS_ВызовСервера.ЭтоKhors() Тогда
		Возврат;
	КонецЕсли;

	УтверждатьПланПроизводства = AMS_ВызовСервера.ЕстьПравоАМС(Перечисления.AMS_Права.УтверждатьПланПроизводства);
	
	Элементы.Утвержден.Доступность = План И УтверждатьПланПроизводства;
	Элементы.ПродукцияУтверждено.Доступность = План И УтверждатьПланПроизводства;

	Элементы.СтраницаТЧ.Видимость = Ложь;
	Элементы.Дата.Доступность     = Ложь;

	Элементы.ПродукцияФакт.ТолькоПросмотр = Не ВРаботе;
	
	Элементы.ГруппаКомандПродукция.Видимость      = Ложь;
	Элементы.ДобавитьПеремещениеТоваров.Видимость = Ложь;

	Если УтверждатьПланПроизводства Тогда
		
	ИначеЕсли Пользователи.РолиДоступны("_Директор,_СтаршийМенеджер") Тогда
		Если План И Пользователи.РолиДоступны("_СтаршийМенеджер") Тогда
			ТолькоПросмотр = Не План;
		КонецЕсли;

		Элементы.Смена.Доступность     = Ложь;
		Элементы.Статус.Доступность    = Ложь;
		Элементы.Склад.Доступность     = Ложь;

		Элементы.Продукция.ТолькоПросмотр = Истина;
		Элементы.Фабрикаты.ТолькоПросмотр = Истина;
		Элементы.РасходСырья.ТолькоПросмотр = Истина;
		Элементы.РасходУпаковки.ТолькоПросмотр = Истина;

	ИначеЕсли Пользователи.РолиДоступны("_НачальникЦеха") И Не Пользователи.РолиДоступны("_Бухгалтер") Тогда
		ТолькоПросмотр = Не ЭтоМойДок;
		Элементы.ДобавитьПродукцию.Доступность = ЭтоМойДок;
		Элементы.УдалитьПродукцию.Доступность = ЭтоМойДок;
		Элементы.ПродукцияФакт.Доступность = ЭтоМойДок;
		Элементы.ДобавитьПеремещениеТоваров.Доступность = ЭтоМойДок;
	
		Элементы.ГруппаКомандПродукция.Видимость = (Проект Или План);
		Элементы.ДобавитьПеремещениеТоваров.Видимость = Не Выполнено;
		Элементы.ПродукцияГруппаСтоимость.Видимость   = Ложь;
		Элементы.ФабрикатыГруппаСтоимость.Видимость   = Ложь;
		
		Элементы.Дата.Доступность = Проект;

		Если Не (Проект Или (План И Не Объект.Утвержден)) Тогда
			Элементы.Смена.Доступность = Ложь;
		КонецЕсли;

	ИначеЕсли Пользователи.РолиДоступны("_МенеджерЗакупок") Тогда
		Элементы.Статус.ТолькоПросмотр = (Выполнено Или РасчётЗарплаты);

		Элементы.СтраницаПланирование.ТолькоПросмотр = Истина;
		Элементы.ГруппаКомандПродукция.Видимость     = Ложь;

		Элементы.ПродукцияГруппаСтоимость.Видимость = Ложь;
		Элементы.ФабрикатыГруппаСтоимость.Видимость = Ложь;

		Элементы.СтраницаРабота.Видимость            = Ложь;
		Элементы.СтраницаДополнительно.Видимость     = Ложь;

		Элементы.ДобавитьПеремещениеТоваров.Видимость = ВРаботе;

	Иначе
		ТолькоПросмотр = Истина;
	КонецЕсли;

	Если План Тогда
		Рез = РеквизитФормыВЗначение("Объект").ПолучитьДанныхПоРасходуМатериалов(Истина, Истина);
		
		Если Не Рез = Неопределено Тогда
			Если Рез.Сырье.Количество() > 0 Тогда
				Элементы.СтрРасходСырья.ЦветФона = ЦветаСтиля.ЦветОтрицательногоЧисла;
			Иначе
				Элементы.СтрРасходСырья.ЦветФона = ЦветаСтиля.ЦветФонаФормы;
			КонецЕсли;

			Если Рез.Упаковка.Количество() > 0 Тогда
				Элементы.СтрРасходУпаковки.ЦветФона = ЦветаСтиля.ЦветОтрицательногоЧисла;
			Иначе
				Элементы.СтрРасходУпаковки.ЦветФона = ЦветаСтиля.ЦветФонаФормы;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПроверкаНаличияДокументовПередачиПродукции(Ссылка, Отказ)
	ДокументыПеремещенияПродукцииНаСклад = Документы.AMS_ПроизводствоЗаСмену.ПолучитьДокументыПеремещенияПродукцииНаСклад(
		Ссылка);
	Если Не ДокументыПеремещенияПродукцииНаСклад = Неопределено Тогда
		ОбщегоНазначения.СообщитьПользователю(
			"Статус не изменён. Есть оформленные документы перемещения продукции на склад продукции!", , , , Отказ);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПроверкаРанееДокументВСтатусеПроект(Отказ)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Склад", Объект.Склад);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("Дата", Объект.Дата);

	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	т.Дата КАК Дата,
	|	т.Смена КАК Смена,
	|	т.Ссылка КАК Документ
	|ИЗ
	|	Документ.AMS_ПроизводствоЗаСмену КАК т
	|ГДЕ
	|	т.Склад = &Склад
	|	И НЕ т.Ссылка = &Ссылка
	|	И т.Статус = ЗНАЧЕНИЕ(Перечисление._СтатусыПроизводства.Проект)
	|	И т.Дата < &Дата
	|	И НЕ т.ПометкаУдаления
	|	И т.Организация = &Организация";
	Рез = Запрос.Выполнить();

	Если Не Рез.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю("Статус не изменён. Есть ранее документы в статусе ""Проект"".", , , ,
			Отказ);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПроверкаРанееНеЗакрытыхДокументов(Отказ)
	Если Объект.Склад = AMS_ВызовСервера.Цех4() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Запрос.УстановитьПараметр("Склад", Объект.Склад);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Дата КАК Дата,
	|	т.Статус КАК Статус,
	|	т.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.AMS_ПроизводствоЗаСмену КАК т
	|ГДЕ
	|	т.Склад = &Склад
	|	И НЕ т.Статус В (ЗНАЧЕНИЕ(Перечисление._СтатусыПроизводства.Выполнено), ЗНАЧЕНИЕ(Перечисление._СтатусыПроизводства.РасчётЗарплаты))
	|	И т.Дата < НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
	|	И НЕ т.ПометкаУдаления";
	Рез = Запрос.Выполнить();

	Если Не Рез.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю(
			"Статус не изменён. Необходимо более ранним документам установить статус ""Выполнено"".", , , , Отказ);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПроверкаРанееДокументВСтатусеПроектПлан(Отказ)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Склад", Объект.Склад);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("Дата", Объект.Дата);

	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	т.Дата КАК Дата,
	|	т.Смена КАК Смена,
	|	т.Ссылка КАК Документ
	|ИЗ
	|	Документ.AMS_ПроизводствоЗаСмену КАК т
	|ГДЕ
	|	т.Склад = &Склад
	|	И НЕ т.Ссылка = &Ссылка
	|	И т.Статус В (ЗНАЧЕНИЕ(Перечисление._СтатусыПроизводства.Проект), ЗНАЧЕНИЕ(Перечисление._СтатусыПроизводства.План))
	|	И т.Дата < &Дата
	|	И НЕ т.ПометкаУдаления
	|	И т.Организация = &Организация";
	Рез = Запрос.Выполнить();

	Если Не Рез.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю(
			"Статус не изменён. Есть ранее документы в статусе ""Проект"" или ""План"".", , , , Отказ);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УдалитьПродукциюНаСервере(Продукция, Фабрикат)
	Если ЗначениеЗаполнено(Фабрикат) Тогда
		Строки = Объект.Продукция.НайтиСтроки(Новый Структура("Фабрикат", Фабрикат));
	
		Для Каждого ТекСтр Из Строки Цикл
			Объект.Продукция.Удалить(ТекСтр);
		КонецЦикла;
	
		Строки = Объект.Фабрикаты.НайтиСтроки(Новый Структура("Номенклатура", Фабрикат));
		
		Для Каждого ТекСтр Из Строки Цикл
			Объект.Фабрикаты.Удалить(ТекСтр);
		КонецЦикла;
	
	Иначе
		Строки = Объект.Продукция.НайтиСтроки(Новый Структура("Номенклатура", Продукция));
	
		Для Каждого ТекСтр Из Строки Цикл
			Объект.Продукция.Удалить(ТекСтр);
		КонецЦикла;
	КонецЕсли;	

	ЗаполнитьРасходМатериалов();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДвижениеТовара(Номенклатура, Склад)
	ИмяОтчета   = "AMS_ДвижениеТоваров";
	ИмяВарианта = "ДвижениеТоваров";

	Период = Новый СтандартныйПериод;
	Период.Вариант = ВариантСтандартногоПериода.Месяц;

	ПользовательскиеНастройки = Новый Структура;
	ПользовательскиеНастройки.Вставить("Период", Период);

	Отбор = Новый Структура;
	Отбор.Вставить("Склад", Склад);
	Отбор.Вставить("Номенклатура", Номенклатура);

	Парам = Новый Структура;
	Парам.Вставить("ВидимостьКомандВариантовОтчетов", Ложь);
	Парам.Вставить("СформироватьПриОткрытии", Истина);
	Парам.Вставить("Отбор", Отбор);
	Парам.Вставить("КлючНазначенияИспользования", "План производства");
	Парам.Вставить("ПользовательскиеНастройки", ПолучитьИзВременногоХранилища(
		AMS_ВызовСервера.ПолучитьАдресПользовательскиеНастройки(ИмяОтчета, ПользовательскиеНастройки, ИмяВарианта)));

	ОткрытьФорму("Отчет." + ИмяОтчета + ".Форма", Парам, ЭтотОбъект, Номенклатура);
КонецПроцедуры

&НаСервере
Функция ПолучитьТекстВопросаУдалитьПродукцию(ТекПродукция)
	СтрПрод = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекПродукция, "Наименование,_ИспользуетФабрикат,_Фабрикат");

	Текст = "Удалить продукцию:" + Символы.ПС + СтрПрод.Наименование;

	Если СтрПрод._ИспользуетФабрикат Тогда
		ТекФабрикат = СтрПрод._Фабрикат;

		Для Каждого Стр Из Продукция Цикл
			Если Стр.Номенклатура = ТекПродукция Тогда
				Продолжить;
			КонецЕсли;

			СтрНом = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Стр.Номенклатура, "Наименование,_Фабрикат");

			Если СтрНом._Фабрикат = ТекФабрикат Тогда
				Текст = Текст + Символы.ПС + СтрНом.Наименование;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Возврат Текст + "?";
КонецФункции

&НаСервере
Функция ПолучитьПараметрыНоменклатуры(Продукция)
	СпецификацияПродукции = Неопределено;
	Фабрикат              = Неопределено;
	СпецификацияФабриката = Неопределено;

	МассивФабрикаты = Новый Массив;
	МассивПродукция = Новый Массив;

	Табл = Объект.Продукция.Выгрузить();
	Для Каждого Стр Из Табл Цикл
		МассивПродукция.Добавить(ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Стр));

		Если Стр.Номенклатура = Продукция Тогда
			СпецификацияПродукции = Стр.Спецификация;
			Фабрикат              = Стр.Фабрикат;
		КонецЕсли;
	КонецЦикла;
	
	Табл = Объект.Фабрикаты.Выгрузить();
	Для Каждого Стр Из Табл Цикл
		МассивФабрикаты.Добавить(ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Стр));

		Если Стр.Номенклатура = Фабрикат Тогда
			СпецификацияФабриката = Стр.Спецификация;
		КонецЕсли;
	КонецЦикла;
	
	ПарамФормы = Новый Структура;
	
	ПарамФормы.Вставить("Дата", Объект.Дата);
	ПарамФормы.Вставить("Смена", Объект.Смена);
	ПарамФормы.Вставить("Статус", Объект.Статус);
	ПарамФормы.Вставить("Склад", Объект.Склад);
	ПарамФормы.Вставить("Продукция", Продукция);
	ПарамФормы.Вставить("СпецификацияПродукции", СпецификацияПродукции);
	ПарамФормы.Вставить("Фабрикат", Фабрикат);
	ПарамФормы.Вставить("СпецификацияФабриката", СпецификацияФабриката);
	ПарамФормы.Вставить("МассивПродукция", МассивПродукция);
	ПарамФормы.Вставить("МассивФабрикаты", МассивФабрикаты);

	Возврат ПарамФормы;
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаписатьСтоимостьПродукции(Дата)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	д.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	Документ.AMS_ПроизводствоЗаСмену КАК д
	|ГДЕ
	|	д.Проведен
	|	И д.Статус В (ЗНАЧЕНИЕ(Перечисление._СтатусыПроизводства.Выполнено), ЗНАЧЕНИЕ(Перечисление._СтатусыПроизводства.РасчётЗарплаты))
	|	И д.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(ВЫРАЗИТЬ(т.Цена / н.КоэффициентЕдиницыДляОтчетов КАК ЧИСЛО(10, 2))) КАК Стоимость
	|ПОМЕСТИТЬ тов
	|ИЗ
	|	вт КАК вт
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.AMS_ПроизводствоЗаСмену.Продукция КАК т
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК н
	|			ПО т.Номенклатура = н.Ссылка
	|		ПО вт.Ссылка = т.Ссылка
	|ГДЕ
	|	т.Цена > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	т.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.Стоимость КАК Стоимость
	|ПОМЕСТИТЬ рег
	|ИЗ
	|	РегистрСведений._СтоимостьПродукции.СрезПоследних(
	|			ДОБАВИТЬКДАТЕ(&Дата, ДЕНЬ, -1),
	|			Номенклатура В
	|				(ВЫБРАТЬ
	|					тов.Номенклатура КАК Номенклатура
	|				ИЗ
	|					тов КАК тов)) КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тов.Номенклатура КАК Номенклатура,
	|	тов.Стоимость КАК Стоимость,
	|	ЕСТЬNULL(рег.Стоимость, 0) КАК СтоимостьСтарая
	|ПОМЕСТИТЬ итог
	|ИЗ
	|	тов КАК тов
	|		ЛЕВОЕ СОЕДИНЕНИЕ рег КАК рег
	|		ПО тов.Номенклатура = рег.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	итог.Номенклатура КАК Номенклатура,
	|	итог.Стоимость КАК Стоимость
	|ИЗ
	|	итог КАК итог
	|ГДЕ
	|	НЕ итог.Стоимость = итог.СтоимостьСтарая";

	Рез = Запрос.Выполнить();
	Выб = Рез.Выбрать();

	НаборЗаписей = РегистрыСведений._СтоимостьПродукции.СоздатьНаборЗаписей();

	НаборЗаписей.Отбор.Период.Установить(Дата);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() > 0 Тогда
		НаборЗаписей.Очистить();
	КонецЕсли;

	Пока Выб.Следующий() Цикл
		НоваяЗапись = НаборЗаписей.Добавить();

		НоваяЗапись.Период = Дата;
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Выб);
	КонецЦикла;

	НаборЗаписей.Записать();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМассивНеотгруженныхТоваров(ТекущийДокумент)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.КоличествоФакт КАК Количество,
	|	т.Номенклатура._Упаковка КАК Упаковка
	|ПОМЕСТИТЬ Сделано
	|ИЗ
	|	Документ.AMS_ПроизводствоЗаСмену.Продукция КАК т
	|ГДЕ
	|	т.Ссылка = &ТекущийДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	СУММА(т.КоличествоУпаковок) КАК Количество
	|ПОМЕСТИТЬ Сдано
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК д
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров.Товары КАК т
	|		ПО д.Ссылка = т.Ссылка
	|ГДЕ
	|	д.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПеремещенийТоваров.Принято)
	|	И НЕ д.ПометкаУдаления
	|	И д._Основание = &ТекущийДокумент
	|
	|СГРУППИРОВАТЬ ПО
	|	т.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(Сделано.Номенклатура) КАК Номенклатура,
	|	ЕСТЬNULL(Сделано.Количество, 0) - ЕСТЬNULL(Сдано.Количество, 0) КАК Количество,
	|	Сделано.Упаковка КАК Упаковка
	|ИЗ
	|	Сделано КАК Сделано
	|		ЛЕВОЕ СОЕДИНЕНИЕ Сдано КАК Сдано
	|		ПО Сделано.Номенклатура = Сдано.Номенклатура
	|ГДЕ
	|	НЕ ЕСТЬNULL(Сделано.Количество, 0) - ЕСТЬNULL(Сдано.Количество, 0) = 0";

	Табл = Запрос.Выполнить().Выгрузить();

	Массив = Новый Массив;

	Для Каждого Стр Из Табл Цикл
		Массив.Добавить(ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Стр));
	КонецЦикла;

	Возврат Массив;
КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	УсловноеОформление.Элементы.Очистить();

	//	
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПродукцияФакт.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.Статус");
	ОтборЭлемента.ПравоеЗначение = ПредопределенноеЗначение("Перечисление._СтатусыПроизводства.ВРаботе");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветВажного);
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Ложь);

	// Не работает
	
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Продукция.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Продукция.Факт");
	ОтборЭлемента.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Продукция.Сдано");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеРавно;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветАктивности);

	//  не работает
	
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДокументыПроизводства.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДокументыПроизводства.СформированАвтоматически");
	ОтборЭлемента.ПравоеЗначение = Истина;
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветФонаШапкиОтчета);
КонецПроцедуры

#КонецОбласти

#Область Работы

&НаСервере
Процедура ЗаполнитьЗамесчикиНаСервере()
	Склад = Объект.Склад;
	Смена = Объект.Смена;
	Замесчики = Объект.Замесчики;

	Если Объект.Смена = Перечисления._ПроизводственныеСмены.Дневная Тогда
		Подработка = 1;
	Иначе
		Подработка = 1.5;
	КонецЕсли;

	Если Смена = Перечисления._ПроизводственныеСмены.Дневная Тогда
		Количество = 8;
	Иначе
		Количество = 6;
	КонецЕсли;

	Если Склад = AMS_ВызовСервера.Цех1() Тогда
		Родитель = AMS_ВызовСервера.ФизЛицаПапкаЗамесчики1();
		Работа = Справочники._Работы.Замесчик1;

	ИначеЕсли Склад = AMS_ВызовСервера.Цех2() Тогда
		Родитель = AMS_ВызовСервера.ФизЛицаПапкаЗамесчики2();
		Работа = Справочники._Работы.Замесчик2;

	ИначеЕсли Склад = AMS_ВызовСервера.Цех3() Тогда
		Родитель = AMS_ВызовСервера.ФизЛицаПапкаЗамесчики3();
		Работа = Справочники._Работы.Замесчик3;
	КонецЕсли;

	Цена  = ПолучитьСтоимостьРаботы(Работа, Объект.Дата);

	Парам = Новый Структура;
	Парам.Вставить("Родитель", Родитель);
	Парам.Вставить("Работа", Работа);
	Парам.Вставить("Подработка", Подработка);
	Парам.Вставить("Количество", Количество);
	Парам.Вставить("Цена", Цена);
	Парам.Вставить("Сумма", Цена * Количество * Подработка);

	Замесчики.Загрузить(ПолучитьДанныеШаблона(Парам));

	ПодсчетКоличествоРаботы();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабМеханикиНаСервере()
	Склад    = Объект.Склад;
	Смена    = Объект.Смена;
	Механики = Объект.Механики;

	Если Объект.Смена = Перечисления._ПроизводственныеСмены.Дневная Тогда
		Подработка = 1;
	Иначе
		Подработка = 1.5;
	КонецЕсли;

	Если Смена = Перечисления._ПроизводственныеСмены.Дневная Тогда
		Количество = 8;
	Иначе
		Количество = 6;
	КонецЕсли;

	Если Склад = AMS_ВызовСервера.Цех1() Тогда
		Родитель = AMS_ВызовСервера.ФизЛицаПапкаМеханики1();
		Работа   = Справочники._Работы.Механик1;

	ИначеЕсли Склад = AMS_ВызовСервера.Цех2() Тогда
		Родитель = AMS_ВызовСервера.ФизЛицаПапкаМеханики2();
		Работа   = Справочники._Работы.Механик2;

	ИначеЕсли Склад = AMS_ВызовСервера.Цех3() Тогда
		Родитель = AMS_ВызовСервера.ФизЛицаПапкаМеханики3();
//        Работа = Справочники._Работы.Механик3;
	КонецЕсли;

	Цена  = ПолучитьСтоимостьРаботы(Работа, Объект.Дата);

	Парам = Новый Структура;
	Парам.Вставить("Родитель", Родитель);
	Парам.Вставить("Работа", Работа);
	Парам.Вставить("Подработка", Подработка);
	Парам.Вставить("Количество", Количество);
	Парам.Вставить("Цена", Цена);
	Парам.Вставить("Сумма", Цена * Количество * Подработка);

	Механики.Загрузить(ПолучитьДанныеШаблона(Парам));

	ПодсчетКоличествоРаботы();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКладовщикиНаСервере()
	Склад = Объект.Склад;
	Смена = Объект.Смена;
	Кладовщики = Объект.Кладовщики;

	Если Объект.Смена = Перечисления._ПроизводственныеСмены.Дневная Тогда
		Подработка = 1;
	Иначе
		Подработка = 1.5;
	КонецЕсли;

	Если Смена = Перечисления._ПроизводственныеСмены.Дневная Тогда
		Количество = 8;
	Иначе
		Количество = 6;
	КонецЕсли;

	Если Склад = AMS_ВызовСервера.Цех1() Тогда
		Родитель = AMS_ВызовСервера.ФизЛицаПапкаКладовщики1();
		Работа = Справочники._Работы.Кладовщик1;

	ИначеЕсли Склад = AMS_ВызовСервера.Цех2() Тогда
		Родитель = AMS_ВызовСервера.ФизЛицаПапкаКладовщики2();
		Работа = Справочники._Работы.Кладовщик2;

	ИначеЕсли Склад = AMS_ВызовСервера.Цех3() Тогда
		Родитель = AMS_ВызовСервера.ФизЛицаПапкаКладовщики3();
		Работа = Справочники._Работы.Кладовщик3;
	КонецЕсли;

	Цена  = ПолучитьСтоимостьРаботы(Работа, Объект.Дата);

	Парам = Новый Структура;
	Парам.Вставить("Родитель", Родитель);
	Парам.Вставить("Работа", Работа);
	Парам.Вставить("Подработка", Подработка);
	Парам.Вставить("Количество", Количество);
	Парам.Вставить("Цена", Цена);
	Парам.Вставить("Сумма", Цена * Количество * Подработка);

	Кладовщики.Загрузить(ПолучитьДанныеШаблона(Парам));

	ПодсчетКоличествоРаботы();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьГрузчикиНаСервере()
	Склад = Объект.Склад;
	Смена = Объект.Смена;
	Грузчики = Объект.Грузчики;

	Если Объект.Смена = Перечисления._ПроизводственныеСмены.Дневная Тогда
		Подработка = 1;
	Иначе
		Подработка = 1.5;
	КонецЕсли;

	Если Смена = Перечисления._ПроизводственныеСмены.Дневная Тогда
		Количество = 8;
	Иначе
		Количество = 6;
	КонецЕсли;

	Если Склад = AMS_ВызовСервера.Цех1() Тогда
		Родитель = AMS_ВызовСервера.ФизЛицаПапкаГрузчики1();
		Работа = Справочники._Работы.Грузчик1;

	ИначеЕсли Склад = AMS_ВызовСервера.Цех2() Тогда
		Родитель = AMS_ВызовСервера.ФизЛицаПапкаГрузчики2();
		Работа = Справочники._Работы.Грузчик2;

	ИначеЕсли Склад = AMS_ВызовСервера.Цех3() Тогда
		Родитель = AMS_ВызовСервера.ФизЛицаПапкаГрузчики3();
		Работа = Справочники._Работы.Грузчик3;
	КонецЕсли;

	Цена  = ПолучитьСтоимостьРаботы(Работа, Объект.Дата);

	Парам = Новый Структура;
	Парам.Вставить("Родитель", Родитель);
	Парам.Вставить("Работа", Работа);
	Парам.Вставить("Подработка", Подработка);
	Парам.Вставить("Количество", Количество);
	Парам.Вставить("Цена", Цена);
	Парам.Вставить("Сумма", Цена * Количество * Подработка);

	Грузчики.Загрузить(ПолучитьДанныеШаблона(Парам));

	ПодсчетКоличествоРаботы();
КонецПроцедуры

&НаСервере
Процедура ПоказатьНачисленоЗаСмену()
	День = Новый СтандартныйПериод;
	День.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
	День.ДатаНачала = НачалоДня(Объект.Дата);
	День.ДатаОкончания = КонецДня(Объект.Дата);

	Парам = Новый Структура;
	Парам.Вставить("Склад", Объект.Склад);
	Парам.Вставить("Период", День);

	СКД = Документы.AMS_ПроизводствоЗаСмену.ПолучитьМакет("скдНачислено");

	Настройки = СКД.ВариантыНастроек.Найти("НачисленоЗаСмену").Настройки;

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Настройки.Отбор, "Ссылка", Объект.Ссылка,
		ВидСравненияКомпоновкиДанных.Равно, , Истина);

	Начислено.Очистить();

	мср.ПолучитьДанныеНаОснованииСКД(СКД, Начислено, Настройки, Парам);
КонецПроцедуры

&НаСервере
Процедура ПоказатьНачисленоСотруднику()
	Если Не ЗначениеЗаполнено(Сотрудник) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не указан сотрудник.");
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Период) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не указан период.");
		Возврат;
	КонецЕсли;

	СКД = Документы.AMS_ПроизводствоЗаСмену.ПолучитьМакет("скдНачислено");

	Парам = Новый Структура;
	Парам.Вставить("Склад", Объект.Склад);
	Парам.Вставить("Период", Период);

	Настройки = СКД.ВариантыНастроек.Найти("НачисленоСотруднику").Настройки;

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Настройки.Отбор, "Сотрудник", Сотрудник,
		ВидСравненияКомпоновкиДанных.Равно, , Истина);

	Начислено.Очистить();

	мср.ПолучитьДанныеНаОснованииСКД(СКД, Начислено, Настройки, Парам);
КонецПроцедуры

&НаСервере
Процедура ПоказатьНачисленоЗаПериод()
	Если Не ЗначениеЗаполнено(Период) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не указан период.");
		Возврат;
	КонецЕсли;

	Парам = Новый Структура;
	Парам.Вставить("Склад", Объект.Склад);
	Парам.Вставить("Период", Период);

	СКД = Документы.AMS_ПроизводствоЗаСмену.ПолучитьМакет("скдНачислено");

	Настройки = СКД.ВариантыНастроек.Найти("НачисленоЗаПериод").Настройки;

	Начислено.Очистить();

	мср.ПолучитьДанныеНаОснованииСКД(СКД, Начислено, Настройки, Парам);
КонецПроцедуры

&НаСервере
Процедура ПоказатьСтоимостьРабот()
	// Работы
	Парам = Новый Структура;
	Парам.Вставить("Период", Объект.Дата);

	СКД = Документы.AMS_ПроизводствоЗаСмену.ПолучитьМакет("скдСтоимостьРабот");

	Настройки = СКД.НастройкиПоУмолчанию;

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Настройки.Отбор, "Склад", Объект.Склад,
		ВидСравненияКомпоновкиДанных.Равно, , Истина);

	СтоимостьРабот.Очистить();

	мср.ПолучитьДанныеНаОснованииСКД(СКД, СтоимостьРабот, Настройки, Парам);
	
	// Фасовка

	Парам.Вставить("Сегмент", AMS_ВызовСервера.СегментыНоменклатурыПродукцияКомпании());
	Парам.Вставить("ВидНоменклатуры", мср.СоответствиеЦехВидНоменклатуры().Получить(Объект.Склад));

	СКД = Документы.AMS_ПроизводствоЗаСмену.ПолучитьМакет("скдСтоимостьФасовки");

	Настройки = СКД.НастройкиПоУмолчанию;

	СтоимостьФасовки.Очистить();

	мср.ПолучитьДанныеНаОснованииСКД(СКД, СтоимостьФасовки, Настройки, Парам);
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСтроку(Стр)
	Стр.Цена  = ПолучитьСтоимостьРаботы(Стр.Работа, Объект.Дата);
	Стр.Сумма = Стр.Цена * Стр.Количество * Стр.Подработка;
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеШаблона(Стр)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Родитель", Стр.Родитель);
	Запрос.УстановитьПараметр("Работа", Стр.Работа);
	Запрос.УстановитьПараметр("Подработка", Стр.Подработка);
	Запрос.УстановитьПараметр("Количество", Стр.Количество);
	Запрос.УстановитьПараметр("Цена", Стр.Цена);
	Запрос.УстановитьПараметр("Сумма", Стр.Сумма);

	Запрос.Текст =
	"ВЫБРАТЬ
	|   ФизическиеЛица.Ссылка КАК Сотрудник,
	|   &Работа КАК Работа,
	|   &Подработка КАК Подработка,
	|   &Количество КАК Количество,
	|   &Цена КАК Цена,
	|   &Сумма КАК Сумма
	|ИЗ
	|   Справочник.ФизическиеЛица КАК ФизическиеЛица
	|ГДЕ
	|   ФизическиеЛица.Ссылка В ИЕРАРХИИ(&Родитель)
	|   И НЕ ФизическиеЛица.ЭтоГруппа
	|   И НЕ ФизическиеЛица.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|   ФизическиеЛица.Наименование";

	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

&НаСервере
Функция ПолучитьСуммуБригады(НомерБригады)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НомерБригады", НомерБригады);
	Запрос.УстановитьПараметр("ФасовкаПродукция", Объект.ФасовкаПродукция.Выгрузить());
	Запрос.Текст =
	"ВЫБРАТЬ
	|   т.Сумма КАК Сумма
	|ПОМЕСТИТЬ вт
	|ИЗ
	|   &ФасовкаПродукция КАК т
	|ГДЕ
	|   т.НомерБригады = &НомерБригады
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|   СУММА(ЕСТЬNULL(вт.Сумма, 0)) КАК Сумма
	|ИЗ
	|   вт КАК вт";
	Рез = Запрос.Выполнить();

	Выб = Рез.Выбрать();
	Выб.Следующий();

	Возврат ?(Выб.Сумма = Null, 0, Выб.Сумма);
КонецФункции

&НаСервере
Процедура ПодсчетКоличествоРаботы()
	КоличествоРаботы = Объект.ФасовкаБригады.Количество() + Объект.Замесчики.Количество() + Объект.Механики.Количество()
		+ Объект.Кладовщики.Количество() + Объект.Грузчики.Количество() + Объект.ДопРаботы.Количество();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРабота(Вариант, Склад)
	Если Вариант = 1 Тогда
		Если Склад = AMS_ВызовСервера.Цех1() Тогда
			Работа = Справочники._Работы.Замесчик1;
			
		ИначеЕсли Склад = AMS_ВызовСервера.Цех2() Тогда
			Работа = Справочники._Работы.Замесчик2;
			
		ИначеЕсли Склад = AMS_ВызовСервера.Цех3() Тогда
			Работа = Справочники._Работы.Замесчик3;
		КонецЕсли;

	ИначеЕсли Вариант = 2 Тогда
		Если Склад = AMS_ВызовСервера.Цех1() Тогда
			Работа = Справочники._Работы.Механик1;
			
		ИначеЕсли Склад = AMS_ВызовСервера.Цех2() Тогда
			Работа = Справочники._Работы.Механик2;
			
		ИначеЕсли Склад = AMS_ВызовСервера.Цех3() Тогда 
			//Работа = Справочники._Работы.Механик3;
		КонецЕсли;

	ИначеЕсли Вариант = 3 Тогда
		Если Склад = AMS_ВызовСервера.Цех1() Тогда
			Работа = Справочники._Работы.Кладовщик1;
			
		ИначеЕсли Склад = AMS_ВызовСервера.Цех2() Тогда
			Работа = Справочники._Работы.Кладовщик2;
			
		ИначеЕсли Склад = AMS_ВызовСервера.Цех3() Тогда
			Работа = Справочники._Работы.Кладовщик3;
		КонецЕсли;

	ИначеЕсли Вариант = 4 Тогда
		Если Склад = AMS_ВызовСервера.Цех1() Тогда
			Работа = Справочники._Работы.Грузчик1;
			
		ИначеЕсли Склад = AMS_ВызовСервера.Цех2() Тогда
			Работа = Справочники._Работы.Грузчик2;
			
		ИначеЕсли Склад = AMS_ВызовСервера.Цех3() Тогда
			Работа = Справочники._Работы.Грузчик3;
		КонецЕсли;
	КонецЕсли;

	Возврат Работа;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСтоимостьРаботы(Работа, Дата)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Работа", Работа);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Работа КАК Работа,
	|	т.Цена КАК Цена
	|ИЗ
	|	РегистрСведений._ЦеныРабот.СрезПоследних(&Дата, Работа = &Работа) КАК т";
	Рез = Запрос.Выполнить();

	Если Рез.Пустой() Тогда
		Возврат 0;
	Иначе
		Выб = Рез.Выбрать();
		Выб.Следующий();
		Возврат Выб.Цена;
	КонецЕсли;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСотрудников(Склад)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ФизическиеЛица КАК т
	|ГДЕ
	|	НЕ т.ПометкаУдаления
	|	И НЕ т.ЭтоГруппа
	|	И т._РаботникПроизводства
	|	И т._Склад = &Склад
	|
	|УПОРЯДОЧИТЬ ПО
	|	т.Наименование";

	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДопРаботы(Склад)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник._Работы КАК т
	|ГДЕ
	|	т.Склад = &Склад
	|	И НЕ т.ПометкаУдаления
	|	И НЕ т.Предопределенный
	|
	|УПОРЯДОЧИТЬ ПО
	|	т.Наименование";

	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
КонецФункции

#КонецОбласти

#Область Фасовка

&НаСервере
Процедура ПоказатьСтраницуФасовка()
	КоличествоБригадФасовки = Объект.КоличествоБригадФасовки;

	Если КоличествоБригадФасовки > мКоличествоБригадФасовки Тогда
		Для Сч = мКоличествоБригадФасовки + 1 По КоличествоБригадФасовки Цикл
			НомерБригады = Формат(Сч, "ЧГ=");

			НастройкаФормыФасовка(НомерБригады);
		КонецЦикла;

	ИначеЕсли КоличествоБригадФасовки < мКоличествоБригадФасовки Тогда
		Для Сч = КоличествоБригадФасовки + 1 По мКоличествоБригадФасовки Цикл
			НомерБригады = Формат(Сч, "ЧГ=");

			УдалитьБригаду(НомерБригады);
		КонецЦикла;
	КонецЕсли;

	мКоличествоБригадФасовки = КоличествоБригадФасовки;

	ПоказатьБригады();
КонецПроцедуры

&НаСервере
Процедура НастройкаФормыФасовка(НомерБригады)

	ИмяСтраницы = "Бригада" + НомерБригады;
	ИмяТабСостав = "Состав" + НомерБригады;
	ИмяТабТовары = "Товары" + НомерБригады;

	ДобавляемыеРеквизиты = Новый Массив;
	
	// Описание таблиц значений как реквизитов формы
	МассивТипа = Новый Массив;
	МассивТипа.Добавить(Тип("ТаблицаЗначений"));
	ОписаниеТипаТЗ = Новый ОписаниеТипов(МассивТипа);
	
	// Добавить в массив реквизитов ТЗ "Состав"
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(ИмяТабСостав, ОписаниеТипаТЗ));
	ТЗ1 = Новый ТаблицаЗначений;
	ТЗ1.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ТЗ1.Колонки.Добавить("Подработка", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(3, 1)));
	ТЗ1.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 2)));
	Для Каждого Колонка Из ТЗ1.Колонки Цикл
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, ИмяТабСостав));
	КонецЦикла;	
	
	// Добавить в массив реквизитов ТЗ "Товары"
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(ИмяТабТовары, ОписаниеТипаТЗ));
	ТЗ2 = Новый ТаблицаЗначений;
	ТЗ2.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТЗ2.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 2)));
	ТЗ2.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10)));
	ТЗ2.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 2)));
	
	 // Добавление в массив реквизитов колонок ТаблицыЗначений
	Для Каждого Колонка Из ТЗ2.Колонки Цикл
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, ИмяТабТовары));
	КонецЦикла;

	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	// ВЫВОД НА ФОРМУ РЕКВИЗИТОВ ФОРМЫ

	Страница = Элементы.Добавить(ИмяСтраницы, Тип("ГруппаФормы"), Элементы.СтрФасовки);
	Страница.Вид = ВидГруппыФормы.Страница;
	Страница.Заголовок = "Бригада " + НомерБригады;
	Страница.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;

	ИмяГруппы = "Группа" + ИмяТабСостав;
	Группа  = Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы"), Элементы[ИмяСтраницы]);
	Группа.Вид         = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Отображение = ОтображениеОбычнойГруппы.Нет;
	Группа.ОтображатьЗаголовок = Ложь;
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;

	ИмяКоманды = "ПодборФасовкаБригады" + НомерБригады;
	Команда = Команды.Добавить(ИмяКоманды);
	Команда.Действие  = "Подключаемый_ПодборФасовкаБригады";
	Команда.Заголовок = "Подбор состава бригады";

	Кнопка = Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), Элементы[ИмяГруппы]);
	Кнопка.Вид        = ВидКнопкиФормы.КнопкаКоманднойПанели;
	Кнопка.ИмяКоманды = ИмяКоманды;

	ТП1 = Элементы.Добавить(ИмяТабСостав, Тип("ТаблицаФормы"), Элементы[ИмяГруппы]);
	ТП1.ПутьКДанным = ИмяТабСостав;
	ТП1.Отображение = ОтображениеТаблицы.Список;
	ТП1.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	ТП1.ТолькоПросмотр = Истина;
	ТП1.УстановитьДействие("Выбор", "СоставВыбор");

	Для Каждого Колонка Из ТЗ1.Колонки Цикл
		Элемент = Элементы.Добавить(ИмяТабСостав + Колонка.Имя, Тип("ПолеФормы"), ТП1);
		Элемент.ПутьКДанным = ИмяТабСостав + "." + Колонка.Имя;
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		Если Колонка.Имя = "Сумма" Тогда
			Элемент.ТолькоПросмотр = Истина;
		КонецЕсли;
	КонецЦикла;

	ИмяГруппы = "Группа" + ИмяТабТовары;
	Группа  = Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы"), Элементы[ИмяСтраницы]);
	Группа.Вид         = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Отображение = ОтображениеОбычнойГруппы.Нет;
	Группа.ОтображатьЗаголовок = Ложь;
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;

	ИмяКоманды = "ПодборФасовкаПродукция" + НомерБригады;
	Команда = Команды.Добавить(ИмяКоманды);
	Команда.Действие  = "Подключаемый_ПодборФасовкаПродукция";
	Команда.Заголовок = "Подбор продукции для фасовки";

	Кнопка = Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), Элементы[ИмяГруппы]);
	Кнопка.Вид        = ВидКнопкиФормы.КнопкаКоманднойПанели;
	Кнопка.ИмяКоманды = ИмяКоманды;

	ТП2 = Элементы.Добавить(ИмяТабТовары, Тип("ТаблицаФормы"), Элементы[ИмяГруппы]);
	ТП2.ПутьКДанным = ИмяТабТовары;
	ТП2.Отображение = ОтображениеТаблицы.Список;
	ТП2.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	ТП2.ТолькоПросмотр = Истина;
	ТП2.УстановитьДействие("Выбор", "ТоварыВыбор");

	Для Каждого Колонка Из ТЗ2.Колонки Цикл
		Элемент = Элементы.Добавить(ИмяТабТовары + Колонка.Имя, Тип("ПолеФормы"), ТП2);
		Элемент.ПутьКДанным = ИмяТабТовары + "." + Колонка.Имя;
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		Если Колонка.Имя = "Цена" Или Колонка.Имя = "Сумма" Тогда
			Элемент.ТолькоПросмотр = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура УдалитьБригаду(НомерБригады)
	ИмяСтраницы = "Бригада" + НомерБригады;
	ИмяТабСостав = "Состав" + НомерБригады;
	ИмяТабТовары = "Товары" + НомерБригады;

	УдалитьЭлементФормы(ИмяТабСостав);
	УдалитьЭлементФормы(ИмяТабТовары);
	УдалитьЭлементФормы(ИмяСтраницы);

	УдаляемыеРеквизиты = Новый Массив;

	УдаляемыеРеквизиты.Добавить(ИмяТабСостав);
	УдаляемыеРеквизиты.Добавить(ИмяТабТовары);

	ИзменитьРеквизиты( , УдаляемыеРеквизиты);
КонецПроцедуры

&НаСервере
Процедура УдалитьЭлементФормы(ИмяЭлемента)
	ТекЭлемент = Элементы.Найти(ИмяЭлемента);
	Если ТекЭлемент <> Неопределено Тогда
		Элементы.Удалить(ТекЭлемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоставВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;

	НомерБригады = Сред(Элемент.Имя, 7);

	Парам = Новый Структура;
	Парам.Вставить("НомерБригады", НомерБригады);
	Парам.Вставить("МассивСтрок", ПолучитьМассивСтрокСотрудники(НомерБригады));
	Парам.Вставить("СуммаБригады", ПолучитьСуммуБригады(НомерБригады));

	ОткрытьФорму("Документ.AMS_ПроизводствоЗаСмену.Форма.ВыборСоставаБригады", Парам, ЭтотОбъект, , , ,
		Новый ОписаниеОповещения("ОткрытьВыборСоставаБригадыЗавершение", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;

	НомерБригады = Сред(Элемент.Имя, 7);

	Парам = Новый Структура;
	Парам.Вставить("НомерБригады", НомерБригады);
	Парам.Вставить("МассивСтрок", ПолучитьМассивСтрокТовары(НомерБригады));

	ОткрытьФорму("Документ.AMS_ПроизводствоЗаСмену.Форма.ПодборПродукцииДляФасовки", Парам, ЭтотОбъект, , , ,
		Новый ОписаниеОповещения("ОткрытьПодборПродукцииДляФасовкиЗавершение", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПодборФасовкаБригады(Команда)
	НомерБригады = Сред(Команда.Имя, 21);

	Парам = Новый Структура;
	Парам.Вставить("НомерБригады", НомерБригады);
	Парам.Вставить("МассивСтрок", ПолучитьМассивСтрокСотрудники(НомерБригады));
	Парам.Вставить("СуммаБригады", ПолучитьСуммуБригады(НомерБригады));

	ОткрытьФорму("Документ.AMS_ПроизводствоЗаСмену.Форма.ВыборСоставаБригады", Парам, ЭтотОбъект, , , ,
		Новый ОписаниеОповещения("ОткрытьВыборСоставаБригадыЗавершение", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПодборФасовкаПродукция(Команда)
	НомерБригады = Сред(Команда.Имя, 23);

	Парам = Новый Структура;
	Парам.Вставить("НомерБригады", НомерБригады);
	Парам.Вставить("МассивСтрок", ПолучитьМассивСтрокТовары(НомерБригады));

	ОткрытьФорму("Документ.AMS_ПроизводствоЗаСмену.Форма.ПодборПродукцииДляФасовки", Парам, ЭтотОбъект, , , ,
		Новый ОписаниеОповещения("ОткрытьПодборПродукцииДляФасовкиЗавершение", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивСтрокСотрудники(НомерБригады)
	Склад = Объект.Склад;

	Если Склад = AMS_ВызовСервера.Цех1() Тогда
		ГруппаФасовщики = Справочники.ФизическиеЛица.ПолучитьСсылку(
			Новый УникальныйИдентификатор("0c039e32-07ad-11eb-8de3-a4bf015601f8"));
			
	ИначеЕсли Склад = AMS_ВызовСервера.Цех2() Тогда  // Грецкий
		ГруппаФасовщики = Новый Массив;
		ГруппаФасовщики.Добавить(Справочники.ФизическиеЛица.ПолучитьСсылку(
			Новый УникальныйИдентификатор("0c039e32-07ad-11eb-8de3-a4bf015601f8"))); //Цех1
		ГруппаФасовщики.Добавить(Справочники.ФизическиеЛица.ПолучитьСсылку(
			Новый УникальныйИдентификатор("14e401a8-07ad-11eb-8de3-a4bf015601f8"))); //Цех2
			
	ИначеЕсли Склад = AMS_ВызовСервера.Цех3() Тогда
		ГруппаФасовщики = Справочники.ФизическиеЛица.ПолучитьСсылку(
			Новый УникальныйИдентификатор("14e401aa-07ad-11eb-8de3-a4bf015601f8"));
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ГруппаФасовщики", ГруппаФасовщики);
	Запрос.УстановитьПараметр("ФасовкаБригады", Объект.ФасовкаБригады.Выгрузить());
	Запрос.УстановитьПараметр("НомерБригады", НомерБригады);
	Запрос.УстановитьПараметр("Подработка", Объект.Подработка);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Ссылка КАК Сотрудник,
	|	т._НомерГруппы КАК НомерГруппы
	|ПОМЕСТИТЬ лица
	|ИЗ
	|	Справочник.ФизическиеЛица КАК т
	|ГДЕ
	|	т.Родитель В (&ГруппаФасовщики)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.НомерБригады КАК НомерБригады,
	|	т.Сотрудник КАК Сотрудник,
	|	т.Подработка КАК Подработка,
	|	т.Сумма КАК Сумма
	|ПОМЕСТИТЬ ЛицаВкл
	|ИЗ
	|	&ФасовкаБригады КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЛицаВкл.НомерБригады КАК НомерБригады,
	|	ЛицаВкл.Сотрудник КАК Сотрудник,
	|	ЛицаВкл.Подработка КАК Подработка,
	|	ЛицаВкл.Сумма КАК Сумма
	|ПОМЕСТИТЬ НашаБригада
	|ИЗ
	|	ЛицаВкл КАК ЛицаВкл
	|ГДЕ
	|	ЛицаВкл.НомерБригады = &НомерБригады
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЛицаВкл.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ДругиеБригады
	|ИЗ
	|	ЛицаВкл КАК ЛицаВкл
	|ГДЕ
	|	НЕ ЛицаВкл.Сотрудник В
	|				(ВЫБРАТЬ
	|					т.Сотрудник КАК Сотрудник
	|				ИЗ
	|					НашаБригада КАК т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НашаБригада.Сотрудник ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Метка,
	|	лица.Сотрудник КАК Сотрудник,
	|	лица.НомерГруппы КАК НомерГруппы,
	|	ВЫБОР
	|		КОГДА НашаБригада.Подработка ЕСТЬ NULL
	|			ТОГДА &Подработка
	|		ИНАЧЕ НашаБригада.Подработка
	|	КОНЕЦ КАК Подработка,
	|	НашаБригада.Сумма КАК Сумма,
	|	ВЫБОР
	|		КОГДА ДругиеБригады.Сотрудник ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Включен
	|ИЗ
	|	лица КАК лица
	|		ЛЕВОЕ СОЕДИНЕНИЕ НашаБригада КАК НашаБригада
	|		ПО лица.Сотрудник = НашаБригада.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДругиеБригады КАК ДругиеБригады
	|		ПО лица.Сотрудник = ДругиеБригады.Сотрудник";

	МассивСтрок = Новый Массив;
	Табл = Запрос.Выполнить().Выгрузить();
	Для Каждого Стр Из Табл Цикл
		МассивСтрок.Добавить(ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Стр));
	КонецЦикла;

	Возврат МассивСтрок;
КонецФункции

&НаСервере
Процедура ЗаполнитьФасовкаБригады(Результат)
	Склад = Объект.Склад;
	Если Склад = AMS_ВызовСервера.Цех1() Тогда
		Работа = Справочники._Работы.Фасовка1;
		
	ИначеЕсли Склад = AMS_ВызовСервера.Цех2() Тогда
		Работа = Справочники._Работы.Фасовка2;
		
	ИначеЕсли Склад = AMS_ВызовСервера.Цех3() Тогда
		Работа = Справочники._Работы.Фасовка3;
	КонецЕсли;

	НомерБригады = Результат.НомерБригады;
	МассивСтрок = Результат.МассивСтрок;

	КоличествоВБригаде = МассивСтрок.Количество();

	ФасовкаБригады = Объект.ФасовкаБригады;

	Строки = ФасовкаБригады.НайтиСтроки(Новый Структура("НомерБригады", НомерБригады));
	Для Каждого Стр Из Строки Цикл
		ФасовкаБригады.Удалить(Стр);
	КонецЦикла;

	Если КоличествоВБригаде = 0 Тогда
		Возврат;
	КонецЕсли;

	ИтогоСумма = ПолучитьСуммуБригады(НомерБригады);

	Для Каждого Стр Из МассивСтрок Цикл
		НовСтр = ФасовкаБригады.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Стр);
		НовСтр.Работа = Работа;
		НовСтр.Сумма = ?(КоличествоВБригаде = 0, 0, ИтогоСумма / КоличествоВБригаде) * ?(Стр.Подработка
			= Объект.Подработка, Объект.Подработка, Стр.Подработка);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивСтрокТовары(НомерБригады)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Запрос.УстановитьПараметр("НомерБригады", НомерБригады);
	Запрос.УстановитьПараметр("Продукция", Объект.Продукция.Выгрузить());
	Запрос.УстановитьПараметр("ФасовкаПродукция", Объект.ФасовкаПродукция.Выгрузить());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.КоличествоФакт КАК КоличествоФакт
	|ПОМЕСТИТЬ прод
	|ИЗ
	|	&Продукция КАК т
	|ГДЕ
	|	т.КоличествоФакт > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.НомерБригады КАК НомерБригады,
	|	т.Номенклатура КАК Номенклатура,
	|	т.Количество КАК Количество
	|ПОМЕСТИТЬ тов
	|ИЗ
	|	&ФасовкаПродукция КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тов.Номенклатура КАК Номенклатура,
	|	СУММА(тов.Количество) КАК Расфасовано
	|ПОМЕСТИТЬ уже
	|ИЗ
	|	тов КАК тов
	|ГДЕ
	|	НЕ тов.НомерБригады = &НомерБригады
	|
	|СГРУППИРОВАТЬ ПО
	|	тов.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тов.Номенклатура КАК Номенклатура,
	|	тов.Количество КАК Количество
	|ПОМЕСТИТЬ текБригада
	|ИЗ
	|	тов КАК тов
	|ГДЕ
	|	тов.НомерБригады = &НомерБригады
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	прод.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(прод.КоличествоФакт, 0) - ЕСТЬNULL(уже.Расфасовано, 0) КАК Остаток,
	|	ЕСТЬNULL(текБригада.Количество, 0) КАК Количество
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	прод КАК прод
	|		ЛЕВОЕ СОЕДИНЕНИЕ уже КАК уже
	|		ПО прод.Номенклатура = уже.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ текБригада КАК текБригада
	|		ПО прод.Номенклатура = текБригада.Номенклатура
	|ГДЕ
	|	НЕ ЕСТЬNULL(прод.КоличествоФакт, 0) - ЕСТЬNULL(уже.Расфасовано, 0) = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.Цена КАК Цена
	|ПОМЕСТИТЬ ц
	|ИЗ
	|	РегистрСведений._ЦеныФасовкиПродукции.СрезПоследних(
	|			&Дата,
	|			Номенклатура В
	|				(ВЫБРАТЬ
	|					т.Номенклатура КАК Номенклатура
	|				ИЗ
	|					вт КАК т)) КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.Номенклатура КАК Номенклатура,
	|	вт.Остаток КАК Остаток,
	|	ЕСТЬNULL(ц.Цена, 0) КАК Цена,
	|	вт.Количество КАК Количество,
	|	вт.Количество * ЕСТЬNULL(ц.Цена, 0) КАК Сумма
	|ИЗ
	|	вт КАК вт
	|		ЛЕВОЕ СОЕДИНЕНИЕ ц КАК ц
	|		ПО вт.Номенклатура = ц.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК ном
	|		ПО вт.Номенклатура = ном.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ном.Наименование";

	МассивСтрок = Новый Массив;
	Табл = Запрос.Выполнить().Выгрузить();
	Для Каждого Стр Из Табл Цикл
		МассивСтрок.Добавить(ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Стр));
	КонецЦикла;

	Возврат МассивСтрок;
КонецФункции

&НаСервере
Процедура ЗаполнитьФасовкаПродукция(Результат)
	НомерБригады = Результат.НомерБригады;
	МассивСтрок = Результат.МассивСтрок;

	ФасовкаБригады = Объект.ФасовкаБригады;
	ФасовкаПродукция = Объект.ФасовкаПродукция;

	Строки = ФасовкаПродукция.НайтиСтроки(Новый Структура("НомерБригады", НомерБригады));
	Для Каждого Стр Из Строки Цикл
		ФасовкаПродукция.Удалить(Стр);
	КонецЦикла;

	Для Каждого Стр Из МассивСтрок Цикл
		НовСтр = ФасовкаПродукция.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Стр);
	КонецЦикла;

	КоличествоВБригаде = ПолучитьКоличествоВБригаде(ФасовкаБригады, НомерБригады);

	Если КоличествоВБригаде = 0 Тогда
		Возврат;
	КонецЕсли;

	ИтогоСумма = ПолучитьСуммуБригады(НомерБригады);

	Для Каждого Стр Из ФасовкаБригады Цикл
		Если Стр.НомерБригады = НомерБригады Тогда
			Стр.Сумма = ?(КоличествоВБригаде = 0, 0, ИтогоСумма / КоличествоВБригаде) * ?(Стр.Подработка
				= Объект.Подработка, Объект.Подработка, Стр.Подработка);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьКоличествоВБригаде(ФасовкаБригады, НомерБригады)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НомерБригады", НомерБригады);
	Запрос.УстановитьПараметр("ФасовкаБригады", ФасовкаБригады.Выгрузить());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.НомерБригады КАК НомерБригады,
	|	т.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	&ФасовкаБригады КАК т
	|ГДЕ
	|	т.НомерБригады = &НомерБригады
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(вт.Сотрудник) КАК КоличествоСотрудников
	|ИЗ
	|	вт КАК вт";
	Рез = Запрос.Выполнить();

	Выб = Рез.Выбрать();
	Выб.Следующий();

	Возврат ?(Выб.КоличествоСотрудников = Null, 0, Выб.КоличествоСотрудников);
КонецФункции

&НаСервере
Процедура ПоказатьБригады()
	ТабПродукция =        Объект.Продукция.Выгрузить();
	ТабФасовкаБригады =   Объект.ФасовкаБригады.Выгрузить();
	ТабФасовкаПродукция = Объект.ФасовкаПродукция.Выгрузить();

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Продукция", ТабПродукция);
	Запрос.УстановитьПараметр("ФасовкаПродукция", ТабФасовкаПродукция);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.НомерСтроки КАК НомерСтроки,
	|	т.Номенклатура КАК Номенклатура,
	|	т.КоличествоПлан КАК КоличествоПлан,
	|	т.КоличествоФакт КАК КоличествоФакт
	|ПОМЕСТИТЬ прод
	|ИЗ
	|	&Продукция КАК т
	|ГДЕ
	|	НЕ(т.КоличествоПлан = 0
	|				И т.КоличествоФакт = 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.НомерБригады КАК НомерБригады,
	|	т.Номенклатура КАК Номенклатура,
	|	т.Количество КАК Количество
	|ПОМЕСТИТЬ тов
	|ИЗ
	|	&ФасовкаПродукция КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	прод.НомерСтроки КАК НомерСтроки,
	|	прод.Номенклатура КАК Номенклатура,
	|	прод.КоличествоПлан КАК КоличествоПлан,
	|	прод.КоличествоФакт КАК КоличествоФакт
	|ИЗ
	|	прод КАК прод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тов.НомерБригады КАК НомерБригады,
	|	тов.Номенклатура КАК Номенклатура,
	|	тов.Количество КАК Количество
	|ИЗ
	|	тов КАК тов";

	Рез = Запрос.ВыполнитьПакет();

	ТабПродукция = Рез[2].Выгрузить();
	ТабФасовка = Рез[3].Выгрузить();
    
    //
	Фасовка.Очистить();
	СКД = Документы.AMS_ПроизводствоЗаСмену.ПолучитьМакет("скдФасовка");

	Настройки = СКД.НастройкиПоУмолчанию;

	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("Продукция", ТабПродукция);
	ВнешниеНаборыДанных.Вставить("Фасовка", ТабФасовка);

	мср.ПолучитьДанныеНаОснованииСКД(СКД, Фасовка, Настройки, Неопределено, , , ВнешниеНаборыДанных);
    
    //
	КоличествоБригадФасовки = Объект.КоличествоБригадФасовки;
	Для Сч = 1 По КоличествоБригадФасовки Цикл
        //@skip-check query-in-loop
		ПоказатьБригаду(ТабФасовкаБригады, ТабФасовкаПродукция, Формат(Сч, "ЧГ="));
	КонецЦикла;

	ПодсчетКоличествоРаботы();
КонецПроцедуры

&НаСервере
Процедура ПоказатьБригаду(ТабФасовкаБригады, ТабФасовкаПродукция, НомерБригады)
	ИмяТабСостав = "Состав" + НомерБригады;
	ИмяТабТовары = "Товары" + НомерБригады;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НомерБригады", НомерБригады);
	Запрос.УстановитьПараметр("ФасовкаБригады", ТабФасовкаБригады);
	Запрос.УстановитьПараметр("ФасовкаПродукция", ТабФасовкаПродукция);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Сотрудник КАК Сотрудник,
	|	т.Подработка КАК Подработка,
	|	т.Сумма КАК Сумма
	|ПОМЕСТИТЬ Состав
	|ИЗ
	|	&ФасовкаБригады КАК т
	|ГДЕ
	|	т.НомерБригады = &НомерБригады
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.Цена КАК Цена,
	|	т.Количество КАК Количество,
	|	т.Сумма КАК Сумма
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	&ФасовкаПродукция КАК т
	|ГДЕ
	|	т.НомерБригады = &НомерБригады
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Состав.Сотрудник КАК Сотрудник,
	|	Состав.Подработка КАК Подработка,
	|	Состав.Сумма КАК Сумма
	|ИЗ
	|	Состав КАК Состав
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Цена КАК Цена,
	|	Товары.Количество КАК Количество,
	|	Товары.Сумма КАК Сумма
	|ИЗ
	|	Товары КАК Товары";

	Рез = Запрос.ВыполнитьПакет();

	ФасовкаБригады = Рез[2].Выгрузить();
	ФасовкаПродукция = Рез[3].Выгрузить();
	Табл = РеквизитФормыВЗначение(ИмяТабСостав);
	Табл.Очистить();
	Для Каждого Стр Из ФасовкаБригады Цикл
		НовСтр = Табл.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Стр);
	КонецЦикла;
	ЗначениеВРеквизитФормы(Табл, ИмяТабСостав);

	Табл = РеквизитФормыВЗначение(ИмяТабТовары);
	Табл.Очистить();
	Для Каждого Стр Из ФасовкаПродукция Цикл
		НовСтр = Табл.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Стр);
	КонецЦикла;
	ЗначениеВРеквизитФормы(Табл, ИмяТабТовары);
КонецПроцедуры

&НаСервере
Процедура ПодработкаПриИзмененииНаСервере()
	КоличествоБригадФасовки = Объект.КоличествоБригадФасовки;
	ФасовкаБригады = Объект.ФасовкаБригады;

	Для Сч = 1 По КоличествоБригадФасовки Цикл
		НомерБригады = Формат(Сч, "ЧГ=");
		
    	//@skip-check query-in-loop
		КоличествоВБригаде = ПолучитьКоличествоВБригаде(ФасовкаБригады, НомерБригады);
		
		//@skip-check query-in-loop
		ИтогоСумма = ПолучитьСуммуБригады(НомерБригады);

		Для Каждого Стр Из ФасовкаБригады Цикл
			Если Стр.НомерБригады = НомерБригады Тогда
				Стр.Сумма = ?(КоличествоВБригаде = 0, 0, ИтогоСумма / КоличествоВБригаде) * ?(Стр.Подработка
					= Объект.Подработка, Объект.Подработка, Стр.Подработка);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиОжидания

&НаКлиенте
Процедура ПослеЗаписиОбработчикОжидания()
	ПоказатьОтчетПередачаПродукции();
КонецПроцедуры

&НаКлиенте
Процедура РасходСырьяПриАктивизацииСтрокиОбработчикОжидания()
	ТекущиеДанные = Элементы.РасходСырья.ТекущиеДанные;

	Если Не ТекущиеДанные = Неопределено Тогда
		ПоказатьОтчетРасшифровкаРасходСырья(ТекущиеДанные.Номенклатура);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РасходУпаковкиПриАктивизацииСтрокиОбработчикОжидания()
	ТекущиеДанные = Элементы.РасходУпаковки.ТекущиеДанные;

	Если Не ТекущиеДанные = Неопределено Тогда
		ПоказатьОтчетРасшифровкаРасходУпаковки(ТекущиеДанные.Номенклатура);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПроизводстваПриАктивизацииСтрокиОбработчикОжидания()
	ТекущиеДанные = Элементы.ДокументыПроизводства.ТекущиеДанные;

	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьТоварыДокументыПроизводства(ТекущиеДанные.ДокСсылка, ТекущиеДанные.Операция);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиОповещений

&НаКлиенте
Процедура ОткрытьФормуВыбораТовараЗавершение(Результат, ДополнительныеПераметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ОткрытьФормуПланированияПроизводства(Результат.Номенклатура);
КонецПроцедуры

&НаКлиенте
Процедура ОбратоткаКомандыУдалитьПродукциюЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		УдалитьПродукциюНаСервере(ДополнительныеПараметры.Продукция, ДополнительныеПараметры.Фабрикат);
		ПоказатьТовары();
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСФабрикатомЗавершение(Результат, ДополнительныеПераметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Модифицированность = Истина;
	ОформитьСтрокуПродукцииСФабрикатом(Результат);
	ПоказатьТовары();

	Массив = Продукция.НайтиСтроки(Новый Структура("Номенклатура", ДополнительныеПераметры.Номенклатура));
	Если Массив.Количество() > 0 Тогда
		Стр     = Массив[0];
		Идентиф = Стр.ПолучитьИдентификатор();
		Элементы.Продукция.ТекущаяСтрока = Идентиф;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормаПодбораФактЗавершение(Результат, ДополнительныеПераметры) Экспорт 
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Модифицированность = Истина;
	
	ПодборФактЗавершить(Результат);

	ПоказатьТовары();

	Массив = Продукция.НайтиСтроки(Новый Структура("Номенклатура", ДополнительныеПераметры.Номенклатура));
	Если Массив.Количество() > 0 Тогда
		Стр     = Массив[0];
		Идентиф = Стр.ПолучитьИдентификатор();
		Элементы.Продукция.ТекущаяСтрока = Идентиф;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПодборФактЗавершить(Результат) 
	Сделано = Новый ТаблицаЗначений();
	Сделано.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Сделано.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	
    Для каждого Стр Из Результат Цикл
		НовСтр = Сделано.Добавить();
		НовСтр.Номенклатура = Стр.Номенклатура;
		НовСтр.Количество   = Стр.Количество;	
    КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сделано", Сделано);
	Запрос.УстановитьПараметр("Продукция", Объект.Продукция.Выгрузить(, "Номенклатура, Фабрикат, Спецификация"));
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Сделано.Номенклатура КАК Номенклатура,
		|	Сделано.Количество КАК Количество
		|ПОМЕСТИТЬ Сделано
		|ИЗ
		|	&Сделано КАК Сделано
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Продукция.Номенклатура КАК Номенклатура,
		|	Продукция.Фабрикат КАК Фабрикат,
		|	Продукция.Спецификация КАК Спецификация
		|ПОМЕСТИТЬ Прод1
		|ИЗ
		|	&Продукция КАК Продукция
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Прод1.Номенклатура КАК Номенклатура,
		|	Прод1.Фабрикат КАК Фабрикат,
		|	Прод1.Спецификация КАК Спецификация,
		|	ЕСТЬNULL(Сделано.Количество, 0) КАК Количество
		|ПОМЕСТИТЬ Прод2
		|ИЗ
		|	Прод1 КАК Прод1
		|		ЛЕВОЕ СОЕДИНЕНИЕ Сделано КАК Сделано
		|		ПО Прод1.Номенклатура = Сделано.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Прод2.Номенклатура КАК Продукция,
		|	Прод2.Количество КАК КоличествоПродукция,
		|	Прод2.Фабрикат КАК Фабрикат,
		|	Спец.Количество * Прод2.Количество КАК КоличествоФабрикат
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	Прод2 КАК Прод2
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры.Товары КАК Спец
		|		ПО Прод2.Спецификация = Спец.Ссылка
		|			И Прод2.Фабрикат = Спец.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт.Продукция КАК Номенклатура,
		|	вт.КоличествоПродукция КАК КоличествоФакт
		|ИЗ
		|	вт КАК вт
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт.Фабрикат КАК Номенклатура,
		|	СУММА(вт.КоличествоФабрикат) КАК КоличествоФакт
		|ИЗ
		|	вт КАК вт
		|
		|СГРУППИРОВАТЬ ПО
		|	вт.Фабрикат";
	
	Пакет = Запрос.ВыполнитьПакет();
	
	Выб = Пакет[4].Выбрать();
	Пока Выб.Следующий() Цикл
		Строки = Объект.Продукция.НайтиСтроки(Новый Структура("Номенклатура", Выб.Номенклатура));
		Если Строки.Количество()> 0 Тогда
			Стр = Строки[0];
			Стр.КоличествоФакт = Выб.КоличествоФакт;
		КонецЕсли;
	КонецЦикла;

	Выб = Пакет[5].Выбрать();
	Пока Выб.Следующий() Цикл
		Строки = Объект.Фабрикаты.НайтиСтроки(Новый Структура("Номенклатура", Выб.Номенклатура));
		Если Строки.Количество()> 0 Тогда
			Стр = Строки[0];
			Стр.КоличествоФакт = Выб.КоличествоФакт;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОформитьСтрокуПродукцииСФабрикатом(Данные)
	ТекОбъект  = РеквизитФормыВЗначение("Объект");
	
	Стр = Данные.Фабрикат;
	
	//Фабрикат
	ТЧ_Фабрикаты = ТекОбъект.Фабрикаты;
	
	ТекСтр = ТЧ_Фабрикаты.Найти(Стр.Номенклатура, "Номенклатура");

	Если Стр.КоличествоПлан = 0 И Стр.КоличествоФакт = 0 Тогда
		Если ТекСтр <> Неопределено Тогда
			ТЧ_Фабрикаты.Удалить(ТекСтр);
		КонецЕсли;
	Иначе
		Если ТекСтр = Неопределено Тогда
			ТекСтр = ТЧ_Фабрикаты.Добавить();
		КонецЕсли;

		ЗаполнитьЗначенияСвойств(ТекСтр, Стр);

		ТЧ_Фабрикаты.Сортировать("Номенклатура");
	КонецЕсли;
	
	//Продукция
	ТЧ_Продукция  = ТекОбъект.Продукция;
	ТабПродукция = Данные.Продукция;

	Для Каждого Стр Из ТабПродукция Цикл
		ТекСтр = ТЧ_Продукция.Найти(Стр.Номенклатура, "Номенклатура");

		Если Стр.КоличествоПлан = 0 Тогда
			Если Не ТекСтр = Неопределено Тогда
				Если ТекСтр.Утверждено = 0 Тогда
					ТЧ_Продукция.Удалить(ТекСтр);

				Иначе
					ЗаполнитьЗначенияСвойств(ТекСтр, Стр);
				КонецЕсли;
			КонецЕсли;
		Иначе
			Если ТекСтр = Неопределено Тогда
				ТекСтр = ТЧ_Продукция.Добавить();
			КонецЕсли;

			ЗаполнитьЗначенияСвойств(ТекСтр, Стр);
		КонецЕсли;
	КонецЦикла;

	ТЧ_Продукция.Сортировать("Номенклатура");

	ЗначениеВРеквизитФормы(ТекОбъект, "Объект");

	ЗаполнитьРасходМатериалов();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуБезФабрикатаЗавершение(Результат, ДополнительныеПераметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Модифицированность = Истина;
	ОформитьСтрокуПродукцииБезФабриката(Результат);
	ПоказатьТовары();

	МассивСтрок = Продукция.НайтиСтроки(Новый Структура("Номенклатура", ДополнительныеПераметры.Номенклатура));
	Если МассивСтрок.Количество() > 0 Тогда
		Стр = МассивСтрок[0];
		Идентиф = Стр.ПолучитьИдентификатор();
		Элементы.Продукция.ТекущаяСтрока = Идентиф;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОформитьСтрокуПродукцииБезФабриката(Данные)
	ТекОбъект = РеквизитФормыВЗначение("Объект");

	ТЧ_Продукция = ТекОбъект.Продукция;

	ТекСтр = ТЧ_Продукция.Найти(Данные.Номенклатура, "Номенклатура");

	Если Данные.КоличествоПлан = 0 Тогда
		Если ТекСтр <> Неопределено Тогда
			ТЧ_Продукция.Удалить(ТекСтр);
		КонецЕсли;

	Иначе
		Если ТекСтр = Неопределено Тогда
			ТекСтр = ТЧ_Продукция.Добавить();
		КонецЕсли;

		ЗаполнитьЗначенияСвойств(ТекСтр, Данные);

		ТЧ_Продукция.Сортировать("Номенклатура");
	КонецЕсли;

	ЗначениеВРеквизитФормы(ТекОбъект, "Объект");

	ЗаполнитьРасходМатериалов();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРасходМатериалов()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Продукция", Объект.Продукция.Выгрузить());
	Запрос.УстановитьПараметр("Фабрикаты", Объект.Фабрикаты.Выгрузить());
	Запрос.УстановитьПараметр("Склад", Объект.Склад);
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Запрос.УстановитьПараметр("ВидыНоменклатуры", AMS_ВызовСервера.ВидыНоменклатурыФабрикаты());

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Номенклатура КАК Продукция,
	|	т.Спецификация КАК Спецификация,
	|	т.КоличествоПлан КАК КоличествоПлан,
	|	т.КоличествоФакт КАК КоличествоФакт
	|ПОМЕСТИТЬ п
	|ИЗ
	|	&Продукция КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Номенклатура КАК Фабрикат,
	|	т.Спецификация КАК Спецификация,
	|	т.КоличествоПлан КАК КоличествоПлан,
	|	т.КоличествоФакт КАК КоличествоФакт
	|ПОМЕСТИТЬ ф
	|ИЗ
	|	&Фабрикаты КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	п.Продукция КАК Продукция,
	|	СпецТ.Номенклатура КАК Номенклатура,
	|	п.КоличествоПлан * СпецТ.Количество КАК КоличествоПлан,
	|	п.КоличествоФакт * СпецТ.Количество КАК КоличествоФакт
	|ПОМЕСТИТЬ п1
	|ИЗ
	|	п КАК п
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры.Товары КАК СпецТ
	|		ПО п.Спецификация = СпецТ.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|		ПО СпецТ.Номенклатура = Ном.Ссылка
	|ГДЕ
	|	НЕ Ном.ВидНоменклатуры В (&ВидыНоменклатуры)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ф.Фабрикат КАК Фабрикат,
	|	СпецТ.Номенклатура КАК Номенклатура,
	|	ф.КоличествоПлан * СпецТ.Количество / СпецД.Количество КАК КоличествоПлан,
	|	ф.КоличествоФакт * СпецТ.Количество / СпецД.Количество КАК КоличествоФакт
	|ПОМЕСТИТЬ ф1
	|ИЗ
	|	ф КАК ф
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры.Товары КАК СпецТ
	|		ПО ф.Спецификация = СпецТ.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры КАК СпецД
	|		ПО ф.Спецификация = СпецД.Ссылка
	|ГДЕ
	|	НЕ СпецТ.Номенклатура.Код = ""01-00000017""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	п1.Продукция КАК Продукция,
	|	п1.Номенклатура КАК Номенклатура,
	|	п1.КоличествоПлан КАК КоличествоПлан,
	|	п1.КоличествоФакт КАК КоличествоФакт
	|ИЗ
	|	п1 КАК п1
	|
	|УПОРЯДОЧИТЬ ПО
	|	п1.Номенклатура.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ф1.Фабрикат КАК Фабрикат,
	|	ф1.Номенклатура КАК Номенклатура,
	|	ф1.КоличествоПлан КАК КоличествоПлан,
	|	ф1.КоличествоФакт КАК КоличествоФакт
	|ИЗ
	|	ф1 КАК ф1
	|
	|УПОРЯДОЧИТЬ ПО
	|	ф1.Номенклатура.Наименование";

	Рез = Запрос.ВыполнитьПакет();
	Объект.МатериалыПродукции.Загрузить(Рез[4].Выгрузить());
	Объект.МатериалыФабриката.Загрузить(Рез[5].Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПрочееОприходованиеТоваровВопросЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПараметрыЗаписи = Новый Структура("РежимЗаписи,РежимПроведения", РежимЗаписиДокумента.Проведение,
			РежимПроведенияДокумента.Неоперативный);
		Записать(ПараметрыЗаписи);
		ОткрытьФорму("Документ.ПрочееОприходованиеТоваров.ФормаОбъекта", ДополнительныеПараметры);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПеремещениеТоваровВопросЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПараметрыЗаписи = Новый Структура("РежимЗаписи,РежимПроведения", РежимЗаписиДокумента.Проведение,
			РежимПроведенияДокумента.Неоперативный);
		Записать(ПараметрыЗаписи);
		ОткрытьФорму("Документ.ПеремещениеТоваров.ФормаОбъекта", ДополнительныеПараметры);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВыборСоставаБригадыЗавершение(Результат, ДополнительныеПераметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Модифицированность = Истина;

	ЗаполнитьФасовкаБригады(Результат);

	ПоказатьБригады();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодборПродукцииДляФасовкиЗавершение(Результат, ДополнительныеПераметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Модифицированность = Истина;

	ЗаполнитьФасовкаПродукция(Результат);

	ПоказатьБригады();
КонецПроцедуры

&НаКлиенте
Процедура ОтчетНачисленоЗаСменуЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Записать();
		ПоказатьНачисленоЗаСмену();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтчетНачисленоСотрудникуЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Записать();
		ПоказатьНачисленоСотруднику();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтчетНачисленоЗаПериодЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Записать();
		ПоказатьНачисленоЗаПериод();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбратоткаКомандыЗаполнитьЗамесчикиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗаполнитьЗамесчикиНаСервере();
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбратоткаКомандыЗаполнитьМеханикиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗаполнитьТабМеханикиНаСервере();
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбратоткаКомандыЗаполнитьКладовщикиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗаполнитьКладовщикиНаСервере();
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбратоткаКомандыЗаполнитьГрузчикиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗаполнитьГрузчикиНаСервере();
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецОбласти