
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.ЦветКнопкиМенялся Тогда
		Элементы.КнопкаОбновлениеМодулей1С.ЦветФона = Новый Цвет(255,225,0);
	Иначе
		Элементы.КнопкаОбновлениеМодулей1С.ЦветФона = Новый Цвет();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовФормы

&НаКлиенте
Процедура QRкодПодключения(Команда)
	ФормаОбновления = ПолучитьФорму("Обработка.ДатаМобайл_АРМДиспетчера.Форма.ФормаQRКодПодключения");	
	ФормаОбновления.Открыть()
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьОбновление1С(Команда)
	
	Попытка 
		ПерейтиПоНавигационнойСсылке("https://disk.yandex.ru/d/pc1gUd45_du3WQ/DM_Windows_Android/1C/Online/UT11_KA2_ERP_UT3");
		ЭтаФорма.Закрыть();	
	Исключение 		
		ДатаМобайл_ОбщийМодульКлиент.СообщитьПользователю("Обновление доступно на https://data-mobile.ru/download/ ");		
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьОбновлениеDM(Команда)
	
	Попытка
		ПерейтиПоНавигационнойСсылке("https://disk.yandex.ru/d/pc1gUd45_du3WQ/DM_Windows_Android");
		ЭтаФорма.Закрыть();	
	Исключение 		
		ДатаМобайл_ОбщийМодульКлиент.СообщитьПользователю("Обновление доступно на https://data-mobile.ru/download/ ");		
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьИнструкцию(Команда)
	
	Попытка
		ПерейтиПоНавигационнойСсылке("https://docs.data-mobile.ru/datamobile/instruktsiya/");
		ЭтаФорма.Закрыть();	
	Исключение 		
		ДатаМобайл_ОбщийМодульКлиент.СообщитьПользователю("Инструкция доступна на https://docs.data-mobile.ru/datamobile/ ");		
	КонецПопытки;
		
КонецПроцедуры

#КонецОбласти
