#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда	

#Область ОбработчикиСобытий
	
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	// Если это рекурсивный вызов – ничего не делать.
	Если НЕ Параметры.Свойство("Рекурсия") Тогда
		СтандартнаяОбработка = Ложь;

		// Получить стандартный список выбора.
		Параметры.Вставить("Рекурсия");

		Список = ПолучитьДанныеВыбора(Параметры);

		Список.Очистить();
		
		Если Пользователи.РолиДоступны("_Цех1, _Цех3") Тогда
			Список.Добавить(Основной);
			
		Иначе 
			Список.Добавить(Основной);
			Список.Добавить(Дополнительный);
		КонецЕсли;
			
		ДанныеВыбора = Список;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти		

#КонецЕсли
