#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.Склад.Доступность = Ложь;
	
	Если Пользователи.РолиДоступны("_НачальникСклада,_КладовщикСклада") Тогда
		Запись.Склад = AMS_ВызовСервера.СкладПродукции();
		
	ИначеЕсли Пользователи.РолиДоступны("_Цех1") Тогда
		Запись.Склад = AMS_ВызовСервера.Цех1();
		
	ИначеЕсли Пользователи.РолиДоступны("_Цех2") Тогда
		Запись.Склад = AMS_ВызовСервера.Цех2();
		
	ИначеЕсли Пользователи.РолиДоступны("_Цех3") Тогда
		Запись.Склад = AMS_ВызовСервера.Цех3();
		
	Иначе

		Элементы.Склад.Доступность = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти