#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если Дата < '20260101' Тогда
		Возврат;
	КонецЕсли;

	Если Не (AMS_ВызовСервера.ЕстьПравоАМС(ПредопределенноеЗначение("Перечисление.AMS_Права.Продукция_ПроизводствоПередача"))
		Или AMS_ВызовСервера.ЕстьПравоАМС(ПредопределенноеЗначение("Перечисление.AMS_Права.Продукция_ПередачаНаСклад"))) Тогда
		Возврат;
	КонецЕсли;
	
	Если ПометкаУдаления Тогда
		Таб = Документы.AMS_ПроизводствоЗаСмену.ПолучитьДокументыПеремещенияПродукцииНаСклад(Ссылка);
		Если Не Таб = Неопределено Тогда
			ОбщегоНазначения.СообщитьПользователю(
				"Необходимо предварительно удалить документы перемещения продукции на склад продукции!", , , , Отказ);
		КонецЕсли;
		
		Таб = AMS_Сервер.ПолучитьДокументыПроизводстваПродукции(Ссылка);
		
		Для каждого Стр Из Таб Цикл
			мср.УстановитьПометкуУдаленияДокументу(Стр.ДокСсылка, Истина);
		КонецЦикла;

	ИначеЕсли ЗначениеЗаполнено(Ссылка) И Продукция.Количество() = 0 Тогда
		Таб = Документы.AMS_ПроизводствоЗаСмену.ПолучитьДокументыПеремещенияПродукцииНаСклад(Ссылка);
		Если Не Таб = Неопределено Тогда
			ОбщегоНазначения.СообщитьПользователю(
				"Необходимо предварительно удалить документы перемещения продукции на склад продукции!", , , , Отказ);
		КонецЕсли;

		Если Проведен Тогда
			РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения;
		Иначе
			РежимЗаписи = РежимЗаписиДокумента.Запись;
		КонецЕсли;

		ОчиститьДокумент();

	ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда  //Проверить, есть ли необходимость
		
		ЗаполнитьСтоимостьФабрикатов();
		ЗаполнитьСтоимостьПродукции();
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Сутки = 24 * 3600;
	
	Склад         = AMS_ВызовСервера.ПолучитьСвойСклад();
	Ответственный = Пользователи.ТекущийПользователь();
	
	СменаДневная  = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление._ПроизводственныеСмены.Дневная");
	СменаВечерняя = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление._ПроизводственныеСмены.Вечерняя");
	
	ЦехОсновной       = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление._МестаПроизводства.Основной");
	ЦехДополнительный = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление._МестаПроизводства.Дополнительный");


	Стр = ПолучитьДанныеПоследнегоДокумента();

	Если Стр = Неопределено Тогда
		ДатаДок = ТекущаяДатаСеанса();
		Смена   = СменаДневная;
		Цех     = ЦехОсновной;
	
	Иначе
		Если Склад = AMS_ВызовСервера.Цех2() Тогда
			Если Стр.Смена = СменаДневная И Стр.Цех = ЦехОсновной Тогда
				ДатаДок = Стр.Дата;
				Смена   = СменаДневная;
				Цех     = ЦехДополнительный;

			ИначеЕсли Стр.Смена = СменаДневная И Стр.Цех = ЦехДополнительный Тогда
				ДатаДок = Стр.Дата;
				Смена   = СменаВечерняя;
				Цех     = ЦехОсновной;

			ИначеЕсли Стр.Смена = СменаВечерняя И Стр.Цех = ЦехОсновной Тогда
				ДатаДок = Стр.Дата;
				Смена   = СменаВечерняя;
				Цех     = ЦехДополнительный;

			ИначеЕсли Стр.Смена = СменаВечерняя И Стр.Цех = ЦехДополнительный Тогда
				ДатаДок = Стр.Дата + Сутки;
				Смена   = СменаДневная;
				Цех     = ЦехОсновной;
			КонецЕсли;

		Иначе
			Если Стр.Смена = СменаДневная Тогда
				ДатаДок = Стр.Дата;
				Смена   = СменаВечерняя;
				Цех     = ЦехОсновной;
			Иначе
				ДатаДок = Стр.Дата + Сутки;
				Смена   = СменаДневная;
				Цех     = ЦехОсновной;
			КонецЕсли;
		КонецЕсли;

		Если Смена = СменаДневная Тогда
			Если ДеньНедели(ДатаДок) = 6 Тогда
				ДатаДок = ДатаДок + Сутки + Сутки;
			ИначеЕсли ДеньНедели(ДатаДок) = 7 Тогда
				ДатаДок = ДатаДок + Сутки;
			КонецЕсли;

			Если Цех = ЦехОсновной Тогда
				Дата = ДатаДок + AMS_ВызовСервера.ПолучитьВремя(9, 0);
			Иначе
				Дата = ДатаДок + AMS_ВызовСервера.ПолучитьВремя(9, 5);
			КонецЕсли;
		Иначе // Вечерняя
			Если Цех = ЦехОсновной Тогда
				Дата = ДатаДок + AMS_ВызовСервера.ПолучитьВремя(12, 0);
			Иначе
				Дата = ДатаДок + AMS_ВызовСервера.ПолучитьВремя(12, 5);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если Дата < '20260101' Тогда
		МассивНепроверяемыхРеквизитов = Новый Массив;
		МассивНепроверяемыхРеквизитов.Добавить("Цех");
		ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
		Возврат;
	КонецЕсли;

	МассивНепроверяемыхРеквизитов = Новый Массив;

	Если Не (Статус = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление._СтатусыПроизводства.Выполнено")
		Или Статус = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление._СтатусыПроизводства.РасчётЗарплаты")) Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("ДопРаботы.Количество");
		МассивНепроверяемыхРеквизитов.Добавить("ДопРаботы.Сумма");
	КонецЕсли;

	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);

	Если (Статус = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление._СтатусыПроизводства.ВРаботе") 
		Или Статус = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление._СтатусыПроизводства.РасчётЗарплаты") 
		Или Статус = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление._СтатусыПроизводства.Выполнено")) 
		И Дата > КонецДня(ТекущаяДатаСеанса()) Тогда

		ТекстОшибки = "Проведение будущей датой в статусе """ + Статус + """ запрещено.";
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , , , Отказ);
	КонецЕсли;

	Если Статус = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление._СтатусыПроизводства.План") 
		Или Статус = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление._СтатусыПроизводства.ВРаботе") Тогда

		Рез = ПолучитьДанныеДляПроверкиЗаполнения();
		
		//Есть ли документы с одинаковой датой и сменой и организацией?
		Если Не Рез.Дубликаты.Пустой() Тогда
			ОбщегоНазначения.СообщитьПользователю("Документ от " + Формат(Дата, "ДЛФ=ДД") + " для смены """ + Смена
				+ """ уже существует.", , , , Отказ);
		КонецЕсли;
		
		//Есть ли дневная смена?
		Если Смена	= ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление._ПроизводственныеСмены.Вечерняя")
			И Рез.ДневнаяСмена.Пустой() Тогда
			
			ОбщегоНазначения.СообщитьПользователю("Необходимо предварительно оформить документ для Дневной смены.",,,, Отказ);
		КонецЕсли;
		
		//Проверить количество замесов
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Сегмент", AMS_ВызовСервера.СегментыНоменклатурыФабрикатыСПереходящимОстатком());
		Запрос.УстановитьПараметр("Фабрикаты", Фабрикаты.Выгрузить(, "Номенклатура, КоличествоПлан"));
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	т.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ Фабрикаты
		|ИЗ
		|	&Фабрикаты КАК т
		|ГДЕ
		|	т.КоличествоПлан = 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	т.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ФабрикатыСПереходОст
		|ИЗ
		|	РегистрСведений.НоменклатураСегмента КАК т
		|ГДЕ
		|	т.Сегмент = &Сегмент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Фабрикаты.Номенклатура КАК Номенклатура
		|ИЗ
		|	Фабрикаты КАК Фабрикаты
		|ГДЕ
		|	НЕ Фабрикаты.Номенклатура В
		|		(ВЫБРАТЬ
		|		т.Номенклатура КАК Номенклатура
		|		ИЗ
		|		ФабрикатыСПереходОст КАК т)";
		
		Рез = Запрос.Выполнить();
		Выб = Рез.Выбрать();
		Пока Выб.Следующий() Цикл
			ТекстОшибки = """" + Выб.Номенклатура + """ - не указано количество замесов.";
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , , , Отказ);
		КонецЦикла;
	
		//Проверить для цехов 1 и 2 - должны передать всю продукция на склад
		Если (Статус = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление._СтатусыПроизводства.Выполнено")
			Или Статус = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление._СтатусыПроизводства.РасчётЗарплаты"))
			И (Склад = AMS_ВызовСервера.Цех1() Или Склад = AMS_ВызовСервера.Цех2()) Тогда

			Выб = Рез.Передано.Выбрать();
			Пока Выб.Следующий() Цикл
				Если Выб.Количество > 0 Тогда
					ТекстОшибки = "Продукция """ + Выб.Номенклатура + """ в количестве " + Выб.Количество + " "
						+ Выб.Упаковка + " не передана на склад.";
					ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , , , Отказ);
				Иначе
					ТекстОшибки = "Продукция """ + Выб.Номенклатура + """ в количестве " + Выб.Количество + " "
						+ Выб.Упаковка + " передана на склад в излишке.";
					ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , , , Отказ);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		//Достаточно ли материалов
		Если Статус = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление._СтатусыПроизводства.ВРаботе") Тогда
			Рез = ПолучитьДанныхПоРасходуМатериалов(Истина, Истина);
			
			Если Не Рез = Неопределено Тогда
				Сырье    = Рез.Сырье;
				Упаковка = Рез.Упаковка;
	
				Для Каждого Стр Из Сырье Цикл
					Если Стр.КонОстатокС < 0 Тогда
						ОбщегоНазначения.СообщитьПользователю("" + Стр.Номенклатура + " недостаточно на складе в количестве "
							+ Строка(-Стр.КонОстатокС) + " " + Стр.Ед, , , , Отказ);
					КонецЕсли;
				КонецЦикла;
	
				Для Каждого Стр Из Упаковка Цикл
					Если Стр.КонОстатокС < 0 Тогда
						ОбщегоНазначения.СообщитьПользователю("" + Стр.Номенклатура + " недостаточно на складе в количестве "
							+ Строка(-Стр.КонОстатокС) + " " + Стр.Ед, , , , Отказ);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Или Дата < '20260101' Тогда
		Возврат;
	КонецЕсли;
	
	Если Проведен Тогда
		ТабДокументов = AMS_Сервер.ПолучитьДокументыПроизводстваПродукции(Ссылка);
		
		ОформитьПеремещениеМатериаловВПроизводство(ТабДокументов, Отказ);
		
		Если Статус = ПредопределенноеЗначение("Перечисление._СтатусыПроизводства.Проект")
			Или Статус = ПредопределенноеЗначение("Перечисление._СтатусыПроизводства.План") Тогда
			
			Стр = ТабДокументов.Найти(Перечисления.AMS_ОперацииПроизводства.ПроизводствоФабрикатов);
			Если Не Стр = Неопределено И Стр.Проведен Тогда 
				мср.ЗаписатьДокумент(Стр.ДокСсылка, РежимЗаписиДокумента.ОтменаПроведения);
			КонецЕсли;

			Стр = ТабДокументов.Найти(Перечисления.AMS_ОперацииПроизводства.ПроизводствоПродукции);
			Если Не Стр = Неопределено И Стр.Проведен Тогда 
				мср.ЗаписатьДокумент(Стр.ДокСсылка, РежимЗаписиДокумента.ОтменаПроведения);
			КонецЕсли;

			Стр = ТабДокументов.Найти(Перечисления.AMS_ОперацииПроизводства.СписаниеМатериаловСПроизводства);
			Если Не Стр = Неопределено И Стр.Проведен Тогда 
				мср.ЗаписатьДокумент(Стр.ДокСсылка, РежимЗаписиДокумента.ОтменаПроведения);
			КонецЕсли;
			
			Стр = ТабДокументов.Найти(Перечисления.AMS_ОперацииПроизводства.СписаниеФабрикатаСПроизводства);
			Если Не Стр = Неопределено И Стр.Проведен Тогда 
				мср.ЗаписатьДокумент(Стр.ДокСсылка, РежимЗаписиДокумента.ОтменаПроведения);
			КонецЕсли;

		ИначеЕсли Статус = ПредопределенноеЗначение("Перечисление._СтатусыПроизводства.ВРаботе") Тогда
			ОформитьПроизводствоФабриката(ТабДокументов, Отказ);
			ОформитьПроизводствоПродукции(ТабДокументов, Отказ);
			
			Стр = ТабДокументов.Найти(Перечисления.AMS_ОперацииПроизводства.СписаниеМатериаловСПроизводства);
			Если Не Стр = Неопределено И Стр.Проведен Тогда 
				мср.ЗаписатьДокумент(Стр.ДокСсылка, РежимЗаписиДокумента.ОтменаПроведения);
			КонецЕсли;

			Стр = ТабДокументов.Найти(Перечисления.AMS_ОперацииПроизводства.СписаниеФабрикатаСПроизводства);
			Если Не Стр = Неопределено И Стр.Проведен Тогда 
				мср.ЗаписатьДокумент(Стр.ДокСсылка, РежимЗаписиДокумента.ОтменаПроведения);
			КонецЕсли;
		
		ИначеЕсли Статус = ПредопределенноеЗначение("Перечисление._СтатусыПроизводства.РасчётЗарплаты") 
			Или Статус = ПредопределенноеЗначение("Перечисление._СтатусыПроизводства.Выполнено") Тогда
			
			// Это право есть у кладовщиков 1 и 2 цеха
			Если AMS_ВызовСервера.ЕстьПравоАМС(ПредопределенноеЗначение("Перечисление.AMS_Права.Продукция_ПередачаНаСклад"))
				И Не AMS_ВызовСервера.ЭтоKhors() Тогда
				Возврат;
			КонецЕсли;		
	
			ОформитьПроизводствоФабриката(ТабДокументов, Отказ);
			ОформитьПроизводствоПродукции(ТабДокументов, Отказ);
			ОформитьСписаниеМатериалов(ТабДокументов, Отказ);
			ОформитьСписаниеФабриката(ТабДокументов, Отказ);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если Дата < '20260101' Тогда
		Возврат;
	КонецЕсли;

	Подразделение = мср.СоответствиеЦехПодразделение().Получить(Склад);

	Рез = ПолучитьНачисления();

	Выб = Рез.Выбрать();

	Движения._Зарплата.Записывать = Истина;

	Пока Выб.Следующий() Цикл
		Движение = Движения._Зарплата.Добавить();
		Движение.Период = Дата;
		Движение.Подразделение = Подразделение;
		Движение.Сотрудник = Выб.Сотрудник;
		Движение.Работа = Выб.Работа;
		Движение.Сумма = Выб.Сумма;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	ОтменитьПроведениеПодчиненныхДокументов(Отказ);
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Дата      = ТекущаяДатаСеанса();
	Статус    = ПредопределенноеЗначение("Перечисление._СтатусыПроизводства.Проект");
	Утвержден = Ложь;

	Для Каждого Стр Из Продукция Цикл
		Стр.КоличествоФакт = 0;
	КонецЦикла;

	Для Каждого Стр Из Фабрикаты Цикл
		Стр.КоличествоФакт  = 0;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОформитьПеремещениеМатериаловВПроизводство(ТабДокументов, Отказ)
	Товары = ПолучитьПеремещениеМатериаловВПроизводство();
	
	Стр = ТабДокументов.Найти(Перечисления.AMS_ОперацииПроизводства.ПеремещениеМатериаловВПроизводство);
	
	Если Товары.Количество() > 0 Тогда 
		Если Стр = Неопределено Тогда 
			Док = Документы.ПеремещениеТоваров.СоздатьДокумент();
		Иначе 
			Док = Стр.ДокСсылка.ПолучитьОбъект();
			Если Стр.ПометкаУдаления Тогда
				Док.УстановитьПометкуУдаления(Ложь);
			КонецЕсли;
		КонецЕсли;
			
		Док.Дата                       = Дата;
		Док.Организация                = Организация;
		Док.Статус                     = Перечисления.СтатусыПеремещенийТоваров.Принято;
		Док.СкладОтправитель           = Склад;
		Док.СкладПолучатель            = мср.ПолучитьСкладМатериаловВПроизводстве(Склад);
		Док.ВидЦены                    = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Склад, "УчетныйВидЦены");
		Док.СпособДоставки             = Перечисления.СпособыДоставки.Самовывоз;
		Док.ВариантПриемкиТоваров      = Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным;
		Док.ПеремещениеПодДеятельность = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
		Док.ХозяйственнаяОперация      = Перечисления.ХозяйственныеОперации.ПеремещениеТоваров;
		Док.Ответственный              = Ответственный;
		Док.Автор                      = Ответственный;
		Док.Подразделение              = AMS_ВызовСервера.ПодразделениеПроизводство();
		Док.НаправлениеДеятельности    = Справочники.НаправленияДеятельности.НайтиПоНаименованию("Продажа", Истина);
		Док._ОперацияПроизводства      = Перечисления.AMS_ОперацииПроизводства.ПеремещениеМатериаловВПроизводство;
		Док._Основание                 = Ссылка;
		Док.Комментарий                = "Сформирован автоматичестки. Перемещение материалов в производство. Производство товаров за смену №"
											+ Номер + " от " + Формат(Дата, "ДЛФ=Д") + " г. " + Смена + " смена.";

		Док.Товары.Загрузить(Товары);

		мср.ЗаписатьДокумент(Док, РежимЗаписиДокумента.Проведение, Отказ, Истина);

	Иначе // нет товара
		Если Не Стр = Неопределено И ЗначениеЗаполнено(Стр.ДокСсылка) Тогда
			мср.УстановитьПометкуУдаленияДокументу(Стр.ДокСсылка, Истина);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
Функция ПолучитьПеремещениеМатериаловВПроизводство()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Статус", Статус);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ВидыНоменклатуры", AMS_ВызовСервера.ВидыНоменклатурыФабрикаты());

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.Спецификация КАК Спецификация,
	|	т.КоличествоПлан КАК КоличествоПлан
	|ПОМЕСТИТЬ ф
	|ИЗ
	|	Документ.AMS_ПроизводствоЗаСмену.Фабрикаты КАК т
	|ГДЕ
	|	т.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СпецТ.Номенклатура КАК Номенклатура,
	|	СУММА(СпецТ.Количество * ф.КоличествоПлан / СпецД.Количество) КАК Количество,
	|	1 КАК ТипМатериала
	|ПОМЕСТИТЬ фм
	|ИЗ
	|	ф КАК ф
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры КАК СпецД
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры.Товары КАК СпецТ
	|			ПО СпецД.Ссылка = СпецТ.Ссылка
	|		ПО ф.Спецификация = СпецД.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|		ПО СпецТ.Номенклатура = Ном.Ссылка
	|ГДЕ
	|	НЕ СпецТ.Номенклатура.Код = ""01-00000017""
	|	И НЕ Ном.ВидНоменклатуры В (&ВидыНоменклатуры)
	|СГРУППИРОВАТЬ ПО
	|	СпецТ.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.Спецификация КАК Спецификация,
	|	т.КоличествоПлан КАК КоличествоПлан,
	|	т.КоличествоФакт КАК КоличествоФакт
	|ПОМЕСТИТЬ п
	|ИЗ
	|	Документ.AMS_ПроизводствоЗаСмену.Продукция КАК т
	|ГДЕ
	|	т.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СпецТ.Номенклатура КАК Номенклатура,
	|	СУММА(ВЫБОР
	|		КОГДА &Статус В (ЗНАЧЕНИЕ(Перечисление._СтатусыПроизводства.Выполнено),
	|			ЗНАЧЕНИЕ(Перечисление._СтатусыПроизводства.РасчётЗарплаты))
	|			ТОГДА п.КоличествоФакт
	|		ИНАЧЕ п.КоличествоПлан
	|	КОНЕЦ * СпецТ.Количество) КАК Количество,
	|	2 КАК ТипМатериала
	|ПОМЕСТИТЬ пм
	|ИЗ
	|	п КАК п
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры.Товары КАК СпецТ
	|		ПО п.Спецификация = СпецТ.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|		ПО СпецТ.Номенклатура = Ном.Ссылка
	|ГДЕ
	|	НЕ Ном.ВидНоменклатуры В (&ВидыНоменклатуры)
	|СГРУППИРОВАТЬ ПО
	|	СпецТ.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	фм.Номенклатура КАК Номенклатура,
	|	фм.Количество КАК Количество,
	|	фм.Количество КАК КоличествоУпаковок,
	|	Ном.Наименование КАК Наименование,
	|	фм.ТипМатериала КАК ТипМатериала
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	фм КАК фм
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|		ПО фм.Номенклатура = Ном.Ссылка
	|ГДЕ
	|	фм.Количество > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	пм.Номенклатура,
	|	пм.Количество,
	|	пм.Количество,
	|	Ном.Наименование,
	|	пм.ТипМатериала
	|ИЗ
	|	пм КАК пм
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|		ПО пм.Номенклатура = Ном.Ссылка
	|ГДЕ
	|	пм.Количество > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.Номенклатура КАК Номенклатура,
	|	вт.Количество КАК Количество,
	|	вт.КоличествоУпаковок КАК КоличествоУпаковок
	|ИЗ
	|	вт КАК вт
	|
	|УПОРЯДОЧИТЬ ПО
	|	вт.ТипМатериала,
	|	вт.Наименование";

	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Процедура ОформитьПроизводствоФабриката(ТабДокументов, Отказ)
	Товары = ПолучитьПроизводствоФабриката();
	
	Стр = ТабДокументов.Найти(Перечисления.AMS_ОперацииПроизводства.ПроизводствоФабрикатов);
	
	Если Товары.Количество() > 0 Тогда 
		Если Стр = Неопределено Тогда 
			Док = Документы.ПрочееОприходованиеТоваров.СоздатьДокумент();
		Иначе 
			Док = Стр.ДокСсылка.ПолучитьОбъект();
			Если Стр.ПометкаУдаления Тогда
				Док.УстановитьПометкуУдаления(Ложь);
			КонецЕсли;
		КонецЕсли;

		Док.Дата                  = Дата;
		Док.Организация           = Организация;
		Док.Склад                 = Склад;
		Док.ВидЦены               = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Склад, "УчетныйВидЦены");
		Док.Подразделение         = мср.СоответствиеЦехПодразделение().Получить(Склад);
		Док.Ответственный         = Ответственный;
		Док.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеИзПроизводства;
		Док.Валюта                = Константы.ВалютаУправленческогоУчета.Получить();
		Док.ВариантПриемкиТоваров = Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным;
		Док.Комментарий           = "Сформирован автоматичестки. Оформление поступление произведённого фабриката. Производство товаров за смену №"
										+ Номер + " от " + Формат(Дата, "ДЛФ=Д") + " г. " + Смена + " смена.";

		Док._ЭтапПроизводства         = 1;        //Удалить
		Док._Производство             = Истина;   //Удалить
		Док._ПроизводствоЗаСмену      = Ссылка;   //Удалить

		Док._Основание                = Ссылка;
		Док._ОперацияПроизводства     = Перечисления.AMS_ОперацииПроизводства.ПроизводствоФабрикатов;
		Док._СформированАвтоматически = Истина;

		Док.Товары.Загрузить(Товары);

		мср.ЗаписатьДокумент(Док, РежимЗаписиДокумента.Проведение, Отказ, Истина);

	Иначе // нет товара
		Если Не Стр = Неопределено И ЗначениеЗаполнено(Стр.ДокСсылка) Тогда
			мср.УстановитьПометкуУдаленияДокументу(Стр.ДокСсылка, Истина);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
Функция ПолучитьПроизводствоФабриката()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Подразделение", мср.СоответствиеЦехПодразделение().Получить(Склад));
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("ВидЗапасов", ПолучитьВидЗапасов());
	Запрос.УстановитьПараметр("ВидыНоменклатуры", AMS_ВызовСервера.ВидыНоменклатурыФабрикаты());
	Запрос.УстановитьПараметр("СтатьяРасходов", ПланыВидовХарактеристик.СтатьиРасходов.НайтиПоКоду("01-000081"));

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.КоличествоПлан КАК КоличествоПлан,
	|	т.Цена КАК Цена
	|ПОМЕСТИТЬ ф
	|ИЗ
	|	Документ.AMS_ПроизводствоЗаСмену.Фабрикаты КАК т
	|ГДЕ
	|	т.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ф.Номенклатура КАК Номенклатура,
	|	ф.КоличествоПлан КАК Количество,
	|	ф.КоличествоПлан КАК КоличествоУпаковок,
	|	ф.Цена КАК Цена,
	|	ф.КоличествоПлан * ф.Цена КАК Сумма,
	|	Ном.Наименование КАК Наименование
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	ф КАК ф
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|		ПО ф.Номенклатура = Ном.Ссылка
	|ГДЕ
	|	Ном.ВидНоменклатуры В (&ВидыНоменклатуры)
	|	И ф.КоличествоПлан > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.Номенклатура КАК Номенклатура,
	|	т.КлючАналитики КАК КлючАналитики
	|ПОМЕСТИТЬ АналНом
	|ИЗ
	|	вт КАК вт
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК т
	|		ПО вт.Номенклатура = т.Номенклатура
	|		И т.МестоХранения = &Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НЕОПРЕДЕЛЕНО КАК АналитикаАктивовПассивов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаДоходов,
	|	ЛОЖЬ КАК АналитикаДоходовОбязательна,
	|	&Подразделение КАК АналитикаРасходов,
	|	ЛОЖЬ КАК АналитикаРасходовЗаказРеализация,
	|	ИСТИНА КАК АналитикаРасходовОбязательна,
	|	АналНом.КлючАналитики КАК АналитикаУчетаНоменклатуры,
	|	ЛОЖЬ КАК ВедетсяУчетПоГТД,
	|	&ВидЗапасов КАК ВидЗапасов,
	|	"""" КАК ВидыЗапасов,
	|	ЛОЖЬ КАК ИнвентарныйУчет,
	|	вт.Количество КАК Количество,
	|	вт.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеОтправителя,
	|	вт.Номенклатура КАК Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка) КАК НомерГТД,
	|	ЗНАЧЕНИЕ(Справочник.ПартииТМЦВЭксплуатации.ПустаяСсылка) КАК ПартияТМЦВЭксплуатации,
	|	"""" КАК ПредставлениеОтраженияВРеглУчете,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	ЗНАЧЕНИЕ(Документ.ВнутреннееПотребление.ПустаяСсылка) КАК СписаниеНаРасходы,
	|	0 КАК СтатусУказанияСерий,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.ПустаяСсылка) КАК СтатьяДоходов,
	|	&СтатьяРасходов КАК СтатьяРасходовДоходов,
	|	ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка) КАК СтранаПроисхождения,
	|	"""" КАК Субконто1,
	|	"""" КАК Субконто2,
	|	"""" КАК Субконто3,
	|	вт.Сумма КАК Сумма,
	|	"""" КАК СчетУчета,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар) КАК ТипНоменклатуры,
	|	1 КАК ТипСтатьи,
	|	ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка) КАК ФизическоеЛицо,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	ЛОЖЬ КАК ХарактеристикиИспользуются,
	|	вт.Цена КАК Цена
	|ИЗ
	|	вт КАК вт
	|		ЛЕВОЕ СОЕДИНЕНИЕ АналНом КАК АналНом
	|		ПО вт.Номенклатура = АналНом.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	вт.Наименование";

	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Процедура ОформитьПроизводствоПродукции(ТабДокументов, Отказ) 
	Табл = ПолучитьПроизводствоПродукции();
	
	Если Склад = AMS_ВызовСервера.Цех4() Тогда 
		Стр = ТабДокументов.Найти(Перечисления.AMS_ОперацииПроизводства.ПроизводствоФлаконов);
	Иначе
		Стр = ТабДокументов.Найти(Перечисления.AMS_ОперацииПроизводства.ПроизводствоПродукции);
	КонецЕсли;
	
	Если Табл.Количество() = 0 И Не Стр = Неопределено И ЗначениеЗаполнено(Стр.ДокСсылка) Тогда
		мср.УстановитьПометкуУдаленияДокументу(Стр.ДокСсылка, Истина);
		Возврат;
	КонецЕсли;
	
	Если Стр = Неопределено Тогда 
		Док = Документы.ПрочееОприходованиеТоваров.СоздатьДокумент();
	Иначе 
		Док = Стр.ДокСсылка.ПолучитьОбъект();
		Если Стр.ПометкаУдаления Тогда
			Док.УстановитьПометкуУдаления(Ложь);
		КонецЕсли;
	КонецЕсли;

	Док.Дата = Дата;
	Если Смена = ПредопределенноеЗначение("Перечисление._ПроизводственныеСмены.Дневная") Тогда
		AMS_Сервер.УстановитьВремяДокумента(Док,"ПрочееОприходованиеТоваров",AMS_ВызовСервера.ПолучитьВремя(9,0),AMS_ВызовСервера.ПолучитьВремя(9,1));
	Иначе
		AMS_Сервер.УстановитьВремяДокумента(Док,"ПрочееОприходованиеТоваров",AMS_ВызовСервера.ПолучитьВремя(12,0),AMS_ВызовСервера.ПолучитьВремя(12,1));
	КонецЕсли;
	
	Док.Организация           = Организация;
	Док.Склад                 = Склад;
	Док.ВидЦены               = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Склад, "УчетныйВидЦены");
	Док.Подразделение         = мср.СоответствиеЦехПодразделение().Получить(Склад);
	Док.Ответственный         = Ответственный;
	Док.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеИзПроизводства;
	Док.Валюта                = Константы.ВалютаУправленческогоУчета.Получить();
	Док.ВариантПриемкиТоваров = Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным;
	Док.Комментарий           = "Сформирован автоматичестки. Оформление поступление произведённой продукции. Производство товаров за смену №"
								+ Номер + " от " + Формат(Дата, "ДЛФ=Д") + " г. " + Смена + " смена.";

	Док._ЭтапПроизводства         = 2; //Удалить
	Док._Производство             = Истина; //Удалить
	Док._ПроизводствоЗаСмену      = Ссылка; //Удалить

	Док._СформированАвтоматически = Истина;
	Док._Основание                = Ссылка;
	Если Склад = AMS_ВызовСервера.Цех4() Тогда 
		Док._ОперацияПроизводства = Перечисления.AMS_ОперацииПроизводства.ПроизводствоФлаконов;
	Иначе
		Док._ОперацияПроизводства = Перечисления.AMS_ОперацииПроизводства.ПроизводствоПродукции;
	КонецЕсли;

	Товары = Док.Товары; Товары.Очистить();
	Серии  = Док.Серии; Серии.Очистить();
	
	Для Каждого Стр Из Табл Цикл
		НовСтр = Товары.Добавить();
		
		ЗаполнитьЗначенияСвойств(НовСтр, Стр);

		Если Стр.ИспользоватьСрокГодности Тогда
			
			НовСтр.СтатусУказанияСерий           = 8;
			НовСтр.СтатусУказанияСерийПолучатель = 8;

			ВидНоменклатуры = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Стр.Номенклатура, "ВидНоменклатуры");
			Серия           = AMS_ВызовСервера.ПолучитьСрокГодности(Стр.ДатаПроизводства, Стр.ГоденДо, ВидНоменклатуры);
			
			Если ЗначениеЗаполнено(Серия) Тогда
				СтрСерии = Серии.Добавить();
				
				СтрСерии.Номенклатура = НовСтр.Номенклатура;
				СтрСерии.Количество   = НовСтр.Количество;
				СтрСерии.Серия        = Серия;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	мср.ЗаписатьДокумент(Док, РежимЗаписиДокумента.Проведение, Отказ, Истина);
КонецПроцедуры
Функция ПолучитьПроизводствоПродукции()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Подразделение", мср.СоответствиеЦехПодразделение().Получить(Склад));
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ВидЗапасов", ПолучитьВидЗапасов());
	Запрос.УстановитьПараметр("СтатьяРасходов", ПланыВидовХарактеристик.СтатьиРасходов.НайтиПоКоду("01-000081"));
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.КоличествоФакт КАК КоличествоФакт,
	|	т.Цена КАК Цена
	|ПОМЕСТИТЬ п
	|ИЗ
	|	Документ.AMS_ПроизводствоЗаСмену.Продукция КАК т
	|ГДЕ
	|	т.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ном.Артикул КАК Артикул,
	|	п.Номенклатура КАК Номенклатура,
	|	Ном._Упаковка КАК Упаковка,
	|	п.КоличествоФакт * Ном.КоэффициентЕдиницыДляОтчетов КАК Количество,
	|	п.КоличествоФакт КАК КоличествоУпаковок,
	|	п.Цена КАК Цена,
	|	п.КоличествоФакт * п.Цена КАК Сумма,
	|	Ном.Наименование КАК Наименование,
	|	Ном.ВидНоменклатуры КАК ВидНоменклатуры,
	|	Ном.ВидНоменклатуры.ИспользоватьСрокГодностиСерии КАК ИспользоватьСрокГодности,
	|	НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) КАК ДатаПроизводства,
	|	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, Ном.СрокГодности), ДЕНЬ) КАК ГоденДо
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	п КАК п
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|		ПО п.Номенклатура = Ном.Ссылка
	|ГДЕ
	|	п.КоличествоФакт > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.Номенклатура КАК Номенклатура,
	|	т.КлючАналитики КАК КлючАналитики
	|ПОМЕСТИТЬ АналНом
	|ИЗ
	|	вт КАК вт
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК т
	|		ПО вт.Номенклатура = т.Номенклатура
	|		И т.МестоХранения = &Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НЕОПРЕДЕЛЕНО КАК АналитикаАктивовПассивов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаДоходов,
	|	ЛОЖЬ КАК АналитикаДоходовОбязательна,
	|	&Подразделение КАК АналитикаРасходов,
	|	ЛОЖЬ КАК АналитикаРасходовЗаказРеализация,
	|	ИСТИНА КАК АналитикаРасходовОбязательна,
	|	АналНом.КлючАналитики КАК АналитикаУчетаНоменклатуры,
	|	вт.Артикул КАК Артикул,
	|	ЛОЖЬ КАК ВедетсяУчетПоГТД,
	|	&ВидЗапасов КАК ВидЗапасов,
	|	"""" КАК ВидыЗапасов,
	|	ЛОЖЬ КАК ИнвентарныйУчет,
	|	вт.Количество КАК Количество,
	|	вт.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеОтправителя,
	|	вт.Номенклатура КАК Номенклатура,
	|	вт.ВидНоменклатуры КАК ВидНоменклатуры,
	|	вт.ИспользоватьСрокГодности КАК ИспользоватьСрокГодности,
	|	вт.ДатаПроизводства КАК ДатаПроизводства,
	|	вт.ГоденДо КАК ГоденДо,
	|	ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка) КАК НомерГТД,
	|	ЗНАЧЕНИЕ(Справочник.ПартииТМЦВЭксплуатации.ПустаяСсылка) КАК ПартияТМЦВЭксплуатации,
	|	"""" КАК ПредставлениеОтраженияВРеглУчете,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	ЗНАЧЕНИЕ(Документ.ВнутреннееПотребление.ПустаяСсылка) КАК СписаниеНаРасходы,
	|	0 КАК СтатусУказанияСерий,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.ПустаяСсылка) КАК СтатьяДоходов,
	|	&СтатьяРасходов КАК СтатьяРасходовДоходов,
	|	ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка) КАК СтранаПроисхождения,
	|	"""" КАК Субконто1,
	|	"""" КАК Субконто2,
	|	"""" КАК Субконто3,
	|	вт.Сумма КАК Сумма,
	|	"""" КАК СчетУчета,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар) КАК ТипНоменклатуры,
	|	1 КАК ТипСтатьи,
	|	вт.Упаковка КАК Упаковка,
	|	ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка) КАК ФизическоеЛицо,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	ЛОЖЬ КАК ХарактеристикиИспользуются,
	|	вт.Цена КАК Цена
	|ИЗ
	|	вт КАК вт
	|		ЛЕВОЕ СОЕДИНЕНИЕ АналНом КАК АналНом
	|		ПО вт.Номенклатура = АналНом.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	вт.Наименование";
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Процедура ОформитьСписаниеМатериалов(ТабДокументов, Отказ)
	Товары = ПолучитьСписаниеМатериалов();
	
	Стр = ТабДокументов.Найти(Перечисления.AMS_ОперацииПроизводства.СписаниеМатериаловСПроизводства);
	
	Если Товары.Количество() > 0 Тогда 
		Если Стр = Неопределено Тогда 
			Док = Документы.ВнутреннееПотребление.СоздатьДокумент();
		Иначе 
			Док = Стр.ДокСсылка.ПолучитьОбъект();
			Если Стр.ПометкаУдаления Тогда
				Док.УстановитьПометкуУдаления(Ложь);
			КонецЕсли;
		КонецЕсли;

		Док.Дата                  = Дата + 360;
		Док.Организация           = Организация;
		Док.Склад                 = мср.ПолучитьСкладМатериаловВПроизводстве(Склад);
		Док.Подразделение         = мср.СоответствиеЦехПодразделение().Получить(Склад);
		Док.Ответственный         = Ответственный;
		Док.ВидЦены               = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Склад, "УчетныйВидЦены");
		Док.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию;
		Док.Комментарий           = "Сформирован автоматичестки. Оформление списания материалов из производства. Производство товаров за смену №"
									+ Номер + " от " + Формат(Дата, "ДЛФ=Д") + " г. " + Смена + " смена.";

		Док._Основание                = Ссылка;
		Док._ОперацияПроизводства     = Перечисления.AMS_ОперацииПроизводства.СписаниеМатериаловСПроизводства;
		Док._СформированАвтоматически = Истина;

		Док.Товары.Загрузить(Товары);

		мср.ЗаписатьДокумент(Док, РежимЗаписиДокумента.Проведение, Отказ, Истина);

	Иначе // нет товара
		Если Не Стр = Неопределено И ЗначениеЗаполнено(Стр.ДокСсылка) Тогда
			мср.УстановитьПометкуУдаленияДокументу(Стр.ДокСсылка, Истина);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
Функция ПолучитьСписаниеМатериалов()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("ВидыНоменклатуры", AMS_ВызовСервера.ВидыНоменклатурыФабрикаты());
	Запрос.УстановитьПараметр("СтатьяРасходов", ПланыВидовХарактеристик.СтатьиРасходов.НайтиПоКоду("01-000082"));
	Запрос.УстановитьПараметр("АналитикаРасходов", Справочники.ПрочиеРасходы.НайтиПоНаименованию(
		"Материалы в производство", Истина));

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.Спецификация КАК Спецификация,
	|	т.КоличествоПлан КАК Количество
	|ПОМЕСТИТЬ ф
	|ИЗ
	|	Документ.AMS_ПроизводствоЗаСмену.Фабрикаты КАК т
	|ГДЕ
	|	т.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СпецТ.Номенклатура КАК Номенклатура,
	|	СУММА(СпецТ.Количество * ф.Количество / СпецД.Количество) КАК Количество,
	|	1 КАК ТипМатериала
	|ПОМЕСТИТЬ фм
	|ИЗ
	|	ф КАК ф
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры КАК СпецД
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры.Товары КАК СпецТ
	|			ПО СпецД.Ссылка = СпецТ.Ссылка
	|		ПО ф.Спецификация = СпецД.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|		ПО СпецТ.Номенклатура = Ном.Ссылка
	|ГДЕ
	|	НЕ СпецТ.Номенклатура.Код = ""01-00000017""
	|	И НЕ Ном.ВидНоменклатуры В (&ВидыНоменклатуры)
	|СГРУППИРОВАТЬ ПО
	|	СпецТ.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.Спецификация КАК Спецификация,
	|	т.КоличествоФакт КАК Количество
	|ПОМЕСТИТЬ п
	|ИЗ
	|	Документ.AMS_ПроизводствоЗаСмену.Продукция КАК т
	|ГДЕ
	|	т.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СпецТ.Номенклатура КАК Номенклатура,
	|	СУММА(п.Количество * СпецТ.Количество) КАК Количество,
	|	2 КАК ТипМатериала
	|ПОМЕСТИТЬ пм
	|ИЗ
	|	п КАК п
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры.Товары КАК СпецТ
	|		ПО п.Спецификация = СпецТ.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|		ПО СпецТ.Номенклатура = Ном.Ссылка
	|ГДЕ
	|	НЕ Ном.ВидНоменклатуры В (&ВидыНоменклатуры)
	|СГРУППИРОВАТЬ ПО
	|	СпецТ.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	фм.Номенклатура КАК Номенклатура,
	|	фм.Количество КАК Количество,
	|	фм.Количество КАК КоличествоУпаковок,
	|	Ном.ТипНоменклатуры КАК ТипНоменклатуры,
	|	Ном.Наименование КАК Наименование,
	|	фм.ТипМатериала КАК ТипМатериала
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	фм КАК фм
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|		ПО фм.Номенклатура = Ном.Ссылка
	|ГДЕ
	|	фм.Количество > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	пм.Номенклатура,
	|	пм.Количество,
	|	пм.Количество,
	|	NULL,
	|	Ном.Наименование,
	|	пм.ТипМатериала
	|ИЗ
	|	пм КАК пм
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|		ПО пм.Номенклатура = Ном.Ссылка
	|ГДЕ
	|	пм.Количество > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.Номенклатура КАК Номенклатура,
	|	вт.Количество КАК Количество,
	|	вт.КоличествоУпаковок КАК КоличествоУпаковок,
	|	&СтатьяРасходов КАК СтатьяРасходов,
	|	&АналитикаРасходов КАК АналитикаРасходов,
	|	вт.ТипНоменклатуры КАК ТипНоменклатуры,
	|	АналНом.КлючАналитики КАК АналитикаУчетаНоменклатуры,
	|	1 КАК ТипСтатьи
	|ИЗ
	|	вт КАК вт
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналНом
	|		ПО вт.Номенклатура = АналНом.Номенклатура
	|		И АналНом.МестоХранения = &Склад
	|
	|УПОРЯДОЧИТЬ ПО
	|	вт.ТипМатериала,
	|	вт.Наименование";

	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Процедура ОформитьСписаниеФабриката(ТабДокументов, Отказ)
	Товары = ПолучитьСписаниеФабриката();
	
	Стр = ТабДокументов.Найти(Перечисления.AMS_ОперацииПроизводства.СписаниеФабрикатаСПроизводства);
	
	Если Товары.Количество() > 0 Тогда 
		Если Стр = Неопределено Тогда 
			Док = Документы.ВнутреннееПотребление.СоздатьДокумент();
		Иначе 
			Док = Стр.ДокСсылка.ПолучитьОбъект();
			
			Если Стр.ПометкаУдаления Тогда
				Док.УстановитьПометкуУдаления(Ложь);
			КонецЕсли;
		КонецЕсли;

		Док.Дата                  = Дата + 360;
		Док.Организация           = Организация;
		Док.Склад                 = Склад;
		Док.Подразделение         = мср.СоответствиеЦехПодразделение().Получить(Склад);
		Док.Ответственный         = Ответственный;
		Док.ВидЦены               = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Склад, "УчетныйВидЦены");
		Док.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию;
		Док.Комментарий           = "Сформирован автоматичестки. Оформление списания фабриката с цеха. Производство товаров за смену №"
									+ Номер + " от " + Формат(Дата, "ДЛФ=Д") + " г. " + Смена + " смена.";

		Док._Основание                = Ссылка;
		Док._ОперацияПроизводства     = Перечисления.AMS_ОперацииПроизводства.СписаниеФабрикатаСПроизводства;
		Док._СформированАвтоматически = Истина;

		Док.Товары.Загрузить(Товары);

		Для Каждого Стр Из Товары Цикл
			ТекСтр = Фабрикаты.Найти(Стр.Номенклатура);

			Если Не ТекСтр = Неопределено Тогда
				ТекСтр.КоличествоФакт = Стр.Количество;
			КонецЕсли;
		КонецЦикла;

		мср.ЗаписатьДокумент(Док, РежимЗаписиДокумента.Проведение, Отказ, Истина);

	Иначе // нет товара
		Если Не Стр = Неопределено И ЗначениеЗаполнено(Стр.ДокСсылка) Тогда
			мср.УстановитьПометкуУдаленияДокументу(Стр.ДокСсылка, Истина);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
Функция ПолучитьСписаниеФабриката()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("СтатьяРасходов", ПланыВидовХарактеристик.СтатьиРасходов.НайтиПоКоду("01-000083"));
	Запрос.УстановитьПараметр("АналитикаРасходов", Справочники.ПрочиеРасходы.НайтиПоНаименованию(
		"Фабрикаты в производство", Истина));

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.КоличествоФакт КАК КоличествоУпаковок,
	|	т.КоличествоФакт КАК Количество,
	|	&СтатьяРасходов КАК СтатьяРасходов,
	|	&АналитикаРасходов КАК АналитикаРасходов,
	|	АналНом.КлючАналитики КАК АналитикаУчетаНоменклатуры,
	|	т.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	1 КАК ТипСтатьи,
	|	т.Номенклатура.Наименование КАК Наименование
	|ИЗ
	|	Документ.AMS_ПроизводствоЗаСмену.Фабрикаты КАК т
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналНом
	|		ПО т.Номенклатура = АналНом.Номенклатура
	|			И (АналНом.МестоХранения = &Склад)
	|ГДЕ
	|	т.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";

	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Процедура ОчиститьДокумент()
	Таб = AMS_Сервер.ПолучитьДокументыПроизводстваПродукции(Ссылка);
	
	Для каждого Стр Из Таб Цикл
		Если Стр.Проведен Тогда 
			мср.ЗаписатьДокумент(Стр.ДокСсылка, РежимЗаписиДокумента.ОтменаПроведения);
		КонецЕсли;
	КонецЦикла;

	Статус = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление._СтатусыПроизводства.Проект");

	Утвержден = Ложь;

	Фабрикаты.Очистить();
	МатериалыПродукции.Очистить();
	МатериалыФабриката.Очистить();
	ФасовкаПродукция.Очистить();
	ФасовкаБригады.Очистить();
	Замесчики.Очистить();
	Механики.Очистить();
	Кладовщики.Очистить();
	Грузчики.Очистить();
	ДопРаботы.Очистить();
КонецПроцедуры

Процедура ОтменитьПроведениеПодчиненныхДокументов(Отказ)
	ДокПеремещенияПродукцииНаСклад = Документы.AMS_ПроизводствоЗаСмену.ПолучитьДокументыПеремещенияПродукцииНаСклад(Ссылка);
	Если Не ДокПеремещенияПродукцииНаСклад = Неопределено Тогда
		ОбщегоНазначения.СообщитьПользователю(
			"Необходимо предварительно отменить проведение документов перемещения продукции на склад продукции!",,,,Отказ);
	КонецЕсли;

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Табл = AMS_Сервер.ПолучитьДокументыПроизводстваПродукции(Ссылка);
	
	Для каждого Стр Из Табл Цикл 
		Если Стр.Проведен Тогда
			мср.ЗаписатьДокумент(Стр.ДокСсылка, РежимЗаписиДокумента.ОтменаПроведения,Отказ);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьДанныеПоследнегоДокумента()
	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("Склад", Склад);

	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НАЧАЛОПЕРИОДА(т.Дата, ДЕНЬ) КАК Дата,
	|	т.Смена КАК Смена,
	|	т.Цех КАК Цех,
	|	ВЫБОР
	|		КОГДА т.Смена = ЗНАЧЕНИЕ(Перечисление._ПроизводственныеСмены.Дневная)
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК СменаПорядок,
	|	ВЫБОР
	|		КОГДА т.Цех = ЗНАЧЕНИЕ(Перечисление._МестаПроизводства.Основной)
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК ЦехПорядок
	|ИЗ
	|	Документ.AMS_ПроизводствоЗаСмену КАК т
	|ГДЕ
	|	т.Склад = &Склад
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ,
	|	СменаПорядок УБЫВ,
	|	ЦехПорядок УБЫВ";

	Рез = Запрос.Выполнить();

	Если Рез.Пустой() Тогда
		Возврат Неопределено;

	Иначе
		Выб = Рез.Выбрать();
		Выб.Следующий();

		Стр = Новый Структура;
		Стр.Вставить("Дата", Выб.Дата);
		Стр.Вставить("Смена", Выб.Смена);
		Стр.Вставить("Цех", Выб.Цех);

		Возврат Стр;
	КонецЕсли;
КонецФункции

Функция ПолучитьДанныеДляПроверкиЗаполнения()
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Цех", Цех);
	Запрос.УстановитьПараметр("Смена", Смена);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.AMS_ПроизводствоЗаСмену КАК т
	|ГДЕ
	|	ИСТИНА
	|	И т.Дата = &Дата
	|	И т.Смена = &Смена
	|	И т.Склад = &Склад
	|	И НЕ т.Ссылка = &Ссылка
	|	И т.Организация = &Организация
	|	И НЕ т.ПометкаУдаления
	|	И т.Цех = &Цех
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.AMS_ПроизводствоЗаСмену КАК т
	|ГДЕ
	|	ИСТИНА
	|	И т.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	|	И т.Смена = ЗНАЧЕНИЕ(Перечисление._ПроизводственныеСмены.Дневная)
	|	И т.Склад = &Склад
	|	И НЕ т.Ссылка = &Ссылка
	|	И т.Организация = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.КоличествоФакт КАК Количество
	|ПОМЕСТИТЬ тов
	|ИЗ
	|	Документ.AMS_ПроизводствоЗаСмену.Продукция КАК т
	|ГДЕ
	|	т.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	СУММА(т.КоличествоУпаковок) КАК Количество
	|ПОМЕСТИТЬ сдано
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК т
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров КАК д
	|		ПО т.Ссылка = д.Ссылка
	|ГДЕ
	|	ИСТИНА
	|	И д._Основание = &Ссылка
	|	И д.Проведен
	|	И д._ОперацияПроизводства = ЗНАЧЕНИЕ(Перечисление.AMS_ОперацииПроизводства.ПеремещениеПроизведеннойПродукции)
	|	И д.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПеремещенийТоваров.Принято)
	|
	|СГРУППИРОВАТЬ ПО
	|	т.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тов.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(тов.Количество, 0) - ЕСТЬNULL(сдано.Количество, 0) КАК Количество,
	|	Ном._Упаковка КАК Упаковка
	|ИЗ
	|	тов КАК тов
	|		ЛЕВОЕ СОЕДИНЕНИЕ сдано КАК сдано
	|		ПО тов.Номенклатура = сдано.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|		ПО тов.Номенклатура = Ном.Ссылка
	|ГДЕ
	|	НЕ ЕСТЬNULL(тов.Количество, 0) = ЕСТЬNULL(сдано.Количество, 0)";
	Рез = Запрос.ВыполнитьПакет();

	Стр = Новый Структура;
	Стр.Вставить("Дубликаты", Рез[0]);
	Стр.Вставить("ДневнаяСмена", Рез[1]);
	Стр.Вставить("Передано", Рез[4]);

	Возврат Стр;
КонецФункции

Функция ПолучитьДанныхПоРасходуМатериалов(ПоказатьТолькоОтрицательныеОстаткиПоСырью,
	ПоказатьТолькоОтрицательныеОстаткиПоУпаковке) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПеремещениеМатериаловВПроизводство = Документы.AMS_ПроизводствоЗаСмену.ПолучитьПеремещениеМатериаловВПроизводство(Ссылка);
	
	Если ПеремещениеМатериаловВПроизводство = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	//@skip-check bsl-legacy-check-string-literal
	ДатаПеремещения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПеремещениеМатериаловВПроизводство, "Дата");

	Момент = Новый МоментВремени(ДатаПеремещения, ПеремещениеМатериаловВПроизводство);
	Граница = Новый Граница(Момент, ВидГраницы.Исключая);

	СписаниеМатериаловСПроизводства = Документы.AMS_ПроизводствоЗаСмену.ПолучитьСписаниеМатериаловСПроизводства(Ссылка);
	Если СписаниеМатериаловСПроизводства = Неопределено Тогда
		СписаниеМатериаловСПроизводства = Документы.ВнутреннееПотребление.ПустаяСсылка();
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МатериалыПродукции", МатериалыПродукции.Выгрузить( , "Номенклатура,КоличествоПлан"));
	Запрос.УстановитьПараметр("МатериалыФабриката", МатериалыФабриката.Выгрузить( , "Номенклатура,КоличествоПлан"));
	Запрос.УстановитьПараметр("ВПроизводстве", мср.ПолучитьСкладМатериаловВПроизводстве(Склад));
	Запрос.УстановитьПараметр("ПеремещениеМатериаловВПроизводство", ПеремещениеМатериаловВПроизводство);
	Запрос.УстановитьПараметр("СписаниеМатериаловСПроизводства", СписаниеМатериаловСПроизводства);
	Запрос.УстановитьПараметр("ВидыНоменклатуры", AMS_ВызовСервера.ВидыНоменклатурыФабрикаты());
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Смена", Смена);
	Запрос.УстановитьПараметр("Дата", Граница);

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.КоличествоПлан КАК Количество
	|ПОМЕСТИТЬ пм
	|ИЗ
	|	&МатериалыПродукции КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.КоличествоПлан КАК Количество
	|ПОМЕСТИТЬ фм
	|ИЗ
	|	&МатериалыФабриката КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	фм.Номенклатура КАК Номенклатура,
	|	СУММА(фм.Количество) КАК Количество,
	|	1 КАК Тип
	|ПОМЕСТИТЬ мат
	|ИЗ
	|	фм КАК фм
	|СГРУППИРОВАТЬ ПО
	|	фм.Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	пм.Номенклатура,
	|	СУММА(пм.Количество),
	|	2
	|ИЗ
	|	пм КАК пм
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|		ПО пм.Номенклатура = Ном.Ссылка
	|ГДЕ
	|	НЕ Ном.ВидНоменклатуры В (&ВидыНоменклатуры)
	|СГРУППИРОВАТЬ ПО
	|	пм.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	мат.Номенклатура КАК Номенклатура,
	|	мат.Тип КАК Тип,
	|	ЕСТЬNULL(Ост.ВНаличииОстаток, 0) КАК НачОстатокС,
	|	ЕСТЬNULL(мат.Количество, 0) КАК КоличествоС,
	|	ЕСТЬNULL(Ост.ВНаличииОстаток, 0) - ЕСТЬNULL(мат.Количество, 0) КАК КонОстатокС
	|ПОМЕСТИТЬ МатСклад
	|ИЗ
	|	мат КАК мат
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(&Дата, Склад = &Склад) КАК Ост
	|		ПО мат.Номенклатура = Ост.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	СУММА(т.Количество) КАК Количество
	|ПОМЕСТИТЬ приход
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК т
	|ГДЕ
	|	т.Ссылка = &ПеремещениеМатериаловВПроизводство
	|	И т.Ссылка.Проведен
	|СГРУППИРОВАТЬ ПО
	|	т.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	СУММА(т.Количество) КАК Количество
	|ПОМЕСТИТЬ расход
	|ИЗ
	|	Документ.ВнутреннееПотребление.Товары КАК т
	|ГДЕ
	|	т.Ссылка = &СписаниеМатериаловСПроизводства
	|	И т.Ссылка.Проведен
	|СГРУППИРОВАТЬ ПО
	|	т.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	мат.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(Ост.ВНаличииОстаток, 0) КАК НачОстатокЦ,
	|	ЕСТЬNULL(приход.Количество, 0) КАК ПриходЦ,
	|	ЕСТЬNULL(расход.Количество, 0) КАК РасходЦ,
	|	ЕСТЬNULL(Ост.ВНаличииОстаток, 0) + ЕСТЬNULL(приход.Количество, 0) - ЕСТЬNULL(расход.Количество, 0) КАК КонОстатокЦ
	|ПОМЕСТИТЬ МатЦех
	|ИЗ
	|	мат КАК мат
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(&Дата, Склад = &ВПроизводстве) КАК Ост
	|		ПО мат.Номенклатура = Ост.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ расход КАК расход
	|		ПО мат.Номенклатура = расход.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ приход КАК приход
	|		ПО мат.Номенклатура = приход.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МатСклад.Номенклатура КАК Номенклатура,
	|	Ном.ЕдиницаДляОтчетов КАК Ед,
	|	МатСклад.НачОстатокС / Ном.КоэффициентЕдиницыДляОтчетов КАК НачОстатокС,
	|	МатСклад.КоличествоС / Ном.КоэффициентЕдиницыДляОтчетов КАК КоличествоС,
	|	МатСклад.КонОстатокС / Ном.КоэффициентЕдиницыДляОтчетов КАК КонОстатокС,
	|	МатЦех.НачОстатокЦ / Ном.КоэффициентЕдиницыДляОтчетов КАК НачОстатокЦ,
	|	МатЦех.ПриходЦ / Ном.КоэффициентЕдиницыДляОтчетов КАК ПриходЦ,
	|	МатЦех.РасходЦ / Ном.КоэффициентЕдиницыДляОтчетов КАК РасходЦ,
	|	МатЦех.КонОстатокЦ / Ном.КоэффициентЕдиницыДляОтчетов КАК КонОстатокЦ,
	|	Ном.Наименование КАК Наименование
	|ИЗ
	|	МатСклад КАК МатСклад
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|		ПО МатСклад.Номенклатура = Ном.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ МатЦех КАК МатЦех
	|		ПО МатСклад.Номенклатура = МатЦех.Номенклатура
	|ГДЕ
	|	МатСклад.Тип = 2" + ?(ПоказатьТолькоОтрицательныеОстаткиПоУпаковке,	" И МатСклад.КонОстатокС < 0", "") + "
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ном.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МатСклад.Номенклатура КАК Номенклатура,
	|	Ном.ЕдиницаДляОтчетов КАК Ед,
	|	МатСклад.НачОстатокС / Ном.КоэффициентЕдиницыДляОтчетов КАК НачОстатокС,
	|	МатСклад.КоличествоС / Ном.КоэффициентЕдиницыДляОтчетов КАК КоличествоС,
	|	МатСклад.КонОстатокС / Ном.КоэффициентЕдиницыДляОтчетов КАК КонОстатокС,
	|	МатЦех.НачОстатокЦ / Ном.КоэффициентЕдиницыДляОтчетов КАК НачОстатокЦ,
	|	МатЦех.ПриходЦ / Ном.КоэффициентЕдиницыДляОтчетов КАК ПриходЦ,
	|	МатЦех.РасходЦ / Ном.КоэффициентЕдиницыДляОтчетов КАК РасходЦ,
	|	МатЦех.КонОстатокЦ / Ном.КоэффициентЕдиницыДляОтчетов КАК КонОстатокЦ,
	|	Ном.Наименование КАК Наименование
	|ИЗ
	|	МатСклад КАК МатСклад
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|		ПО МатСклад.Номенклатура = Ном.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ МатЦех КАК МатЦех
	|		ПО МатСклад.Номенклатура = МатЦех.Номенклатура
	|ГДЕ
	|	МатСклад.Тип = 1" + ?(ПоказатьТолькоОтрицательныеОстаткиПоСырью," И МатСклад.КонОстатокС < 0", "") + "
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ном.Наименование";
	
	Запрос.Текст = ТекстЗапроса;

	Рез = Запрос.ВыполнитьПакет();

	Стр = Новый Структура;
	Стр.Вставить("Упаковка", Рез[7].Выгрузить());
	Стр.Вставить("Сырье", Рез[8].Выгрузить());

	Возврат Стр;
КонецФункции

Функция ПолучитьНачисления()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ФасовкаБригады", ФасовкаБригады.Выгрузить( , "Сотрудник,Работа,Сумма"));
	Запрос.УстановитьПараметр("Замесчики", Замесчики.Выгрузить( , "Сотрудник,Работа,Сумма"));
	Запрос.УстановитьПараметр("Механики", Механики.Выгрузить( , "Сотрудник,Работа,Сумма"));
	Запрос.УстановитьПараметр("Кладовщики", Кладовщики.Выгрузить( , "Сотрудник,Работа,Сумма"));
	Запрос.УстановитьПараметр("Грузчики", Грузчики.Выгрузить( , "Сотрудник,Работа,Сумма"));
	Запрос.УстановитьПараметр("ДопРаботы", ДопРаботы.Выгрузить( , "Сотрудник,Работа,Сумма"));

	Запрос.Текст =
	"ВЫБРАТЬ
	|   т.Сотрудник КАК Сотрудник,
	|   т.Работа КАК Работа,
	|   т.Сумма КАК Сумма
	|ПОМЕСТИТЬ Фасовка
	|ИЗ
	|   &ФасовкаБригады КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|   т.Сотрудник КАК Сотрудник,
	|   т.Работа КАК Работа,
	|   т.Сумма КАК Сумма
	|ПОМЕСТИТЬ Замес
	|ИЗ
	|   &Замесчики КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|   т.Сотрудник КАК Сотрудник,
	|   т.Работа КАК Работа,
	|   т.Сумма КАК Сумма
	|ПОМЕСТИТЬ Мех
	|ИЗ
	|   &Механики КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|   т.Сотрудник КАК Сотрудник,
	|   т.Работа КАК Работа,
	|   т.Сумма КАК Сумма
	|ПОМЕСТИТЬ Клад
	|ИЗ
	|   &Кладовщики КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|   т.Сотрудник КАК Сотрудник,
	|   т.Работа КАК Работа,
	|   т.Сумма КАК Сумма
	|ПОМЕСТИТЬ Груз
	|ИЗ
	|   &Грузчики КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|   т.Сотрудник КАК Сотрудник,
	|   т.Работа КАК Работа,
	|   т.Сумма КАК Сумма
	|ПОМЕСТИТЬ ДопРаб
	|ИЗ
	|   &ДопРаботы КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|   Фасовка.Сотрудник КАК Сотрудник,
	|   Фасовка.Сумма КАК Сумма,
	|   Фасовка.Работа КАК Работа
	|ПОМЕСТИТЬ вт
	|ИЗ
	|   Фасовка КАК Фасовка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|   Замес.Сотрудник,
	|   Замес.Сумма,
	|   Замес.Работа
	|ИЗ
	|   Замес КАК Замес
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|   Мех.Сотрудник,
	|   Мех.Сумма,
	|   Мех.Работа
	|ИЗ
	|   Мех КАК Мех
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|   Клад.Сотрудник,
	|   Клад.Сумма,
	|   Клад.Работа
	|ИЗ
	|   Клад КАК Клад
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|   Груз.Сотрудник,
	|   Груз.Сумма,
	|   Груз.Работа
	|ИЗ
	|   Груз КАК Груз
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|   ДопРаб.Сотрудник,
	|   ДопРаб.Сумма,
	|   ДопРаб.Работа
	|ИЗ
	|   ДопРаб КАК ДопРаб
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|   вт.Сотрудник КАК Сотрудник,
	|   СУММА(вт.Сумма) КАК Сумма,
	|   вт.Работа КАК Работа
	|ИЗ
	|   вт КАК вт
	|
	|СГРУППИРОВАТЬ ПО
	|   вт.Сотрудник,
	|   вт.Работа";

	Возврат Запрос.Выполнить();
КонецФункции

Функция ПолучитьВидЗапасов()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВидыЗапасов.Ссылка КАК ВидЗапасов
	|ИЗ
	|	Справочник.ВидыЗапасов КАК ВидыЗапасов
	|ГДЕ
	|	ВидыЗапасов.Организация = &Организация
	|	И ВидыЗапасов.Контрагент = НЕОПРЕДЕЛЕНО";

	Рез = Запрос.Выполнить();
	Выб = Рез.Выбрать();
	Выб.Следующий();
	Возврат Выб.ВидЗапасов;
КонецФункции

//

Процедура ЗаполнитьСтоимостьФабрикатов()
	Для Каждого Стр Из Фабрикаты Цикл
		Стр.Цена = AMS_ВызовСервера.ПолучитьСтоимостьФабриката(Стр.Спецификация, Дата)
	КонецЦикла;
КонецПроцедуры

Процедура ЗаполнитьСтоимостьПродукции()
	Для Каждого Стр Из Продукция Цикл
		СтоимостьФабриката = 0;
		
		СтрПоиска = Фабрикаты.Найти(Стр.Фабрикат, "Номенклатура");
		
		Если Не СтрПоиска = Неопределено Тогда
			СтоимостьФабриката = СтрПоиска.Цена;
		КонецЕсли;
		
		Стр.Цена = AMS_ВызовСервера.ПолучитьСтоимостьПродукции(Стр.Спецификация, СтоимостьФабриката, Дата);
	КонецЦикла;
КонецПроцедуры

//

#КонецОбласти

#КонецЕсли
