
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Цех1    = AMS_ВызовСервера.Цех1();
    Цех2    = AMS_ВызовСервера.Цех2();
    Цех3    = AMS_ВызовСервера.Цех3();
    Цех4    = AMS_ВызовСервера.Цех4();
    СкладГП = AMS_ВызовСервера.СкладПродукции();
    СкладРМ = AMS_ВызовСервера.СкладРасходныхМатериалов();
    
    Дата  = Параметры.Дата;
    Склад = Параметры.Склад;
	
	Если Пользователи.РолиДоступны("_Цех1, _Цех2, _Цех3, _Цех4, _НачальникСклада") И Не AMS_ВызовСервера.ЭтоKhors() Тогда
	    Если Пользователи.РолиДоступны("_Цех1") Тогда
	        Если НЕ ЗначениеЗаполнено(Склад) Тогда Склад = Цех1; КонецЕсли;
	        Элементы.Склад.СписокВыбора.Добавить(Цех1);
	        
	    ИначеЕсли Пользователи.РолиДоступны("_Цех2") Тогда
	        Если НЕ ЗначениеЗаполнено(Склад) Тогда Склад = Цех2; КонецЕсли;
	        Элементы.Склад.СписокВыбора.Добавить(Цех2);
	        
	    ИначеЕсли Пользователи.РолиДоступны("_Цех3") Тогда
	        Если НЕ ЗначениеЗаполнено(Склад) Тогда Склад = Цех3; КонецЕсли;
	        Элементы.Склад.СписокВыбора.Добавить(Цех3);
			
		ИначеЕсли Пользователи.РолиДоступны("_Цех4") Тогда
	        Если НЕ ЗначениеЗаполнено(Склад) Тогда Склад = Цех4; КонецЕсли;
	        Элементы.Склад.СписокВыбора.Добавить(Цех4);
	    
	    ИначеЕсли Пользователи.РолиДоступны("_НачальникСклада") Тогда
	        Если НЕ ЗначениеЗаполнено(Склад) Тогда Склад = СкладГП; КонецЕсли;
	        Элементы.Склад.СписокВыбора.Добавить(СкладГП);
	    КонецЕсли;
	    
	    Элементы.Склад.СписокВыбора.Добавить(СкладРМ);
	    
	Иначе    
	    Если НЕ ЗначениеЗаполнено(Склад) Тогда
	        Склад = Цех1;
	    КонецЕсли;
	    
	    Элементы.Склад.СписокВыбора.Добавить(Цех1);
	    Элементы.Склад.СписокВыбора.Добавить(Цех2);
	    Элементы.Склад.СписокВыбора.Добавить(Цех3);
	    Элементы.Склад.СписокВыбора.Добавить(Цех4);
	    Элементы.Склад.СписокВыбора.Добавить(СкладГП);
	    Элементы.Склад.СписокВыбора.Добавить(СкладРМ);
	КонецЕсли;
    
    ПриИзмененииСклада();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриИзмененииСклада();
	ПоказатьТабНоменклатура();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
    ПриИзмененииСклада();
    ПоказатьТабНоменклатура();
КонецПроцедуры

&НаКлиенте
Процедура РодительМатериалПриИзменении(Элемент)
    ПоказатьТабНоменклатура();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормытНоменклатура

&НаКлиенте
Процедура тНоменклатураПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("тНоменклатураПриАктивизацииСтрокиОбработчикОжидания",0.1,Истина);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормытПоставщики

&НаКлиенте
Процедура тПоставщикиПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("тПоставщикиПриАктивизацииСтрокиОбработчикОжидания",0.1,Истина);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	Закрыть(ПолучитьДанныеПодбора());
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПоказатьТабНоменклатура()
    Если РодительМатериал = Справочники.Номенклатура.НайтиПоКоду("00007") Тогда
        Сегменты = Новый Массив;
        Сегменты.Добавить(AMS_ВызовСервера.СегментыНоменклатурыРасходныеПроизводства());
    Иначе
        Сегменты = ПолучитьСегментыЦеха();
    КонецЕсли;
    
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", РодительМатериал);
    Запрос.УстановитьПараметр("Сегменты"    , Сегменты);
    
    Запрос.Текст =
    "ВЫБРАТЬ РАЗЛИЧНЫЕ
    |	таб.Номенклатура
    |ИЗ
    |	РегистрСведений.НоменклатураСегмента КАК таб
    |ГДЕ
    |	таб.Сегмент В(&Сегменты)
    |	И таб.Номенклатура В ИЕРАРХИИ(&Номенклатура)
    |
    |УПОРЯДОЧИТЬ ПО
    |	таб.Номенклатура.Наименование";
		
	Результат = Запрос.Выполнить();
    
    Табл = РеквизитФормыВЗначение("тНоменклатура");
    Табл.Очистить();
    
    Выборка = Результат.Выбрать();
    Пока Выборка.Следующий() Цикл
        Стр = Табл.Добавить();
        Стр.Номенклатура = Выборка.Номенклатура;
    КонецЦикла;
    
    ЗначениеВРеквизитФормы(Табл,"тНоменклатура");
    
    тПоставщики.Очистить();
    тТовары.Очистить();
КонецПроцедуры

&НаСервере
Процедура ПоказатьТабПоставщики(Номенклатура) 
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(док.Дата) КАК Дата,
	|	док.Партнер КАК Поставщик
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг.Товары КАК тов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг КАК док
	|		ПО тов.Ссылка = док.Ссылка
	|ГДЕ
	|	тов.Номенклатура = &Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	док.Партнер
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
    
	тПоставщики.Загрузить(Запрос.Выполнить().Выгрузить());
    
    тТовары.Очистить();
КонецПроцедуры

&НаСервере
Процедура ПоказатьТабТовары(Партнер)
    УстановитьПривилегированныйРежим(Истина);
	
    Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата"   ,Дата);
	Запрос.УстановитьПараметр("Склад"  ,Склад);
	Запрос.УстановитьПараметр("Партнер",Партнер);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	тов.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(док.Дата) КАК Дата
	|ПОМЕСТИТЬ Закупки
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг.Товары КАК тов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг КАК док
	|		ПО тов.Ссылка = док.Ссылка
	|ГДЕ
	|	док.Партнер = &Партнер
	|	И док.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	тов.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Закупки.Номенклатура КАК Номенклатура,
	|	Закупки.Дата КАК Дата,
	|	д.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ДокЗакупки
	|ИЗ
	|	Закупки КАК Закупки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг КАК д
	|		ПО Закупки.Дата = д.Дата
	|ГДЕ
	|	д.Партнер = &Партнер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокЗакупки.Номенклатура КАК Номенклатура,
	|	Товары.Сумма / Товары.Количество КАК Цена,
	|	ДокЗакупки.Дата КАК Дата,
	|	ДокЗакупки.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ НомЗакупки
	|ИЗ
	|	ДокЗакупки КАК ДокЗакупки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг.Товары КАК Товары
	|		ПО ДокЗакупки.Ссылка = Товары.Ссылка
	|			И ДокЗакупки.Номенклатура = Товары.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.Ссылка КАК НоменклатураПартнера
	|ПОМЕСТИТЬ НомПартнера
	|ИЗ
	|	Справочник.НоменклатураКонтрагентов КАК т
	|ГДЕ
	|	т.Владелец = &Партнер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НомЗакупки.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ НомВся
	|ИЗ
	|	НомЗакупки КАК НомЗакупки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НомПартнера.Номенклатура
	|ИЗ
	|	НомПартнера КАК НомПартнера
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НомВся.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ Ном
	|ИЗ
	|	НомВся КАК НомВся
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ном.Номенклатура КАК Номенклатура,
	|	НомПартнера.НоменклатураПартнера КАК НоменклатураПартнера,
	|	НомЗакупки.Дата КАК Дата,
	|	НомЗакупки.Цена КАК Цена,
	|	НомЗакупки.Ссылка КАК ДокументЗакупки,
	|	Ост.ВНаличииОстаток КАК Остаток
	|ИЗ
	|	Ном КАК Ном
	|		ЛЕВОЕ СОЕДИНЕНИЕ НомЗакупки КАК НомЗакупки
	|		ПО Ном.Номенклатура = НомЗакупки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ НомПартнера КАК НомПартнера
	|		ПО Ном.Номенклатура = НомПартнера.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(&Дата, Склад = &Склад) КАК Ост
	|		ПО Ном.Номенклатура = Ост.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ном.Номенклатура.Наименование";
    
	тТовары.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораМатериала()
    Элементы.РодительМатериал.Видимость = Истина;
    
	Схема = Документы.ЗаказПоставщику.ПолучитьМакет("_СписокПапок");
	
	Настройки = Схема.НастройкиПоУмолчанию;
	
	// установить параметры
	ПолеИспользоватьСегмент = Новый ПараметрКомпоновкиДанных("ИспользоватьСегмент");
	ПолеВыводитьФабрикат    = Новый ПараметрКомпоновкиДанных("ВыводитьФабрикат");
	Для каждого Элемент Из Настройки.ПараметрыДанных.Элементы Цикл
		Если Элемент.Параметр = ПолеИспользоватьСегмент Тогда
			Элемент.Использование = Истина;
			Элемент.Значение      = Истина;
		КонецЕсли;
		Если Элемент.Параметр = ПолеВыводитьФабрикат Тогда
			Элемент.Использование = Истина;
			Элемент.Значение = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	// установить отбор
	Родитель = Справочники.Номенклатура.НайтиПоКоду("00002");
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Настройки.Отбор,"Номенклатура",Родитель,ВидСравненияКомпоновкиДанных.ВИерархии,,Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Настройки.Отбор,"Сегмент"     ,ПолучитьСегментыЦеха(),ВидСравненияКомпоновкиДанных.ВСписке  ,,Истина);
		
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Макет = КомпоновщикМакета.Выполнить(Схема,Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(Макет,,,Истина);
    
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
    Табл = Новый ТаблицаЗначений;
	ПроцессорВывода.УстановитьОбъект(Табл);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
    
    СписокВыбора = Элементы.РодительМатериал.СписокВыбора;
    СписокВыбора.ЗагрузитьЗначения(Табл.ВыгрузитьКолонку("Родитель"));
    
    СписокВыбора = Элементы.РодительМатериал.СписокВыбора;
    Если СписокВыбора.Количество() > 0 Тогда
        Если СписокВыбора.НайтиПоЗначению(РодительМатериал) = Неопределено Тогда
            РодительМатериал = СписокВыбора[0].Значение;
        КонецЕсли;
    КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьСегментыЦеха()
    Сегменты = Новый Массив;
    
    Если Склад = AMS_ВызовСервера.Цех1() Тогда
        Сегменты.Добавить(AMS_ВызовСервера.СегментыНоменклатурыМатериалыЦеха1());
        Сегменты.Добавить(AMS_ВызовСервера.СегментыНоменклатурыУпаковкаЦеха1());
        
    ИначеЕсли Склад = AMS_ВызовСервера.Цех2() Тогда
        Сегменты.Добавить(AMS_ВызовСервера.СегментыНоменклатурыМатериалыЦеха2());
        Сегменты.Добавить(AMS_ВызовСервера.СегментыНоменклатурыУпаковкаЦеха2());
        
    ИначеЕсли Склад = AMS_ВызовСервера.Цех3() Тогда
        Сегменты.Добавить(AMS_ВызовСервера.СегментыНоменклатурыМатериалыЦеха3());
        Сегменты.Добавить(AMS_ВызовСервера.СегментыНоменклатурыУпаковкаЦеха3());
    
    ИначеЕсли Склад = AMS_ВызовСервера.СкладПродукции() Тогда
        Сегменты.Добавить(Справочники.СегментыНоменклатуры.НайтиПоКоду("01-00000015"));
	КонецЕсли;
    
    Возврат Сегменты;
КонецФункции

&НаСервере
Процедура ПриИзмененииСклада()
    Если Склад = СкладРМ Тогда
        РодительМатериал = Справочники.Номенклатура.НайтиПоКоду("00007"); // Папка "Расходные"
        Элементы.РодительМатериал.Видимость = Ложь;
    Иначе
        ЗаполнитьСписокВыбораМатериала();
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура тНоменклатураПриАктивизацииСтрокиОбработчикОжидания() Экспорт
	ТекущиеДанные = Элементы.тНоменклатура.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Номенклатура = ТекущиеДанные.Номенклатура;
	
    Если ЗначениеЗаполнено(Номенклатура) Тогда
        ПоказатьТабПоставщики(Номенклатура);
	КонецЕсли;
	
	Если тПоставщики.Количество() > 0 Тогда
    	Стр = тПоставщики[0];
    	Идентиф = Стр.ПолучитьИдентификатор();
    	Элементы.тПоставщики.ТекущаяСтрока = Идентиф;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура тПоставщикиПриАктивизацииСтрокиОбработчикОжидания() Экспорт
	ТекущиеДанные = Элементы.тПоставщики.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Партнер = ТекущиеДанные.Поставщик;
	
    Если ЗначениеЗаполнено(Партнер) Тогда
        ПоказатьТабТовары(Партнер);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеПодбора()
	МассивСтрок = Новый Массив; 
	
	Табл = РеквизитФормыВЗначение("тТовары");
	
	Для каждого Стр Из Табл Цикл
		Если Стр.Количество > 0 Тогда
			МассивСтрок.Добавить(ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Стр));
		КонецЕсли;
	КонецЦикла;
	
	Данные = Новый Структура;
    Данные.Вставить("Склад"  ,Склад);
	Данные.Вставить("Партнер",Партнер);
	Данные.Вставить("Табл"   ,МассивСтрок);
	
	Возврат Данные;
КонецФункции

#КонецОбласти