#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
	Попытка
		ОбъектМодифицирован = ОбъектМодифицирован(ЭтотОбъект, Истина, Истина);
		
		Если ОбменДанными.Получатели.АвтоЗаполнение Тогда
			ОбменДанными.Получатели.Очистить();
			
			Если Не ЗначениеЗаполнено(Ссылка) Тогда // новый объект
				Если Не ЗначениеЗаполнено(ТСД) Тогда
					Если СписокТерминалов.Количество() = 0 Тогда
						ОбменДанными.Получатели.Заполнить();
					Иначе
						Для каждого СтрокаТерминал Из СписокТерминалов Цикл
							ОбменДанными.Получатели.Добавить(СтрокаТерминал.ТСД);	
						КонецЦикла;
					КонецЕсли;
				Иначе	
					ОбменДанными.Получатели.Добавить(ТСД);
				КонецЕсли;	
			Иначе
				Если ОбъектМодифицирован Тогда
					Если Не ЗначениеЗаполнено(ТСД) Или Не ЗначениеЗаполнено(Ссылка.ТСД) Тогда
						Если СписокТерминалов.Количество() = 0 Тогда
							ОбменДанными.Получатели.Заполнить();
						Иначе
							Для каждого СтрокаТерминал Из СписокТерминалов Цикл
								ОбменДанными.Получатели.Добавить(СтрокаТерминал.ТСД);	
							КонецЦикла;
						КонецЕсли;
					Иначе	
						ОбменДанными.Получатели.Добавить(ТСД);
						ОбменДанными.Получатели.Добавить(Ссылка.ТСД);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;
	Исключение
	КонецПопытки;

	Если ДатаСоздания = Дата(1,1,1) Тогда
		ДатаСоздания = ТекущаяДата();
	КонецЕсли;
	
	Если ИсходныйДокумент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ИсходныйДокумент.Пустая() Тогда
		Возврат;
	КонецЕсли;	
	
	Если Шаблон.ВыгружатьТолькоПроведенныеДокументы Тогда
		Если ЗначениеЗаполнено(ИсходныйДокумент) Тогда
			Если Не ИсходныйДокумент.Проведен Тогда
				Сообщить("Запрещена выгрузка непроведенных документов");
				Отказ = Истина;
				Возврат;
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;

	Если СокрЛП(Комментарий) = "" Тогда
		Комментарий = СокрЛП(ИсходныйДокумент.Комментарий);
	КонецЕсли;	
	
	Если СокрЛП(Номер) = "" Тогда
		Номер = СокрЛП(ИсходныйДокумент.Номер);
	КонецЕсли;	
	
	Если Клиент = Неопределено Тогда
		Попытка Клиент = ИсходныйДокумент.Партнер; Исключение КонецПопытки;
		Попытка Клиент = ИсходныйДокумент.Отправитель; Исключение КонецПопытки;
		Попытка Клиент = ИсходныйДокумент.Получатель; Исключение КонецПопытки;
		Попытка Клиент = ИсходныйДокумент.Поставщик; Исключение КонецПопытки;
	КонецЕсли;	
	
	Если Склад.Пустая() Тогда
		Попытка Склад = ИсходныйДокумент.ТорговыйОбъект; Исключение КонецПопытки;
		Попытка Склад = ИсходныйДокумент.Помещение.Владелец; Исключение КонецПопытки;
		Попытка Склад = ИсходныйДокумент.Склад; Исключение КонецПопытки;		
		Попытка Склад = ИсходныйДокумент.СкладОтправитель; Исключение КонецПопытки;
	КонецЕсли; 
	
	Если Дата = Дата(1,1,1) Тогда
		Дата = ИсходныйДокумент.Дата;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ТСД.Пустая() Тогда
		Если СписокТерминалов.Количество() = 0 Тогда
			ОбменДанными.Получатели.Заполнить();
		Иначе
			Для каждого стр Из СписокТерминалов Цикл
				ОбменДанными.Получатели.Добавить(стр.ТСД);
			КонецЦикла;
		КонецЕсли;	
	Иначе	
		ОбменДанными.Получатели.Добавить(ТСД);
		
		Для каждого стр Из СписокТерминалов Цикл
			ОбменДанными.Получатели.Добавить(стр.ТСД);
		КонецЦикла;
	КонецЕсли;
	
	ДатаМобайл_ОбщийМодуль.ОчиститьЗаписиТСДГрупповогоДокумента_ОПТ(Ссылка);
	ДатаМобайл_ОбщийМодуль.ОчиститьЗаписиГрупповогоДокумента(Ссылка);
	
КонецПроцедуры

Процедура ПриКопировании()

	ДатаСоздания = Дата(1,1,1);
	ДатаНачалаСбора = Дата(1,1,1);
	ДатаЗавершенияСбора = Дата(1,1,1);
	ДатаПриемкиОператором = Дата(1,1,1);
	ДатаЗавершения = Дата(1,1,1);
	Комментарий = "";
	Номер = "";
	Дата = Дата(1,1,1);
	НовыйДокумент = Неопределено;	
	Клиент = Неопределено;
	//Склад = Неопределено;
	ДатаИзмененияКлиента = Дата(1,1,1);
	СсылкаНаИзображение = "";
	ПостановкаНаКарантин = Ложь;
	ДополнительныйДокумент = Неопределено;
	СобранныеДанныеПодбор.Очистить();
	СписокТерминалов.Очистить();
	
КонецПроцедуры   

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбъектМодифицирован(Объект, ПроверятьТабличныеЧасти = Истина, ПроверятьСтандартные = Истина) 
	
	Попытка 
		СсылкаОбъекта = Объект.Ссылка;
		Метаданное = Ссылка.Метаданные();
		
		Для каждого Реквизит Из Метаданное.Реквизиты Цикл
			Если Объект[Реквизит.Имя] <> СсылкаОбъекта[Реквизит.Имя] Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если ПроверятьСтандартные Тогда
			Для каждого Реквизит Из Метаданное.СтандартныеРеквизиты Цикл
				Если Объект[Реквизит.Имя] <> СсылкаОбъекта[Реквизит.Имя] Тогда
					Возврат Истина;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
				
		Если ПроверятьТабличныеЧасти Тогда
			Для каждого ТЧ Из Метаданное.ТабличныеЧасти Цикл
				
				Если Объект[ТЧ.Имя].Количество() <> СсылкаОбъекта[ТЧ.Имя].Количество() Тогда
					Возврат Истина;
				КонецЕсли;
				
				Для Индекс = 0 По Объект[ТЧ.Имя].Количество() - 1 Цикл
					ОбъектСтрокаТЧ = Объект[ТЧ.Имя][Индекс];
					СсылкаСтрокаТЧ = СсылкаОбъекта[ТЧ.Имя][Индекс];
					Для каждого РеквизитТЧ Из ТЧ.Реквизиты Цикл
						Если ОбъектСтрокаТЧ[РеквизитТЧ.Имя] <> СсылкаСтрокаТЧ[РеквизитТЧ.Имя] Тогда
							Возврат Истина;
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
				
			КонецЦикла;        
		КонецЕсли;
		
		Возврат Ложь;
	Исключение
		Возврат Истина;
	КонецПопытки;	
		
КонецФункции

#КонецОбласти
