#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;

	Данные = ПолучитьИзВременногоХранилища(Параметры.АдресВХранилище);

	ЗаполнитьТаблицуПодбора(Данные);

	КоличествоСтрок = Товары.Количество();
	Элементы.Товары.Высота = КоличествоСтрок + 1;

	Высота = КоличествоСтрок + 5;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	Если Модифицированность Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект), НСтр(
			"ru = 'Данные были изменены. Перенести изменения в документ?'"), РежимДиалогаВопрос.ДаНет);

	Иначе
		ПеренестиТоварыВДокумент();
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренестиВДокументВыполнить()
	ПеренестиТоварыВДокумент();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицуПодбора(Данные)
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Товары", Данные.Товары);
	Запрос.УстановитьПараметр("Дата", Данные.Дата);
	Запрос.УстановитьПараметр("Склад", Данные.Склад);
	Запрос.УстановитьПараметр("Контрагент", Данные.Контрагент);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Количество КАК Количество
	|ПОМЕСТИТЬ док
	|ИЗ
	|	&Товары КАК Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыПереданныеОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыПереданныеОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ПОМЕСТИТЬ ост
	|ИЗ
	|	РегистрНакопления._ТоварыПереданные.Остатки(&Дата, Контрагент = &Контрагент) КАК ТоварыПереданныеОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	док.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	док КАК док
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ост.Номенклатура
	|ИЗ
	|	ост КАК ост
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	вт.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ тов
	|ИЗ
	|	вт КАК вт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тов.Номенклатура КАК Номенклатура,
	|	ост.КоличествоОстаток КАК ВПереработке,
	|	док.Количество КАК Количество
	|ИЗ
	|	тов КАК тов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ост КАК ост
	|		ПО тов.Номенклатура = ост.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ док КАК док
	|		ПО тов.Номенклатура = док.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	тов.Номенклатура.Наименование";

	Результат = Запрос.Выполнить();
	Товары.Загрузить(Результат.Выгрузить());

	Элементы.ТоварыОстатокНаСкладе.Заголовок = "Остаток на " + Данные.Дата;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Модифицированность = Ложь;
		ПеренестиТоварыВДокумент();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиТоварыВДокумент()
	// Снятие модифицированности, т.к. перед закрытием признак проверяется.
	Модифицированность = Ложь;

	Массив = Новый Массив;

	Для Каждого Стр Из Товары Цикл
		Если Стр.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;

		Массив.Добавить(Новый Структура("Номенклатура,Количество", Стр.Номенклатура, Стр.Количество));
	КонецЦикла;

	Закрыть(Массив);
КонецПроцедуры

#КонецОбласти