
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Записывает событие документа
// 
// Параметры:
//  Документ - ДокументСсылка.ПередачаТоваровХранителю, ДокументСсылка.РеализацияТоваровУслуг - документ.
//	Событие - ПеречислениеСсылка.AMS_СобытияРеализации - событие документа.
//  ВремяНачалаСобытия - Дата - время открытия документа
//	ЛогистическийЛист - ДокументСсылка.AMS_ЛогистическийЛист
//
Процедура ЗаписатьСобытиеДокумента(Документ, Событие, ВремяНачалаСобытия = Неопределено, ЛогистическийЛист = Неопределено) Экспорт 
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда 
		СтрДок = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Документ,"AMS_СтатусРеализации,Проведен,Партнер,СуммаДокумента");
	Иначе
		СтрДок = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Документ,"Проведен,Партнер,СуммаДокумента");
		СтрДок.Вставить("AMS_СтатусРеализации",?(СтрДок.Проведен,"К отгрузке","В работе"));
	КонецЕсли;	
	
	Если ЛогистическийЛист = Неопределено Тогда
		Данные = AMS_ВызовСервера.ПолучитьЛогистическийЛистРасходныйОрдер(Документ);
		ЛогистическийЛист = Данные.ЛогистическийЛист;
	КонецЕсли;	

	Запись = СоздатьМенеджерЗаписи();
	
	Запись.Период            = ТекущаяДатаСеанса();
	
	Запись.Документ          = Документ;
	
	Запись.Событие           = Событие;
	Запись.Исполнитель       = Пользователи.ТекущийПользователь();
	Запись.Проведен          = СтрДок.Проведен;
	Запись.Статус            = СтрДок.AMS_СтатусРеализации;
	Запись.Партнер           = СтрДок.Партнер;
	Запись.СуммаДокумента    = СтрДок.СуммаДокумента;
	Запись.ВремяОбработки    = ?(ВремяНачалаСобытия = Неопределено, 0, ТекущаяДатаСеанса() - ВремяНачалаСобытия);
	Запись.ЛогистическийЛист = ЛогистическийЛист;
	
	Запись.Записать(); 
КонецПроцедуры


#КонецОбласти

#КонецЕсли