
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.Склад.СписокВыбора.Добавить(AMS_ВызовСервера.Цех1());
	Элементы.Склад.СписокВыбора.Добавить(AMS_ВызовСервера.Цех2());
	Элементы.Склад.СписокВыбора.Добавить(AMS_ВызовСервера.Цех3());
	Элементы.Склад.СписокВыбора.Добавить(AMS_ВызовСервера.Цех4());
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Склад", Склад,
		ВидСравненияКомпоновкиДанных.Равно, , ЗначениеЗаполнено(Склад));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Склад", Склад,
		ВидСравненияКомпоновкиДанных.Равно, , ЗначениеЗаполнено(Склад));
КонецПроцедуры

#КонецОбласти