#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьОсновноеПравило(Владелец) Экспорт 
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	т.Ссылка
	|ИЗ
	|	Справочник.AMS_ПравилаПродаж КАК т
	|ГДЕ
	|	т.Владелец = &Владелец
	|	И т.Основное
	|	И НЕ т.ПометкаУдаления";
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат ПустаяСсылка();
		
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		Возврат Выборка.Ссылка;
	КонецЕсли;
КонецФункции

Функция ПолучитьКонтрагентов(Партнер) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА Партнеры.Родитель = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
		|			ТОГДА Партнеры.Ссылка
		|		ИНАЧЕ Партнеры.Родитель
		|	КОНЕЦ КАК Партнер
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	Справочник.Партнеры КАК Партнеры
		|ГДЕ
		|	Партнеры.Ссылка = &Партнер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СправочникКонтрагенты.Ссылка КАК Ссылка,
		|	СправочникКонтрагенты.Наименование КАК Наименование,
		|	СправочникКонтрагенты.НаименованиеПолное КАК НаименованиеПолное,
		|	СправочникКонтрагенты.ЮрФизЛицо КАК ЮрФизЛицо,
		|	ВЫБОР
		|		КОГДА СправочникКонтрагенты.ОбособленноеПодразделение
		|			ТОГДА СправочникКонтрагенты.ГоловнойКонтрагент
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|	КОНЕЦ КАК ГоловнойКонтрагент,
		|	СправочникКонтрагенты.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
		|	СправочникКонтрагенты.ИНН КАК ИНН,
		|	СправочникКонтрагенты.КПП КАК КПП,
		|	СправочникКонтрагенты.КодПоОКПО КАК КодПоОКПО,
		|	СправочникКонтрагенты.Партнер КАК Партнер,
		|	СправочникКонтрагенты.Представление КАК Представление,
		|	ЕСТЬNULL(СостоянияКонтрагентов.Состояние,
		|		ЗНАЧЕНИЕ(Перечисление.СостоянияСуществованияКонтрагента.КонтрагентЕстьВБазеФНС)) КАК СостояниеПроверкиКонтрагента
		|ИЗ
		|	Справочник.Контрагенты КАК СправочникКонтрагенты
		|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияКонтрагентов КАК СостоянияКонтрагентов
		|		ПО СостоянияКонтрагентов.Контрагент = СправочникКонтрагенты.Ссылка}
		|ГДЕ
		|	СправочникКонтрагенты.Партнер В
		|		(ВЫБРАТЬ
		|			вт.Партнер
		|		ИЗ
		|			вт КАК вт)
		|	И НЕ СправочникКонтрагенты._Закрыт
		|	И НЕ СправочникКонтрагенты.ПометкаУдаления";
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ПолучитьДоговора(Организация,Партнер,Контрагент) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаАктуальности", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	т.Ссылка,
		|	т.Статус,
		|	т.ДатаНачалаДействия,
		|	т.ДатаОкончанияДействия
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК т
		|ГДЕ
		|	т.Организация = &Организация
		|	И т.Партнер = &Партнер
		|	И т.Контрагент = &Контрагент
		|	И т.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПокупателем)
		|	И т.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует)
		|	И (т.ДатаНачалаДействия = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ &ДатаАктуальности > т.ДатаНачалаДействия)
		|	И (т.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ &ДатаАктуальности < т.ДатаОкончанияДействия)";
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

#КонецОбласти	

#КонецЕсли