
#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	
	ИДСправочника = ""; 
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
	 	Возврат;
	КонецЕсли;

	// Отключение механизма регистрации объектов.
	ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
	 	Возврат;
	КонецЕсли;

	// Отключение механизма регистрации объектов.
	ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
	
КонецПроцедуры

#КонецОбласти