
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    СписокВыбора = Элементы.ГруппаНоменклатуры.СписокВыбора;
    
    СписокВыбора.Добавить(AMS_ВызовСервера.НоменклатураСырье());
    СписокВыбора.Добавить(AMS_ВызовСервера.НоменклатураКрасители());
    СписокВыбора.Добавить(AMS_ВызовСервера.НоменклатураОтдушки());
    СписокВыбора.Добавить(AMS_ВызовСервера.НоменклатураКоробки());
    СписокВыбора.Добавить(AMS_ВызовСервера.НоменклатураКанистры());
    СписокВыбора.Добавить(AMS_ВызовСервера.НоменклатураФлаконы());
    СписокВыбора.Добавить(AMS_ВызовСервера.НоменклатураКрышки());
    СписокВыбора.Добавить(AMS_ВызовСервера.НоменклатураЭтикетки());
    СписокВыбора.Добавить(AMS_ВызовСервера.НоменклатураУпаковка());
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    ВывестиСводку();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
    ВывестиСводку();
    СпецификацииОчистить();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаНоменклатурыПриИзменении(Элемент)
    ВывестиСводку();
    СпецификацииОчистить();
КонецПроцедуры

&НаКлиенте
Процедура РезультатПриАктивизации1(Элемент)
    ИмяОбласти = Элемент.ТекущаяОбласть.Имя;
    
    НомерСтроки = Лев(Сред(ИмяОбласти,2),СтрНайти(Сред(ИмяОбласти,2),"C")-1);
    
    Позиция = СтрНайти(ИмяОбласти,":");
    Если Позиция > 0 Тогда
        ИмяОбласти = Лев(ИмяОбласти,Позиция-1);
    КонецЕсли;
    НомерКолонки = Сред(ИмяОбласти,СтрНайти(ИмяОбласти,"C")+1);
    
    мНоменклатура = УстановитьНоменклатура(Результат.Область("R"+НомерСтроки+"C2").Текст);
    
    Попытка
        MIN = Число(Результат.Область("R"+НомерСтроки+"C5").Текст);
    Исключение
        MIN = 0;
    КонецПопытки;
    
    Попытка
        MAX = Число(Результат.Область("R"+НомерСтроки+"C6").Текст);
    Исключение
        MAX = 0;
    КонецПопытки;
    
    Если ЗначениеЗаполнено(мНоменклатура) Тогда
        ВывестиСпецификации();
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	СтандартнаяОбработка = Ложь;
    
	ОбработкаРасшифровки = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСКД));
	
	ДоступныеДействия = Новый Массив;
	ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение);
	
	ОбработкаРасшифровки.ПоказатьВыборДействия(Новый ОписаниеОповещения("ОбработатьРасшифровку",ЭтотОбъект),Расшифровка,ДоступныеДействия);
КонецПроцедуры

&НаКлиенте
Процедура СпецификацииОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	СтандартнаяОбработка = Ложь;
    
	ОбработкаРасшифровкиСпец = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровкиСпец, Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСКДСпец));
	
	ДоступныеДействия = Новый Массив;
	ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение);
	
	ОбработкаРасшифровкиСпец.ПоказатьВыборДействия(Новый ОписаниеОповещения("ОбработатьРасшифровкуСпец",ЭтотОбъект),Расшифровка,ДоступныеДействия);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СпецификацииОчистить()
    Спецификации.Очистить();
КонецПроцедуры

&НаСервере
Процедура ВывестиСводку()
    Результат.Очистить();
    
	Схема = РеквизитФормыВЗначение("Объект").ПолучитьМакет("скдМатериалы");

	Настройки = Схема.НастройкиПоУмолчанию;
	
    СегментНоменклатуры = Новый Массив;
    
    Если Цех = AMS_ВызовСервера.Цех1() Тогда
        СегментНоменклатуры.Добавить(AMS_ВызовСервера.СегментыНоменклатурыМатериалыЦеха1());
        СегментНоменклатуры.Добавить(AMS_ВызовСервера.СегментыНоменклатурыУпаковкаЦеха1());
        
    ИначеЕсли Цех = AMS_ВызовСервера.Цех2() Тогда
        СегментНоменклатуры.Добавить(AMS_ВызовСервера.СегментыНоменклатурыМатериалыЦеха2());
        СегментНоменклатуры.Добавить(AMS_ВызовСервера.СегментыНоменклатурыУпаковкаЦеха2());
        
    ИначеЕсли Цех = AMS_ВызовСервера.Цех3() Тогда
        СегментНоменклатуры.Добавить(AMS_ВызовСервера.СегментыНоменклатурыМатериалыЦеха3());
        СегментНоменклатуры.Добавить(AMS_ВызовСервера.СегментыНоменклатурыУпаковкаЦеха3());
    КонецЕсли;
        
    ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Настройки.Отбор,"СегментНоменклатуры",СегментНоменклатуры,ВидСравненияКомпоновкиДанных.ВСписке,,Истина);
    ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Настройки.Отбор,"Номенклатура",ГруппаНоменклатуры,ВидСравненияКомпоновкиДанных.ВИерархии,,Истина);
    
    Расшифровка = Новый ДанныеРасшифровкиКомпоновкиДанных;
    
    Парам = Новый Структура();
    Парам.Вставить("Склад", Цех);
    Парам.Вставить("СегментыНоменклатурыСтарая", AMS_ВызовСервера.СегментыНоменклатурыСтарая());
    Парам.Вставить("ВидНоменклатурыМатериал", AMS_ВызовСервера.ВидНоменклатурыМатериал());
	
	мср.ПолучитьДанныеНаОснованииСКД(Схема, Результат, Настройки, Парам, Расшифровка);
	
	Если ЗначениеЗаполнено(ДанныеРасшифровки) И ЭтоАдресВременногоХранилища(ДанныеРасшифровки) Тогда
		УдалитьИзВременногоХранилища(ДанныеРасшифровки);
	КонецЕсли;
	
	ДанныеРасшифровки = ПоместитьВоВременноеХранилище(Расшифровка,УникальныйИдентификатор);
	
	Если ЗначениеЗаполнено(АдресСКД) И ЭтоАдресВременногоХранилища(АдресСКД) Тогда
		УдалитьИзВременногоХранилища(АдресСКД);
	КонецЕсли;
	
	АдресСКД = ПоместитьВоВременноеХранилище(Схема,УникальныйИдентификатор);
КонецПроцедуры

&НаСервере
Процедура ВывестиСпецификации()
    Спецификации.Очистить();
    
	Схема = РеквизитФормыВЗначение("Объект").ПолучитьМакет("скдСпецификации");

	Настройки = Схема.НастройкиПоУмолчанию;
	
	РасшифровкаСпец = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	мср.ПолучитьДанныеНаОснованииСКД(Схема,Спецификации,Настройки,Новый Структура("Номенклатура",мНоменклатура),РасшифровкаСпец);
	
	Если ЗначениеЗаполнено(ДанныеРасшифровкиСпец) И ЭтоАдресВременногоХранилища(ДанныеРасшифровкиСпец) Тогда
		УдалитьИзВременногоХранилища(ДанныеРасшифровкиСпец);
	КонецЕсли;
	ДанныеРасшифровкиСпец = ПоместитьВоВременноеХранилище(РасшифровкаСпец,УникальныйИдентификатор);
	
	Если ЗначениеЗаполнено(АдресСКДСпец) И ЭтоАдресВременногоХранилища(АдресСКДСпец) Тогда
		УдалитьИзВременногоХранилища(АдресСКДСпец);
	КонецЕсли;
	АдресСКДСпец = ПоместитьВоВременноеХранилище(Схема,УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРасшифровку(ВыбранноеДействие, ВыбранноеЗначение, Параметр) Экспорт
	Если ВыбранноеДействие <> ДействиеОбработкиРасшифровкиКомпоновкиДанных.Нет Тогда
		Если ВыбранноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение И AMS_ВызовСервера.ЭтоKhors() Тогда
    	    ПоказатьЗначение(,мНоменклатура);
		КонецЕсли;
        
    Иначе
		Если НомерКолонки = "5" Тогда
			Если НачЦеха() Тогда 
            	ПоказатьВводЧисла(Новый ОписаниеОповещения("ЗаписатьMIN",ЭтотОбъект),MIN,"Минимальные запасы");
			Иначе
				ПоказатьВедомостьПоТоварамНаСкладах();
			КонецЕсли;
            
        ИначеЕсли НомерКолонки = "6" Тогда 
			Если НачЦеха() Тогда 
            	ПоказатьВводЧисла(Новый ОписаниеОповещения("ЗаписатьMAX",ЭтотОбъект),MAX,"Максимальные запасы");    
			Иначе
				ПоказатьВедомостьПоТоварамНаСкладах();
			КонецЕсли;
			
		Иначе
			ПоказатьВедомостьПоТоварамНаСкладах();
        КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВедомостьПоТоварамНаСкладах()
    Если ЗначениеЗаполнено(мНоменклатура) Тогда 
        Период = Новый СтандартныйПериод;
        Период.Вариант       = ВариантСтандартногоПериода.ПроизвольныйПериод;
        Период.ДатаНачала    = ОбщегоНазначенияКлиент.ДатаСеанса() - 3600*24*30;
        Период.ДатаОкончания = КонецГода(ОбщегоНазначенияКлиент.ДатаСеанса());
        
        ПользовательскиеНастройки = Новый Структура;
        ПользовательскиеНастройки.Вставить("Период",Период); 
        ПользовательскиеНастройки.Вставить("ЕдиницыКоличества",1);
        
        Склады = Новый СписокЗначений;
        Склады.Добавить(Цех);
        Склады.Добавить(ПолучитьСкладМатериаловВПроизводстве(Цех));
        
        Отбор = Новый Структура;
        Отбор.Вставить("Склад",Склады);  
        Отбор.Вставить("Номенклатура",мНоменклатура);
            
        ПараметрыФормы = Новый Структура;
        ПараметрыФормы.Вставить("СформироватьПриОткрытии",Истина);
        ПараметрыФормы.Вставить("КлючНазначенияИспользования",мНоменклатура);
        ПараметрыФормы.Вставить("Отбор",Отбор);
        ПараметрыФормы.Вставить("КлючВарианта","ВедомостьПоТоварамНаСкладах");
        ПараметрыФормы.Вставить("ПользовательскиеНастройки",ПолучитьИзВременногоХранилища(AMS_ВызовСервера.ПолучитьАдресПользовательскиеНастройки("ВедомостьПоТоварамНаСкладах",ПользовательскиеНастройки,"ВедомостьПоТоварамНаСкладах")));
        
        ОткрытьФорму("Отчет.ВедомостьПоТоварамНаСкладах.Форма", ПараметрыФормы);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьMIN(Результат, Параметры) Экспорт
    Если Результат = Неопределено Тогда
    	Возврат;
    КонецЕсли;
    
	ПараметрыЗаписи = Новый Структура();
	ПараметрыЗаписи.Вставить("Ресурс", "МинимальноеКоличествоЗапаса");
	ПараметрыЗаписи.Вставить("Значение", Результат);
	ПараметрыЗаписи.Вставить("Склад", Цех);
	ПараметрыЗаписи.Вставить("Номенклатура", мНоменклатура);
	
	AMS_ВызовСервера.ЗаписатьРегистрТоварныеОграничения(ПараметрыЗаписи);
        
    ВывестиСводку();
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьMAX(Результат, Параметры) Экспорт
    Если Результат = Неопределено Тогда
    	Возврат;
    КонецЕсли;
    
	ПараметрыЗаписи = Новый Структура();
	ПараметрыЗаписи.Вставить("Ресурс", "МаксимальноеКоличествоЗапаса");
	ПараметрыЗаписи.Вставить("Значение", Результат);
	ПараметрыЗаписи.Вставить("Склад", Цех);
	ПараметрыЗаписи.Вставить("Номенклатура", мНоменклатура);
	
	AMS_ВызовСервера.ЗаписатьРегистрТоварныеОграничения(ПараметрыЗаписи);
        
    ВывестиСводку();
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРасшифровкуСпец(ВыбранноеДействие, ВыбранноеЗначение, Параметр) Экспорт
	Если ВыбранноеДействие <> ДействиеОбработкиРасшифровкиКомпоновкиДанных.Нет Тогда
		Если ВыбранноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение Тогда
			Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка._ВариантыСпецификацийНоменклатуры") Тогда 
    	    	ПоказатьЗначение(,ВыбранноеЗначение);
				
			ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Номенклатура") Тогда 
				ПользовательскиеНастройки = Новый Структура;
				ПользовательскиеНастройки.Вставить("Владелец",ВыбранноеЗначение); 
				
				ПараметрыФормы = Новый Структура;
				ПараметрыФормы.Вставить("СформироватьПриОткрытии",Истина);
				ПараметрыФормы.Вставить("КлючНазначенияИспользования",ВыбранноеЗначение);
				ПараметрыФормы.Вставить("ПользовательскиеНастройки",ПолучитьИзВременногоХранилища(AMS_ВызовСервера.ПолучитьАдресПользовательскиеНастройки("_Спецификации",ПользовательскиеНастройки,"Основной")));
				
				ОткрытьФорму("Отчет._Спецификации.Форма", ПараметрыФормы);
			КонецЕсли;
        КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция НачЦеха()
    Возврат Пользователи.РолиДоступны("_НачальникЦеха") Или AMS_ВызовСервера.ЭтоKhors();    
КонецФункции

&НаСервереБезКонтекста
Функция УстановитьНоменклатура(Наименование)
    Возврат Справочники.Номенклатура.НайтиПоНаименованию(Наименование,Истина);    
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСкладМатериаловВПроизводстве(Цех)
    Если Цех = AMS_ВызовСервера.Цех1() Тогда 
        Возврат AMS_ВызовСервера.Цех1_МатериалыВПроизводстве();
        
    ИначеЕсли Цех = AMS_ВызовСервера.Цех2() Тогда 
        Возврат AMS_ВызовСервера.Цех2_МатериалыВПроизводстве();
        
    ИначеЕсли Цех = AMS_ВызовСервера.Цех3() Тогда 
        Возврат AMS_ВызовСервера.Цех3_МатериалыВПроизводстве();
	КонецЕсли;
КонецФункции

#КонецОбласти