
#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗагрузитьЗаказыВОжиданииРегламентноеЗадание(ТокенАвторизации = Неопределено) Экспорт
	Если ТокенАвторизации = Неопределено Тогда
		ТокенАвторизации = ПолучитьТокенАвторизации(Константы.AMS_В2В_МенеджерЗагрузкиЗаказов.Получить());
	КонецЕсли;  

	ЗагрузитьНовыеЗаказыВ2В(ТокенАвторизации);
КонецПроцедуры

Процедура СинхронизироватьОстаткиВ2В() Экспорт
	ТокенАвторизации = ПолучитьТокенАвторизации(Константы.AMS_В2В_МенеджерЗагрузкиЗаказов.Получить());
	
	ОстаткиНаСкладеАМС = ПолучитьОстаткиНаСкладеАМС();

	МассивДанных = Новый Массив;
	Для каждого Стр Из ОстаткиНаСкладеАМС Цикл
		МассивСтрока = Новый Массив;
		МассивСтрока.Добавить(Стр.SKU);
		МассивСтрока.Добавить(Формат(Стр.count, "ЧН=; ЧГ="));
		
		МассивДанных.Добавить(МассивСтрока);
	КонецЦикла;
	
	ОбъектТела = Новый Соответствие;
	ОбъектТела.Вставить("store", Константы.AMS_В2В_Склад.Получить());
	ОбъектТела.Вставить("items", МассивДанных);

	Послание = СоответствиеВJSON(ОбъектТела);
	
	HTTPСоединение = Новый HTTPСоединение("b2b.cafe",,,,, ТАЙМАУТ(), Новый ЗащищенноеСоединениеOpenSSL());
	HTTPЗапрос = Новый HTTPЗапрос("/api/v1.4.9/store/update_balance_product");
	HTTPЗапрос.Заголовки.Вставить("Authorization", "Bearer " + ТокенАвторизации);
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");
	HTTPЗапрос.Заголовки.Вставить("Accept-Language", "ru");
	
	HTTPЗапрос.УстановитьТелоИзСтроки(Послание);
	
	//@skip-check bsl-legacy-check-dynamic-feature-access
	HTTPОтвет = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	
	Если HTTPОтвет.КодСостояния = 200 Тогда
		//@skip-check module-unused-local-variable
		ТелоОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
	Иначе
		ЗаписьЖурналаРегистрации("ВыгрузитьОстаткиНаСкладВ2В.Ошибка", УровеньЖурналаРегистрации.Ошибка);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПодпискиНаСобытияДокументов

#Область ОбработкаЗаполнения

Процедура ОбработкаЗаполненияДокументов(Источник, ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	ИмяДок = Источник.Метаданные().Имя;

	Если ИмяДок = "АктВыполненныхРабот" Тогда
		Источник.Организация = AMS_ВызовСервера.ПолучитьОсновнуюОрганизацию();

	ИначеЕсли ИмяДок = "ЗаказПоставщику" Тогда
		Источник.Статус                       = Перечисления.СтатусыЗаказовПоставщикам.НеСогласован;
		Источник.Приоритет                    = Справочники.Приоритеты.НайтиПоНаименованию("Низкий", Истина);
		Источник.Организация                  = AMS_ВызовСервера.ПолучитьОсновнуюОрганизацию();
		Источник.РегистрироватьЦеныПоставщика = Истина;
		Источник.Склад                        = AMS_ВызовСервера.ПолучитьСвойСклад();
		Источник.ПоступлениеОднойДатой        = Истина;

	ИначеЕсли ИмяДок = "ЗаявкаНаВозвратТоваровОтКлиента" Тогда
		Источник.СпособДоставки = Перечисления.СпособыДоставки.ДоКлиента;
			
	ИначеЕсли ИмяДок = "КорректировкаРеализации" Тогда
		ОбработкаЗаполненияКорректировкаРеализации(Источник);

	ИначеЕсли ИмяДок = "ОприходованиеИзлишковТоваров" Тогда
		Источник.АналитикаДоходов = Неопределено;
		
	ИначеЕсли ИмяДок = "ОтгрузкаТоваровКлиенту" Тогда

	ИначеЕсли ИмяДок = "ОтчетОСписанииТоваровУХранителя" Тогда
		Источник.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеНедостачЗаСчетКомитента;

	ИначеЕсли ИмяДок = "ПередачаТоваровХранителю" Тогда
		Источник.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию;
	
	ИначеЕсли ИмяДок = "ПеремещениеТоваров" Тогда
		ОбработкаЗаполненияПеремещениеТоваров(Источник, ДанныеЗаполнения);

	ИначеЕсли ИмяДок = "ПоступлениеТоваровОтХранителя" Тогда
		Источник.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОтКомиссионера;
    
	ИначеЕсли ИмяДок = "ПриобретениеТоваровУслуг" Тогда
		ОбработкаЗаполненияПриобретениеТоваровУслуг(Источник, ДанныеЗаполнения);

	ИначеЕсли ИмяДок = "РеализацияТоваровУслуг" Тогда
		ОбработкаЗаполненияРеализацияТоваровУслуг(Источник, ДанныеЗаполнения);

	ИначеЕсли ИмяДок = "СписаниеНедостачТоваров" Тогда
		Источник.АналитикаРасходов = Неопределено;

	ИначеЕсли ИмяДок = "СчетФактураВыданный" Тогда
		ОбработкаЗаполненияСчетФактураВыданный(Источник);
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполненияКорректировкаРеализации(Источник)
	СтатьяДоходовПрочиеДоходы   = ПланыВидовХарактеристик.СтатьиДоходов.НайтиПоКоду("01-000001");
	СтатьяРасходовПрочиеРасходы = ПланыВидовХарактеристик.СтатьиРасходов.НайтиПоКоду("01-000022");

	Источник.ВидКорректировки = Перечисления.ХозяйственныеОперации.КорректировкаПоСогласованиюСторон;

	СтатьяДоходов  = Ложь;
	СтатьяРасходов = Ложь;

	Для Каждого Стр Из Источник.Расхождения Цикл
		Если Стр.Количество > 0 Тогда
			СтатьяДоходов = Истина;
		ИначеЕсли Стр.Количество < 0 Тогда
			СтатьяРасходов = Истина;
		КонецЕсли;
	КонецЦикла;

	Источник.СтатьяДоходов  = ?(СтатьяДоходов, СтатьяДоходовПрочиеДоходы, Источник.СтатьяДоходов);
	Источник.СтатьяРасходов = ?(СтатьяРасходов, СтатьяРасходовПрочиеРасходы, Источник.СтатьяРасходов);
КонецПроцедуры

Процедура ОбработкаЗаполненияПеремещениеТоваров(Источник, ДанныеЗаполнения)
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);

	Если ТипДанныхЗаполнения = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("_Основание")
			И ТипЗнч(ДанныеЗаполнения._Основание) = Тип("ДокументСсылка.AMS_ПроизводствоЗаСмену") Тогда

			ЗаполнитьЗначенияСвойств(Источник, ДанныеЗаполнения);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполненияПриобретениеТоваровУслуг(Источник, ДанныеЗаполнения)
	Если Источник.Организация = AMS_ВызовСервера.ОрганизацияТД() И ЗначениеЗаполнено(Источник.Партнер) Тогда
		КодПартнера = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Партнер, "Код");
		Если КодПартнера = "01-01001303" Тогда
			ОтветственныеЛицаСервер.ПриИзмененииСвязанныхРеквизитовДокумента(Источник);
		КонецЕсли;
	
	Иначе
		Источник.Организация                  = AMS_ВызовСервера.ПолучитьОсновнуюОрганизацию();
		Источник.РегистрироватьЦеныПоставщика = Истина;
		Источник.Склад                        = AMS_ВызовСервера.ПолучитьСвойСклад();
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполненияРеализацияТоваровУслуг(Источник, ДанныеЗаполнения)
	Если Источник.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПереходПраваСобственности Тогда
		Возврат;
	КонецЕсли;
	
	Источник.Статус = Перечисления.СтатусыРеализацийТоваровУслуг.Отгружено;
	
	Если ДанныеЗаполнения = Неопределено Тогда
		Источник.Организация = AMS_ВызовСервера.ПолучитьОсновнуюОрганизацию();

	ИначеЕсли Источник.РеализацияПоЗаказам  И ТипЗнч(Источник.ЗаказКлиента) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		ЗаказКлиента = Источник.ЗаказКлиента;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказКлиента);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	т.ДатаОтгрузки КАК Дата,
		|	ЗНАЧЕНИЕ(Перечисление.AMS_СтатусыРеализаций.КОтгрузке) КАК AMS_СтатусРеализации,
		|	т.AMS_ID КАК AMS_ID,
		|	т.AMS_Вес КАК AMS_Вес,
		|	т.AMS_ВесПлан КАК AMS_ВесПлан,
		|	т.AMS_Объем КАК AMS_Объем,
		|	т.AMS_ДатаОтгрузки КАК AMS_ДатаОтгрузки,
		|	т.AMS_ДатаСчета КАК AMS_ДатаСчета,
		|	т.AMS_КоличествоПалет КАК AMS_КоличествоПалет,
		|	т.AMS_КоличествоПалетПлан КАК AMS_КоличествоПалетПлан,
		|	т.AMS_КоличествоПалетРасчет КАК AMS_КоличествоПалетРасчет,
		|	т.AMS_КоличествоПалетСборных КАК AMS_КоличествоПалетСборных,
		|	т.AMS_КоличествоУпаковок КАК AMS_КоличествоУпаковок,
		|	т.AMS_Обрешетка КАК AMS_Обрешетка,
		|	т.AMS_Основание КАК Основание,
		|	т.AMS_ОснованиеНомер КАК ОснованиеНомер,
		|	т.AMS_ОснованиеДата КАК ОснованиеДата,
		|	т.AMS_ПравилоПродажи КАК AMS_ПравилоПродажи,
		|	т.AMS_СпособПередачиТоваров КАК AMS_СпособПередачиТоваров,
		|	т.AMS_ДоверенностьКлиента КАК AMS_ДоверенностьКлиента,
		|	т.AMS_УсловияОтгрузки КАК AMS_УсловияОтгрузки,
		|	т.AMS_ВидТранспортаПеревозчика КАК AMS_ВидТранспортаПеревозчика,
		|	т.AMS_НомерЗаявкиПеревозчика КАК AMS_НомерЗаявкиПеревозчика,
		|	т.AMS_ТелефонВодителяКлиента КАК AMS_ТелефонВодителяКлиента,
		|	т.AMS_ТранспортКлиента КАК AMS_ТранспортКлиента,
		|	т.Номер КАК AMS_ЗаказКлиентаНомер,
		|	т.АдресДоставки КАК АдресДоставки,
		|	т.ЗонаДоставки КАК ЗонаДоставки,
		|	т.Грузополучатель КАК Грузополучатель,
		|	т.БанковскийСчетГрузополучателя КАК БанковскийСчетГрузополучателя,
		|	т.ПорядокРасчетов КАК ПорядокРасчетов,
		|	т.ПеревозчикПартнер КАК ПеревозчикПартнер,
		|	т.СпособДоставки КАК СпособДоставки,
		|	т.ВремяДоставкиС КАК ВремяДоставкиС,
		|	т.ВремяДоставкиПо КАК ВремяДоставкиПо,
		|	т.АдресДоставкиПеревозчика КАК АдресДоставкиПеревозчика,
		|	т.ДополнительнаяИнформацияПоДоставке КАК ДополнительнаяИнформацияПоДоставке,
		|	т.КонтактноеЛицо КАК КонтактноеЛицо,
		|	т.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
		|	т.ОсобыеУсловияПеревозкиОписание КАК ОсобыеУсловияПеревозкиОписание,
		|	т.Комментарий КАК Комментарий
		|ИЗ
		|	Документ.ЗаказКлиента КАК т
		|ГДЕ
		|	т.Ссылка = &ЗаказКлиента";
		
		Рез = Запрос.Выполнить();
		Выб = Рез.Выбрать();
		Выб.Следующий();
		
		ЗаполнитьЗначенияСвойств(Источник, Выб);
		
		Источник.Дата = Источник.Дата + (ТекущаяДатаСеанса() - НачалоДня(ТекущаяДатаСеанса()));
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполненияСчетФактураВыданный(Источник)
	ДокументОснование = Источник.ДокументОснование;

	Если Не ЗначениеЗаполнено(ДокументОснование) Тогда
		ДокументОснование = Источник.ДокументыОснования[0].ДокументОснование;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат;
	КонецЕсли;

	Номер       = ДокументОснование.Номер;
	НомерСлева  = Лев(Номер, 5);
	НомерСправа = Прав(Номер, 5);

	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Или ТипЗнч(ДокументОснование) = Тип(
		"ДокументСсылка.РеализацияУслугПрочихАктивов") Тогда

		Источник.Номер = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "Номер");

	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.АктВыполненныхРабот") Тогда
		Источник.Номер = НомерСлева + 1 + НомерСправа;

	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ВозвратТоваровПоставщику") Тогда
		Источник.Номер = НомерСлева + 2 + НомерСправа;

	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ВозвратТоваровМеждуОрганизациями") Тогда
		Источник.Номер = НомерСлева + 4 + НомерСправа;

	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаписьКнигиПродаж") Тогда
		Источник.Номер = НомерСлева + 5 + НомерСправа;
	КонецЕсли;

	ДатаОснования = Источник.ДокументыОснования[0].ДокументОснование.Дата;

	Если ДатаОснования <> Дата(1, 1, 1) Тогда
		Источник.Дата            = ДатаОснования + 1;
		Источник.ДатаВыставления = ДатаОснования;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработкаПроверкиЗаполнения

Процедура ОбработкаПроверкиЗаполненияДокументов(Источник, Отказ, ПроверяемыеРеквизиты) Экспорт
	ИмяДок = Источник.Метаданные().Имя;

	Если ИмяДок = "ЗаказКлиента" Или ИмяДок = "ОтгрузкаТоваровКлиенту" Или ИмяДок = "РеализацияТоваровУслуг" Тогда
		ОбработкаПроверкиЗаполненияЗаказКлиентаОтгрузкаТоваровКлиентуРеализацияТоваровУслуг(Источник, Отказ);
		
		Если (ИмяДок = "ЗаказКлиента" И Не Источник.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию)
			Или (ИмяДок = "РеализацияТоваровУслуг" 
				И (Источник.AMS_СтатусРеализации = Перечисления.AMS_СтатусыРеализаций.Заказ
					Или Источник.AMS_СтатусРеализации = Перечисления.AMS_СтатусыРеализаций.Стикерование
					Или Источник.AMS_СтатусРеализации = Перечисления.AMS_СтатусыРеализаций.КОтгрузке)) Тогда
			
			ПроверяемыеРеквизиты.Добавить("AMS_ПравилоПродажи");
		КонецЕсли;
				
	ИначеЕсли ИмяДок = "КорректировкаРеализации" Тогда
		ОбработкаПроверкиЗаполнения_КорректировкаРеализации(Источник, Отказ);

	ИначеЕсли ИмяДок = "ПриобретениеТоваровУслуг" Тогда
		ОбработкаПроверкиЗаполнения_ПриобретениеТоваровУслуг(Источник, Отказ);

	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполненияЗаказКлиентаОтгрузкаТоваровКлиентуРеализацияТоваровУслуг(Источник, Отказ)
	Если Пользователи.РолиДоступны("_Бухгалтер") Тогда
		Возврат;
	КонецЕсли;
	
	ТранспортУслугиПоступление = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор("d573ef93-9e57-11ed-8e1a-a4bf015601f8"));
	ТранспортУслугиРеализация  = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор("5e448643-bf70-11dc-b366-0013d41f76d0"));

	Товары = Источник.Товары;
	Для ТекИндекс = 0 По Товары.Количество() - 1 Цикл
		Стр = Товары[ТекИндекс];

		Если Стр.Номенклатура = ТранспортУслугиПоступление Тогда
			Стр.Номенклатура = ТранспортУслугиРеализация;
		КонецЕсли;
	КонецЦикла;
	
	Если Не Источник.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз И Источник.AMS_КоличествоПалет = 0 Тогда
		ТекстОшибки = НСтр("ru='Не заполнено поле ""Количество палет""'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,, "Объект.AMS_КоличествоПалет",, Отказ);
	КонецЕсли;

	Стр = ПолучитьВесОбъемТоваров(Источник.Товары.Выгрузить(, "Номенклатура,Количество"));

	КоличествоПалетМинимум = Стр.КоличествоПалетМоно + Стр.КоличествоПалетСборных;

	Если Стр.КоличествоПалетРасчет - Цел(Стр.КоличествоПалетРасчет) < 0.1 Тогда
		Если Источник.AMS_КоличествоПалет < КоличествоПалетМинимум - 1 Тогда
			ТекстОшибки = "Количество палет не может быть меньше " + КоличествоПалетМинимум + " шт.";
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, Источник.Ссылка, "Объект.AMS_КоличествоПалет",, Отказ);
		КонецЕсли;
	Иначе
		Если Источник.AMS_КоличествоПалет < КоличествоПалетМинимум Тогда
			ТекстОшибки = "Количество палет не может быть меньше " + КоличествоПалетМинимум + " шт.";
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, Источник.Ссылка, "Объект.AMS_КоличествоПалет",, Отказ);
		КонецЕсли;
	КонецЕсли;

	Если Источник.AMS_КоличествоПалетСборных > Источник.AMS_КоличествоПалет Тогда
		ТекстОшибки = "Количество палет сборных не может быть больше общего количества палет.";
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, Источник.Ссылка, "Объект.AMS_КоличествоПалетСборных",, Отказ);
	КонецЕсли;

	Если AMS_ВызовСервера.ЭтоKhors() Или Не Источник.Склад = AMS_ВызовСервера.СкладПродукции() Тогда
		Возврат;
	КонецЕсли;

	Если Источник.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз Тогда
		Если Источник.AMS_ДоверенностьКлиента = 0 Тогда
			ТекстОшибки = "Не заполнено поле ""Доверенность клиента""";
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,,, Отказ);
		КонецЕсли;

	Иначе
		Если Не ЗначениеЗаполнено(Источник.ЗонаДоставки) Тогда
			ТекстОшибки = "Не заполнено поле ""Зона доставки""";
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,,, Отказ);
		КонецЕсли;

		Если Источник.ВремяДоставкиС = Дата(1, 1, 1) Тогда
			ТекстОшибки = "Не заполнено поле ""Желаемое время доставки с""";
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,,, Отказ);
		КонецЕсли;

		Если Источник.ВремяДоставкиПо = Дата(1, 1, 1) Тогда
			ТекстОшибки = "Не заполнено поле ""Желаемое время доставки по""";
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,,, Отказ);
		КонецЕсли;

		Если Источник.СпособДоставки = Перечисления.СпособыДоставки.КПолучателюОпределяетСлужбаДоставки Тогда
			Если ПустаяСтрока(Источник.AMS_ТранспортКлиента) Тогда
				ТекстОшибки = "Не указан транспорт клиента.";
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,,, Отказ);
			КонецЕсли;
			Если Источник.AMS_ДоверенностьКлиента = 0 Тогда
				ТекстОшибки = "Не указана доверенность клиента.";
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,,, Отказ);
			КонецЕсли;
			Если ПустаяСтрока(Источник.AMS_ТранспортКлиента) Тогда
				ТекстОшибки = "Не указан телефон водителя клиента.";
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,,, Отказ);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения_КорректировкаРеализации(Источник, Отказ)
	//@skip-check bsl-legacy-check-string-literal
	Менеджер = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.ДокументОснование, "Менеджер");

	Если Не Источник.Менеджер = Менеджер Тогда
		Источник.Менеджер = Менеджер;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Склад", Источник.Склад);
	Запрос.УстановитьПараметр("Расхождения", Источник.Расхождения.Выгрузить( ,
		"Номенклатура,Количество,ВариантОтражения"));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.Количество КАК Количество
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	&Расхождения КАК т
	|ГДЕ
	|	т.ВариантОтражения = ЗНАЧЕНИЕ(Перечисление.ВариантыОтраженияКорректировокРеализаций.УвеличитьРеализациюУменьшитьСкладскиеОстатки)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.ВНаличииОстаток КАК Остаток
	|ПОМЕСТИТЬ Остатки
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	|			,
	|			Склад = &Склад
	|				И Номенклатура В
	|					(ВЫБРАТЬ
	|						т.Номенклатура КАК Номенклатура
	|					ИЗ
	|						Товары КАК т)) КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Количество КАК Количество,
	|	ЕСТЬNULL(Остатки.Остаток, 0) КАК Остаток
	|ИЗ
	|	Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
	|		ПО Товары.Номенклатура = Остатки.Номенклатура
	|ГДЕ
	|	Товары.Количество > ЕСТЬNULL(Остатки.Остаток, 0)";

	Рез = Запрос.Выполнить();
	Выб = Рез.Выбрать();
	Пока Выб.Следующий() Цикл
		Текст = "Для отгрузки товара """ + Выб.Номенклатура + """ на складе """ + Источник.Склад
			+ """ недостаточно свободного остатка в количестве " + Строка(Выб.Количество - Выб.Остаток) + " шт.";
		ОбщегоНазначения.СообщитьПользователю(Текст, , , , Отказ);
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения_ПриобретениеТоваровУслуг(Источник, Отказ)
	Если Не ЗначениеЗаполнено(Источник.Соглашение) Тогда
		Текст = "Не заполнено поле ""Соглашение"".";
		ОбщегоНазначения.СообщитьПользователю(Текст, , , , Отказ);
	КонецЕсли;

	Если Не (Источник.Склад = AMS_ВызовСервера.Цех1() 
		 Или Источник.Склад = AMS_ВызовСервера.Цех2() 
		 Или Источник.Склад = AMS_ВызовСервера.Цех3() 
		 Или Источник.Склад = AMS_ВызовСервера.СкладКомпании() 
		 Или Источник.Склад	= AMS_ВызовСервера.СкладРасходныхМатериалов()) Тогда

		Возврат;
	КонецЕсли;

	Товары = Источник.Товары.Выгрузить(, "НомерСтроки,Номенклатура,Склад");

	Если Не Отказ Тогда
		ТолькоУслуги = Истина;
		
		Для Каждого Стр Из Товары Цикл
			Если Стр.Склад <> Справочники.Склады.ПустаяСсылка() Тогда
				ТолькоУслуги = Ложь;
			КонецЕсли;
		КонецЦикла;
		
		Если ТолькоУслуги Тогда
			Источник.Склад = Справочники.Склады.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ПередЗаписью

Процедура ПередЗаписьюДокумента(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	Имя = Источник.Метаданные().Имя;

	Если Имя = "ВозвратТоваровОтКлиента" Тогда
		УстановитьВремяДокумента(Источник, Имя, AMS_ВызовСервера.ПолучитьВремя(9, 0), AMS_ВызовСервера.ПолучитьВремя(9,	30));

	ИначеЕсли Имя = "ВозвратТоваровПоставщику" Тогда
		УстановитьВремяДокумента(Источник, Имя, AMS_ВызовСервера.ПолучитьВремя(16, 0), AMS_ВызовСервера.ПолучитьВремя(18, 0));

	ИначеЕсли Имя = "ЗаказКлиента" Тогда
		ПередЗаписьюЗаказКлиента(Источник, Отказ, РежимЗаписи);
	
	ИначеЕсли Имя = "ЗаказПоставщику" Тогда
		УстановитьВремяДокумента(Источник, Имя, AMS_ВызовСервера.ПолучитьВремя(9, 0), AMS_ВызовСервера.ПолучитьВремя(9, 30));
		ПередЗаписьюЗаказПоставщику(Источник, РежимЗаписи);

	ИначеЕсли Имя = "КорректировкаРеализации" Тогда
		ПередЗаписьюКорректировкаРеализации(Источник, Отказ, РежимЗаписи);

	ИначеЕсли Имя = "ПередачаТоваровХранителю" Тогда
		ПередЗаписьюПередачаТоваровХранителю(Источник, Отказ, РежимЗаписи);

	ИначеЕсли Имя = "ПеремещениеТоваров" Тогда
		ПередЗаписьюПеремещениеТоваров(Источник, Отказ, РежимЗаписи);

	ИначеЕсли Имя = "ПриобретениеТоваровУслуг" Тогда
		УстановитьВремяДокумента(Источник, Имя, AMS_ВызовСервера.ПолучитьВремя(7, 50), AMS_ВызовСервера.ПолучитьВремя(8, 10));

	ИначеЕсли Имя = "ПрочееОприходованиеТоваров" Тогда
		Если ЗначениеЗаполнено(Источник._ПроизводствоЗаСмену) Тогда 
			//@skip-check wrong-string-literal-content
			Источник.Дата = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник._ПроизводствоЗаСмену, "Дата");
		КонецЕсли;

	ИначеЕсли Имя = "ПоступлениеБезналичныхДенежныхСредств" Или Имя = "ПриходныйКассовыйОрдер" Тогда
		УстановитьВремяДокумента(Источник, Имя, AMS_ВызовСервера.ПолучитьВремя(18, 0), AMS_ВызовСервера.ПолучитьВремя(19, 0));

	ИначеЕсли Имя = "РасходныйКассовыйОрдер" Или Имя = "СписаниеБезналичныхДенежныхСредств" Тогда
		УстановитьВремяДокумента(Источник, Имя, AMS_ВызовСервера.ПолучитьВремя(19, 0), AMS_ВызовСервера.ПолучитьВремя(10, 0));

	ИначеЕсли Имя = "РасходныйОрдерНаТовары" Тогда
		Пользователь = Пользователи.ТекущийПользователь();
		Если Источник.Модифицированность() И Не (Пользователь = AMS_ВызовСервера.Иванова() Или Пользователи.РолиДоступны(
			"_НачальникСклада,_ГлавныйБухгалтер,_Бухгалтер") Или AMS_ВызовСервера.ЭтоKhors()) Тогда

			ОбщегоНазначения.СообщитьПользователю("Изменения запрещены. Обратитесь в Главному бухгалтеру.", , , , Отказ);
			Возврат;
		КонецЕсли;

		Если Источник.ОтгрузкаПоЗаданиюНаПеревозку = Истина Тогда
			Источник.ОтгрузкаПоЗаданиюНаПеревозку = Ложь;
			Источник.ПорядокДоставки = "";
			Источник.ЗаданиеНаПеревозку = Неопределено;
		КонецЕсли;

	ИначеЕсли Имя = "РеализацияТоваровУслуг" Тогда
		ПередЗаписьюРеализацияТоваровУслуг(Источник, Отказ, РежимЗаписи);
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписьюЗаказКлиента(Источник, Отказ, РежимЗаписи)
	AMS_Резерв   = Истина;
	ЭтоБухгалтер = Пользователи.РолиДоступны("_Бухгалтер");

	//Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
	//	Запрос = Новый Запрос;
	//	Запрос.УстановитьПараметр("AMS_ЗаказКлиентаНомер", Источник.Номер);
	//	Запрос.Текст =
	//	"ВЫБРАТЬ
	//	|	т.Ссылка КАК Реализация,
	//	|	т.Проведен КАК Проведен,
	//	|	т.Номер КАК Номер,
	//	|	т.Дата КАК Дата
	//	|ИЗ
	//	|	Документ.РеализацияТоваровУслуг КАК т
	//	|ГДЕ
	//	|	т.AMS_ЗаказКлиентаНомер = &AMS_ЗаказКлиентаНомер
	//	|	И НЕ т.ПометкаУдаления";
	//	
	//	Рез = Запрос.Выполнить();
	//	
	//	Если Не Рез.Пустой() Тогда
	//		Выб = Рез.Выбрать();
	//		Пока Выб.Следующий() Цикл
	//			Текст = "На основании данного заказа создан документ реализации № %1 от %2 г.";
	//			Текст = СтрШаблон(Текст, ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выб.Номер), Формат(Выб.Дата, "ДЛФ=Д"));
	//			ОбщегоНазначения.СообщитьПользователю(Текст,,,, Отказ);
	//		КонецЦикла;
	//	КонецЕсли;
	//КонецЕсли;
	
	Источник.AMS_ЦенаИзменена = ЕстьЦеныНеПоУсловиямПродаж(Источник);
	
	Если Источник.ДатаОтгрузки = Дата(1, 1, 1) Тогда
		Текст = "Не заполнено поле ""Дата отгрузки""";
		ОбщегоНазначения.СообщитьПользователю(Текст,, "Объект.ДатаОтгрузки",, Отказ);
	КонецЕсли;
	
	
	МассивТоваров = Новый Массив;
	Для Каждого Стр Из Источник.Товары Цикл
		МассивТоваров.Добавить(Стр.Номенклатура);
		
		Если Не (Стр.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить ИЛИ Стр.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.СоСклада) Тогда
			AMS_Резерв = Ложь;
		КонецЕсли;
		
		//@skip-check bsl-legacy-check-string-literal
		Упаковка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.Номенклатура, "_Упаковка");
		
		Если Не ЭтоБухгалтер И Стр.Упаковка <> Упаковка Тогда
			Текст = "В строке %1 списка ""Товары"" для номенклатуры ""%2"" не правильно указана единица измерения";
			Текст = СтрШаблон(Текст, Стр.НомерСтроки, Стр.Номенклатура);
			ОбщегоНазначения.СообщитьПользователю(Текст,, "Объект.Товары[" + (Стр.НомерСтроки - 1) + "].ЕдиницаИзмерения",, Отказ);
		КонецЕсли;
	КонецЦикла;
	
	Источник.AMS_Резерв = РежимЗаписи = РежимЗаписиДокумента.Проведение И AMS_Резерв;
	
//	МассивТоваров = AMS_ВызовСервера.ПолучитьТоварыЗапрещенныеКПродажиЧестныйЗнакМасло(Источник.Контрагент, Источник.ДатаОтгрузки, МассивТоваров);
//	Для Каждого Товар Из МассивТоваров Цикл
//		Текст = "Номенклатура ""%1"" запрещена к продажи контрагенту ""%2""";
//		Текст = СтрШаблон(Текст, Товар, Источник.Контрагент);
//		ОбщегоНазначения.СообщитьПользователю(Текст,,,, Отказ);
//	КонецЦикла;
//	
//	МассивТоваров = AMS_ВызовСервера.ПолучитьТоварыЗапрещенныеКПродажиЧестныйЗнакКосметика(Источник.Контрагент, Источник.ДатаОтгрузки, МассивТоваров);
//	Для Каждого Товар Из МассивТоваров Цикл
//		Текст = "Номенклатура ""%1"" запрещена к продажи контрагенту ""%2""";
//		Текст = СтрШаблон(Текст, Товар, Источник.Контрагент);
//		ОбщегоНазначения.СообщитьПользователю(Текст,,,, Отказ);
//	КонецЦикла;
	
	ПроверитьЗагрузкуВТранспорт(Источник, РежимЗаписи, Отказ);
КонецПроцедуры

Процедура ПередЗаписьюЗаказПоставщику(Источник, РежимЗаписи)
	Если Источник.Статус = ОбщегоНазначения.ПредопределенныйЭлемент(
		"Перечисление.СтатусыЗаказовПоставщикам.НеСогласован") Тогда
		Если Источник.Проведен Тогда
			РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения;
		Иначе
			РежимЗаписи = РежимЗаписиДокумента.Запись;
		КонецЕсли;
	КонецЕсли;

	ТекстТовары = Источник._Товары;
	ТекстТовары = "";
	Для Каждого Стр Из Источник.Товары Цикл
		ТекстТовары = ТекстТовары + Стр.Номенклатура + " - " + Строка(?(Стр.Количество = 0, Стр._КоличествоЗаказано,
			Стр.Количество)) + ", ";
	КонецЦикла;
	Источник._Товары = Лев(ТекстТовары, СтрДлина(ТекстТовары) - 2);
КонецПроцедуры

Процедура ПередЗаписьюКорректировкаРеализации(Источник, Отказ, РежимЗаписи)
	ПеремещениеТоваров = Источник._ПеремещениеТоваров;

	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ПередатьБракНаСкладБракованнойПродукции(Источник, Отказ);

	ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения И ЗначениеЗаполнено(ПеремещениеТоваров) Тогда
		мср.ЗаписатьДокумент(ПеремещениеТоваров, РежимЗаписиДокумента.ОтменаПроведения, Отказ, Истина);
	КонецЕсли;

	Если Источник.ПометкаУдаления И ЗначениеЗаполнено(ПеремещениеТоваров) Тогда
		мср.УстановитьПометкуУдаленияДокументу(ПеремещениеТоваров, Истина);
		Источник._ПеремещениеТоваров = Неопределено;
	КонецЕсли;
КонецПроцедуры

Процедура ПередатьБракНаСкладБракованнойПродукции(Источник, Отказ)
	Отбор = Новый Структура;
	Отбор.Вставить("ВариантОтражения", ОбщегоНазначения.ПредопределенныйЭлемент(
		"Перечисление.ВариантыОтраженияКорректировокРеализаций.УменьшитьРеализациюУвеличитьСкладскиеОстатки"));
	Отбор.Вставить("_Брак", Истина);

	Табл = Источник.Расхождения.Выгрузить(Отбор, "Номенклатура,Количество");

	ПеремещениеТоваров = Источник._ПеремещениеТоваров;

	Если Табл.Количество() = 0 Тогда
		Если ЗначениеЗаполнено(ПеремещениеТоваров) Тогда
			мср.УстановитьПометкуУдаленияДокументу(ПеремещениеТоваров, Истина);
			Источник._ПеремещениеТоваров = Неопределено;
		КонецЕсли;

	Иначе
		Если ЗначениеЗаполнено(ПеремещениеТоваров) Тогда
			Док = ПеремещениеТоваров.ПолучитьОбъект();
		Иначе
			Док = Документы.ПеремещениеТоваров.СоздатьДокумент();
		КонецЕсли;

		Док.Дата = Источник.Дата;

		Док.Организация                = AMS_ВызовСервера.ПолучитьОсновнуюОрганизацию();
		Док.Статус                     = Перечисления.СтатусыПеремещенийТоваров.Принято;
		Док.СкладОтправитель           = Источник.Склад;
		Док.СкладПолучатель            = AMS_ВызовСервера.СкладБракованнойПродукции();
		Док.ВидЦены                    = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Склад, "УчетныйВидЦены");
		Док.СпособДоставки             = Перечисления.СпособыДоставки.Самовывоз;
		Док.ВариантПриемкиТоваров      = Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным;
		Док.ПеремещениеПодДеятельность = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
		Док.ХозяйственнаяОперация      = Перечисления.ХозяйственныеОперации.ПеремещениеТоваров;
		Док.Автор                      = Пользователи.ТекущийПользователь();
		Док.Ответственный              = Источник.Менеджер;
		Док.Подразделение              = AMS_ВызовСервера.ПодразделениеПроизводство();
		Док.НаправлениеДеятельности    = Справочники.НаправленияДеятельности.НайтиПоНаименованию("Продажа", Истина);
		Док.Комментарий                = "Сформирован автоматичестки. Перемещение брака на склад бракованной продукции на основании документа Корректировка реализации №"
			+ Источник.Номер + " от " + Формат(Источник.Дата, "ДЛФ=Д") + " г.";

		Док._Основание                = Источник.Ссылка;
		Док._ОперацияПроизводства     = Перечисления.AMS_ОперацииПроизводства.ПеремещениеПослеКорректировки;
		Док._СформированАвтоматически = Истина;
		
		Док.Товары.Очистить();

		Для Каждого Стр Из Табл Цикл
			НовСтр = Док.Товары.Добавить();

			НовСтр.Номенклатура       = Стр.Номенклатура;
			НовСтр.КоличествоУпаковок = -Стр.Количество;
			НовСтр.Количество         = -Стр.Количество;
		КонецЦикла;

		мср.ЗаписатьДокумент(Док, РежимЗаписиДокумента.Проведение, Отказ, Истина);

		Если Отказ Тогда
			ОбщегоНазначения.СообщитьПользователю(
				"Не удалось провести документ перемещения брака на склад бракованной продукции.");
		Иначе
			Источник._ПеремещениеТоваров = Док.Ссылка;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписьюПередачаТоваровХранителю(Источник, Отказ, РежимЗаписи)
	Если Источник.Склад = AMS_ВызовСервера.СкладМПКТ() Тогда
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			Ответственный = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Склад, "ТекущийОтветственный");
			Подразделение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Склад, "Подразделение");
			
			МассивСборкаТоваров = Новый Массив();
			
			Табл = ПолучитьДанныеСборкиТоваров(Источник);
			
			// Удалить лишние сборки товаров на одну и ту же номенклатуру
			Таб = Табл.Скопировать(, "Номенклатура");
			Таб.Свернуть("Номенклатура");
			
			Для Каждого СтрТаб Из Таб Цикл
				МассивСтрок = Табл.НайтиСтроки(Новый Структура("Номенклатура", СтрТаб.Номенклатура));
				
				Если МассивСтрок.Количество() > 1 Тогда
					Счет = 0;
					Для Каждого Стр Из МассивСтрок Цикл
						Счет = Счет + 1;
						Если Счет > 1 Тогда
							мср.УстановитьПометкуУдаленияДокументу(Стр.СборкаТоваров, Истина);
							Табл.Удалить(Стр);		
						КонецЕсли;						
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
			// Удалить лишние сборки товаров на одну и ту же номенклатуру
			
			// Удалить лишние сборки товаров со ссылкой на Источник, но на другую номенклатуру
			СписокСборкаТоваров = Табл.ВыгрузитьКолонку("СборкаТоваров");
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("СписокСборкаТоваров", СписокСборкаТоваров);
			Запрос.УстановитьПараметр("ПередачаТоваровНаКомиссию", Источник.Ссылка);
			Запрос.Текст =
			"ВЫБРАТЬ
			|	т.Ссылка КАК СборкаТоваров
			|ИЗ
			|	Документ.СборкаТоваров КАК т
			|ГДЕ
			|	НЕ т.Ссылка В (&СписокСборкаТоваров)
			|	И т.AMS_Основание = &ПередачаТоваровНаКомиссию
			|	И т.AMS_Операция = ЗНАЧЕНИЕ(Перечисление.AMS_ОперацияСборкаТоваров.СборкаНаборов)
			|	И НЕ т.ПометкаУдаления";
			Таб = Запрос.Выполнить().Выгрузить();
			Для Каждого Стр Из Таб Цикл
				мср.УстановитьПометкуУдаленияДокументу(Стр.СборкаТоваров, Истина);
			КонецЦикла;
			// Удалить лишние сборки товаров со ссылкой на Источник, но на другую номенклатуру

			Для Каждого Стр Из Табл Цикл
				Если ЗначениеЗаполнено(Стр.СборкаТоваров) Тогда
					Док = Стр.СборкаТоваров.ПолучитьОбъект();
				Иначе
					Док = Документы.СборкаТоваров.СоздатьДокумент();
					
					Док.Дата                  = Источник.Дата - 600;
					Док.Организация           = Источник.Организация;
					Док.Склад                 = Источник.Склад;
					Док.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СборкаТоваров;
					Док.ВариантПриемкиТоваров = Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным;
					Док.Ответственный         = Ответственный;
					Док.AMS_Операция          = Перечисления.AMS_ОперацияСборкаТоваров.СборкаНаборов;
					Док.Подразделение         = Подразделение;
					Док.Статус                = Перечисления.СтатусыСборокТоваров.СобраноРазобрано;
					Док.СборкаПодДеятельность = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС;
					
					Док.Номенклатура          = Стр.Номенклатура;
					Док.ВариантКомплектации   = Стр.ВариантКомплектации;
					
					Док.УстановитьНовыйНомер();
				КонецЕсли;
				
				Если Док.Дата = Источник.Дата - 600 Тогда
					Док.Дата = Источник.Дата - 600;
				КонецЕсли;

				Если Не ЗначениеЗаполнено(Док.ВариантКомплектации) Тогда
					Док.ВариантКомплектации = Стр.ВариантКомплектации;
				КонецЕсли;
				
				Док.Упаковка           = Стр.Упаковка;
				Док.Количество         = Стр.Количество;
				Док.КоличествоУпаковок = Стр.Количество;
				
				Док.Комментарий = "Основание: Передача на комиссию " + Источник.Номер + " от " + Формат(Источник.Дата, "ДЛФ=Д");
				
				// Удалить лишние комплектующие
				Комплектующие = Справочники.ВариантыКомплектацииНоменклатуры.ПолучитьКомплектующиеНоменклатуры(
									Док.ВариантКомплектации, , Док.Количество);
				Запрос = Новый Запрос;
				Запрос.УстановитьПараметр("Товары", Комплектующие);
				Запрос.УстановитьПараметр("ВидНоменклатуры", AMS_ВызовСервера.ВидыНоменклатурыПродукции());
				Запрос.Текст =
				"ВЫБРАТЬ
				|	т.Номенклатура КАК Номенклатура,
				|	т.Упаковка КАК Упаковка,
				|	т.КоличествоУпаковок КАК КоличествоУпаковок,
				|	т.Количество КАК Количество
				|ПОМЕСТИТЬ вт
				|ИЗ
				|	&Товары КАК т
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	Ном.Ссылка КАК Номенклатура,
				|	вт.Упаковка КАК Упаковка,
				|	вт.КоличествоУпаковок КАК КоличествоУпаковок,
				|	вт.Количество КАК Количество
				|ИЗ
				|	вт КАК вт
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
				|		ПО вт.Номенклатура = Ном.Ссылка
				|ГДЕ
				|	Ном.ВидНоменклатуры В (&ВидНоменклатуры)";
				//@skip-check query-in-loop
				Товары = Запрос.Выполнить().Выгрузить();
				// Удалить лишние комплектующие

				Док.Товары.Загрузить(Товары);
				
				мср.ЗаписатьДокумент(Док, РежимЗаписиДокумента.Проведение);
				
				МассивСборкаТоваров.Добавить(Док.Ссылка);
			КонецЦикла;
			
			Источник. ДополнительныеСвойства.Вставить("МассивСборкаТоваров", МассивСборкаТоваров);
		
		ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
			Для Каждого Стр Из Табл Цикл
				Если ЗначениеЗаполнено(Стр.СборкаТоваров) Тогда
					мср.ЗаписатьДокумент(Стр.СборкаТоваров, РежимЗаписиДокумента.ОтменаПроведения);
				КонецЕсли;
			КонецЦикла;				
		
		ИначеЕсли Источник.ПометкаУдаления Тогда
			Для Каждого Стр Из Табл Цикл
				Если ЗначениеЗаполнено(Стр.СборкаТоваров) Тогда
					мср.УстановитьПометкуУдаленияДокументу(Стр.СборкаТоваров, Истина);
				КонецЕсли;
			КонецЦикла;				
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьДанныеСборкиТоваров(Источник)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Товары", Источник.Товары.Выгрузить(, "Номенклатура, Количество"));
	Запрос.УстановитьПараметр("ВидНоменклатуры", AMS_ВызовСервера.ВидНоменклатурыПродукцияНаборы());
	Запрос.УстановитьПараметр("Передача", Источник.Ссылка);
	Запрос.УстановитьПараметр("Дата", Источник.Дата);
	Запрос.УстановитьПараметр("Склад", Источник.Склад);
		
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.Количество КАК Количество
	|ПОМЕСТИТЬ тч
	|ИЗ
	|	&Товары КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ном.Ссылка КАК Номенклатура,
	|	СУММА(тч.Количество) КАК Количество
	|ПОМЕСТИТЬ тов
	|ИЗ
	|	тч КАК тч
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|		ПО тч.Номенклатура = Ном.Ссылка
	|		И Ном.ВидНоменклатуры = &ВидНоменклатуры
	|СГРУППИРОВАТЬ ПО
	|	Ном.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тов.Номенклатура КАК Номенклатура,
	|	Сборка.Ссылка КАК СборкаТоваров,
	|	Сборка.ВариантКомплектации КАК ВариантКомплектации
	|ПОМЕСТИТЬ сбор
	|ИЗ
	|	тов КАК тов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СборкаТоваров КАК Сборка
	|		ПО тов.Номенклатура = Сборка.Номенклатура
	|		И &Передача = Сборка.AMS_Основание
	|ГДЕ
	|	НЕ Сборка.ПометкаУдаления
	|	И Сборка.Склад = &Склад
	|	И Сборка.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тов.Номенклатура КАК Номенклатура,
	|	ВариантыКомпл.Ссылка КАК ВариантКомплектации
	|ПОМЕСТИТЬ комп
	|ИЗ
	|	тов КАК тов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомпл
	|		ПО тов.Номенклатура = ВариантыКомпл.Владелец
	|ГДЕ
	|	ВариантыКомпл.Основной
	|	И НЕ ВариантыКомпл.ПометкаУдаления
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тов.Номенклатура КАК Номенклатура,
	|	Упак.Ссылка КАК Упаковка
	|ПОМЕСТИТЬ упак
	|ИЗ
	|	тов КАК тов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК Упак
	|		ПО тов.Номенклатура = Упак.Владелец
	|ГДЕ
	|	Упак.Числитель = 1
	|	И НЕ Упак.ПометкаУдаления
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тов.Номенклатура КАК Номенклатура,
	|	тов.Количество КАК Количество,
	|	сбор.СборкаТоваров КАК СборкаТоваров,
	|	ВЫБОР
	|		КОГДА сбор.ВариантКомплектации ЕСТЬ NULL
	|		ИЛИ сбор.ВариантКомплектации = ЗНАЧЕНИЕ(Справочник.ВариантыКомплектацииНоменклатуры.ПустаяСсылка)
	|			ТОГДА комп.ВариантКомплектации
	|		ИНАЧЕ сбор.ВариантКомплектации
	|	КОНЕЦ КАК ВариантКомплектации,
	|	упак.Упаковка КАК Упаковка
	|ИЗ
	|	тов КАК тов
	|		ЛЕВОЕ СОЕДИНЕНИЕ сбор КАК сбор
	|		ПО тов.Номенклатура = сбор.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ комп КАК комп
	|		ПО тов.Номенклатура = комп.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ упак КАК упак
	|		ПО тов.Номенклатура = упак.Номенклатура";

	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Процедура ПередЗаписьюПеремещениеТоваров(Источник, Отказ, РежимЗаписи)
	Если Источник.СкладПолучатель = AMS_ВызовСервера.СкладБракованнойПродукции() Тогда
		Для Каждого Стр Из Источник.Товары Цикл
			Если Не AMS_ВызовСервера.ЭтоПродукцияAMS(Стр.Номенклатура) Тогда
				Текст = "Указанная номенклатура не является продукцией";
				ОбщегоНазначения.СообщитьПользователю(Текст,,,,Отказ);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура УстановитьВремяДокумента(Источник, Имя, ВремяОт, ВремяДо) Экспорт
	Дата     = Источник.Дата;
	ТекВремя = Дата - НачалоДня(Дата);
	Ссылка   = Источник.Ссылка;

	Если Не ЗначениеЗаполнено(Ссылка) Или ТекВремя < ВремяОт Или ТекВремя > ВремяДо Или ЕстьДокументЭтойДаты(Ссылка,
		Имя, Дата) Тогда
		Источник.Дата = ПолучитьДатуДокумента(Ссылка, Имя, ВремяОт, ВремяДо, Дата);
	КонецЕсли;
КонецПроцедуры

Функция ЕстьДокументЭтойДаты(Ссылка, Имя, Дата)
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.Текст = "ВЫБРАТЬ д.Ссылка ИЗ Документ." + Имя + " КАК д ГДЕ д.Дата = &Дата И д.Ссылка <> &Ссылка";

	Возврат Не Запрос.Выполнить().Пустой();
КонецФункции

Функция ПолучитьДатуДокумента(Ссылка, Имя, ВремяОт, ВремяДо, Дата)
	УстановитьПривилегированныйРежим(Истина);

	НачалоДня = НачалоДня(Дата);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ДатаОт", НачалоДня + ВремяОт);
	Запрос.УстановитьПараметр("ДатаДо", НачалоДня + ВремяДо);

	Запрос.Текст = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(д.Дата, ДЕНЬ), д.Дата, СЕКУНДА) КАК КолСек
		|ИЗ
		|	Документ." + Имя + " КАК д
		|ГДЕ
		|	д.Дата МЕЖДУ &ДатаОт И &ДатаДо И д.Ссылка <> &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	КолСек";

	Табл = Запрос.Выполнить().Выгрузить();

	Для Сч = ВремяОт По ВремяДо Цикл
		НайденнаяСтрока = Табл.Найти(Сч);
		Если НайденнаяСтрока = Неопределено Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Возврат НачалоДня + Сч;
КонецФункции

Процедура ПередЗаписьюРеализацияТоваровУслуг(Источник, Отказ, РежимЗаписи)
	Источник.ДополнительныеСвойства.Вставить("AMS_УтвержденаОтгрузка", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Ссылка, "AMS_УтвержденаОтгрузка"));
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения
		И Не Пользователи.РолиДоступны("_Бухгалтер") 
		И Не Источник.AMS_СтатусРеализации = Перечисления.AMS_СтатусыРеализаций.КОтгрузке Тогда
			ТекстОшибки = НСтр("ru='Нет прав на отмену проведения.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , , , Отказ);
		Возврат;
	КонецЕсли;

	Если Источник.ПометкаУдаления Тогда
		Если Не Источник.Проведен Тогда
			//При установки пометки удаления у непроведённого документа, убрать данные из доставки
			УстановитьПривилегированныйРежим(Истина);
			ДоставкаТоваров.ОтразитьСостояниеДоставки(Источник.Ссылка, Отказ, Истина);
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Источник.AMS_ЦенаИзменена = ЕстьЦеныНеПоУсловиямПродаж(Источник);
	
	Если Источник.AMS_СтатусРеализации = Перечисления.AMS_СтатусыРеализаций.КОтгрузке Тогда
		ПроверитьЗагрузкуВТранспорт(Источник, РежимЗаписи, Отказ);
			
		Если Источник.РеализацияПоЗаказам Тогда
			ЗаказКлиента = Источник.ЗаказКлиента;
			
			Если ЗначениеЗаполнено(ЗаказКлиента) Тогда
				AMS_ЗаказКлиентаНомер = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаказКлиента, "Номер");
				
				Если Не ЗначениеЗаполнено(Источник.Ссылка) И ЕстьРеализацияЗаказа(AMS_ЗаказКлиентаНомер, Отказ) Тогда
					Возврат;
				КонецЕсли;
					
				Источник.AMS_ЗаказКлиентаНомер = AMS_ЗаказКлиентаНомер;
				
				мср.ЗаписатьДокумент(ЗаказКлиента, РежимЗаписиДокумента.ОтменаПроведения, Отказ, Истина);
				
				Источник.ЗаказКлиента        = Неопределено;
				Источник.РеализацияПоЗаказам = Ложь;
				
				Для Каждого Стр Из Источник.ВидыЗапасов Цикл
					Стр.ЗаказКлиента   = Неопределено;
					Стр.ОбъектРасчетов = Неопределено;
				КонецЦикла;
				
				Для Каждого Стр Из Источник.Товары Цикл
					Стр.ЗаказКлиента   = Неопределено;
					Стр.ОбъектРасчетов = Неопределено;
				КонецЦикла;
				
				Для Каждого Стр Из Источник.ЭтапыГрафикаОплаты Цикл
					Стр.Заказ = Неопределено;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ПриЗаписи

Процедура ПриЗаписиДокумента(Источник, Отказ) Экспорт
	Имя = Источник.Метаданные().Имя;

	Если Имя = "ЗаказКлиента" Тогда
		ПриЗаписиЗаказКлиента(Источник, Отказ);
		
	ИначеЕсли Имя = "ПередачаТоваровХранителю" Тогда
		ПриЗаписиПередачаТоваровХранителю(Источник, Отказ);
		
	ИначеЕсли Имя = "РасходныйОрдерНаТовары" Тогда
		ПриЗаписиРасходныйОрдерНаТовары(Источник, Отказ);

	ИначеЕсли Имя = "РеализацияТоваровУслуг" Тогда
		ПриЗаписиРеализацияТоваровУслуг(Источник, Отказ);
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписиЗаказКлиента(Источник, Отказ)
	Если Не Источник.Проведен Тогда
		Возврат;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗаказКлиента", Источник.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	т.ВариантОбеспечения КАК ВариантОбеспечения
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК т
	|ГДЕ
	|	т.Ссылка = &ЗаказКлиента";
		
	Табл = Запрос.Выполнить().Выгрузить();
	
	КоличествоВариантОбеспечения = Табл.Количество();
	
	Если КоличествоВариантОбеспечения = 0 Тогда
		Возврат;
	КонецЕсли;
		
		
	Если КоличествоВариантОбеспечения = 1 И Табл[0].ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить Тогда
		СтатусВ2В = Перечисления.AMS_СтатусыВ2В.readyTogo;
	Иначе
		СтатусВ2В = Перечисления.AMS_СтатусыВ2В.packed;
	КонецЕсли;
	
	ОбновитьЗаказКлиентаНаВ2В(Источник.Ссылка, СтатусВ2В);
КонецПроцедуры

Процедура ПриЗаписиПередачаТоваровХранителю(Источник, Отказ)
	Если Источник.Организация = AMS_ВызовСервера.ОрганизацияСобственникПродукции() Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.Проведен Тогда
		МассивСборкаТоваров = Неопределено;
		Источник. ДополнительныеСвойства.Свойство("МассивСборкаТоваров", МассивСборкаТоваров);
		Если Не МассивСборкаТоваров = Неопределено Тогда
			Для Каждого СборкаТоваров Из МассивСборкаТоваров Цикл
				Док = СборкаТоваров.ПолучитьОбъект();
				Док.AMS_Основание = Источник.Ссылка;
				мср.ЗаписатьДокумент(Док, РежимЗаписиДокумента.Запись);
			КонецЦикла;
		КонецЕсли;
		
		Если Источник.Организация = AMS_ВызовСервера.ОрганизацияТрейд() Тогда
			ПередатьТоварыДругойОрганизации(Источник.Ссылка, Источник.Дата - 3600, Отказ);
		КонецЕсли;
		
	Иначе // отменено проведение
		ПередачаТоваровМеждуОрганизациями = ПолучитьПередачаТоваровМеждуОрганизациями(Источник.Ссылка);
		
		Если ЗначениеЗаполнено(ПередачаТоваровМеждуОрганизациями) Тогда
			мср.УстановитьПометкуУдаленияДокументу(ПередачаТоваровМеждуОрганизациями, Истина);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписиРасходныйОрдерНаТовары(Источник, Отказ)
	УстановитьПривилегированныйРежим(Истина);
	
	Табл = Источник.ТоварыПоРаспоряжениям.Выгрузить(, "Распоряжение");
	Табл.Свернуть("Распоряжение");
	МассивРаспоряжение = Табл.ВыгрузитьКолонку("Распоряжение");
	
	Распоряжение = МассивРаспоряжение[0];
	
	Если ТипЗнч(Распоряжение) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Стр = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Распоряжение, "AMS_СтатусРеализации, AMS_ЗаказКлиентаНомер, AMS_ID");
		
		Если Источник.Проведен И Источник.Статус = Перечисления.СтатусыРасходныхОрдеров.Отгружен Тогда
			Если Стр.AMS_СтатусРеализации = Перечисления.AMS_СтатусыРеализаций.Заказ
				Или Стр.AMS_СтатусРеализации = Перечисления.AMS_СтатусыРеализаций.Стикерование
				Или Стр.AMS_СтатусРеализации = Перечисления.AMS_СтатусыРеализаций.КОтгрузке Тогда
				
				ЗаказКлиента = ПолучитьЗаказКлиента(Стр.AMS_ЗаказКлиентаНомер);
				
				Если ЗначениеЗаполнено(ЗаказКлиента) Тогда
					Если Не Стр.AMS_ID = 0 Тогда
						ОбновитьЗаказКлиентаНаВ2В(ЗаказКлиента, Перечисления.AMS_СтатусыВ2В.closed); // завершен
					КонецЕсли;

					ЗаказКлиентаОбъект = ЗаказКлиента.ПолучитьОбъект();
					ЗаказКлиентаОбъект.УстановитьПометкуУдаления(Истина);
				КонецЕсли;
				
				Реализация = Распоряжение.ПолучитьОбъект();
				Реализация.AMS_СтатусРеализации = Перечисления.AMS_СтатусыРеализаций.Отгружено;
				Реализация.Записать(РежимЗаписиДокумента.Запись);
				
				РегистрыСведений.AMS_ИсторияРеализации.ЗаписатьСобытиеДокумента(Распоряжение, Перечисления.AMS_СобытияРеализации.Отгрузка);
			КонецЕсли;
				
		Иначе // отменено проведение или изменен статус	ордера
			Если Не Стр.AMS_СтатусРеализации = Перечисления.AMS_СтатусыРеализаций.КОтгрузке Тогда
				Реализация = Распоряжение.ПолучитьОбъект();
				Реализация.AMS_СтатусРеализации = Перечисления.AMS_СтатусыРеализаций.КОтгрузке;
				Реализация.Записать(РежимЗаписиДокумента.Запись);
				
				РегистрыСведений.AMS_ИсторияРеализации.ЗаписатьСобытиеДокумента(Распоряжение, Перечисления.AMS_СобытияРеализации.ОтменаОтгрузки);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписиРеализацияТоваровУслуг(Источник, Отказ)
	Статус = Источник.AMS_СтатусРеализации;

	// Временно
	Если Статус = Перечисления.AMS_СтатусыРеализаций.Заказ Или Статус = Перечисления.AMS_СтатусыРеализаций.Стикерование Тогда
		Возврат;
	КонецЕсли;
	
	СоздатьСчетФактуруДляРеализации(Источник);		
	
	ИзменитьСчетФактуруДляРеализации(Источник); 
	
	Если Источник.Проведен Тогда
		ЗаказКлиента = ПолучитьЗаказКлиента(Источник.AMS_ЗаказКлиентаНомер);
		
		Если ЗначениеЗаполнено(ЗаказКлиента) И Статус = Перечисления.AMS_СтатусыРеализаций.КОтгрузке Тогда
			Стр = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗаказКлиента, "AMS_ID, Проведен");
			
			Если Стр.AMS_ID > 0 Тогда
				ОбновитьЗаказКлиентаНаВ2В(ЗаказКлиента, Перечисления.AMS_СтатусыВ2В.readyTogo); // готов к отгрузке
			КонецЕсли;
			
			Если Стр.Проведен Тогда
				мср.ЗаписатьДокумент(ЗаказКлиента, РежимЗаписиДокумента.ОтменаПроведения, Отказ, Истина);
			КонецЕсли;
		КонецЕсли;
		
		Если Не Статус = Перечисления.AMS_СтатусыРеализаций.Заказ 
			И Источник.Организация = AMS_ВызовСервера.ОрганизацияТрейд() 
			И Не AMS_ВызовСервера.ПолучитьИмяГруппыДоступаРеализации(Источник.Ссылка) = "Маркетплейс" Тогда
			
			ПередатьТоварыДругойОрганизации(Источник.Ссылка, Источник.Дата - 3600, Отказ);
		КонецЕсли;
		
	Иначе // отменено проведение
		ПередачаТоваровМеждуОрганизациями = ПолучитьПередачаТоваровМеждуОрганизациями(Источник.Ссылка);
		Если ЗначениеЗаполнено(ПередачаТоваровМеждуОрганизациями) Тогда
			мср.УстановитьПометкуУдаленияДокументу(ПередачаТоваровМеждуОрганизациями, Истина, Отказ);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#Область ПередачаТоваровДругойОрганизации

Процедура ПередатьТоварыДругойОрганизации(Распоряжение, Дата, Отказ)
	УстановитьПривилегированныйРежим(Истина);

	Если ТипЗнч(Распоряжение) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Данные = ПолучитьДанныеИзРеализацияТоваровУслуг(Распоряжение);
	
	ИначеЕсли ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ПередачаТоваровХранителю") Тогда
		Данные = ПолучитьДанныеИзПередачаТоваровХранителю(Распоряжение);
	КонецЕсли;
	
	ПередачаТоваровМеждуОрганизациями = ПолучитьПередачаТоваровМеждуОрганизациями(Распоряжение);
	
	Если ПередачаТоваровМеждуОрганизациями = Неопределено Тогда
		ПередачаОбъект = Документы.ПередачаТоваровМеждуОрганизациями.СоздатьДокумент();
	Иначе
		ПередачаОбъект = ПередачаТоваровМеждуОрганизациями.ПолучитьОбъект();
	КонецЕсли;

	Шапка = Данные.Шапка;

	ЗаполнитьЗначенияСвойств(ПередачаОбъект, Шапка);

	ПередачаОбъект.Дата        = Дата - 60;
	ПередачаОбъект.Организация = AMS_ВызовСервера.ОрганизацияСобственникПродукции();
	ПередачаОбъект._Основание  = Распоряжение;

	ПередачаОбъект.Комментарий = "Основание " + Шапка.Ссылка + Символы.ПС + "Клиент """ + Шапка.Партнер + """.";

	Если ПередачаОбъект.ЭтоНовый() И Не ЗначениеЗаполнено(ПередачаОбъект.Номер) Тогда
		ПередачаОбъект.УстановитьНовыйНомер();
	КонецЕсли;

	ПередачаОбъект.Товары.Загрузить(Данные.Товары);

	мср.ЗаписатьДокумент(ПередачаОбъект, РежимЗаписиДокумента.Проведение, Отказ);
	
	Если Не Отказ Тогда 
		СоздатьСчетФактуруДляПередачи(ПередачаОбъект.Ссылка, ПередачаОбъект.Номер);
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьДанныеИзРеализацияТоваровУслуг(Распоряжение)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Распоряжение", Распоряжение);
	Запрос.УстановитьПараметр("СтавкаНДС", Справочники.СтавкиНДС.НайтиПоНаименованию("22%", Истина));
	Запрос.УстановитьПараметр("НалогообложениеНДС", Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС);
	Запрос.УстановитьПараметр("Подразделение", AMS_ВызовСервера.ПодразделениеПроизводство());
	Запрос.УстановитьПараметр("ВидыНоменклатурыПродукции", AMS_ВызовСервера.ВидыНоменклатурыПродукции());

	ЗапросТекст =
	"ВЫБРАТЬ
	|	т.Ссылка,
	|	т.Номенклатура КАК Номенклатура,
	|	т.Упаковка КАК Упаковка,
	|	т.КоличествоУпаковок КАК КоличествоУпаковок,
	|	т.Количество КАК Количество,
	|	ВЫРАЗИТЬ(100 * т.Цена / 130 КАК ЧИСЛО(10, 2)) КАК Цена,
	|	&СтавкаНДС КАК СтавкаНДС,
	|	т.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ном.ВидНоменклатуры КАК ВидНоменклатуры
	|ПОМЕСТИТЬ тов
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК ном
	|		ПО т.Номенклатура = ном.Ссылка
	|ГДЕ
	|	т.Ссылка = &Распоряжение
	|	И ном.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	|	И ном.ВидНоменклатуры В (&ВидыНоменклатурыПродукции)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тов.Номенклатура КАК Номенклатура,
	|	тов.Упаковка КАК Упаковка,
	|	тов.КоличествоУпаковок КАК КоличествоУпаковок,
	|	тов.Количество КАК Количество,
	|	тов.Цена КАК Цена,
	|	тов.СтавкаНДС КАК СтавкаНДС,
	|	0.22 * тов.Цена * тов.КоличествоУпаковок КАК СуммаНДС,
	|	тов.Цена * тов.КоличествоУпаковок КАК Сумма,
	|	1.22 * тов.Цена * тов.КоличествоУпаковок КАК СуммаСНДС,
	|	0.22 * тов.Цена * тов.КоличествоУпаковок КАК СуммаНДСВзаиморасчетов,
	|	1.22 * тов.Цена * тов.КоличествоУпаковок КАК СуммаВзаиморасчетов,
	|	тов.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры
	|ИЗ
	|	тов КАК тов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Ссылка,
	|	т.Валюта КАК Валюта,
	|	т.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	т.ВариантОформленияПродажи КАК ВариантОформленияПродажи,
	|	т.Дата КАК Дата,
	|	т.Дата КАК ДатаПлатежа,
	|	т.Номер КАК НомерРеал,
	|	т.Партнер КАК Партнер,
	|	&НалогообложениеНДС КАК НалогообложениеНДС,
	|	т.Организация КАК ОрганизацияПолучатель,
	|	т.НалогообложениеНДС КАК ПередачаПодДеятельность,
	|	т.Склад КАК Склад,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию) КАК ХозяйственнаяОперация,
	|	&Подразделение КАК Подразделение
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК т
	|ГДЕ
	|	т.Ссылка = &Распоряжение";

	Запрос.Текст = ЗапросТекст;

	Рез = Запрос.ВыполнитьПакет();

	Возврат Новый Структура("Товары, Шапка", Рез[1].Выгрузить(), Рез[2].Выгрузить()[0]);
КонецФункции

Функция ПолучитьДанныеИзПередачаТоваровХранителю(Распоряжение)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Распоряжение", Распоряжение);
	Запрос.УстановитьПараметр("СтавкаНДС", Справочники.СтавкиНДС.НайтиПоНаименованию("20%", Истина));
	Запрос.УстановитьПараметр("НалогообложениеНДС", Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС);
	Запрос.УстановитьПараметр("ПередачаПодДеятельность", Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС);
	Запрос.УстановитьПараметр("Подразделение", AMS_ВызовСервера.ПодразделениеПроизводство());
	Запрос.УстановитьПараметр("ВидыНоменклатурыПродукции", AMS_ВызовСервера.ВидыНоменклатурыПродукции());

	ЗапросТекст =
	"ВЫБРАТЬ
	|	т.Ссылка КАК Ссылка,
	|	т.Номенклатура КАК Номенклатура,
	|	т.Упаковка КАК Упаковка,
	|	т.КоличествоУпаковок КАК КоличествоУпаковок,
	|	т.Количество КАК Количество,
	|	т.Цена * 100 / 122 КАК Цена,
	|	&СтавкаНДС КАК СтавкаНДС,
	|	т.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ном.ВидНоменклатуры КАК ВидНоменклатуры
	|ПОМЕСТИТЬ тов
	|ИЗ
	|	Документ.ПередачаТоваровХранителю.Товары КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК ном
	|		ПО т.Номенклатура = ном.Ссылка
	|ГДЕ
	|	т.Ссылка = &Распоряжение
	|	И ном.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	|	И ном.ВидНоменклатуры В (&ВидыНоменклатурыПродукции)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Ссылка КАК Ссылка,
	|	т.Валюта КАК Валюта,
	|	т.Валюта КАК ВалютаВзаиморасчетов,
	|	ЗНАЧЕНИЕ(Перечисление.ВариантыОформленияПродажи.РеализацияТоваровУслуг) КАК ВариантОформленияПродажи,
	|	т.Дата КАК Дата,
	|	т.Дата КАК ДатаПлатежа,
	|	т.Номер КАК НомерРеал,
	|	т.Партнер КАК Партнер,
	|	&НалогообложениеНДС КАК НалогообложениеНДС,
	|	т.Организация КАК ОрганизацияПолучатель,
	|	&ПередачаПодДеятельность КАК ПередачаПодДеятельность,
	|	т.Склад КАК Склад,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию) КАК ХозяйственнаяОперация,
	|	НЕОПРЕДЕЛЕНО КАК ВидЦены,
	|	&Подразделение КАК Подразделение,
	|	т.Менеджер КАК Менеджер
	|ИЗ
	|	Документ.ПередачаТоваровХранителю КАК т
	|ГДЕ
	|	т.Ссылка = &Распоряжение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тов.Номенклатура КАК Номенклатура,
	|	тов.Упаковка КАК Упаковка,
	|	тов.КоличествоУпаковок КАК КоличествоУпаковок,
	|	тов.Количество КАК Количество,
	|	тов.Цена КАК Цена,
	|	тов.СтавкаНДС КАК СтавкаНДС,
	|	0.22 * тов.Цена * тов.КоличествоУпаковок КАК СуммаНДС,
	|	тов.Цена * тов.КоличествоУпаковок КАК Сумма,
	|	1.22 * тов.Цена * тов.КоличествоУпаковок КАК СуммаСНДС,
	|	0.22 * тов.Цена * тов.КоличествоУпаковок КАК СуммаНДСВзаиморасчетов,
	|	1.22 * тов.Цена * тов.КоличествоУпаковок КАК СуммаВзаиморасчетов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаНоменклатуры
	|ИЗ
	|	тов КАК тов";

	Запрос.Текст = ЗапросТекст;

	Рез = Запрос.ВыполнитьПакет();
	
	Шапка  = Рез[1].Выгрузить()[0];
	Товары = Рез[2].Выгрузить();

	Возврат Новый Структура("Шапка, Товары", Шапка, Товары);
КонецФункции

Процедура СоздатьСчетФактуруДляПередачи(ДокументОснование, Номер)
	СчетФактура = ПолучитьСчетФактураВыданный(ДокументОснование);

	Если ЗначениеЗаполнено(СчетФактура) Тогда
		СчетФактура = СчетФактура.ПолучитьОбъект();

		Если СчетФактура.ПометкаУдаления Тогда
			мср.УстановитьПометкуУдаленияДокументу(СчетФактура, Ложь);
		КонецЕсли;

	Иначе
		СчетФактура = Документы.СчетФактураВыданный.СоздатьДокумент();
	КонецЕсли;

	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("ДокументОснование", ДокументОснование);

	СчетФактура.Заполнить(ДанныеЗаполнения);

	СчетФактура.Номер = Номер;

	мср.ЗаписатьДокумент(СчетФактура, РежимЗаписиДокумента.Проведение);
КонецПроцедуры

Функция ПолучитьПередачаТоваровМеждуОрганизациями(Основание) Экспорт
	Если ЗначениеЗаполнено(Основание) Тогда
		УстановитьПривилегированныйРежим(Истина);
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Основание", Основание);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	т.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПередачаТоваровМеждуОрганизациями КАК т
		|ГДЕ
		|	т._Основание = &Основание
		|	И НЕ т.ПометкаУдаления";
	
		Рез = Запрос.Выполнить();
	
		Если Рез.Пустой() Тогда
			Возврат Неопределено;
		Иначе
			Выб = Рез.Выбрать(); Выб.Следующий();
			Возврат Выб.Ссылка;
		КонецЕсли;
	КонецЕсли;
КонецФункции

#КонецОбласти

#Область СозданиеСчетаФактура

Процедура СоздатьСчетФактуруДляРеализации(Источник)
	СчетФактура = ПолучитьСчетФактураВыданный(Источник.Ссылка);

	Если ЗначениеЗаполнено(СчетФактура) Тогда
		СчетФактура = СчетФактура.ПолучитьОбъект();

		Если Не Источник.ПометкаУдаления = СчетФактура.ПометкаУдаления Тогда
			мср.УстановитьПометкуУдаленияДокументу(СчетФактура, Источник.ПометкаУдаления);
		КонецЕсли;
		
		Если Не Источник.Проведен Тогда
	
			Если СчетФактура.Проведен Тогда
				мср.ЗаписатьДокумент(СчетФактура, РежимЗаписиДокумента.ОтменаПроведения);
			КонецЕсли;
			
			Возврат;
		КонецЕсли;

	Иначе
			СчетФактура = Документы.СчетФактураВыданный.СоздатьДокумент();
	КонецЕсли;

	ПараметрыРегистрации = Документы.РеализацияТоваровУслуг.ПараметрыРегистрацииСчетовФактурВыданных(Источник);
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("ДокументОснование", ПараметрыРегистрации.Ссылка);
	ДанныеЗаполнения.Вставить("Организация",       ПараметрыРегистрации.Организация);
	ДанныеЗаполнения.Вставить("Контрагент",        ПараметрыРегистрации.Контрагент);
	ДанныеЗаполнения.Вставить("Исправление",       ПараметрыРегистрации.ИсправлениеОшибок);
	ДанныеЗаполнения.Вставить("Корректировочный",  ПараметрыРегистрации.КорректировкаПоСогласованиюСторон);

	Если Источник.Проведен Тогда
		СчетФактура.Заполнить(ДанныеЗаполнения);
		
		СчетФактура.Номер = Источник.Номер;
		
		мср.ЗаписатьДокумент(СчетФактура, РежимЗаписиДокумента.Проведение);
	КонецЕсли;
КонецПроцедуры

Процедура ИзменитьСчетФактуруДляРеализации(Источник)
	Если Источник.ЭтапыГрафикаОплаты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Источник.ЭтапыГрафикаОплаты[0].Сдвиг = 0 Тогда
		Возврат;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументРегистратор", Источник.Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	т.ДокументРегистратор КАК Реализация,
	|	т.РасчетныйДокумент КАК Платежка
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК т
	|ГДЕ
	|	т.ДокументРегистратор = &ДокументРегистратор
	|	И т.РасчетныйДокумент ССЫЛКА Документ.ПоступлениеБезналичныхДенежныхСредств
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	вт.Реализация КАК Реализация,
	|	вт.Платежка КАК РасчетныйДокумент,
	|	вт.Платежка.НомерВходящегоДокумента КАК НомерПлатежноРасчетногоДокумента,
	|	вт.Платежка.ДатаВходящегоДокумента КАК ДатаПлатежноРасчетногоДокумента,
	|	СчетФактураАванс.Ссылка КАК СчетФактураВыданныйАванс,
	|	СчетФактураАванс.Номер КАК НомерСчетаФактурыНаАванс,
	|	СчетФактураАванс.Дата КАК ДатаСчетаФактурыНаАванс,
	|	СчетФактура.Ссылка КАК СчетФактураВыданный
	|ИЗ
	|	вт КАК вт
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданныйАванс КАК СчетФактураАванс
	|		ПО вт.Платежка = СчетФактураАванс.ДокументОснование
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактура
	|		ПО вт.Реализация = СчетФактура.ДокументОснование";
	
	Табл = Запрос.Выполнить().Выгрузить();
	
	Если Табл.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Стр = Табл[0];
	
	Если Не (ЗначениеЗаполнено(Стр.РасчетныйДокумент) 
			И ЗначениеЗаполнено(Стр.СчетФактураВыданныйАванс)
			И ЗначениеЗаполнено(Стр.СчетФактураВыданный)) Тогда
		Возврат;
	Иначе
		
		Фактура = Стр.СчетФактураВыданный.ПолучитьОбъект();
		
		Фактура.ПлатежноРасчетныеДокументы.Очистить();
		
		НовСтр = Фактура.ПлатежноРасчетныеДокументы.Добавить();
		
		НовСтр.НомерПлатежноРасчетногоДокумента = Стр.НомерПлатежноРасчетногоДокумента;
		НовСтр.ДатаПлатежноРасчетногоДокумента  = Стр.ДатаПлатежноРасчетногоДокумента;
		НовСтр.РасчетныйДокумент                = Стр.РасчетныйДокумент;
		НовСтр.НомерСчетаФактурыНаАванс         = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Стр.НомерСчетаФактурыНаАванс);
		НовСтр.ДатаСчетаФактурыНаАванс          = Стр.ДатаСчетаФактурыНаАванс;
		
		Фактура.СтрокаПлатежноРасчетныеДокументы = Документы.СчетФактураВыданный.СтрокаРасчетноПлатежныхДокументов(Фактура.ПлатежноРасчетныеДокументы);
		Фактура.СтрокаАвансовыеСчетаФактуры      = Документы.СчетФактураВыданный.СтрокаАвансовыеСчетаФактуры(Фактура.ПлатежноРасчетныеДокументы);
		
		мср.ЗаписатьДокумент(Фактура, РежимЗаписиДокумента.Проведение);
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьСчетФактураВыданный(Основание)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Основание", Основание);

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	д.Ссылка КАК СчетФактура,
	|	д.Организация КАК Организация
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК тч
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК д
	|		ПО тч.Ссылка = д.Ссылка
	|ГДЕ
	|	тч.ДокументОснование = &Основание
	|	И НЕ д.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	д.НомерИсправления УБЫВ";
	
	Табл = Запрос.Выполнить().Выгрузить();

	Если Табл.Количество() > 0 Тогда
		Возврат Табл[0].СчетФактура;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область ПередЗаписьюНаСервереИзФормыДокумента

Процедура ПередЗаписьюНаСервереРасходныйОрдерНаТовары(Отказ, Форма, ТекущийОбъект, ПараметрыЗаписи) Экспорт
    // Если указано более одного Распоряжения, то запретить запись 
	ТоварыПоРаспоряжениям = ТекущийОбъект.ТоварыПоРаспоряжениям.Выгрузить( , "Распоряжение");
	ТоварыПоРаспоряжениям.Свернуть("Распоряжение");
	Если ТоварыПоРаспоряжениям.Количество() > 1 Тогда
		ТекстОшибки = НСтр("ru='Расходный ордер на товары может быть оформлен только одно Распоряжение.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , , , Отказ);
	КонецЕсли;

	Распоряжение = ТоварыПоРаспоряжениям[0].Распоряжение;
    
    // Если уже оформлен Ордер по укажанному Распоряжению, то запретить запись 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Распоряжение", Распоряжение);
	Запрос.УстановитьПараметр("Ссылка", ТекущийОбъект.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	т.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК т
	|ГДЕ
	|	т.Распоряжение = &Распоряжение
	|	И НЕ т.Ссылка = &Ссылка
	|	И НЕ т.Ссылка.ПометкаУдаления";
	Если Не Запрос.Выполнить().Пустой() Тогда
		ТекстОшибки = НСтр("ru='Расходный ордер уже оформлен на данное Распоряжение.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , , , Отказ);
	КонецЕсли;
    
    // Если Товары в Расходном ордере не равны товарам, указанным в Распоряжении, то запретить запись
	Если ТипЗнч(Распоряжение) = Тип("ДокументСсылка.РеализацияТоваровУслуг") 
		И ЕстиРазличияМеждуРеализациейИОрдером(ПолучитьТоварыРаспоряжения(Распоряжение),
			ТекущийОбъект.ОтгружаемыеТовары.Выгрузить(, "Номенклатура,Количество")) Тогда
		ТекстОшибки = НСтр("ru='Товары в Расходном ордере не равны товарам, указанным в Распоряжении.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , , , Отказ);
	КонецЕсли;
    
    // Если Дата отгрузки не соответствует дате отгрузки в распоряжении, то запретить запись
	Если ТипЗнч(Распоряжение) = Тип("ДокументСсылка.РеализацияТоваровУслуг") 
		Или ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
			
		Табл = ТекущийОбъект.ТоварыПоРаспоряжениям.Выгрузить(, "Распоряжение");
		Табл.Свернуть("Распоряжение");

		Для Каждого Стр Из Табл Цикл
			Док = Стр.Распоряжение;

			Если ТипЗнч(Распоряжение) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
				//@skip-check bsl-legacy-check-string-literal
				ДатаОтгрузки = НачалоДня(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Док, "Дата"));
			
			ИначеЕсли ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
				//@skip-check bsl-legacy-check-string-literal
				ДатаОтгрузки = НачалоДня(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Док, "ДатаОтгрузки"));
			КонецЕсли;	

			Если ДатаОтгрузки > НачалоДня(ТекущийОбъект.ДатаОтгрузки) Тогда
				ТекстОшибки = НСтр("ru='Дата отгрузки не соответствует дате отгрузки в распоряжении.'");
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , , , Отказ);
			КонецЕсли;
		КонецЦикла;

		Если ТекущийОбъект.Статус = Перечисления.СтатусыРасходныхОрдеров.Отгружен Тогда
			//Есть ли отгрузка с Основного склада
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ТоварыПоРаспоряжениям", ТекущийОбъект.ТоварыПоРаспоряжениям.Выгрузить( ,
				"Номенклатура,Количество"));
			Запрос.УстановитьПараметр("Товары", ТекущийОбъект._Товары.Выгрузить( , "Номенклатура,Количество"));
			Запрос.Текст =
			"ВЫБРАТЬ
			|	т.Номенклатура КАК Номенклатура,
			|	т.Количество КАК Количество
			|ПОМЕСТИТЬ ТоварыПоРаспоряжениям
			|ИЗ
			|	&ТоварыПоРаспоряжениям КАК т
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	т.Номенклатура КАК Номенклатура,
			|	т.Количество КАК Количество
			|ПОМЕСТИТЬ ТоварыВерхние
			|ИЗ
			|	&Товары КАК т
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТоварыПоРаспоряжениям.Номенклатура КАК Номенклатура,
			|	СУММА(ТоварыПоРаспоряжениям.Количество) КАК Количество
			|ПОМЕСТИТЬ вт1
			|ИЗ
			|	ТоварыПоРаспоряжениям КАК ТоварыПоРаспоряжениям
			|
			|СГРУППИРОВАТЬ ПО
			|	ТоварыПоРаспоряжениям.Номенклатура
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТоварыВерхние.Номенклатура КАК Номенклатура,
			|	СУММА(ТоварыВерхние.Количество) КАК Количество
			|ПОМЕСТИТЬ вт2
			|ИЗ
			|	ТоварыВерхние КАК ТоварыВерхние
			|
			|СГРУППИРОВАТЬ ПО
			|	ТоварыВерхние.Номенклатура
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	вт1.Номенклатура КАК Номенклатура,
			|	вт1.Количество - ЕСТЬNULL(вт2.Количество, 0) * Ном.КоэффициентЕдиницыДляОтчетов КАК Количество
			|ПОМЕСТИТЬ вт
			|ИЗ
			|	вт1 КАК вт1
			|		ЛЕВОЕ СОЕДИНЕНИЕ вт2 КАК вт2
			|		ПО вт1.Номенклатура = вт2.Номенклатура
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
			|		ПО вт1.Номенклатура = Ном.Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	вт.Номенклатура КАК Номенклатура,
			|	вт.Количество КАК Количество
			|ИЗ
			|	вт КАК вт
			|ГДЕ
			|	вт.Количество > 0";
			Рез = Запрос.Выполнить();

			ЕстьОтгрузкаНаОсновомСкладе = Не Рез.Пустой();
			ЕстьОтгрузкаНаВерхнемСкладе = ТекущийОбъект._Товары.Количество() > 0;

			РаботыНаОсновномСкладе = ТекущийОбъект._Работы.НайтиСтроки(Новый Структура("МестоПогрузки",
				ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление._МестаПогрузки.Основной")));
			ЕстьРаботыНаОсновомСкладе = РаботыНаОсновномСкладе.Количество() > 0;

			РаботыНаВерхнемСкладе = ТекущийОбъект._Работы.НайтиСтроки(Новый Структура("МестоПогрузки",
				ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление._МестаПогрузки.Верхний")));
			ЕстьРаботыНаВерхнемСкладе = РаботыНаВерхнемСкладе.Количество() > 0;
			
			// Если есть отгрузка с Основного склада, то должна быть и работы Основного склада
			Если ЕстьОтгрузкаНаОсновомСкладе И Не ЕстьРаботыНаОсновомСкладе Тогда
				ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Не указаны Работы на Основном складе.'"),
					ТекущийОбъект.Ссылка, ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Объект._Работы", 0,
					"Номенклатура"), , Отказ);
			КонецЕсли;
			
			// Если есть работы на верхнем складе, то должны быть и товары на верхнем складе
			Если ЕстьОтгрузкаНаВерхнемСкладе И Не ЕстьРаботыНаВерхнемСкладе Тогда
				ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Не указаны Работы на Верхнем складе.'"),
					ТекущийОбъект.Ссылка, ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Объект._Работы", 0,
					"Номенклатура"), , Отказ);
			КонецЕсли;
		
			// Если есть отгрузка с Верхнего склада, то должна быть и работа Кладовщика Верхнего склада - Справочники._Работы.СкладКладовщикВерхний
			Если ЕстьРаботыНаОсновомСкладе И Не ЕстьОтгрузкаНаОсновомСкладе Тогда
				ОбщегоНазначения.СообщитьПользователю(НСтр(
					"ru='Работы на Основном складе есть, а отгруженных там товаров нет.'"), ТекущийОбъект.Ссылка,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Объект._Товары", 0, "Номенклатура"), , Отказ);
			КонецЕсли;
			
			// Если есть отгрузка с Верхнего склада, то должна быть и работа Кладовщика Верхнего склада - Справочники._Работы.СкладКладовщикВерхний
			Если ЕстьРаботыНаВерхнемСкладе И Не ЕстьОтгрузкаНаВерхнемСкладе Тогда
				ОбщегоНазначения.СообщитьПользователю(НСтр(
					"ru='Работы на Верхнем складе есть, а отгруженных там товаров нет.'"), ТекущийОбъект.Ссылка,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Объект._Товары", 0, "Номенклатура"), , Отказ);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция ЕстиРазличияМеждуРеализациейИОрдером(ТоварыРеал, ТоварыОрдер)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Товары", ТоварыРеал);
	Запрос.УстановитьПараметр("ОтгружаемыеТовары", ТоварыОрдер);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.Количество КАК Количество
	|ПОМЕСТИТЬ Ордер1
	|ИЗ
	|	&ОтгружаемыеТовары КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ордер1.Номенклатура КАК Номенклатура,
	|	СУММА(Ордер1.Количество) КАК Количество
	|ПОМЕСТИТЬ Ордер
	|ИЗ
	|	Ордер1 КАК Ордер1
	|
	|СГРУППИРОВАТЬ ПО
	|	Ордер1.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.Количество КАК Количество
	|ПОМЕСТИТЬ Реал1
	|ИЗ
	|	&Товары КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Реал1.Номенклатура КАК Номенклатура,
	|	СУММА(Реал1.Количество) КАК Количество
	|ПОМЕСТИТЬ Реал
	|ИЗ
	|	Реал1 КАК Реал1
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК ном
	|		ПО Реал1.Номенклатура = ном.Ссылка
	|			И (ном.ТипНоменклатуры В (ЗНАЧЕНИЕ(перечисление.ТипыНоменклатуры.Товар),ЗНАЧЕНИЕ(перечисление.ТипыНоменклатуры.МногооборотнаяТара)))
	|
	|СГРУППИРОВАТЬ ПО
	|	Реал1.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Ордер.Номенклатура ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Номенклатура.Пустаяссылка)
	|		ИНАЧЕ Ордер.Номенклатура
	|	КОНЕЦ КАК НоменклатураОрдер,
	|	ЕСТЬNULL(Ордер.Количество, 0) КАК КоличествоОрдер,
	|	ВЫБОР
	|		КОГДА Реал.Номенклатура ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Номенклатура.Пустаяссылка)
	|		ИНАЧЕ Реал.Номенклатура
	|	КОНЕЦ КАК НоменклатураРеал,
	|	ЕСТЬNULL(Реал.Количество, 0) КАК КоличествоРеал
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	Ордер КАК Ордер
	|		ПОЛНОЕ СОЕДИНЕНИЕ Реал КАК Реал
	|		ПО Ордер.Номенклатура = Реал.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.НоменклатураОрдер КАК НоменклатураОрдер,
	|	вт.КоличествоОрдер КАК КоличествоОрдер,
	|	вт.НоменклатураРеал КАК НоменклатураРеал,
	|	вт.КоличествоРеал КАК КоличествоРеал
	|ИЗ
	|	вт КАК вт
	|ГДЕ
	|	(вт.НоменклатураОрдер <> вт.НоменклатураРеал
	|			ИЛИ вт.КоличествоОрдер <> вт.КоличествоРеал)";

	Возврат Не Запрос.Выполнить().Пустой();
КонецФункции

Функция ПолучитьТоварыРаспоряжения(Док)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Док", Док);

	Если ТипЗнч(Док) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	т.Номенклатура,
		|	СУММА(т.Количество) КАК Количество
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК т
		|ГДЕ
		|	т.Ссылка = &Док
		|СГРУППИРОВАТЬ ПО
		|	т.Номенклатура";

	Иначе
		Запрос.Текст =
		"ВЫБРАТЬ
		|	т.Номенклатура,
		|	СУММА(т.Количество) КАК Количество
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК т
		|ГДЕ
		|	т.Ссылка = &Док
		|СГРУППИРОВАТЬ ПО
		|	т.Номенклатура";
	КонецЕсли;

	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

#КонецОбласти

#Область Производство

Функция ПолучитьДокументыПроизводстваПродукции(Основание) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Основание", Основание);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т._ОперацияПроизводства КАК ОперацияПроизводства,
	|	т.Дата КАК Дата,
	|	т.Номер КАК Номер,
	|	NULL КАК Статус,
	|	т.Ответственный КАК Ответственный,
	|	т.Ссылка КАК Ссылка,
	|	т._ОперацияПроизводства.Порядок КАК Порядок,
	|	т.ПометкаУдаления КАК ПометкаУдаления,
	|	т.Проведен КАК Проведен,
	|	т.СкладПолучатель КАК Склад
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК т
	|ГДЕ
	|	т._Основание = &Основание
	|	И т._ОперацияПроизводства = ЗНАЧЕНИЕ(Перечисление.AMS_ОперацииПроизводства.ПеремещениеМатериаловВПроизводство)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	т._ОперацияПроизводства,
	|	т.Дата,
	|	т.Номер,
	|	NULL,
	|	т.Ответственный,
	|	т.Ссылка,
	|	т._ОперацияПроизводства.Порядок,
	|	т.ПометкаУдаления,
	|	т.Проведен,
	|	т.Склад
	|ИЗ
	|	Документ.ПрочееОприходованиеТоваров КАК т
	|ГДЕ
	|	т._Основание = &Основание
	|	И т._ОперацияПроизводства = ЗНАЧЕНИЕ(Перечисление.AMS_ОперацииПроизводства.ПроизводствоФабрикатов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	т._ОперацияПроизводства,
	|	т.Дата,
	|	т.Номер,
	|	NULL,
	|	т.Ответственный,
	|	т.Ссылка,
	|	т._ОперацияПроизводства.Порядок,
	|	т.ПометкаУдаления,
	|	т.Проведен,
	|	т.Склад
	|ИЗ
	|	Документ.ПрочееОприходованиеТоваров КАК т
	|ГДЕ
	|	т._Основание = &Основание
	|	И т._ОперацияПроизводства В (ЗНАЧЕНИЕ(Перечисление.AMS_ОперацииПроизводства.ПроизводствоПродукции),
	|		ЗНАЧЕНИЕ(Перечисление.AMS_ОперацииПроизводства.ПроизводствоФлаконов))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	т._ОперацияПроизводства,
	|	т.Дата,
	|	т.Номер,
	|	т.Статус,
	|	т.Ответственный,
	|	т.Ссылка,
	|	т._ОперацияПроизводства.Порядок,
	|	т.ПометкаУдаления,
	|	т.Проведен,
	|	т.Склад
	|ИЗ
	|	Документ.ВнутреннееПотребление КАК т
	|ГДЕ
	|	т._Основание = &Основание
	|	И т._ОперацияПроизводства = ЗНАЧЕНИЕ(Перечисление.AMS_ОперацииПроизводства.СписаниеМатериаловСПроизводства)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	т._ОперацияПроизводства,
	|	т.Дата,
	|	т.Номер,
	|	т.Статус,
	|	т.Ответственный,
	|	т.Ссылка,
	|	т._ОперацияПроизводства.Порядок,
	|	т.ПометкаУдаления,
	|	т.Проведен,
	|	т.Склад
	|ИЗ
	|	Документ.ВнутреннееПотребление КАК т
	|ГДЕ
	|	т._Основание = &Основание
	|	И т._ОперацияПроизводства = ЗНАЧЕНИЕ(Перечисление.AMS_ОперацииПроизводства.СписаниеФабрикатаСПроизводства)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	т._ОперацияПроизводства,
	|	т.Дата,
	|	т.Номер,
	|	т.Статус,
	|	т.Ответственный,
	|	т.Ссылка,
	|	т._ОперацияПроизводства.Порядок,
	|	т.ПометкаУдаления,
	|	т.Проведен,
	|	т.СкладПолучатель
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК т
	|ГДЕ
	|	т._Основание = &Основание
	|	И т._ОперацияПроизводства = ЗНАЧЕНИЕ(Перечисление.AMS_ОперацииПроизводства.ПеремещениеПроизведеннойПродукции)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.Ссылка КАК ДокСсылка,
	|	вт.Дата КАК Дата,
	|	вт.Номер КАК Номер,
	|	вт.Статус КАК Статус,
	|	вт.ОперацияПроизводства КАК Операция,
	|	вт.Ответственный КАК Ответственный,
	|	вт.Склад КАК Склад,
	|	ВЫБОР
	|		КОГДА вт.ПометкаУдаления
	|			ТОГДА 1
	|		ИНАЧЕ ВЫБОР
	|			КОГДА вт.Проведен
	|				ТОГДА 0
	|			ИНАЧЕ 2
	|		КОНЕЦ
	|	КОНЕЦ КАК СостоянияДокумента,
	|	вт.Проведен КАК Проведен,
	|	вт.ПометкаУдаления КАК ПометкаУдаления
	|ИЗ
	|	вт КАК вт
	|
	|УПОРЯДОЧИТЬ ПО
	|	вт.Порядок,
	|	Дата";
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ПолучитьДокументыПроизводстваФабриката(Основание) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Основание", Основание);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т._ОперацияПроизводства КАК ОперацияПроизводства,
	|	т.Дата КАК Дата,
	|	т.Номер КАК Номер,
	|	т.Ответственный КАК Ответственный,
	|	т.Ссылка КАК Ссылка,
	|	т._ОперацияПроизводства.Порядок КАК Порядок,
	|	т.ПометкаУдаления КАК ПометкаУдаления,
	|	т.Проведен КАК Проведен,
	|	т.Склад КАК Склад
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	Документ.ПрочееОприходованиеТоваров КАК т
	|ГДЕ
	|	т._Основание = &Основание
	|	И т._ОперацияПроизводства = ЗНАЧЕНИЕ(Перечисление.AMS_ОперацииПроизводства.ПроизводствоФабрикатов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	т._ОперацияПроизводства,
	|	т.Дата,
	|	т.Номер,
	|	т.Ответственный,
	|	т.Ссылка,
	|	т._ОперацияПроизводства.Порядок,
	|	т.ПометкаУдаления,
	|	т.Проведен,
	|	т.Склад
	|ИЗ
	|	Документ.ВнутреннееПотребление КАК т
	|ГДЕ
	|	т._Основание = &Основание
	|	И т._ОперацияПроизводства = ЗНАЧЕНИЕ(Перечисление.AMS_ОперацииПроизводства.СписаниеМатериаловСПроизводства)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.Ссылка КАК Ссылка,
	|	вт.Дата КАК Дата,
	|	вт.Номер КАК Номер,
	|	вт.ОперацияПроизводства КАК Операция,
	|	вт.Ответственный КАК Ответственный,
	|	вт.Склад КАК Склад,
	|	ВЫБОР
	|		КОГДА вт.ПометкаУдаления
	|			ТОГДА 1
	|		ИНАЧЕ ВЫБОР
	|				КОГДА вт.Проведен
	|					ТОГДА 0
	|				ИНАЧЕ 2
	|			КОНЕЦ
	|	КОНЕЦ КАК СостоянияДокумента,
	|	вт.Проведен КАК Проведен,
	|	вт.ПометкаУдаления КАК ПометкаУдаления
	|ИЗ
	|	вт КАК вт
	|
	|УПОРЯДОЧИТЬ ПО
	|	вт.Порядок,
	|	Дата";
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ПолучитьДокументыПереработкиБрака(Основание) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Основание", Основание);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т._ОперацияПроизводства КАК ОперацияПроизводства,
	|	т.Дата КАК Дата,
	|	т.Номер КАК Номер,
	|	т.Ответственный КАК Ответственный,
	|	т.Ссылка КАК Ссылка,
	|	т._ОперацияПроизводства.Порядок КАК Порядок,
	|	т.ПометкаУдаления КАК ПометкаУдаления,
	|	т.Проведен КАК Проведен,
	|	т.СкладПолучатель КАК Склад
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК т
	|ГДЕ
	|	т._Основание = &Основание
	|	И т._ОперацияПроизводства = ЗНАЧЕНИЕ(Перечисление.AMS_ОперацииПроизводства.ПеремещениеБракаВЦех)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	т._ОперацияПроизводства,
	|	т.Дата,
	|	т.Номер,
	|	т.Ответственный,
	|	т.Ссылка,
	|	т._ОперацияПроизводства.Порядок,
	|	т.ПометкаУдаления,
	|	т.Проведен,
	|	т.Склад
	|ИЗ
	|	Документ.СписаниеНедостачТоваров КАК т
	|ГДЕ
	|	т._Основание = &Основание
	|	И т._ОперацияПроизводства = ЗНАЧЕНИЕ(Перечисление.AMS_ОперацииПроизводства.СписаниеБракаВЦехе)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	т._ОперацияПроизводства,
	|	т.Дата,
	|	т.Номер,
	|	т.Ответственный,
	|	т.Ссылка,
	|	т._ОперацияПроизводства.Порядок,
	|	т.ПометкаУдаления,
	|	т.Проведен,
	|	т.Склад
	|ИЗ
	|	Документ.ОрдерНаОтражениеНедостачТоваров КАК т
	|ГДЕ
	|	т._Основание = &Основание
	|	И т._ОперацияПроизводства = ЗНАЧЕНИЕ(Перечисление.AMS_ОперацииПроизводства.СписаниеБракаВЦехеОрдер)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	т._ОперацияПроизводства,
	|	т.Дата,
	|	т.Номер,
	|	т.Ответственный,
	|	т.Ссылка,
	|	т._ОперацияПроизводства.Порядок,
	|	т.ПометкаУдаления,
	|	т.Проведен,
	|	т.Склад
	|ИЗ
	|	Документ.ОприходованиеИзлишковТоваров КАК т
	|ГДЕ
	|	т._Основание = &Основание
	|	И т._ОперацияПроизводства = ЗНАЧЕНИЕ(Перечисление.AMS_ОперацииПроизводства.ОприходованиеМатериаловИзБрака)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	т._ОперацияПроизводства,
	|	т.Дата,
	|	т.Номер,
	|	т.Ответственный,
	|	т.Ссылка,
	|	т._ОперацияПроизводства.Порядок,
	|	т.ПометкаУдаления,
	|	т.Проведен,
	|	т.Склад
	|ИЗ
	|	Документ.ОрдерНаОтражениеИзлишковТоваров КАК т
	|ГДЕ
	|	т._Основание = &Основание
	|	И т._ОперацияПроизводства = ЗНАЧЕНИЕ(Перечисление.AMS_ОперацииПроизводства.ОприходованиеМатериаловИзБракаОрдер)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	т._ОперацияПроизводства,
	|	т.Дата,
	|	т.Номер,
	|	т.Ответственный,
	|	т.Ссылка,
	|	т._ОперацияПроизводства.Порядок,
	|	т.ПометкаУдаления,
	|	т.Проведен,
	|	т.СкладПолучатель
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК т
	|ГДЕ
	|	т._Основание = &Основание
	|	И т._ОперацияПроизводства = ЗНАЧЕНИЕ(Перечисление.AMS_ОперацииПроизводства.ПеремещениеМатериаловНаПереработкуБрака)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	т._ОперацияПроизводства,
	|	т.Дата,
	|	т.Номер,
	|	т.Ответственный,
	|	т.Ссылка,
	|	т._ОперацияПроизводства.Порядок,
	|	т.ПометкаУдаления,
	|	т.Проведен,
	|	т.СкладПолучатель
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК т
	|ГДЕ
	|	т._Основание = &Основание
	|	И т._ОперацияПроизводства = ЗНАЧЕНИЕ(Перечисление.AMS_ОперацииПроизводства.ПеремещениеМатериаловБракаВОтходы)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	т._ОперацияПроизводства,
	|	т.Дата,
	|	т.Номер,
	|	т.Ответственный,
	|	т.Ссылка,
	|	т._ОперацияПроизводства.Порядок,
	|	т.ПометкаУдаления,
	|	т.Проведен,
	|	т.Склад
	|ИЗ
	|	Документ.ВнутреннееПотребление КАК т
	|ГДЕ
	|	т._Основание = &Основание
	|	И т._ОперацияПроизводства = ЗНАЧЕНИЕ(Перечисление.AMS_ОперацииПроизводства.СписаниеМатериаловНаПереработкуБрака)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	т._ОперацияПроизводства,
	|	т.Дата,
	|	т.Номер,
	|	т.Ответственный,
	|	т.Ссылка,
	|	т._ОперацияПроизводства.Порядок,
	|	т.ПометкаУдаления,
	|	т.Проведен,
	|	т.Склад
	|ИЗ
	|	Документ.ПрочееОприходованиеТоваров КАК т
	|ГДЕ
	|	т._Основание = &Основание
	|	И т._ОперацияПроизводства = ЗНАЧЕНИЕ(Перечисление.AMS_ОперацииПроизводства.ПроизводствоПродукцииИзБрака)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.Ссылка КАК Ссылка,
	|	вт.Дата КАК Дата,
	|	вт.Номер КАК Номер,
	|	вт.ОперацияПроизводства КАК Операция,
	|	вт.Ответственный КАК Ответственный,
	|	вт.Склад КАК Склад,
	|	ВЫБОР
	|		КОГДА вт.ПометкаУдаления
	|			ТОГДА 1
	|		ИНАЧЕ ВЫБОР
	|			КОГДА вт.Проведен
	|				ТОГДА 0
	|			ИНАЧЕ 2
	|		КОНЕЦ
	|	КОНЕЦ КАК СостоянияДокумента,
	|	вт.Проведен КАК Проведен,
	|	вт.ПометкаУдаления КАК ПометкаУдаления
	|ИЗ
	|	вт КАК вт
	|
	|УПОРЯДОЧИТЬ ПО
	|	вт.Порядок,
	|	Дата";
	
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

#КонецОбласти

#Область В2В

#Область ЗагрузкаОтВ2В

Процедура ЗагрузитьНовыеЗаказыВ2В(ТокенАвторизации)
	РежимБезопасности = БезопасныйРежим();
	
	Если ТипЗнч(РежимБезопасности) = тип("Булево") и РежимБезопасности = Истина тогда
		УстановитьОтключениеБезопасногоРежима(Истина);
	КонецЕсли;;
	
	Если Не ЗначениеЗаполнено(ТокенАвторизации) Тогда
		ВызватьИсключение "Нет токена авторизации";
	КонецЕсли;  

	HTTPСоединение = Новый HTTPСоединение("b2b.cafe",,,,, 10, Новый ЗащищенноеСоединениеOpenSSL());
	HTTPЗапрос = Новый HTTPЗапрос("/api/v1.4.10/order/list");
	HTTPЗапрос.Заголовки.Вставить("Authorization", "Bearer " + ТокенАвторизации);
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");
	HTTPЗапрос.Заголовки.Вставить("Accept-Language", "ru");
	
	ДанныеЗапроса = Новый Структура();
	ДанныеЗапроса.Вставить("store", Константы.AMS_В2В_Склад.Получить());
	ДанныеЗапроса.Вставить("status", "pending"); 

	ТелоЗапроса = СтруктураВJson(ДанныеЗапроса);
	
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса);
	
	//@skip-check bsl-legacy-check-dynamic-feature-access
	HTTPОтвет = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	
	Если HTTPОтвет.КодСостояния = 200 Тогда
		ТелоОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
		
		СтруктураОтвета = JSONВСоответствие(ТелоОтвета); 
		
		Результат = СтруктураОтвета["result"];
		
		Заказы = Результат["items"];
		
		Для Каждого Заказ Из Заказы Цикл
			IdB2B  = Заказ["id"];

			НачатьТранзакцию();
			
			Попытка  
				ДанныеЗаказа = ПолучитьДанныеЗаказаВ2В(IdB2B, ТокенАвторизации);
		
				//@skip-check query-in-loop
				ЗаказКлиента = СоздатьЗаказКлиентаПоДаннымВ2В(ДанныеЗаказа);
				
				//@skip-check query-in-loop
				ОбновитьЗаказКлиентаНаВ2В(ЗаказКлиента, Перечисления.AMS_СтатусыВ2В.processing, ТокенАвторизации);
				
				ЗафиксироватьТранзакцию();  
			
			Исключение  
				ОтменитьТранзакцию();
				  
				ТекстОшибки = НСтр("ru = 'Регламентное задание.ЗагрузитьНовыеЗаказыВ2В.Ошибка: Не удалось создать заказ ID %ID%'");
				ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ID%", IdB2B);
				ЗаписьЖурналаРегистрации(ТекстОшибки, УровеньЖурналаРегистрации.Ошибка,,
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки  
		КонецЦикла; 

	ИначеЕсли HTTPОтвет.КодСостояния = 401 Тогда	
		ТекстОшибки = НСтр("ru = 'AMS_Сервер.ЗагрузитьНовыеЗаказыВ2В.Ошибка: Истекла авторизация: Нажмите кнопку ""Загрузить"".'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
	
	Иначе
		ТекстОшибки = НСтр("ru = 'AMS_Сервер.ЗагрузитьНовыеЗаказыВ2В.Ошибка: Не удалось прочитать файл из временного хранилища по причине: %Причина%'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Причина%", ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации(ТекстОшибки, УровеньЖурналаРегистрации.Ошибка);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
КонецПроцедуры

//@skip-check module-unused-method
Функция ЗагрузитьОстаткиСоСкладеВ2В() 
	ТокенАвторизации = Константы.AMS_В2В_ТокенАвторизации.Получить();
	
	Если Не ЗначениеЗаполнено(ТокенАвторизации) Тогда
		ВызватьИсключение "Нет токена авторизации";
	КонецЕсли;  
	
	Табл = Новый ТаблицаЗначений;
	КвалификаторыСтроки = Новый КвалификаторыСтроки(20);
	Табл.Колонки.Добавить("SKU", Новый ОписаниеТипов("Строка", ,КвалификаторыСтроки));
	КвалификаторыЧисла = Новый КвалификаторыЧисла(10, 2, ДопустимыйЗнак.Любой);
	Табл.Колонки.Добавить("count", Новый ОписаниеТипов("Число", КвалификаторыЧисла));
	
	HTTPСоединение = Новый HTTPСоединение("b2b.cafe",,,,, ТАЙМАУТ(), Новый ЗащищенноеСоединениеOpenSSL());
	HTTPЗапрос = Новый HTTPЗапрос("/api/v1.4.9/store/get_balance_product");
	HTTPЗапрос.Заголовки.Вставить("Authorization", "Bearer " + ТокенАвторизации);
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");
	HTTPЗапрос.Заголовки.Вставить("Accept-Language", "ru");
	
	ДанныеЗапроса = Новый Структура();
	ДанныеЗапроса.Вставить("store", Константы.AMS_В2В_Склад.Получить());
	ТелоЗапроса = СтруктураВJson(ДанныеЗапроса);
	
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса);
	
	//@skip-check bsl-legacy-check-dynamic-feature-access
	HTTPОтвет = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	
	Если HTTPОтвет.КодСостояния = 200 Тогда
		ТелоОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
		
		СтруктураОтвета = JSONВСоответствие(ТелоОтвета);
		
		//Табл.Очистить();
		Для Каждого Элемент Из СтруктураОтвета["result"] Цикл
			Стр = Табл.Добавить();
			Стр.SKU   = Элемент["sku"];
			Стр.count = Элемент["count"];
		КонецЦикла; 
		
	Иначе
		ОбщегоНазначения.СообщитьПользователю("КоннекторB2bCafe.ПолучитьОстаткиНаСкладе.Ошибка. Код ответа: " + HTTPОтвет.КодСостояния);
		ЗаписьЖурналаРегистрации("КоннекторB2bCafe.ПолучитьОстаткиНаСкладе.Ошибка", УровеньЖурналаРегистрации.Ошибка);
	КонецЕсли;
	
	Возврат Табл;
КонецФункции

Функция ПолучитьЦеныКлиентаНаВ2В(КодКлиентаВ2В) Экспорт
	ТокенАвторизации = ПолучитьТокенАвторизации(Пользователи.АвторизованныйПользователь());
	
	Если Не ЗначениеЗаполнено(ТокенАвторизации) Тогда
		ВызватьИсключение "Нет токена авторизации";
	КонецЕсли;  
	
	HTTPСоединение = Новый HTTPСоединение("b2b.cafe",,,,, ТАЙМАУТ(), Новый ЗащищенноеСоединениеOpenSSL());
	HTTPЗапрос = Новый HTTPЗапрос("/api/v1.5.3/prices/list_client");
	HTTPЗапрос.Заголовки.Вставить("Authorization", "Bearer " + ТокенАвторизации);
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");
	HTTPЗапрос.Заголовки.Вставить("Accept-Language", "ru");
	
	ДанныеЗапроса = Новый Структура();
	ДанныеЗапроса.Вставить("userId", КодКлиентаВ2В);
	
	ТелоЗапроса = СтруктураВJson(ДанныеЗапроса);
	
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса);
	
	//@skip-check bsl-legacy-check-dynamic-feature-access
	HTTPОтвет = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	
	Если HTTPОтвет.КодСостояния = 200 Тогда
		Табл = Новый ТаблицаЗначений();
		Табл.Колонки.Добавить("Код",  Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(20)));
		Табл.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число"));

		ТелоОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
		
		СтруктураОтвета = JSONВСоответствие(ТелоОтвета); 
		
		Результат = СтруктураОтвета["result"];
		
		Для Каждого Стр Из Результат Цикл
			НовСтр = Табл.Добавить();
			
			НовСтр.Код  = Стр["sku"];
			НовСтр.Цена = Число(Стр["value"]);
		КонецЦикла; 
		
		Возврат Табл;
	
	ИначеЕсли HTTPОтвет.КодСостояния = 401 Тогда	
		ТокенАвторизации = ПолучитьТокенАвторизации(Пользователи.АвторизованныйПользователь());
		
		ТекстОшибки = НСтр("ru = 'ПолучитьЦеныКлиентаНаВ2В.Ошибка: Истекла авторизация: Повторите операцию'");
		
		ВызватьИсключение ТекстОшибки;
	
	Иначе
		ТекстОшибки = НСтр("ru = 'ПолучитьЦеныКлиентаНаВ2В.Ошибка: Не удалось прочитать файл из временного хранилища по причине: %Причина%'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Причина%", ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации(ТекстОшибки, УровеньЖурналаРегистрации.Ошибка);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
КонецФункции

Функция ПолучитьДанныеЗаказаВ2В(ИдентификаторЗаказа, ТокенАвторизации)
	РежимБезопасности = БезопасныйРежим();
	
	Если ТипЗнч(РежимБезопасности) = тип("Булево") и РежимБезопасности = Истина тогда
		УстановитьОтключениеБезопасногоРежима(Истина);
	КОнецЕсли;
	
	Если Не ЗначениеЗаполнено(ТокенАвторизации) Тогда
		ВызватьИсключение "Нет токена авторизации";
	КонецЕсли;  

	HTTPСоединение = Новый HTTPСоединение("b2b.cafe",,,,, ТАЙМАУТ(), Новый ЗащищенноеСоединениеOpenSSL());
	HTTPЗапрос = Новый HTTPЗапрос("/api/v1.4.10/order/one");
	HTTPЗапрос.Заголовки.Вставить("Authorization", "Bearer " + ТокенАвторизации);
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");
	HTTPЗапрос.Заголовки.Вставить("Accept-Language", "ru");
	
	ДанныеЗапроса = Новый Структура();
	ДанныеЗапроса.Вставить("id", ИдентификаторЗаказа);
	 
	ТелоЗапроса = СтруктураВJson(ДанныеЗапроса);
	
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса);
	
	//@skip-check bsl-legacy-check-dynamic-feature-access
	HTTPОтвет = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	
	Если HTTPОтвет.КодСостояния = 200 Тогда
		ТелоОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
		
		СтруктураОтвета = JSONВСоответствие(ТелоОтвета); 
		
		Результат = СтруктураОтвета["result"];
		
		ШапкаЗаказа  = Результат["order"];
		
		Шапка = Новый Структура();
		
		Шапка.Вставить("Id", ШапкаЗаказа["id"]); //Идентификатор заказа.
		Шапка.Вставить("extId",          ШапкаЗаказа["extId"]); //Идентификатор заказа для 1С.
		Шапка.Вставить("creationTime",   Дата(1970,1,1) + ШапкаЗаказа["creationTime"]); //Дата создания заказа.
		Шапка.Вставить("updateTime",     Дата(1970,1,1) + ШапкаЗаказа["updateTime"]); //Дата обновления заказа.
		Шапка.Вставить("amount",         ШапкаЗаказа["amount"]); //Сумма заказа с учетом скидок.
		Шапка.Вставить("baseAmount",     ШапкаЗаказа["baseAmount"]); //Сумма заказа без учета скидок.
		Шапка.Вставить("discountAmount", ШапкаЗаказа["discountAmount"]); //Сумма скидок в заказе.
		Шапка.Вставить("paymentType",    ШапкаЗаказа["paymentType"]); //Тип оплаты. 1 - Постоплата, 2 - Предоплата.
		Шапка.Вставить("comment",        ШапкаЗаказа["comment"]); //Комментарий заказа.
		Шапка.Вставить("boxlabel",       ШапкаЗаказа["boxlabel"]); //Маркировка заказа.
		Шапка.Вставить("isReserved",     ШапкаЗаказа["isReserved"]); //Флаг, указывающий, проходил ли заказ через резерв
		
		Шапка.Вставить("clientid",       ШапкаЗаказа["client"]["id"]); //Идентификатор пользователя.
		Шапка.Вставить("clientfullName", ШапкаЗаказа["client"]["fullName"]); //Полное имя пользователя.
		Шапка.Вставить("clientcode1c",   ШапкаЗаказа["client"]["code1c"]); //Код клиента
		
		Шапка.Вставить("addressid",           ШапкаЗаказа["address"]["id"]);//Идентификатор адреса.
		Шапка.Вставить("addresscreationTime", ШапкаЗаказа["address"]["creationTime"]);//Время создания адреса.
		Шапка.Вставить("addressplace",        ШапкаЗаказа["address"]["place"]);//Место.
		Шапка.Вставить("addressdata",         ШапкаЗаказа["address"]["data"]);//Адрес
		Шапка.Вставить("addresscode",         ШапкаЗаказа["address"]["code"]);//Код в системе 1С.
		
		Шапка.Вставить("companyid",             ШапкаЗаказа["company"]["id"]);//Идентификатор компании.
		Шапка.Вставить("companyname",           ШапкаЗаказа["company"]["name"]);//Одно из значений: Название, ИНН, ОГРН. Выводится что то одно, что есть.
		Шапка.Вставить("companycompanyName",    ШапкаЗаказа["company"]["companyName"]);//Название компании.
		Шапка.Вставить("companyogrn",           ШапкаЗаказа["company"]["ogrn"]);//ОГРН компании. (КПП)
		Шапка.Вставить("companytaxpayerNumber", Формат(ШапкаЗаказа["company"]["taxpayerNumber"], "ЧГ=0"));//ИНН компании.
		
		Шапка.Вставить("managerid",       ШапкаЗаказа["manager"]["id"]);//Идентификатор пользователя.
		Шапка.Вставить("managerfullName", ШапкаЗаказа["manager"]["fullName"]);//Полное имя пользователя.
		Шапка.Вставить("managercode1c",   ШапкаЗаказа["manager"]["code1c"]);//ID клиента для 1с.

		Шапка.Вставить("statusid",        ШапкаЗаказа["status"]["id"]);//Идентификатор статуса.
		Шапка.Вставить("statuscode",      ШапкаЗаказа["status"]["code"]);//Значение статуса.
		Шапка.Вставить("statustextColor", ШапкаЗаказа["status"]["textColor"]);//Название цвета статуса.
		Шапка.Вставить("statuscolor",     ШапкаЗаказа["status"]["color"]);//Цвет статуса.
		
		Шапка.Вставить("storeid",   ШапкаЗаказа["store"]["id"]);//Идентификатор склада.
		Шапка.Вставить("storename", ШапкаЗаказа["store"]["name"]);//Название склада.

		Шапка.Вставить("originalStoreid",   ШапкаЗаказа["originalStore"]["id"]);//Идентификатор склада
		Шапка.Вставить("originalStorename", ШапкаЗаказа["originalStore"]["name"]);//Название склада.
		
		Шапка.Вставить("distributorid",   ШапкаЗаказа["distributor"]["id"]);//Идентификатор дистрибьютера.
		Шапка.Вставить("distributorname", ШапкаЗаказа["distributor"]["name"]);//Название дистрибьютера.
		
		Шапка.Вставить("currencyid",     ШапкаЗаказа["currency"]["id"]);//Идентификатор валюты.
		Шапка.Вставить("currencyname",   ШапкаЗаказа["currency"]["name"]);//Название валюты.
		Шапка.Вставить("currencycode",   ШапкаЗаказа["currency"]["code"]);//Код валюты.
		Шапка.Вставить("currencysymbol", ШапкаЗаказа["currency"]["symbol"]);//Символ валюты.

		Шапка.Вставить("typeid",    ШапкаЗаказа["type"]["id"]);//Идентификатор типа.
		Шапка.Вставить("typecode",  ШапкаЗаказа["type"]["code"]);//Значение типа.
		Шапка.Вставить("typename",  ШапкаЗаказа["type"]["name"]);//Название типа.
		Шапка.Вставить("typecolor", ШапкаЗаказа["type"]["color"]);//Цвет типа.

		ТоварыЗаказа = Результат["products"];
		Товары = Новый Массив();
		
		Для Каждого Стр Из ТоварыЗаказа Цикл
			НовСтр = Новый Структура();
			
			НовСтр.Вставить("id",         Стр["id"]);        //Идентификатор записи.
			НовСтр.Вставить("model_id",   Стр["model_id"]);  //Идентификатор модели.
			НовСтр.Вставить("product_id", Стр["product_id"]);//Идентификатор продукта.
			НовСтр.Вставить("sku",        Стр["sku"]);       //Артикул продукта.
			НовСтр.Вставить("barcode",    Стр["barcode"]);   //Штрихкод продукта.
			НовСтр.Вставить("skuMf",      Стр["skuMf"]);     //Артикул модели.
			НовСтр.Вставить("enSkuMf",    Стр["enSkuMf"]);   //Артикул модели на английском.
			НовСтр.Вставить("type",       Стр["type"]);      //Категория продукта.
			НовСтр.Вставить("name",       Стр["name"]);      //Название продукта.
			НовСтр.Вставить("color",      Стр["color"]);     //Название цвета.
			НовСтр.Вставить("colorSrc",   Стр["colorSrc"]);  //Ссылка на иконку цвета.
			НовСтр.Вставить("size",       Стр["size"]);      //Размер продукта.
			НовСтр.Вставить("amount",     Стр["amount"]);    //Сумма продуктов.
			НовСтр.Вставить("price",      Стр["price"]);     //Цена продукта.
			НовСтр.Вставить("count",      Стр["count"]);     //Количество продуктов в корзине.
			НовСтр.Вставить("oldCount",   Стр["oldCount"]);  //Старое количество продуктов в корзине.
			
			НовСтр.Вставить("currencyid",     Стр["currency"]["id"]);    //Идентификатор валюты.
			НовСтр.Вставить("currencyname",   Стр["currency"]["name"]);  //Название валюты.
			НовСтр.Вставить("currencycode",   Стр["currency"]["code"]);  //Код валюты.
			НовСтр.Вставить("currencysymbol", Стр["currency"]["symbol"]);//Символ валюты.
			
			Массивbadge = Стр["badge"];
			Если Массивbadge.Количество() > 0 Тогда
				Стрbadge = Стр["badge"][0];
				
				НовСтр.Вставить("badgetype",  Стрbadge["type"]); //Тип бейджа.
				НовСтр.Вставить("badgetext",  Стрbadge["text"]); //Текст на бейдже.
				НовСтр.Вставить("badgecolor", Стрbadge["color"]);//Список цветов для бейджа.
			КонецЕсли;

			НовСтр.Вставить("imagesoriginal", Стр["images"]["original"]);//Оригинальная картинка товара.
			НовСтр.Вставить("imagesthump_1",  Стр["images"]["thump_1"]); //Уменьшенная версия картинки товара 1.
			НовСтр.Вставить("imagesthump_2",  Стр["images"]["thump_2"]); //Уменьшенная версия картинки товара 2.

			Товары.Добавить(НовСтр);
		КонецЦикла; 

	Иначе
		ТекстОшибки = НСтр("ru = 'AMS_Сервер.ПолучитьДанныеЗаказаВ2В.Ошибка: Не удалось получить данные заказа по причине: %Причина%'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Причина%", ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации(ТекстОшибки, УровеньЖурналаРегистрации.Ошибка);
	КонецЕсли;
	
	ДанныеЗаказа = Новый Структура("Шапка, Товары");
	ДанныеЗаказа.Шапка 	= Шапка;	
	ДанныеЗаказа.Товары = Товары;
	
	Возврат ДанныеЗаказа;
КонецФункции

Функция СоздатьЗаказКлиентаПоДаннымВ2В(ДанныеЗаказа)
	ШапкаВ2В  = ДанныеЗаказа.Шапка;
	ТоварыВ2В = ДанныеЗаказа.Товары;
	
	Док = Документы.ЗаказКлиента.СоздатьДокумент();

	Док.Дата                    = ШапкаВ2В.creationTime;
	Док.AMS_ID                  = ШапкаВ2В.id;	
	Док.AMS_ДатаСчета           = Док.Дата;	
	Док.AMS_ДоверенностьКлиента = 2;	
	Док.Партнер                 = Справочники.Партнеры.НайтиПоКоду(ШапкаВ2В.clientcode1c);
	Док.Контрагент              = AMS_ВызовСервера.ПолучитьКонтрагентаПартнёра(Док.Партнер, ШапкаВ2В.companytaxpayerNumber, ШапкаВ2В.companyogrn);
	
	ПараметрыЗаполнения = Новый Структура("Партнет ,Контрагент", Док.Партнер, Док.Контрагент);
	
	Док.Заполнить(ПараметрыЗаполнения);
	
	Правило = AMS_ВызовСервера.ПолучитьПравилоПродажи(Док.Дата, Док.Партнер, Док.Контрагент);
	
	Если ЗначениеЗаполнено(Правило) Тогда
		Док.AMS_ПравилоПродажи = Правило;
		
		ДанныеПравила = AMS_ВызовСервера.ПолучитьДанныеПравилПродажи(Правило);
		
		ЗаполнитьЗначенияСвойств(Док, ДанныеПравила);
	КонецЕсли;	
	
	Док.УстановитьНовыйНомер();	
	
	Док.Статус             = Перечисления.СтатусыЗаказовКлиентов.КОбеспечению;
	Док.Склад              = AMS_ВызовСервера.СкладПродукции();
	Док.ДатаСогласования   = мср.ПолучитьРабочийДень(1, Док.Дата);
	Док.ДатаОтгрузки       = мср.ПолучитьРабочийДень(3, Док.Дата);
	Док.Приоритет          = Справочники.Приоритеты.ПолучитьНизшийПриоритет();
	Док.СкидкиРассчитаны   = Истина;
	Док.ЦенаВключаетНДС    = Ложь;
	Док.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
	Док.Валюта             = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Док.Договор, "ВалютаВзаиморасчетов");
	
	ОтветственныеЛицаСервер.ПриИзмененииСвязанныхРеквизитовДокумента(Док);

	ЗаполнитьТоварыЗаказа(Док, ТоварыВ2В);
	
	ЗаполнитьВесОбъемКолПалетЗаказКлиента(Док);
	
	мср.ЗаписатьДокумент(Док, РежимЗаписиДокумента.Запись);
	
	Возврат Док.Ссылка;
КонецФункции

Процедура ЗаполнитьТоварыЗаказа(Док, Товары)
	Табл = Новый ТаблицаЗначений();
	Табл.Колонки.Добавить("Код",        Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(20)));
	Табл.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	
	Для Каждого Стр Из Товары Цикл
		НовСтр = Табл.Добавить();
		НовСтр.Код = Стр.sku;
		НовСтр.Количество = Стр.count;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	//@skip-check bsl-legacy-check-string-literal
	Запрос.УстановитьПараметр("ВидЦеныОсновная", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Док.Соглашение, "ВидЦен"));
	Запрос.УстановитьПараметр("ВидЦеныМега",     AMS_ВызовСервера.ПолучитьИзСоглашенияВидЦеныМега(Док.Соглашение));
	Запрос.УстановитьПараметр("Дата",            Док.Дата);
	Запрос.УстановитьПараметр("ДатаОтгрузки",    Док.ДатаОтгрузки);
	Запрос.УстановитьПараметр("Товары",          Табл);
	Запрос.УстановитьПараметр("Склад",           Док.Склад);
	Запрос.УстановитьПараметр("Соглашение",      Док.Соглашение);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	т.Код КАК Код,
		|	т.Количество КАК Количество
		|ПОМЕСТИТЬ в2в
		|ИЗ
		|	&Товары КАК т
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Ном.Артикул КАК Артикул,
		|	Ном.Ссылка КАК Номенклатура,
		|	в2в.Количество КАК Количество,
		|	Ном.ЦеноваяГруппа КАК ЦеноваяГруппа,
		|	Ном.СтавкаНДС КАК СтавкаНДС,
		|	СтавкиНДС.Ставка КАК Ставка,
		|	Ном._Упаковка КАК Упаковка,
		|	Ном.КоэффициентЕдиницыДляОтчетов КАК Кфц
		|ПОМЕСТИТЬ то
		|ИЗ
		|	в2в КАК в2в
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтавкиНДС КАК СтавкиНДС
		|			ПО Ном.СтавкаНДС = СтавкиНДС.Ссылка
		|		ПО в2в.Код = Ном.Код
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	то.Артикул КАК Артикул,
		|	то.Номенклатура КАК Номенклатура,
		|	то.ЦеноваяГруппа КАК ЦеноваяГруппа,
		|	то.СтавкаНДС КАК СтавкаНДС,
		|	то.Ставка КАК Ставка,
		|	ВЫБОР
		|		КОГДА то.Количество / то.Кфц > ЦЕЛ(то.Количество / то.Кфц)
		|			ТОГДА ЦЕЛ(то.Количество / то.Кфц) + 1
		|		ИНАЧЕ то.Количество / то.Кфц
		|	КОНЕЦ * то.Кфц КАК Количество,
		|	ВЫБОР
		|		КОГДА то.Количество / то.Кфц > ЦЕЛ(то.Количество / то.Кфц)
		|			ТОГДА ЦЕЛ(то.Количество / то.Кфц) + 1
		|		ИНАЧЕ то.Количество / то.Кфц
		|	КОНЕЦ КАК КоличествоУпаковок,
		|	то.Упаковка КАК Упаковка,
		|	то.Кфц КАК Кфц
		|ПОМЕСТИТЬ тов
		|ИЗ
		|	то КАК то
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Цен.Номенклатура КАК Номенклатура,
		|	Цен.Цена КАК Цена,
		|	Цен.ВидЦены КАК ВидЦены
		|ПОМЕСТИТЬ ЦеныОсн
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Дата, ВидЦены = &ВидЦеныОсновная
		|	И Номенклатура В
		|		(ВЫБРАТЬ
		|			тов.Номенклатура КАК Номенклатура
		|		ИЗ
		|			тов КАК тов)) КАК Цен
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Цен.Номенклатура,
		|	Цен.Цена,
		|	Цен.ВидЦены
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Дата, ВидЦены = &ВидЦеныМега
		|	И Номенклатура В
		|		(ВЫБРАТЬ
		|			тов.Номенклатура КАК Номенклатура
		|		ИЗ
		|			тов КАК тов)) КАК Цен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Согл.Номенклатура КАК Номенклатура,
		|	Согл.Цена КАК Цена,
		|	NULL КАК ВидЦены
		|ПОМЕСТИТЬ ЦенДоп
		|ИЗ
		|	Справочник.СоглашенияСКлиентами.Товары КАК Согл
		|ГДЕ
		|	Согл.Ссылка = &Соглашение
		|	И Согл.Номенклатура В
		|		(ВЫБРАТЬ
		|			тов.Номенклатура КАК Номенклатура
		|		ИЗ
		|			тов КАК тов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&ДатаОтгрузки КАК ДатаОтгрузки,
		|	тов.Номенклатура КАК Номенклатура,
		|	тов.Упаковка КАК Упаковка,
		|	тов.Количество / тов.Кфц КАК КоличествоУпаковок,
		|	тов.Количество КАК Количество,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ЦенДоп.Цена, ЦеныОсн.Цена) = ЦенДоп.Цена
		|			ТОГДА NULL
		|		ИНАЧЕ ЦеныОсн.ВидЦены
		|	КОНЕЦ КАК ВидЦены,
		|	ЕСТЬNULL(ЦенДоп.Цена, ЦеныОсн.Цена) * тов.Кфц КАК Цена,
		|	ЕСТЬNULL(ЦенДоп.Цена, ЦеныОсн.Цена) * тов.Количество КАК Сумма,
		|	тов.СтавкаНДС КАК СтавкаНДС,
		|	тов.Ставка * ЕСТЬNULL(ЦенДоп.Цена, ЦеныОсн.Цена) * тов.Количество / 100 КАК СуммаНДС,
		|	ЕСТЬNULL(ЦенДоп.Цена, ЦеныОсн.Цена) * тов.Количество + тов.Ставка * ЕСТЬNULL(ЦенДоп.Цена, ЦеныОсн.Цена) *
		|		тов.Количество / 100 КАК СуммаСНДС,
		|	&Склад КАК Склад,
		|	ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.КОбеспечению) КАК ВариантОбеспечения
		|ИЗ
		|	тов КАК тов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЦеныОсн КАК ЦеныОсн
		|		ПО тов.Номенклатура = ЦеныОсн.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЦенДоп КАК ЦенДоп
		|		ПО тов.Номенклатура = ЦенДоп.Номенклатура";
	
	Док.Товары.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

#КонецОбласти

#Область ВыгрузкаНаВ2В

Процедура ОбновитьЗаказКлиентаНаВ2В(ЗаказКлиента, Статус = Неопределено, ТокенАвторизации = Неопределено) Экспорт
	AMS_ID = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаказКлиента, "AMS_ID");
	
	Если AMS_ID = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ТокенАвторизации = Неопределено Тогда
		ТокенАвторизации = ПолучитьТокенАвторизации(Константы.AMS_В2В_МенеджерЗагрузкиЗаказов.Получить());
	КонецЕсли;  
	
	МассивДанных = ПолучитьМассивТоваровЗаказа(ЗаказКлиента);
	
	ОбъектТела = Новый Соответствие();
	ОбъектТела.Вставить("id",    AMS_ID); 
	ОбъектТела.Вставить("items", МассивДанных);
	
	Если Не Статус = Неопределено Тогда
		ОбъектТела.Вставить("status", ПолучитьИмяПеречисления(Статус));
	КонецЕсли;

	Послание = СоответствиеВJSON(ОбъектТела);
	
	HTTPСоединение = Новый HTTPСоединение("b2b.cafe",,,,, ТАЙМАУТ(), Новый ЗащищенноеСоединениеOpenSSL());
	HTTPЗапрос = Новый HTTPЗапрос("/api/v1.5.0/order/update");
	HTTPЗапрос.Заголовки.Вставить("Authorization", "Bearer " + ТокенАвторизации);
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");
	HTTPЗапрос.Заголовки.Вставить("Accept-Language", "ru");
	
	HTTPЗапрос.УстановитьТелоИзСтроки(Послание);
	
	//@skip-check bsl-legacy-check-dynamic-feature-access
	HTTPОтвет = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	
	Если HTTPОтвет.КодСостояния = 200 Тогда
		//@skip-check module-unused-local-variable
		ТелоОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
	Иначе
		ТекстОшибки = НСтр("ru = 'AMS_Сервер.ОбновитьЗаказКлиентаНаВ2В.Ошибка: Не удалось обновить заказ ID %ID%'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ID%", AMS_ID);
		ЗаписьЖурналаРегистрации(ТекстОшибки, УровеньЖурналаРегистрации.Ошибка,,
		ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьМассивТоваровЗаказа(ЗаказКлиента)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказКлиента);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	т.Номенклатура КАК Номенклатура,
		|	т.Количество КАК Количество
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК т
		|ГДЕ
		|	т.Ссылка = &ЗаказКлиента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ном.Код КАК sku,
		|	СУММА(вт.Количество) КАК count
		|ИЗ
		|	вт КАК вт
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК ном
		|		ПО вт.Номенклатура = ном.Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ном.Код";
	Табл = Запрос.Выполнить().Выгрузить();
	
	МассивДанных = Новый Массив;
	
	Для каждого Стр Из Табл Цикл
		Строка = Новый Соответствие();
		Строка.Вставить("sku",   Стр.SKU);
		Строка.Вставить("count", Стр.count);
		
		МассивДанных.Добавить(Строка);
	КонецЦикла;
	
	Возврат МассивДанных;
КонецФункции 

#КонецОбласти

#Область Прочее_В2В

Функция ПолучитьТокенАвторизации(Пользователь) Экспорт
	ТокенАвторизации = "";
	
	УстановитьПривилегированныйРежим(Истина);

 	РежимБезопасности = БезопасныйРежим();
	
	Если ТипЗнч(РежимБезопасности) = тип("Булево") и РежимБезопасности = Истина тогда
		УстановитьОтключениеБезопасногоРежима(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Логин КАК Логин,
	|	т.Пароль КАК Пароль
	|ИЗ
	|	РегистрСведений.AMS_МенеджерыВ2В КАК т
	|ГДЕ
	|	т.Пользователь = &Пользователь";
	
	Рез = Запрос.Выполнить();
	
	Если Не Рез.Пустой() Тогда
		Выб = Рез.Выбрать(); 
		Выб.Следующий();

		HTTPСоединение = Новый HTTPСоединение("conteb2b.com",,,,, ТАЙМАУТ(), Новый ЗащищенноеСоединениеOpenSSL());
		HTTPЗапрос = Новый HTTPЗапрос("/api/v1.5.0/security/login");
		HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");
		
		ДанныеЗапроса = Новый Структура();
		ДанныеЗапроса.Вставить("login", Выб.Логин);
		ДанныеЗапроса.Вставить("password", Выб.Пароль);
		ТелоЗапроса = СтруктураВJson(ДанныеЗапроса);
		
		HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса);
		
		//@skip-check bsl-legacy-check-dynamic-feature-access
		HTTPОтвет = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
		
		Если HTTPОтвет.КодСостояния = 200 Тогда
			ТелоОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
			СтруктураОтвета = JsonВЗначение(ТелоОтвета);
			
			ТокенАвторизации = СтруктураОтвета["result"]["accessToken"]["token"];
		
		Иначе
			ЗаписьЖурналаРегистрации("ПолучитьТокенАвторизации.Ошибка", УровеньЖурналаРегистрации.Ошибка);
		КонецЕсли;
	КонецЕсли;

	Возврат ТокенАвторизации;
КонецФункции

Функция ПолучитьОстаткиНаСкладеАМС()
	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("Дата",               ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("СкладПродукции",     AMS_ВызовСервера.СкладПродукции());
	Запрос.УстановитьПараметр("СписокЦехов",        AMS_ВызовСервера.СписокЦеховПроизводстваПродукции());

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	т.Номенклатура.Код КАК sku,
	|	т.Номенклатура.Артикул КАК Артикул,
	|	т.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ тов
	|ИЗ
	|	Справочник.AMS_Продукция.Товары КАК т
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.AMS_Продукция КАК д
	|		ПО т.Ссылка = д.Ссылка
	|ГДЕ
	|	т.В2В
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	рег.Номенклатура КАК Номенклатура,
	|	рег.ВНаличииОстаток КАК ОстЦех
	|ПОМЕСТИТЬ ОстЦехВечер
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(КОНЕЦПЕРИОДА(&Дата, ДЕНЬ), Склад В (&СписокЦехов)
	|	И Номенклатура В
	|		(ВЫБРАТЬ
	|			т.Номенклатура КАК Номенклатура
	|		ИЗ
	|			тов КАК т)) КАК рег
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	рег.Номенклатура КАК Номенклатура,
	|	рег.ВНаличииОстаток КАК ОстСклУ
	|ПОМЕСТИТЬ ОстСкл
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, ДЕНЬ, -1), ДЕНЬ), Склад = &СкладПродукции
	|	И Номенклатура В
	|		(ВЫБРАТЬ
	|			т.Номенклатура КАК Номенклатура
	|		ИЗ
	|			тов КАК т)) КАК рег
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	рег.Номенклатура КАК Номенклатура,
	|	СУММА(ЕСТЬNULL(рег.ВНаличииПриход, 0)) КАК Приход,
	|	СУММА(ЕСТЬNULL(рег.ВНаличииРасход, 0)) КАК Расход
	|ПОМЕСТИТЬ Движ
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Обороты(НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ), КОНЕЦПЕРИОДА(&Дата, ДЕНЬ),,
	|		Склад = &СкладПродукции
	|	И Номенклатура В
	|		(ВЫБРАТЬ
	|			т.Номенклатура КАК Номенклатура
	|		ИЗ
	|			тов КАК т)) КАК рег
	|СГРУППИРОВАТЬ ПО
	|	рег.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.КОтгрузкеОстаток КАК Количество,
	|	т.ДокументОтгрузки.Дата КАК Дата
	|ПОМЕСТИТЬ КОтгр
	|ИЗ
	|	РегистрНакопления.ТоварыКОтгрузке.Остатки(, Склад = &СкладПродукции
	|	И Номенклатура В
	|		(ВЫБРАТЬ
	|			т.Номенклатура КАК Номенклатура
	|		ИЗ
	|			тов КАК т)) КАК т
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОтгр.Номенклатура КАК Номенклатура,
	|	СУММА(КОтгр.Количество) КАК КОтгрузке
	|ПОМЕСТИТЬ КОтг
	|ИЗ
	|	КОтгр КАК КОтгр
	|ГДЕ
	|	КОтгр.Дата > НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
	|СГРУППИРОВАТЬ ПО
	|	КОтгр.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тов.sku КАК sku,
	|	тов.Артикул КАК Артикул,
	|	тов.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ОстЦехВечер.ОстЦех, 0) + ЕСТЬNULL(ОстСкл.ОстСклУ, 0) + ЕСТЬNULL(Движ.Приход, 0) - ЕСТЬNULL(Движ.Расход, 0) -
	|		ЕСТЬNULL(КОтг.КОтгрузке, 0) КАК count
	|ПОМЕСТИТЬ склад
	|ИЗ
	|	тов КАК тов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстЦехВечер КАК ОстЦехВечер
	|		ПО тов.Номенклатура = ОстЦехВечер.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстСкл КАК ОстСкл
	|		ПО тов.Номенклатура = ОстСкл.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Движ КАК Движ
	|		ПО тов.Номенклатура = Движ.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ КОтг КАК КОтг
	|		ПО тов.Номенклатура = КОтг.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тов.sku КАК sku,
	|	тов.Артикул КАК Артикул,
	|	тов.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА склад.count < 0
	|			ТОГДА 0
	|		ИНАЧЕ склад.count
	|	КОНЕЦ КАК count
	|ИЗ
	|	тов КАК тов
	|		ЛЕВОЕ СОЕДИНЕНИЕ склад КАК склад
	|		ПО тов.sku = склад.sku";
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ТАЙМАУТ() Экспорт
	Возврат 10;
КонецФункции

Функция JsonВЗначение(JSON)
	ЧтениеJSON = Новый ЧтениеJSON();
	ЧтениеJSON.УстановитьСтроку(JSON);
	
	Возврат ПрочитатьJSON(ЧтениеJSON);
КонецФункции

Функция JSONВСоответствие(JSON) Экспорт
	ЧтениеJSON = Новый ЧтениеJSON();
	ЧтениеJSON.УстановитьСтроку(JSON);
	Результат = ПрочитатьJSON(ЧтениеJSON, Истина);
	ЧтениеJSON.Закрыть();

	Возврат Результат;
КонецФункции

Функция СтруктураВJson(Знач Структура) Экспорт
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Структура);
	
	Результат = ЗаписьJSON.Закрыть();

	Возврат Результат;
КонецФункции

Функция СоответствиеВJSON(Знач Соответствие)
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Unix, "  "));
	ЗаписатьJSON(ЗаписьJSON, Соответствие, , "ПреобразоватьВЗначениеJSON"); 
			
	Результат = ЗаписьJSON.Закрыть();

	Возврат Результат;
КонецФункции

Функция ПреобразоватьВЗначениеJSON(Свойство, Значение, ДополнительныеПараметры, Отказ) Экспорт
	НовоеЗначение = Значение;

	Если Значение = Null Или Значение = Неопределено Тогда
		НовоеЗначение = Новый Структура();
	КонецЕсли;

	Возврат НовоеЗначение;
КонецФункции

Функция ПолучитьИмяПеречисления(Перечисление)
    МетаданныеПеречисления = Перечисление.Метаданные();
    
    ИндексЗначения = Перечисления[МетаданныеПеречисления.Имя].Индекс(Перечисление);
    
    ЗначениеМетаданных = МетаданныеПеречисления.ЗначенияПеречисления[ИндексЗначения];
    
    Возврат ЗначениеМетаданных.Имя;  
КонецФункции

#КонецОбласти

#КонецОбласти

#Область Печать

Функция ПолучитьВыборкаПоДокументамУКД(Ссылка) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СчетФактура.Ссылка КАК Ссылка,
		|	Корр.Ссылка КАК Корректировка,
		|	КоррРасхождения.Номенклатура КАК Номенклатура,
		|	СУММА(КоррРасхождения.Количество) КАК Количество,
		|	СУММА(КоррРасхождения.Сумма) КАК Сумма,
		|	СУММА(КоррРасхождения.СуммаНДС) КАК СуммаНДС,
		|	СУММА(КоррРасхождения.СуммаСНДС) КАК СуммаСНДС,
		|	МАКСИМУМ(КоррРасхождения.НомерСтроки) КАК НомерСтроки,
		|	КоррРасхождения.Серия КАК Серия,
		|	КоррРасхождения.Серия.Наименование КАК СерияНаименование,
		|	КоррРасхождения.СтавкаНДС КАК СтавкаНДС,
		|	КоррРасхождения.НомерГТД.ТипНомераГТД КАК ТипНомераГТД,
		|	КоррРасхождения.Характеристика КАК Характеристика,
		|	КоррРасхождения.Характеристика.Наименование КАК ХарактеристикаНаименование,
		|	КоррРасхождения.НоменклатураНабора КАК НоменклатураНабора,
		|	КоррРасхождения.ХарактеристикаНабора КАК ХарактеристикаНабора
		|ПОМЕСТИТЬ Расх
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации КАК Корр
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации.Расхождения КАК КоррРасхождения
		|			ПО Корр.Ссылка = КоррРасхождения.Ссылка
		|		ПО СчетФактура.ДокументОснование = Корр.Ссылка
		|ГДЕ
		|	СчетФактура.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	КоррРасхождения.НоменклатураНабора,
		|	КоррРасхождения.Характеристика,
		|	СчетФактура.Ссылка,
		|	КоррРасхождения.СтавкаНДС,
		|	КоррРасхождения.ХарактеристикаНабора,
		|	КоррРасхождения.НомерГТД.ТипНомераГТД,
		|	КоррРасхождения.Серия,
		|	КоррРасхождения.Номенклатура,
		|	Корр.Ссылка,
		|	КоррРасхождения.Серия.Наименование,
		|	КоррРасхождения.Характеристика.Наименование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КоррРасхождения.Ссылка КАК Ссылка,
		|	КоррРасхождения.Номенклатура КАК Номенклатура,
		|	ВЫБОР
		|		КОГДА КоррТовары.Количество ЕСТЬ NULL
		|			ТОГДА -КоррРасхождения.Количество
		|		ИНАЧЕ КоррТовары.Количество - КоррРасхождения.Количество
		|	КОНЕЦ КАК КоличествоДо,
		|	ЕСТЬNULL(КоррТовары.Количество, 0) КАК Количество,
		|	ВЫБОР
		|		КОГДА КоррТовары.Сумма ЕСТЬ NULL
		|			ТОГДА -КоррРасхождения.Сумма
		|		ИНАЧЕ КоррТовары.Сумма - КоррРасхождения.Сумма
		|	КОНЕЦ КАК СуммаБезНДСДо,
		|	ЕСТЬNULL(КоррТовары.Сумма, 0) КАК СуммаБезНДС,
		|	ВЫБОР
		|		КОГДА КоррТовары.СуммаНДС ЕСТЬ NULL
		|			ТОГДА -КоррРасхождения.СуммаНДС
		|		ИНАЧЕ КоррТовары.СуммаНДС - КоррРасхождения.СуммаНДС
		|	КОНЕЦ КАК СуммаНДСДо,
		|	ЕСТЬNULL(КоррТовары.СуммаНДС, 0) КАК СуммаНДС,
		|	ВЫБОР
		|		КОГДА КоррТовары.СуммаСНДС ЕСТЬ NULL
		|			ТОГДА -КоррРасхождения.СуммаСНДС
		|		ИНАЧЕ КоррТовары.СуммаСНДС - КоррРасхождения.СуммаСНДС
		|	КОНЕЦ КАК СуммаСНДСДо,
		|	ЕСТЬNULL(КоррТовары.СуммаСНДС, 0) КАК СуммаСНДС,
		|	КоррРасхождения.НомерСтроки КАК НомерСтроки,
		|	КоррТовары.НомерСтроки КАК НомерСтрокиИсходногоСФ,
		|	КоррРасхождения.Серия КАК Серия,
		|	КоррРасхождения.СерияНаименование КАК СерияНаименование,
		|	КоррРасхождения.СтавкаНДС КАК СтавкаНДС,
		|	КоррРасхождения.ТипНомераГТД КАК ТипНомераГТД,
		|	КоррРасхождения.Характеристика КАК Характеристика,
		|	КоррРасхождения.ХарактеристикаНаименование КАК ХарактеристикаНаименование,
		|	КоррРасхождения.НоменклатураНабора КАК НоменклатураНабора,
		|	КоррРасхождения.ХарактеристикаНабора КАК ХарактеристикаНабора
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	Расх КАК КоррРасхождения
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации.Товары КАК КоррТовары
		|		ПО КоррРасхождения.Корректировка = КоррТовары.Ссылка
		|		И КоррРасхождения.Номенклатура = КоррТовары.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт.Ссылка КАК Ссылка,
		|	вт.Номенклатура КАК Номенклатура,
		|	ВЫБОР
		|		КОГДА вт.КоличествоДо = 0
		|			ТОГДА 0
		|		ИНАЧЕ вт.СуммаБезНДСДо / вт.КоличествоДо
		|	КОНЕЦ КАК ЦенаДо,
		|	ВЫБОР
		|		КОГДА вт.Количество = 0
		|			ТОГДА 0
		|		ИНАЧЕ вт.СуммаБезНДС / вт.Количество
		|	КОНЕЦ КАК Цена,
		|	вт.КоличествоДо КАК КоличествоДо,
		|	вт.КоличествоДо КАК КоличествоБазовыхЕдиницДо,
		|	вт.Количество КАК КоличествоБазовыхЕдиниц,
		|	вт.Количество КАК Количество,
		|	вт.СуммаБезНДСДо КАК СуммаБезНДСДо,
		|	вт.СуммаБезНДС КАК СуммаБезНДС,
		|	вт.СуммаНДСДо КАК СуммаНДСДо,
		|	вт.СуммаНДС КАК СуммаНДС,
		|	вт.СуммаСНДСДо КАК СуммаСНДСДо,
		|	вт.СуммаСНДС КАК СуммаСНДС,
		|	ВЫБОР
		|		КОГДА вт.СуммаБезНДСДо > вт.СуммаБезНДС
		|			ТОГДА 0
		|		ИНАЧЕ вт.СуммаБезНДС - вт.СуммаБезНДСДо
		|	КОНЕЦ КАК РазницаБезНДСУвеличение,
		|	ВЫБОР
		|		КОГДА вт.СуммаБезНДСДо > вт.СуммаБезНДС
		|			ТОГДА вт.СуммаБезНДСДо - вт.СуммаБезНДС
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК РазницаБезНДСУменьшение,
		|	ВЫБОР
		|		КОГДА вт.СуммаНДСДо > вт.СуммаНДС
		|			ТОГДА 0
		|		ИНАЧЕ вт.СуммаНДС - вт.СуммаНДСДо
		|	КОНЕЦ КАК РазницаНДСУвеличение,
		|	ВЫБОР
		|		КОГДА вт.СуммаНДСДо > вт.СуммаНДС
		|			ТОГДА вт.СуммаНДСДо - вт.СуммаНДС
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК РазницаНДСУменьшение,
		|	ВЫБОР
		|		КОГДА вт.СуммаСНДСДо > вт.СуммаСНДС
		|			ТОГДА 0
		|		ИНАЧЕ вт.СуммаСНДС - вт.СуммаСНДСДо
		|	КОНЕЦ КАК РазницаСНДСУвеличение,
		|	ВЫБОР
		|		КОГДА вт.СуммаСНДСДо > вт.СуммаСНДС
		|			ТОГДА вт.СуммаСНДСДо - вт.СуммаСНДС
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК РазницаСНДСУменьшение,
		|	ЗНАЧЕНИЕ(Перечисление.ВариантыПредставленияНаборовВПечатныхФормах.ПустаяСсылка) КАК
		|		ВариантПредставленияНабораВПечатныхФормах,
		|	ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.ПустаяСсылка) КАК ВариантРасчетаЦеныНабора,
		|	Ном.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	Ном.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
		|	Ном.ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмеренияНаименование,
		|	НЕОПРЕДЕЛЕНО КАК ЕдиницаИзмеренияТНВЭД,
		|	НЕОПРЕДЕЛЕНО КАК ЕдиницаИзмеренияТНВЭДКод,
		|	НЕОПРЕДЕЛЕНО КАК ЕдиницаИзмеренияТНВЭДНаименование,
		|	ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка) КАК КодТНВЭД,
		|	0 КАК КоличествоПоРНПТДо,
		|	0 КАК КоличествоПоРНПТ,
		|	0 КАК КоличествоПрослежУвеличение,
		|	0 КАК КоличествоПрослежУменьшение,
		|	0 КАК МежценоваяРазницаДо,
		|	0 КАК МежценоваяРазница,
		|	Ном.Артикул КАК НоменклатураКод,
		|	вт.НоменклатураНабора КАК НоменклатураНабора,
		|	Ном.НаименованиеПолное КАК НоменклатураНаименование,
		|	ЗНАЧЕНИЕ(Справочник.НоменклатураКонтрагентов.ПустаяСсылка) КАК НоменклатураПартнера,
		|	НЕОПРЕДЕЛЕНО КАК НомерГТД,
		|	вт.НомерСтроки КАК НомерСтроки,
		|	вт.НомерСтрокиИсходногоСФ КАК НомерСтрокиИсходногоСФ,
		|	вт.НомерСтроки КАК НомерСтрокиНаборы,
		|	ЛОЖЬ КАК ПолныйНабор,
		|	вт.Серия КАК Серия,
		|	вт.СерияНаименование КАК СерияНаименование,
		|	вт.СтавкаНДС КАК СтавкаНДС,
		|	Ном.СтранаПроисхождения КАК СтранаПроисхождения,
		|	Ном.СтранаПроисхождения.Код КАК СтранаПроисхожденияКод,
		|	вт.ТипНомераГТД КАК ТипНомераГТД,
		|	вт.Характеристика КАК Характеристика,
		|	вт.ХарактеристикаНабора КАК ХарактеристикаНабора,
		|	вт.ХарактеристикаНаименование КАК ХарактеристикаНаименование,
		|	ЛОЖЬ КАК ЭтоВозвратнаяТара,
		|	ЛОЖЬ КАК ЭтоКомплектующие,
		|	ЛОЖЬ КАК ЭтоНабор
		|ИЗ
		|	вт КАК вт
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
		|		ПО вт.Номенклатура = Ном.Ссылка
		|ИТОГИ
		|	СУММА(КоличествоДо),
		|	СУММА(КоличествоБазовыхЕдиницДо),
		|	СУММА(КоличествоБазовыхЕдиниц),
		|	СУММА(Количество),
		|	СУММА(СуммаБезНДСДо),
		|	СУММА(СуммаБезНДС),
		|	СУММА(СуммаНДСДо),
		|	СУММА(СуммаНДС),
		|	СУММА(СуммаСНДСДо),
		|	СУММА(СуммаСНДС),
		|	СУММА(РазницаБезНДСУвеличение),
		|	СУММА(РазницаБезНДСУменьшение),
		|	СУММА(РазницаНДСУвеличение),
		|	СУММА(РазницаНДСУменьшение),
		|	СУММА(РазницаСНДСУвеличение),
		|	СУММА(РазницаСНДСУменьшение)
		|ПО
		|	Ссылка";
	
	Возврат Запрос.Выполнить();
КонецФункции

#КонецОбласти

#Область ПолучитьДанные

Функция ПолучитьСотрудниковСкладаПродукции() Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СкладПродукции", AMS_ВызовСервера.СкладПродукции());

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ФизическиеЛица КАК т
	|ГДЕ
	|	НЕ т.ПометкаУдаления
	|	И НЕ т.ЭтоГруппа
	|	И т._РаботникПроизводства
	|	И т._Склад = &СкладПродукции
	|
	|УПОРЯДОЧИТЬ ПО
	|	т.Наименование";

	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
КонецФункции

Функция ПолучитьУпаковкиПродукции(НаборУпаковок) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаборУпаковок", НаборУпаковок);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Ссылка КАК Упаковка,
	|	т.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ПРЕДСТАВЛЕНИЕ(т.ЕдиницаИзмерения) КАК Ед,
	|	т.Числитель / ВЫБОР
	|		КОГДА т.Знаменатель = 0
	|			ТОГДА 1
	|		ИНАЧЕ т.Знаменатель
	|	КОНЕЦ КАК Количество,
	|	т.КоличествоУпаковок КАК КоличествоУпаковок,
	|	т.Вес КАК Вес,
	|	т.Объем КАК Объем
	|ИЗ
	|	Справочник.УпаковкиЕдиницыИзмерения КАК т
	|ГДЕ
	|	т.Владелец = &НаборУпаковок
	|
	|УПОРЯДОЧИТЬ ПО
	|	Количество";

	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ПолучитьДанныеДляРасчетаТоварныхЗапасов(ПараметрыЗапроса) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("НачалоПериода", ПараметрыЗапроса.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", ПараметрыЗапроса.КонецПериода);
	Запрос.УстановитьПараметр("СкладПродукции", AMS_ВызовСервера.СкладПродукции());
	Запрос.УстановитьПараметр("СегментыПродукцияКомпании", AMS_ВызовСервера.СегментыНоменклатурыПродукцияКомпании());
	Запрос.УстановитьПараметр("ГрафикРаботы", Справочники.Календари.НайтиПоНаименованию("Календарь РФ", Истина));
	Запрос.УстановитьПараметр("ПроцентА", 80);
	Запрос.УстановитьПараметр("ПроцентВ", 15);
	Запрос.УстановитьПараметр("AX", ПараметрыЗапроса.AX);
	Запрос.УстановитьПараметр("AY", ПараметрыЗапроса.AY);
	Запрос.УстановитьПараметр("AZ", ПараметрыЗапроса.AZ);
	Запрос.УстановитьПараметр("CZ", ПараметрыЗапроса.CZ);
	Запрос.УстановитьПараметр("ВидНоменклатурыПродукцияЦеха1", AMS_ВызовСервера.ВидНоменклатурыПродукцияЦеха1());
	Запрос.УстановитьПараметр("ВидНоменклатурыПродукцияЦеха2", AMS_ВызовСервера.ВидНоменклатурыПродукцияЦеха2());
	Запрос.УстановитьПараметр("ВидНоменклатурыПродукцияЦеха3", AMS_ВызовСервера.ВидНоменклатурыПродукцияЦеха3());
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	т.Номенклатура КАК Номенклатура,
		|	Ном.КоэффициентЕдиницыДляОтчетов КАК Кфц,
		|	Ном.НаборУпаковок КАК НаборУпаковок
		|ПОМЕСТИТЬ Тов
		|ИЗ
		|	РегистрСведений.НоменклатураСегмента КАК т
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
		|		ПО т.Номенклатура = Ном.Ссылка
		|ГДЕ
		|	т.Сегмент = &СегментыПродукцияКомпании
		|	И т.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
		|	И т.Номенклатура.Артикул <> """"
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ т.ДатаГрафика) + КОЛИЧЕСТВО(РАЗЛИЧНЫЕ МЕСЯЦ(т.ДатаГрафика)) КАК КоличествоДней
		|ПОМЕСТИТЬ Дни
		|ИЗ
		|	РегистрСведений.КалендарныеГрафики КАК т
		|ГДЕ
		|	т.Календарь = &ГрафикРаботы
		|	И т.ДеньВключенВГрафик
		|	И т.ДатаГрафика МЕЖДУ &НачалоПериода И &КонецПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Тов.Номенклатура КАК Номенклатура,
		|	УпакНаПал.КоличествоУпаковок КАК КоличествоУпаковокНаПалете
		|ПОМЕСТИТЬ Палета
		|ИЗ
		|	Тов КАК Тов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпакНаПал
		|		ПО Тов.НаборУпаковок = УпакНаПал.Владелец
		|ГДЕ
		|	УпакНаПал.ЕдиницаИзмерения.Код = ""999""
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Тов.Номенклатура КАК Номенклатура,
		|	ЕСТЬNULL(ОстаткиИОбороты.ВНаличииНачальныйОстаток, 0) / Тов.Кфц КАК НачальныйОстаток,
		|	ЕСТЬNULL(ОстаткиИОбороты.ВНаличииПриход, 0) / Тов.Кфц КАК Приход,
		|	ЕСТЬNULL(ОстаткиИОбороты.ВНаличииРасход, 0) / Тов.Кфц КАК Расход,
		|	ЕСТЬNULL(ОстаткиИОбороты.ВНаличииКонечныйОстаток, 0) / Тов.Кфц КАК КонечныйОстаток,
		|	(ЕСТЬNULL(ОстаткиИОбороты.ВНаличииНачальныйОстаток, 0) / Тов.Кфц + ЕСТЬNULL(ОстаткиИОбороты.ВНаличииПриход, 0) /
		|		Тов.Кфц + ЕСТЬNULL(ОстаткиИОбороты.ВНаличииКонечныйОстаток, 0) / Тов.Кфц) / 2 КАК ТоварныйЗапас,
		|	ЕСТЬNULL(Дни.КоличествоДней, 0) КАК КоличествоДней
		|ПОМЕСТИТЬ Ном1
		|ИЗ
		|	Тов КАК Тов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.ОстаткиИОбороты(&НачалоПериода, &КонецПериода,, Движения,
		|			Склад = &СкладПродукции) КАК ОстаткиИОбороты
		|		ПО Тов.Номенклатура = ОстаткиИОбороты.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Дни КАК Дни
		|		ПО ИСТИНА
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Ном1.Номенклатура КАК Номенклатура,
		|	Ном1.НачальныйОстаток КАК НачальныйОстаток,
		|	Ном1.Приход КАК Приход,
		|	Ном1.Расход КАК Расход,
		|	Ном1.КонечныйОстаток КАК КонечныйОстаток,
		|	Ном1.ТоварныйЗапас КАК ТоварныйЗапас,
		|	ВЫБОР
		|		КОГДА Ном1.Расход = 0
		|			ТОГДА 0
		|		ИНАЧЕ Ном1.ТоварныйЗапас * Ном1.КоличествоДней / Ном1.Расход
		|	КОНЕЦ КАК ОборотВДнях,
		|	ВЫБОР
		|		КОГДА Ном1.ТоварныйЗапас = 0
		|			ТОГДА 0
		|		ИНАЧЕ Ном1.Расход / Ном1.ТоварныйЗапас
		|	КОНЕЦ КАК ОборотВРазах,
		|	ВЫБОР
		|		КОГДА ВЫБОР
		|			КОГДА Ном1.Расход = 0
		|				ТОГДА 0
		|			ИНАЧЕ Ном1.ТоварныйЗапас * Ном1.КоличествоДней / Ном1.Расход
		|		КОНЕЦ = 0
		|			ТОГДА 0
		|		ИНАЧЕ Ном1.Расход / ВЫБОР
		|			КОГДА Ном1.Расход = 0
		|				ТОГДА 0
		|			ИНАЧЕ Ном1.ТоварныйЗапас * Ном1.КоличествоДней / Ном1.Расход
		|		КОНЕЦ
		|	КОНЕЦ КАК МинОстатокУпак,
		|	ВЫБОР
		|		КОГДА Ном1.КоличествоДней = 0
		|			ТОГДА 0
		|		ИНАЧЕ Ном1.Расход / Ном1.КоличествоДней
		|	КОНЕЦ КАК РасходДеньУпак
		|ПОМЕСТИТЬ Ном2
		|ИЗ
		|	Ном1 КАК Ном1
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Тов.Номенклатура КАК Номенклатура,
		|	Продажи.СуммаВыручкиСНДСРеглОборот КАК Сумма
		|ПОМЕСТИТЬ А1
		|ИЗ
		|	Тов КАК Тов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(&НачалоПериода, &КонецПериода,,
		|			Склад = &СкладПродукции
		|		И ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту),
		|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноРеализации),
		|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровОтКлиента),
		|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровОтКлиентаПрошлыхПериодов))) КАК Продажи
		|		ПО Тов.Номенклатура = Продажи.АналитикаУчетаНоменклатуры.Номенклатура
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(А1.Сумма) КАК СуммаИтог
		|ПОМЕСТИТЬ А2
		|ИЗ
		|	А1 КАК А1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 500
		|	А1.Номенклатура КАК Номенклатура,
		|	А1.Сумма КАК Сумма,
		|	100 * А1.Сумма / А2.СуммаИтог КАК Доля,
		|	АВТОНОМЕРЗАПИСИ() КАК Номер
		|ПОМЕСТИТЬ А3
		|ИЗ
		|	А1 КАК А1
		|		ЛЕВОЕ СОЕДИНЕНИЕ А2 КАК А2
		|		ПО ИСТИНА
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сумма УБЫВ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 500000
		|	А3.Номенклатура КАК Номенклатура,
		|	А3.Сумма КАК Сумма,
		|	А3.Доля КАК Доля,
		|	СУММА(А31.Доля) КАК ДоляРост
		|ПОМЕСТИТЬ А4
		|ИЗ
		|	А3 КАК А3
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ А3 КАК А31
		|		ПО ИСТИНА
		|		И А3.Номер >= А31.Номер
		|СГРУППИРОВАТЬ ПО
		|	А3.Номенклатура,
		|	А3.Сумма,
		|	А3.Доля
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сумма УБЫВ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	А4.Номенклатура КАК Номенклатура,
		|	А4.Сумма КАК Сумма,
		|	А4.Доля КАК Доля,
		|	А4.ДоляРост КАК ДоляРост,
		|	ВЫБОР
		|		КОГДА А4.ДоляРост <= &ПроцентА
		|			ТОГДА ""A""
		|		КОГДА А4.ДоляРост <= &ПроцентА + &ПроцентВ
		|			ТОГДА ""B""
		|		ИНАЧЕ ""C""
		|	КОНЕЦ КАК КлассABC
		|ПОМЕСТИТЬ АВС
		|ИЗ
		|	А4 КАК А4
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	т.Номенклатура КАК Номенклатура,
		|	ВЫБОР
		|		КОГДА т.Класс = ЗНАЧЕНИЕ(Перечисление.XYZКлассификация.XКласс)
		|			ТОГДА ""X""
		|		КОГДА т.Класс = ЗНАЧЕНИЕ(Перечисление.XYZКлассификация.YКласс)
		|			ТОГДА ""Y""
		|		КОГДА т.Класс = ЗНАЧЕНИЕ(Перечисление.XYZКлассификация.ZКласс)
		|			ТОГДА ""Z""
		|	КОНЕЦ КАК КлассXYZ,
		|	т.ЗначениеПараметраКлассификации КАК ЗначениеXYZ
		|ПОМЕСТИТЬ XYZ
		|ИЗ
		|	РегистрСведений.ABCXYZКлассификацияНоменклатуры.СрезПоследних(&КонецПериода, РазделКлассификации = &СкладПродукции
		|	И Номенклатура В
		|		(ВЫБРАТЬ
		|			Тов.Номенклатура КАК Номенклатура
		|		ИЗ
		|			Тов КАК Тов)) КАК т
		|ГДЕ
		|	т.ТипКлассификации = ЗНАЧЕНИЕ(Перечисление.ТипыКлассификации.XYZ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	т.Номенклатура КАК Номенклатура,
		|	т.МаксимальныйОбъемЗамеса КАК ОбъемЗамесаМакс,
		|	т.МинимальныйОбъемЗамеса КАК ОбъемЗамесаМин,
		|	т.КоличествоФабрикатаВУпаковке КАК КоличествоФабрикатаВУпаковке,
		|	ВЫБОР
		|		КОГДА т.КоличествоФабрикатаВУпаковке = 0
		|			ТОГДА 0
		|		ИНАЧЕ т.МинимальныйОбъемЗамеса / т.КоличествоФабрикатаВУпаковке
		|	КОНЕЦ КАК УпакНаЗамесМин,
		|	ВЫБОР
		|		КОГДА т.КоличествоФабрикатаВУпаковке = 0
		|			ТОГДА 0
		|		ИНАЧЕ т.МаксимальныйОбъемЗамеса / т.КоличествоФабрикатаВУпаковке
		|	КОНЕЦ КАК УпакНаЗамесМакс
		|ПОМЕСТИТЬ Замес
		|ИЗ
		|	РегистрСведений.AMS_РеквизитыНоменклатуры КАК т
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Ном2.Номенклатура КАК Номенклатура,
		|	Ном2.НачальныйОстаток КАК НачальныйОстаток,
		|	Ном2.Приход КАК Приход,
		|	Ном2.Расход КАК Расход,
		|	Ном2.КонечныйОстаток КАК КонечныйОстаток,
		|	Ном2.ТоварныйЗапас КАК ТоварныйЗапас,
		|	Ном2.ОборотВДнях КАК ОборотВДнях,
		|	Ном2.ОборотВРазах КАК ОборотВРазах,
		|	Ном2.МинОстатокУпак КАК МинОстатокУпак,
		|	ВЫБОР
		|		КОГДА Палета.КоличествоУпаковокНаПалете = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫБОР
		|			КОГДА (Ном2.МинОстатокУпак + Ном2.РасходДеньУпак) / Палета.КоличествоУпаковокНаПалете - ЦЕЛ(Ном2.МинОстатокУпак /
		|				Палета.КоличествоУпаковокНаПалете) = 0
		|				ТОГДА ЦЕЛ((Ном2.МинОстатокУпак + Ном2.РасходДеньУпак) / Палета.КоличествоУпаковокНаПалете)
		|			ИНАЧЕ ЦЕЛ((Ном2.МинОстатокУпак + Ном2.РасходДеньУпак) / Палета.КоличествоУпаковокНаПалете) + 1
		|		КОНЕЦ
		|	КОНЕЦ КАК МинОстатокПалет,
		|	Ном2.РасходДеньУпак КАК РасходДеньУпак,
		|	ВЫБОР
		|		КОГДА Палета.КоличествоУпаковокНаПалете = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫБОР
		|			КОГДА Ном2.РасходДеньУпак / Палета.КоличествоУпаковокНаПалете - ЦЕЛ(Ном2.РасходДеньУпак /
		|				Палета.КоличествоУпаковокНаПалете) = 0
		|				ТОГДА ЦЕЛ(Ном2.РасходДеньУпак / Палета.КоличествоУпаковокНаПалете)
		|			ИНАЧЕ ЦЕЛ(Ном2.РасходДеньУпак / Палета.КоличествоУпаковокНаПалете) + 1
		|		КОНЕЦ
		|	КОНЕЦ КАК РасходДеньПалет,
		|	АВС.Сумма КАК Сумма,
		|	АВС.Доля КАК Доля,
		|	АВС.ДоляРост КАК ДоляРост,
		|	АВС.КлассABC КАК КлассABC,
		|	ЕСТЬNULL(XYZ.КлассXYZ, ""Z"") КАК КлассXYZ,
		|	XYZ.ЗначениеXYZ КАК ЗначениеXYZ,
		|	ВЫБОР
		|		КОГДА АВС.КлассABC = ""A""
		|		И ЕСТЬNULL(XYZ.КлассXYZ, ""Z"") = ""X""
		|			ТОГДА &AX
		|		КОГДА АВС.КлассABC = ""A""
		|		И ЕСТЬNULL(XYZ.КлассXYZ, ""Z"") = ""Y""
		|		ИЛИ АВС.КлассABC = ""B""
		|		И ЕСТЬNULL(XYZ.КлассXYZ, ""Z"") = ""X""
		|		ИЛИ АВС.КлассABC = ""C""
		|		И ЕСТЬNULL(XYZ.КлассXYZ, ""Z"") = ""X""
		|			ТОГДА &AY
		|		КОГДА АВС.КлассABC = ""C""
		|		И ЕСТЬNULL(XYZ.КлассXYZ, ""Z"") = ""Z""
		|			ТОГДА &CZ
		|		ИНАЧЕ &AZ
		|	КОНЕЦ КАК ПланПродажДней,
		|	Палета.КоличествоУпаковокНаПалете КАК КоличествоУпаковокНаПалете
		|ПОМЕСТИТЬ Ном3
		|ИЗ
		|	Ном2 КАК Ном2
		|		ЛЕВОЕ СОЕДИНЕНИЕ Палета КАК Палета
		|		ПО Ном2.Номенклатура = Палета.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ АВС КАК АВС
		|		ПО Ном2.Номенклатура = АВС.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ XYZ КАК XYZ
		|		ПО Ном2.Номенклатура = XYZ.Номенклатура
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Ном3.Номенклатура КАК Номенклатура,
		|	Ном3.НачальныйОстаток КАК НачальныйОстаток,
		|	Ном3.Приход КАК Приход,
		|	Ном3.Расход КАК Расход,
		|	Ном3.КонечныйОстаток КАК КонечныйОстаток,
		|	Ном3.ТоварныйЗапас КАК ТоварныйЗапас,
		|	Ном3.ОборотВДнях КАК ОборотВДнях,
		|	Ном3.ОборотВРазах КАК ОборотВРазах,
		|	Ном3.МинОстатокУпак КАК МинОстатокУпак,
		|	Ном3.МинОстатокПалет КАК МинОстатокПалет,
		|	Ном3.РасходДеньУпак КАК РасходДеньУпак,
		|	Ном3.РасходДеньПалет КАК РасходДеньПалет,
		|	Ном3.Сумма КАК Сумма,
		|	Ном3.Доля КАК Доля,
		|	Ном3.ДоляРост КАК ДоляРост,
		|	Ном3.КлассABC КАК КлассABC,
		|	Ном3.КлассXYZ КАК КлассXYZ,
		|	Ном3.ЗначениеXYZ КАК ЗначениеXYZ,
		|	Ном3.ПланПродажДней КАК ПланПродажДней,
		|	Ном3.РасходДеньУпак * Ном3.ПланПродажДней КАК ПланПродажУпак,
		|	ВЫБОР
		|		КОГДА Ном3.КоличествоУпаковокНаПалете = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫБОР
		|			КОГДА Ном3.РасходДеньУпак * Ном3.ПланПродажДней / Ном3.КоличествоУпаковокНаПалете - ЦЕЛ(Ном3.РасходДеньУпак *
		|				Ном3.ПланПродажДней / Ном3.КоличествоУпаковокНаПалете) = 0
		|				ТОГДА ЦЕЛ(Ном3.РасходДеньУпак * Ном3.ПланПродажДней / Ном3.КоличествоУпаковокНаПалете)
		|			ИНАЧЕ ЦЕЛ(Ном3.РасходДеньУпак * Ном3.ПланПродажДней / Ном3.КоличествоУпаковокНаПалете) + 1
		|		КОНЕЦ
		|	КОНЕЦ КАК ПланПродажПалет,
		|	ВЫБОР
		|		КОГДА Замес.ОбъемЗамесаМин < Замес.ОбъемЗамесаМакс
		|			ТОГДА ВЫБОР
		|				КОГДА Замес.УпакНаЗамесМин = 0
		|					ТОГДА 0
		|				ИНАЧЕ Ном3.РасходДеньУпак * Ном3.ПланПродажДней / Замес.УпакНаЗамесМин
		|			КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|			КОГДА Замес.УпакНаЗамесМакс = 0
		|				ТОГДА 0
		|			ИНАЧЕ Ном3.РасходДеньУпак * Ном3.ПланПродажДней / Замес.УпакНаЗамесМакс
		|		КОНЕЦ
		|	КОНЕЦ КАК ПланПродажРасчЗамесов,
		|	ВЫБОР
		|		КОГДА Замес.ОбъемЗамесаМакс = 0
		|			ТОГДА 0
		|		ИНАЧЕ Замес.ОбъемЗамесаМин / Замес.ОбъемЗамесаМакс
		|	КОНЕЦ КАК КфцЗамеса,
		|	Замес.ОбъемЗамесаМакс КАК ОбъемЗамесаМакс,
		|	Замес.ОбъемЗамесаМин КАК ОбъемЗамесаМин,
		|	Замес.УпакНаЗамесМин КАК УпакНаЗамесМин,
		|	Замес.УпакНаЗамесМакс КАК УпакНаЗамесМакс,
		|	Ном3.КоличествоУпаковокНаПалете КАК КоличествоУпаковокНаПалете
		|ПОМЕСТИТЬ Ном4
		|ИЗ
		|	Ном3 КАК Ном3
		|		ЛЕВОЕ СОЕДИНЕНИЕ Замес КАК Замес
		|		ПО Ном3.Номенклатура = Замес.Номенклатура
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Ном4.Номенклатура КАК Номенклатура,
		|	Ном4.НачальныйОстаток КАК НачальныйОстаток,
		|	Ном4.Приход КАК Приход,
		|	Ном4.Расход КАК Расход,
		|	Ном4.КонечныйОстаток КАК КонечныйОстаток,
		|	Ном4.ТоварныйЗапас КАК ТоварныйЗапас,
		|	Ном4.ОборотВДнях КАК ОборотВДнях,
		|	Ном4.ОборотВРазах КАК ОборотВРазах,
		|	Ном4.МинОстатокУпак КАК МинОстатокУпак,
		|	Ном4.МинОстатокПалет КАК МинОстатокПалет,
		|	Ном4.РасходДеньУпак КАК РасходДеньУпак,
		|	Ном4.РасходДеньПалет КАК РасходДеньПалет,
		|	Ном4.Сумма КАК Сумма,
		|	Ном4.Доля КАК Доля,
		|	Ном4.ДоляРост КАК ДоляРост,
		|	Ном4.КлассABC КАК КлассABC,
		|	Ном4.КлассXYZ КАК КлассXYZ,
		|	Ном4.ЗначениеXYZ КАК ЗначениеXYZ,
		|	Ном4.ПланПродажДней КАК ПланПродажДней,
		|	Ном4.ПланПродажУпак КАК ПланПродажУпак,
		|	Ном4.ПланПродажПалет КАК ПланПродажПалет,
		|	Ном4.ПланПродажРасчЗамесов КАК ПланПродажРасчЗамесов,
		|	Ном4.КфцЗамеса КАК КфцЗамеса,
		|	ВЫБОР
		|		КОГДА Ном4.ПланПродажРасчЗамесов - ЦЕЛ(Ном4.ПланПродажРасчЗамесов) = 0
		|			ТОГДА ЦЕЛ(Ном4.ПланПродажРасчЗамесов)
		|		ИНАЧЕ ЦЕЛ(Ном4.ПланПродажРасчЗамесов) + 1
		|	КОНЕЦ КАК ПланПродажФактЗамесов,
		|	Ном4.КфцЗамеса * ВЫБОР
		|		КОГДА Ном4.ПланПродажРасчЗамесов - ЦЕЛ(Ном4.ПланПродажРасчЗамесов) = 0
		|			ТОГДА ЦЕЛ(Ном4.ПланПродажРасчЗамесов)
		|		ИНАЧЕ ЦЕЛ(Ном4.ПланПродажРасчЗамесов) + 1
		|	КОНЕЦ КАК ПланПродажФактЗамесовМаксЗагрузка,
		|	Ном4.МинОстатокУпак + Ном4.ПланПродажУпак + Ном4.РасходДеньУпак КАК ОстРасчетУпак,
		|	Ном4.ОбъемЗамесаМакс КАК ОбъемЗамесаМакс,
		|	Ном4.ОбъемЗамесаМин КАК ОбъемЗамесаМин,
		|	Ном4.УпакНаЗамесМин КАК УпакНаЗамесМин,
		|	Ном4.УпакНаЗамесМакс КАК УпакНаЗамесМакс,
		|	Ном4.КоличествоУпаковокНаПалете КАК КоличествоУпаковокНаПалете
		|ПОМЕСТИТЬ Ном5
		|ИЗ
		|	Ном4 КАК Ном4
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Ном5.Номенклатура КАК Номенклатура,
		|	Ном5.НачальныйОстаток КАК НачальныйОстаток,
		|	Ном5.Приход КАК Приход,
		|	Ном5.Расход КАК Расход,
		|	Ном5.КонечныйОстаток КАК КонечныйОстаток,
		|	Ном5.ТоварныйЗапас КАК ТоварныйЗапас,
		|	Ном5.ОборотВДнях КАК ОборотВДнях,
		|	Ном5.ОборотВРазах КАК ОборотВРазах,
		|	Ном5.МинОстатокУпак КАК МинОстатокУпак,
		|	Ном5.МинОстатокПалет КАК МинОстатокПалет,
		|	Ном5.РасходДеньУпак КАК РасходДеньУпак,
		|	Ном5.РасходДеньПалет КАК РасходДеньПалет,
		|	Ном5.Сумма КАК Сумма,
		|	Ном5.Доля КАК Доля,
		|	Ном5.ДоляРост КАК ДоляРост,
		|	Ном5.КлассABC КАК КлассABC,
		|	Ном5.КлассXYZ КАК КлассXYZ,
		|	Ном5.ЗначениеXYZ КАК ЗначениеXYZ,
		|	Ном5.ПланПродажДней КАК ПланПродажДней,
		|	Ном5.ПланПродажУпак КАК ПланПродажУпак,
		|	Ном5.ПланПродажПалет КАК ПланПродажПалет,
		|	Ном5.ПланПродажРасчЗамесов КАК ПланПродажРасчЗамесов,
		|	Ном5.КфцЗамеса КАК КфцЗамеса,
		|	Ном5.ПланПродажФактЗамесов КАК ПланПродажФактЗамесов,
		|	Ном5.ПланПродажФактЗамесовМаксЗагрузка КАК ПланПродажФактЗамесовМаксЗагрузка,
		|	Ном5.ОстРасчетУпак КАК ОстРасчетУпак,
		|	ВЫБОР
		|		КОГДА Ном5.ОбъемЗамесаМин < Ном5.ОбъемЗамесаМакс
		|			ТОГДА Ном5.ПланПродажФактЗамесов * Ном5.УпакНаЗамесМин + Ном5.МинОстатокУпак + Ном5.РасходДеньУпак
		|		ИНАЧЕ Ном5.ПланПродажФактЗамесов * Ном5.УпакНаЗамесМакс + Ном5.МинОстатокУпак + Ном5.РасходДеньУпак
		|	КОНЕЦ КАК ОстФактУпак,
		|	ВЫБОР
		|		КОГДА Ном5.КоличествоУпаковокНаПалете = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫБОР
		|			КОГДА Ном5.ОбъемЗамесаМин < Ном5.ОбъемЗамесаМакс
		|				ТОГДА Ном5.ПланПродажФактЗамесов * Ном5.УпакНаЗамесМин + Ном5.МинОстатокУпак + Ном5.РасходДеньУпак
		|			ИНАЧЕ Ном5.ПланПродажФактЗамесов * Ном5.УпакНаЗамесМакс + Ном5.МинОстатокУпак + Ном5.РасходДеньУпак
		|		КОНЕЦ / Ном5.КоличествоУпаковокНаПалете
		|	КОНЕЦ КАК ОстФактПалет,
		|	Ном5.ОбъемЗамесаМакс КАК ОбъемЗамесаМакс,
		|	Ном5.ОбъемЗамесаМин КАК ОбъемЗамесаМин,
		|	Ном5.УпакНаЗамесМакс КАК УпакНаЗамесМакс,
		|	Ном5.УпакНаЗамесМин КАК УпакНаЗамесМин
		|ПОМЕСТИТЬ Ном6
		|ИЗ
		|	Ном5 КАК Ном5
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтрНом.Артикул КАК Артикул,
		|	Ном6.Номенклатура КАК Номенклатура,
		|	СтрНом.ВидНоменклатуры КАК ВидНоменклатуры,
		|	ВЫБОР
		|		КОГДА СтрНом.ВидНоменклатуры = &ВидНоменклатурыПродукцияЦеха1
		|			ТОГДА 1
		|		КОГДА СтрНом.ВидНоменклатуры = &ВидНоменклатурыПродукцияЦеха2
		|			ТОГДА 2
		|		КОГДА СтрНом.ВидНоменклатуры = &ВидНоменклатурыПродукцияЦеха3
		|			ТОГДА 3
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Цех,
		|	Ном6.ТоварныйЗапас КАК ТоварныйЗапас,
		|	Ном6.ОборотВДнях КАК ОборотВДнях,
		|	Ном6.ОборотВРазах КАК ОборотВРазах,
		|	Ном6.МинОстатокУпак + Ном6.РасходДеньУпак КАК МинОстатокУпак,
		|	Ном6.МинОстатокПалет КАК МинОстатокПалет,
		|	Ном6.РасходДеньУпак КАК РасходДеньУпак,
		|	Ном6.РасходДеньПалет КАК РасходДеньПалет,
		|	Ном6.ПланПродажУпак КАК ПланПродажУпак,
		|	Ном6.ПланПродажПалет КАК ПланПродажПалет,
		|	Ном6.ПланПродажФактЗамесовМаксЗагрузка КАК ПланПродажЗамес,
		|	Ном6.ПланПродажДней КАК ПланПродажДней,
		|	Ном6.ОстРасчетУпак КАК ОстРасчетУпак,
		|	Ном6.ОстФактУпак КАК ОстФактУпак,
		|	ВЫБОР
		|		КОГДА Ном6.ОстФактПалет - ЦЕЛ(Ном6.ОстФактПалет) = 0
		|			ТОГДА ЦЕЛ(Ном6.ОстФактПалет)
		|		ИНАЧЕ ЦЕЛ(Ном6.ОстФактПалет) + 1
		|	КОНЕЦ КАК ОстФактПалет,
		|	Ном6.ОбъемЗамесаМакс КАК ОбъемЗамесаМакс,
		|	Ном6.ОбъемЗамесаМин КАК ОбъемЗамесаМин,
		|	Ном6.УпакНаЗамесМакс КАК УпакНаЗамесМакс,
		|	Ном6.УпакНаЗамесМин КАК УпакНаЗамесМин,
		|	Ном6.КлассABC КАК КлассABC,
		|	Ном6.КлассXYZ КАК КлассXYZ,
		|	Ном6.Доля КАК Доля,
		|	Ном6.Сумма КАК Сумма,
		|	Ном6.ДоляРост КАК ДоляРост,
		|	Ном6.ЗначениеXYZ КАК ЗначениеXYZ
		|ИЗ
		|	Ном6 КАК Ном6
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СтрНом
		|		ПО Ном6.Номенклатура = СтрНом.Ссылка";
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции 

#КонецОбласти

#Область Прочие

Процедура ПроверитьЗагрузкуВТранспорт(Источник, РежимЗаписи, Отказ)
	Если Не ЗначениеЗаполнено(Источник.Ссылка) 
		Или Не РежимЗаписи = РежимЗаписиДокумента.Проведение Или Пользователи.РолиДоступны("_Бухгалтер") Тогда
		Возврат;
	КонецЕсли;
		
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг")	
		И Не Источник.AMS_СтатусРеализации = Перечисления.AMS_СтатусыРеализаций.КОтгрузке Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЛогистическийЛист = AMS_ВызовСервера.ПолучитьЛогистическийЛист(Источник.Ссылка);
	
	Если ЗначениеЗаполнено(ЛогистическийЛист) Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ЛогистическийЛист", ЛогистическийЛист);
		Запрос.УстановитьПараметр("Распоряжение", Источник.Ссылка);
		
		Запрос.Текст =
			"ВЫБРАТЬ
			|	т.Ссылка КАК Ссылка,
			|	т.ТранспортноеСредство КАК ТранспортноеСредство,
			|	т.Распоряжение КАК Распоряжение,
			|	т.ТранспортноеСредство.AMS_КоличествоПалет КАК КоличествоПалетАвто
			|ПОМЕСТИТЬ Авто
			|ИЗ
			|	Документ.AMS_ЛогистическийЛист.Распоряжения КАК т
			|ГДЕ
			|	НЕ т.Подвоз
			|	И т.Ссылка = &ЛогистическийЛист
			|	И т.Распоряжение = &Распоряжение
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	т.ТранспортноеСредство КАК ТранспортноеСредство,
			|	СУММА(т.Распоряжение.AMS_КоличествоПалет) КАК КоличествоПалет
			|ПОМЕСТИТЬ Загрузки
			|ИЗ
			|	Документ.AMS_ЛогистическийЛист.Распоряжения КАК т
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Авто КАК Авто
			|		ПО т.Ссылка = Авто.Ссылка
			|		И т.ТранспортноеСредство = Авто.ТранспортноеСредство
			|		И т.Распоряжение <> Авто.Распоряжение
			|СГРУППИРОВАТЬ ПО
			|	т.ТранспортноеСредство
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Авто.ТранспортноеСредство КАК ТранспортноеСредство,
			|	Авто.КоличествоПалетАвто КАК КоличествоПалетАвто,
			|	ЕСТЬNULL(Загрузки.КоличествоПалет, 0) КАК КоличествоПалет
			|ИЗ
			|	Авто КАК Авто
			|		ЛЕВОЕ СОЕДИНЕНИЕ Загрузки КАК Загрузки
			|		ПО Авто.ТранспортноеСредство = Загрузки.ТранспортноеСредство";
		
		Стр = Запрос.Выполнить().Выгрузить()[0];
		
		Перегруз = (Стр.КоличествоПалет + Источник.AMS_КоличествоПалет) - Стр.КоличествоПалетАвто;
		
		Если Перегруз > 0 Тогда
			ТекстОшибки = "Перегруз " + Перегруз + " палет(ы) в транспортное средство " + Стр.ТранспортноеСредство;
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , , , Отказ);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьВесОбъемКолПалетЗаказКлиента(Объект) Экспорт
	Стр = ПолучитьВесОбъемТоваров(Объект.Товары.Выгрузить(,"Номенклатура, Количество"), Объект.AMS_СпособПередачиТоваров);
	
	Объект.AMS_Вес   = Стр.Вес;
	Объект.AMS_Объем = Стр.Объем;
	
	Объект.AMS_КоличествоПалет        = Стр.КоличествоПалетМоно + Стр.КоличествоПалетСборных;
	Объект.AMS_КоличествоПалетСборных = Стр.КоличествоПалетСборных;
	Объект.AMS_КоличествоПалетРасчет  = Стр.КоличествоПалетРасчет;
	Объект.AMS_КоличествоУпаковок     = Стр.КоличествоУпаковок;
	Объект.AMS_КоличествоПалетПлан    = Объект.AMS_КоличествоПалет;
	Объект.AMS_ВесПлан                = Объект.AMS_Вес;
КонецПроцедуры

Функция ПолучитьВесОбъемТоваров(Товары, СпособПередачиТоваров = 0) Экспорт
	Данные = Новый Структура;
	Данные.Вставить("КоличествоУпаковок", 0);
	Данные.Вставить("Вес", 0);
	Данные.Вставить("Объем", 0);
	Данные.Вставить("КоличествоПалет", 0);
	Данные.Вставить("КоличествоПалетМоно", 0);
	Данные.Вставить("КоличествоПалетСборных", 0);
	Данные.Вставить("КоличествоПалетРасчет", 0);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Товары", Товары);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.Количество КАК Количество
	|ПОМЕСТИТЬ тч
	|ИЗ
	|	&Товары КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ном.Ссылка КАК Номенклатура,
	|	СУММА(тч.Количество) КАК Количество,
	|	Ном.НаборУпаковок КАК НаборУпаковок,
	|	Ном.КоэффициентЕдиницыДляОтчетов КАК Кфц,
	|	Ном._Упаковка КАК ОсновнаяУпаковка
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	тч КАК тч
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|		ПО тч.Номенклатура = Ном.Ссылка
	|ГДЕ
	|	тч.Количество > 0
	|	И Ном.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	|
	|СГРУППИРОВАТЬ ПО
	|	Ном.Ссылка,
	|	Ном.НаборУпаковок,
	|	Ном.КоэффициентЕдиницыДляОтчетов,
	|	Ном._Упаковка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.Номенклатура КАК Номенклатура,
	|	Ед.Ссылка КАК ШтУпак,
	|	Ед.Вес КАК ШтВес,
	|	Ед.Объем КАК ШтОбъем
	|ПОМЕСТИТЬ шт
	|ИЗ
	|	вт КАК вт
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК Ед
	|		ПО (вт.Номенклатура = Ед.Владелец
	|				ИЛИ вт.НаборУпаковок = Ед.Владелец)
	|			И (Ед.Числитель = 1)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.Номенклатура КАК Номенклатура,
	|	Ед.Ссылка КАК УпакУпак,
	|	Ед.Вес КАК УпакВес,
	|	Ед.Объем КАК УпакОбъем,
	|	Ед.Числитель КАК УпакЧислитель
	|ПОМЕСТИТЬ упак
	|ИЗ
	|	вт КАК вт
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК Ед
	|		ПО вт.ОсновнаяУпаковка = Ед.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.Номенклатура КАК Номенклатура,
	|	Ед.Ссылка КАК ПалУпак,
	|	Ед.Вес КАК ПалВес,
	|	Ед.Объем КАК ПалОбъем,
	|	Ед.Числитель КАК ПалЧислитель
	|ПОМЕСТИТЬ пал
	|ИЗ
	|	вт КАК вт
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК Ед
	|		ПО (вт.Номенклатура = Ед.Владелец
	|				ИЛИ вт.НаборУпаковок = Ед.Владелец)
	|			И (Ед.ЕдиницаИзмерения.Код = ""999"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.Номенклатура КАК Номенклатура,
	|	вт.Количество КАК Количество,
	|	ЕСТЬNULL(шт.ШтВес, 0) КАК ШтВес,
	|	ЕСТЬNULL(упак.УпакЧислитель, 1) КАК УпакЧислитель,
	|	ЕСТЬNULL(упак.УпакВес, 0) КАК УпакВес,
	|	ЕСТЬNULL(упак.УпакОбъем, 0) КАК УпакОбъем,
	|	вт.Количество / ЕСТЬNULL(упак.УпакЧислитель, 1) КАК КоличествоУпаковок,
	|	ЕСТЬNULL(пал.ПалЧислитель, 1) КАК ПалЧислитель,
	|	ЕСТЬNULL(пал.ПалВес, 0) КАК ПалВес,
	|	ЕСТЬNULL(пал.ПалОбъем, 0) КАК ПалОбъем,
	|	ВЫБОР
	|		КОГДА пал.ПалУпак ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ вт.Количество / пал.ПалЧислитель
	|	КОНЕЦ КАК КоличествоПалет
	|ИЗ
	|	вт КАК вт
	|		ЛЕВОЕ СОЕДИНЕНИЕ шт КАК шт
	|		ПО вт.Номенклатура = шт.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ упак КАК упак
	|		ПО вт.Номенклатура = упак.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ пал КАК пал
	|		ПО вт.Номенклатура = пал.Номенклатура";

	Рез = Запрос.Выполнить();

	Если Рез.Пустой() Тогда
		Возврат Данные;
	КонецЕсли;
	
	КоличествоУпаковок = 0;
	Вес = 0;
	Объем = 0;
	КоличествоПалет = 0;
	КоличествоПалетМоно = 0;
	КоличествоПалетРасчет = 0;
	КоличествоПалетСборных = 0;

	Выб = Рез.Выбрать();
	Пока Выб.Следующий() Цикл
		//Палета
		КолПалетМоно = Цел(Выб.КоличествоПалет);
		КолПалетОстат = Выб.КоличествоПалет - КолПалетМоно;

		ВесПалет = Выб.ПалВес * КолПалетМоно;
		ОбъемПалет = Выб.ПалОбъем * КолПалетМоно;
		
		//Упаковка
		ОстатокКоличество = Выб.Количество - КолПалетМоно * Выб.ПалЧислитель;

		КолУпаковок = ОстатокКоличество / Выб.УпакЧислитель;
		КолУпаковокЦелых = Цел(КолУпаковок);

		ВесУпак = Выб.УпакВес * КолУпаковокЦелых;
		ОбъемУпак = Выб.УпакОбъем * КолУпаковокЦелых;
		
		//Единица
		ОстатокКоличество = ОстатокКоличество - КолУпаковокЦелых * Выб.УпакЧислитель;
		ВесШт = Выб.ШтВес * ОстатокКоличество;
		
		//Итог
		КоличествоУпаковок    = КоличествоУпаковок + Выб.КоличествоУпаковок;
		Вес                   = Вес + ВесПалет + ВесУпак + ВесШт;
		Объем                 = Объем + ОбъемПалет + ОбъемУпак;
		КоличествоПалетРасчет = КоличествоПалетРасчет + Выб.КоличествоПалет;

		КоличествоПалет = КоличествоПалет + Выб.КоличествоПалет;
		КоличествоПалетМоно = КоличествоПалетМоно + КолПалетМоно;
		КоличествоПалетСборных = КоличествоПалетСборных + КолПалетОстат;
	КонецЦикла;

	Данные.КоличествоУпаковок = КоличествоУпаковок;

	Данные.КоличествоПалет = КоличествоПалет;
	Данные.КоличествоПалетМоно = КоличествоПалетМоно;
	Данные.КоличествоПалетРасчет = КоличествоПалетРасчет;
	Данные.КоличествоПалетСборных = ?(КоличествоПалетСборных - Цел(КоличествоПалетСборных) > 0, Цел(
		КоличествоПалетСборных) + 1, Цел(КоличествоПалетСборных));

	Данные.Вес = (Вес + ?(СпособПередачиТоваров = 0, 20, 0) * Данные.КоличествоПалетСборных) / 1000;
	Данные.Объем = (Объем + ?(СпособПередачиТоваров = 0, 200, 0) * Данные.КоличествоПалетСборных) / 1000;

	Возврат Данные;
КонецФункции

Функция ПолучитьЗаказКлиента(Номер)
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номер", Номер);
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	т.Ссылка КАК ЗаказКлиента
	|ИЗ
	|	Документ.ЗаказКлиента КАК т
	|ГДЕ
	|	т.Номер = &Номер
	|	И т.Дата > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1)";
	
	Рез = Запрос.Выполнить();
	
	Если Рез.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Выб = Рез.Выбрать(); Выб.Следующий();
		Возврат Выб.ЗаказКлиента;
	КонецЕсли;
КонецФункции

//@skip-check module-unused-method
Функция ПолучитьЗаказКлиентаВ2В(AMS_ID)
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("AMS_ID", AMS_ID);
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	т.Ссылка КАК ЗаказКлиента
	|ИЗ
	|	Документ.ЗаказКлиента КАК т
	|ГДЕ
	|	т.Дата > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -3)
	|	И т.AMS_ID = &AMS_ID";
	
	Рез = Запрос.Выполнить();
	
	Если Рез.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Выб = Рез.Выбрать(); Выб.Следующий();
		Возврат Выб.ЗаказКлиента;
	КонецЕсли;
КонецФункции

Функция ЕстьРеализацияЗаказа(AMS_ЗаказКлиентаНомер, Отказ)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("AMS_ЗаказКлиентаНомер", AMS_ЗаказКлиентаНомер);
	Запрос.УстановитьПараметр("AMS_СтатусРеализации", Перечисления.AMS_СтатусыРеализаций.КОтгрузке);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Дата КАК Дата,
	|	т.Номер КАК Номер
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК т
	|ГДЕ
	|	т.AMS_ЗаказКлиентаНомер = &AMS_ЗаказКлиентаНомер
	|	И НЕ т.ПометкаУдаления
	|	И т.AMS_СтатусРеализации = &AMS_СтатусРеализации";

	Рез = Запрос.Выполнить();
	
	Если Рез.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Выб = Рез.Выбрать();
		Пока Выб.Следующий() Цикл
			Текст = НСтр("ru='На основании данного заказа уже создан документ реализации № %1 от %2 г.'");
			Текст = СтрШаблон(Текст, Выб.Номер, Формат(Выб.Дата, "ДЛФ=Д"));
			ОбщегоНазначения.СообщитьПользователю(Текст, , , , Отказ);
		КонецЦикла;
		
		Возврат Ложь;
	КонецЕсли;
КонецФункции

Функция ЕстьЦеныНеПоУсловиямПродаж(Источник)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Товары", Источник.Товары.Выгрузить(, "Номенклатура, ВидЦены, СуммаРучнойСкидки, СуммаАвтоматическойСкидки"));

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.ВидЦены КАК ВидЦены,
	|	т.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	|	т.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	&Товары КАК т
	|ГДЕ
	|	(т.ВидЦены = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|			ИЛИ т.СуммаРучнойСкидки > 0
	|			ИЛИ т.СуммаАвтоматическойСкидки > 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.Номенклатура КАК Номенклатура,
	|	вт.ВидЦены КАК ВидЦены,
	|	вт.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	|	вт.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки
	|ИЗ
	|	вт КАК вт";

	Возврат Не Запрос.Выполнить().Пустой();
КонецФункции

#КонецОбласти

#КонецОбласти
