#Область СлужебныйПрограммныйИнтерфейс

// Функция, проверка вхождения в сегмент
//
// Параметры:
// ОбъектСсылка  - СправочникСсылка - номенклатура или партнер.
// СегментСсылка - СправочникСсылка - сегмент.
//
// Возвращаемое значение:
//  Булево - Признак, наличия документа в Логистическом листе
//

#Область Сегменты

// Входит в сегмент.
// 
// Параметры:
//  НоменклатураПартнер - СправочникСсылка.Номенклатура, СправочникСсылка.Партнеры - ссылка на справочник "Номенклатура" или "Партнеры"
//  Сегмент - СправочникСсылка.СегментыНоменклатуры, СправочникСсылка.СегментыПартнеров - ссылка на справочник "Сегменты номенклатуры" или "Сегменты партнеров", СправочникСсылка.ПартнерыСегмента 
// 
// Возвращаемое значение:
//  Неопределено, Булево - Входит в сегмент
Функция ВходитВСегмент(НоменклатураПартнер, Сегмент) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НоменклатураПартнер", НоменклатураПартнер);
	Запрос.УстановитьПараметр("Сегмент", Сегмент);

	Если ТипЗнч(НоменклатураПартнер) = Тип("СправочникСсылка.Номенклатура") Тогда
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	НоменклатураСегмента.Номенклатура
		|ИЗ
		|	РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
		|ГДЕ
		|	НоменклатураСегмента.Сегмент = &Сегмент
		|	И НоменклатураСегмента.Номенклатура = &НоменклатураПартнер";

	ИначеЕсли ТипЗнч(НоменклатураПартнер) = Тип("СправочникСсылка.Партнеры") Тогда
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ПартнерыСегмента.Партнер
		|ИЗ
		|	РегистрСведений.ПартнерыСегмента КАК ПартнерыСегмента
		|ГДЕ
		|	ПартнерыСегмента.Сегмент = &Сегмент
		|	И ПартнерыСегмента.Партнер = &НоменклатураПартнер";

	Иначе
		Возврат Неопределено;
	КонецЕсли;

	Возврат Не Запрос.Выполнить().Пустой();
КонецФункции

Функция ПолучитьТоварыЗапрещенныеКПродажиЧестныйЗнакМасло(Контрагент, Дата, Товары) Экспорт
	//@skip-check bsl-legacy-check-string-literal
	ЕстьРегистрация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "AMS_ЧЗ_МаслоСмазочное");
	
	Если Дата < '20260401' Или ЕстьРегистрация Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Товары", Товары);
	Запрос.УстановитьПараметр("ВидНоменклатуры", ВидыНоменклатуры_ЧЗ_Масло());

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Ссылка КАК Номенклатура,
	|	т.ВидНоменклатуры КАК ВидНоменклатуры
	|ИЗ
	|	Справочник.Номенклатура КАК т
	|ГДЕ
	|	т.Ссылка В (&Товары)
	|	И т.ВидНоменклатуры В (&ВидНоменклатуры)";

	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура");
КонецФункции

Функция ПолучитьТоварыЗапрещенныеКПродажиЧестныйЗнакКосметика(Контрагент, Дата, Товары) Экспорт
	//@skip-check bsl-legacy-check-string-literal
	ЕстьРегистрация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "AMS_ЧЗ_БытоваяХимия");
	
	Если Дата < '20260701' Или ЕстьРегистрация Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Товары", Товары);
	Запрос.УстановитьПараметр("ВидНоменклатуры", ВидыНоменклатуры_ЧЗ_Косметика());

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Ссылка КАК Номенклатура,
	|	т.ВидНоменклатуры КАК ВидНоменклатуры
	|ИЗ
	|	Справочник.Номенклатура КАК т
	|ГДЕ
	|	т.Ссылка В (&Товары)
	|	И т.ВидНоменклатуры В (&ВидНоменклатуры)";

	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура");
КонецФункции

#КонецОбласти

// Функция, проверка конкретной роли
//
// Параметры:
// Роль  - РолиСсылка - роль
//
// Возвращаемое значение:
//  Булево - Признак, наличия документа в Логистическом листе
//
//@skip-check doc-comment-type
Функция ДоступнаКонкретнаяРоль(Роль) Экспорт
	//@skip-check using-isinrole
	Возврат РольДоступна(Роль);
КонецФункции

// Функция, проверка доступности роли.
// 
// Параметры:
// Роль  - РолиСсылка - роль
// 
// Возвращаемое значение:
//  Булево - Доступна роль
//@skip-check doc-comment-type
Функция ДоступнаРоль(Роль) Экспорт
	Возврат Пользователи.РолиДоступны(Роль);
КонецФункции
Функция ЕстьРоль(Роль) Экспорт
	Возврат УправлениеДоступом.ЕстьРоль(Роль);
КонецФункции
Функция РолиДоступны(Роли) Экспорт
	Возврат Пользователи.РолиДоступны(Роли);
КонецФункции

Функция ЕстьПравоАМС(Право) Экспорт
	Если ЭтоKhors() Тогда
		Возврат Истина;	
	
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	т.Право КАК Право,
		|	т.Пользователь КАК Пользователь
		|ИЗ
		|	РегистрСведений.AMS_ПраваПользователей КАК т
		|ГДЕ
		|	т.Право = &Право
		|	И т.Пользователь = &Пользователь";
	
		Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
		Запрос.УстановитьПараметр("Право", Право);
	
		Возврат Не Запрос.Выполнить().Пустой();
	КонецЕсли;
КонецФункции

Функция ЗначениеСправочника(НаименованиеЗначения) Экспорт
	Спр = Справочники.AMS_Константы[НаименованиеЗначения];
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Спр, "Значение");
КонецФункции

Функция ПолучитьАдресПользовательскиеНастройки(ИмяОтчета, ПараметрыПользователя, ИмяВарианта = Неопределено) Экспорт
	ОтчетОбъект = Отчеты[ИмяОтчета].Создать();
	КомпоновщикНастроек = ОтчетОбъект.КомпоновщикНастроек;
	Если ИмяВарианта = Неопределено Тогда
		Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	Иначе
		Варианты = ОтчетОбъект.СхемаКомпоновкиДанных.ВариантыНастроек;
		НайденныйВариант = Варианты.Найти(ИмяВарианта);

		Если НайденныйВариант <> Неопределено Тогда
			Настройки = НайденныйВариант.Настройки;
			Для Каждого ПараметрПользователя Из ПараметрыПользователя Цикл
				Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(ПараметрПользователя.Ключ,
					ПараметрПользователя.Значение);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

	КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);

	Возврат ПоместитьВоВременноеХранилище(КомпоновщикНастроек.ПользовательскиеНастройки, Новый УникальныйИдентификатор);
КонецФункции

Функция ПолучитьВозможностиСклада(Дата) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	т.Дата КАК Дата,
	|	т.Количество КАК Количество
	|ИЗ
	|	РегистрСведений._ВозможностиСклада КАК т
	|ГДЕ
	|	т.Дата <= КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";

	Рез = Запрос.Выполнить();

	Если Рез.Пустой() Тогда
		Возврат 25000;
	Иначе
		Выб = Рез.Выбрать();
		Выб.Следующий();

		Возврат Выб.Количество;
	КонецЕсли;
КонецФункции
Функция ПолучитьДатуUNIX(Дата) Экспорт
	Возврат Дата - Дата(1970,1,1);
КонецФункции

Функция ПолучитьТекущуюДатуИУстановленноеВремя(Час, Мин) Экспорт
	Возврат НачалоДня(ТекущаяДатаСеанса()) + ПолучитьВремя(7,0);
КонецФункции
Функция ПолучитьВремя(Час, Мин) Экспорт
	Возврат 3600 * Час + 60 * Мин;
КонецФункции
Функция ПолучитьВремяСтрока(Время) Экспорт
	Если ЗначениеЗаполнено(Время) Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Время", Время);
		Запрос.Текст = "ВЫБРАТЬ ПОДСТРОКА(""0123456789"", ЧАС(&Время) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * ЧАС(&Время))) / 6 + 1, 1) + "":"" + ПОДСТРОКА(""0123456789"", МИНУТА(&Время) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * МИНУТА(&Время))) / 6 + 1, 1) КАК Время";
		Рез = Запрос.Выполнить();
		Выб = Рез.Выбрать();
		Выб.Следующий();
		Возврат Выб.Время;
	Иначе
		Возврат "00:00";
	КонецЕсли;
КонецФункции
Функция ПолучитьДатуПрайса(ВидЦены) Экспорт
	Если Не ЗначениеЗаполнено(ВидЦены) Тогда
		Возврат '00010101';
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МАКСИМУМ(т.Период) КАК Период
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры КАК т
	|ГДЕ
	|	т.ВидЦены В(&ВидЦены)";

	Рез = Запрос.Выполнить();

	Если Рез.Пустой() Тогда
		Возврат '00010101';
	Иначе
		Выб = Рез.Выбрать();
		Выб.Следующий();
		Возврат Выб.Период;
	КонецЕсли;
КонецФункции
Функция ПолучитьРабочийДень(ПорядковыйНомер, ДатаНачала = Неопределено, ТекущееВремя = Ложь, КалендарьРФ = Ложь) Экспорт
	УстановитьПривилегированныйРежим(Истина);

	Если ДатаНачала = Неопределено Тогда
		ДатаНачала = НачалоДня(ТекущаяДатаСеанса());
	КонецЕсли;

	Если КалендарьРФ Тогда
		ПроизводственныйКалендарь = Справочники.Календари.НайтиПоНаименованию("Календарь РФ", Истина);
	Иначе
		ПроизводственныйКалендарь = Справочники.Календари.НайтиПоНаименованию("Производственный календарь", Истина);
	КонецЕсли; 

	Если ПорядковыйНомер = 0 Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Календарь", ПроизводственныйКалендарь);
		Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);

		Запрос.Текст =
		"ВЫБРАТЬ
		|	таб.ДатаГрафика КАК Дата
		|ИЗ
		|	РегистрСведений.КалендарныеГрафики КАК таб
		|ГДЕ
		|	таб.Календарь = &Календарь
		|	И таб.ДеньВключенВГрафик
		|	И таб.ДатаГрафика = &ДатаНачала";

		Результат = Запрос.Выполнить();

		Если Результат.Пустой() Тогда
			РабочийДень = Неопределено;  //Это выходной день
		Иначе
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			РабочийДень = Выборка.Дата;
		КонецЕсли;

	ИначеЕсли ПорядковыйНомер > 0 Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Календарь", ПроизводственныйКалендарь);
		Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);

		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ " + Строка(ПорядковыйНомер) +
		"
		|   таб.ДатаГрафика КАК Дата
		|ПОМЕСТИТЬ втРабДни
		|ИЗ
		|   РегистрСведений.КалендарныеГрафики КАК таб
		|ГДЕ
		|   таб.Календарь = &Календарь
		|   И таб.ДеньВключенВГрафик
		|   И таб.ДатаГрафика > &ДатаНачала
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|   МАКСИМУМ(Табл.Дата) КАК Дата
		|ИЗ
		|   втРабДни КАК Табл";

		Результат = Запрос.Выполнить();

		Если Результат.Пустой() Тогда
			РабочийДень = Неопределено;
		Иначе
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			РабочийДень = Выборка.Дата;
		КонецЕсли;

	ИначеЕсли ПорядковыйНомер < 0 Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Календарь", ПроизводственныйКалендарь);
		Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);

		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ " + Строка(-ПорядковыйНомер) +
		"
		|   таб.ДатаГрафика КАК Дата
		|ИЗ
		|   РегистрСведений.КалендарныеГрафики КАК таб
		|ГДЕ
		|   таб.Календарь = &Календарь
		|   И таб.ДеньВключенВГрафик
		|   И таб.ДатаГрафика < &ДатаНачала
		|
		|УПОРЯДОЧИТЬ ПО
		|   Дата УБЫВ";

		Результат = Запрос.Выполнить();

		Если Результат.Пустой() Тогда
			РабочийДень = Неопределено;
		Иначе
			МассивДат = Результат.Выгрузить().ВыгрузитьКолонку("Дата");
			РабочийДень = МассивДат[МассивДат.Количество() - 1];
		КонецЕсли;
	КонецЕсли;
	
	Если ТекущееВремя Тогда
		РабочийДень = РабочийДень + (ТекущаяДатаСеанса() - НачалоДня(ТекущаяДатаСеанса()));
	КонецЕсли;
		
	Возврат РабочийДень;	
КонецФункции

Функция ПолучитьКонтрагентаПартнёра(Партнер, ИНН = Неопределено, КПП = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Запрос.УстановитьПараметр("ИНН",     ИНН);
	Запрос.УстановитьПараметр("КПП",     КПП);
		
	Если ИНН = Неопределено Или КПП = Неопределено Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	таб.Ссылка КАК Контрагент
		|ИЗ
		|	Справочник.Контрагенты КАК таб
		|ГДЕ
		|	таб.Партнер = &Партнер
		|	И НЕ таб._Закрыт
		|	И НЕ таб.ПометкаУдаления";
		
	Иначе
		Запрос.Текст =
		"ВЫБРАТЬ
		|	таб.Ссылка КАК Контрагент
		|ИЗ
		|	Справочник.Контрагенты КАК таб
		|ГДЕ
		|	НЕ таб.ПометкаУдаления
		|	И НЕ таб._Закрыт
		|	И таб.Партнер = &Партнер
		|	И таб.ИНН = &ИНН
		|	И таб.КПП = &КПП
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	таб.Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК таб
		|ГДЕ
		|	НЕ таб.ПометкаУдаления
		|	И НЕ таб._Закрыт
		|	И таб.Партнер = &Партнер
		|	И таб.НалоговыйНомер = &КПП";
	КонецЕсли;

	Табл = Запрос.Выполнить().Выгрузить();
	Если Табл.Количество() = 1 Тогда
		Возврат Табл[0].Контрагент;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

#Область Логистика

Функция ВключенВЛогитическийЛист(Распоряжения) Экспорт
	Если Не ЗначениеЗаполнено(Распоряжения) Тогда
		Возврат Ложь;
	КонецЕсли;

	ЛогистическийЛист = ПолучитьЛогистическийЛист(Распоряжения);
	
	Возврат ЗначениеЗаполнено(ЛогистическийЛист);
КонецФункции

Функция ПолучитьЛогистическийЛист(Распоряжения) Экспорт
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Распоряжения", Распоряжения);

	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	т.Ссылка КАК ЛогистическийЛист
	|ИЗ
	|	Документ.AMS_ЛогистическийЛист.Распоряжения КАК т
	|ГДЕ
	|	т.Распоряжение В (&Распоряжения)
	|	И НЕ т.Ссылка.ПометкаУдаления";

	Рез = Запрос.Выполнить();

	Если Рез.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Выб = Рез.Выбрать(); Выб.Следующий();
		Возврат Выб.ЛогистическийЛист;
	КонецЕсли;
КонецФункции

Функция ПолучитьЛогистическийЛистРасходныйОрдер(Распоряжение) Экспорт
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Распоряжение", Распоряжение);

	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	т.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.AMS_ЛогистическийЛист.Распоряжения КАК т
	|ГДЕ
	|	т.Распоряжение = &Распоряжение
	|	И НЕ т.Ссылка.ПометкаУдаления
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	т.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК т
	|ГДЕ
	|	т.Распоряжение = &Распоряжение
	|	И НЕ т.Ссылка.ПометкаУдаления";

	Рез = Запрос.ВыполнитьПакет();

	Стр = Новый Структура("ЛогистическийЛист,РасходныйОрдерНаТовары");

	Если Рез[0].Пустой() Тогда
		Стр.ЛогистическийЛист = Неопределено;
	Иначе
		Выб = Рез[0].Выбрать();
		Выб.Следующий();
		Стр.ЛогистическийЛист = Выб.Ссылка;
	КонецЕсли;

	Если Рез[1].Пустой() Тогда
		Стр.РасходныйОрдерНаТовары = Неопределено;
	Иначе
		Выб = Рез[1].Выбрать();
		Выб.Следующий();
		Стр.РасходныйОрдерНаТовары = Выб.Ссылка;
	КонецЕсли;

	Возврат Стр;
КонецФункции

#КонецОбласти

#Область ЗаписьУдалениеДокументов

Процедура ЗаписатьДокумент(Документ, РежимЗаписи, Отказ = Ложь, СообщитьОбОшибке = Истина, СообщитьОВыполнении = Ложь) Экспорт
	Если СтрНайти(Строка(ТипЗнч(Документ)), "Документ объект") = 0 Тогда //это ссылка 
		//@skip-check unknown-method-property
		ДокументОбъект = Документ.ПолучитьОбъект();
	Иначе
		ДокументОбъект = Документ;
	КонецЕсли;

	СинонимДок = ДокументОбъект.Метаданные().Синоним;
	НоменДок   = ДокументОбъект.Номер;
	СтрокаДок  = СинонимДок + " № " + ?(ПустаяСтрока(НоменДок), " ... ", НоменДок) + " от " + Формат(
		ДокументОбъект.Дата, "ДФ=dd.MM.yyyy") + " г.";

	Попытка
		ДокументОбъект.Записать(РежимЗаписи);

		Если СообщитьОВыполнении Тогда
			Если РежимЗаписи = РежимЗаписиДокумента.Запись Тогда
				Вариант = "Документа " + СтрокаДок + " записан!";
			ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
				Вариант = "Документ " + СтрокаДок + " проведен!";
			ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
				Вариант = "У документа " + СтрокаДок + " отменено проведение!";
			КонецЕсли;
			ОбщегоНазначения.СообщитьПользователю(Вариант, ДокументОбъект);
		КонецЕсли;

	Исключение
		Отказ = Истина;

		Если СообщитьОбОшибке Тогда
			Если РежимЗаписи = РежимЗаписиДокумента.Запись Тогда
				Вариант = "Документа " + СтрокаДок + " не удалось записать!";
			ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
				Вариант = "Документ " + СтрокаДок + " не проведен!";
			ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
				Вариант = "У документа " + СтрокаДок + " не удалось отменить проведение!";
			КонецЕсли;

			ОбщегоНазначения.СообщитьПользователю(Вариант + " Ошибка: " + ОписаниеОшибки(), ДокументОбъект);
		КонецЕсли;
	КонецПопытки;
КонецПроцедуры

Процедура УстановитьПометкуУдаленияДокументу(Документ, Пометка, Отказ = Ложь, СообщитьОбОшибке = Истина,
	СообщитьОВыполении = Ложь) Экспорт
	Если СтрНайти(Строка(ТипЗнч(Документ)), "Документ объект") = 0 Тогда //это ссылка 
		ДокументОбъект = Документ.ПолучитьОбъект();
	Иначе
		ДокументОбъект = Документ;
	КонецЕсли;

	СинонимДок = ДокументОбъект.Метаданные().Синоним;
	НоменДок   = ДокументОбъект.Номер;
	СтрокаДок  = "«" + СинонимДок + " № " + ?(ПустаяСтрока(НоменДок), " ... ", НоменДок) + " от " + Формат(
		ДокументОбъект.Дата, "ДФ=dd.MM.yyyy") + " г.»";

	Попытка
		Если ДокументОбъект.Модифицированность() Тогда
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;

		ДокументОбъект.УстановитьПометкуУдаления(Пометка);

		Если СообщитьОВыполении Тогда
			Если Пометка = Истина Тогда
				Вариант = "Документ " + СтрокаДок + " помечен на удаление!";
			Иначе
				Вариант = "У документа " + СтрокаДок + " снята пометка на удаление!";
			КонецЕсли;
			ОбщегоНазначения.СообщитьПользователю(Вариант);
		КонецЕсли;

	Исключение
		Если СообщитьОбОшибке Тогда
			Если Пометка = Истина Тогда
				Вариант = "У документ " + СтрокаДок + " не удалось установить пометку на удаление!";
			Иначе
				Вариант = "У документа " + СтрокаДок + " не удалось снять пометку на удаление!";
			КонецЕсли;
			ОбщегоНазначения.СообщитьПользователю(Вариант + " Ошибка: " + ОписаниеОшибки(), , , , Отказ);
		КонецЕсли;
	КонецПопытки;
КонецПроцедуры

#КонецОбласти

Функция ПолучитьНаименованиеДоговора(Номер, Дата, Организация, Партнер, Контрагент, ТипДоговора, СтароеНаименование) Экспорт
	Стр = Новый Структура("Наименование,НаименованиеДляПечати");

	НомерДата = СокрЛП(Номер) + " от " + Формат(Дата, "ДЛФ=Д") + " г.";
	
	//Наименование
	Если Организация = ОрганизацияКемикал() Тогда
		Если ТипДоговора = ПредопределенноеЗначение("Перечисление.ТипыДоговоров.СПокупателем") Тогда
			Наименование = "Договор № " + НомерДата;
		ИначеЕсли ТипДоговора = ПредопределенноеЗначение("Перечисление.ТипыДоговоров.СПоставщиком") Тогда
			Наименование = "Договор закупки № " + НомерДата;
		КонецЕсли;

	ИначеЕсли Организация = ОрганизацияТрейд() Тогда
		Если ТипДоговора = ПредопределенноеЗначение("Перечисление.ТипыДоговоров.СПокупателем") Тогда
			Наименование = "Контракт № " + НомерДата;
		ИначеЕсли ТипДоговора = ПредопределенноеЗначение("Перечисление.ТипыДоговоров.СПоставщиком") Тогда
			Наименование = "Договор закупки № " + НомерДата;
		КонецЕсли;

	Иначе
		ОрганизацияДоговора = Организация;
		КонтрагентДоговора  = Контрагент;
		ПартнерДоговора     = Партнер;
		ПартнерКонтрагента  = КонтрагентДоговора.Партнер;
		ГоловноеПредприятие = ПартнерДоговора.Родитель;

		Если ПартнерКонтрагента = ПартнерДоговора Тогда
			Наименование = СокрЛП(КонтрагентДоговора.Наименование) + " с " + СокрЛП(ОрганизацияДоговора.Наименование);

		ИначеЕсли ПартнерКонтрагента = ГоловноеПредприятие Тогда
			Наименование = СокрЛП(КонтрагентДоговора.Наименование) + " с " + СокрЛП(ОрганизацияДоговора.Наименование)
				+ ?(ЗначениеЗаполнено(КонтрагентДоговора), " для " + СокрЛП(ПартнерДоговора.Наименование), "");

		КонецЕсли;
	КонецЕсли;

	Если СтрНайти(СтароеНаименование, Наименование) = 0 Тогда
		Стр.Наименование = Наименование;
	Иначе
		Стр.Наименование = СтароеНаименование;
	КонецЕсли;
	//Наименование
	
	//НаименованиеДляПечати
	Если Организация = ОрганизацияТрейд() Тогда
		Стр.НаименованиеДляПечати = "Контракт № " + НомерДата;
	Иначе
		Стр.НаименованиеДляПечати = "Договор № " + НомерДата;
	КонецЕсли;
	//НаименованиеДляПечати

	Возврат Стр;
КонецФункции
Функция ПолучитьНаименованиеПравила(Знач Правило) Экспорт
	Договор = Правило.Договор;

	Если ЗначениеЗаполнено(Договор) Тогда
		ОрганизацияДоговора = Договор.Организация;
		КонтрагентДоговора  = Договор.Контрагент;
		ПартнерДоговора     = Договор.Партнер;
		ПартнерКонтрагента  = КонтрагентДоговора.Партнер;
		ГоловноеПредприятие = ПартнерДоговора.Родитель;

		Если ПартнерКонтрагента = ПартнерДоговора Тогда
			Возврат СокрЛП(КонтрагентДоговора.Наименование) + " с " + СокрЛП(ОрганизацияДоговора.Наименование);

		ИначеЕсли ПартнерКонтрагента = ГоловноеПредприятие Тогда
			Возврат СокрЛП(КонтрагентДоговора.Наименование) + " с " + СокрЛП(ОрганизацияДоговора.Наименование) + ?(
				ЗначениеЗаполнено(КонтрагентДоговора), " для " + СокрЛП(ПартнерДоговора.Наименование), "");

		КонецЕсли;

	Иначе
		Возврат Правило.Контрагент.Наименование + " с " + Правило.Организация.Наименование;
	КонецЕсли;
КонецФункции
Функция ПолучитьНеобходимостьСтикерованияТовара(Партнер) Экспорт
	Возврат Партнер._Стикерование;
КонецФункции
Функция ПолучитьНоменклатуруПоКоду(Код) Экспорт
	Код = СокрЛП(Код);
	Если СтрДлина(Код) > 0 Тогда
		Возврат Справочники.Номенклатура.НайтиПоКоду(Код);
	Иначе
		Возврат Справочники.Номенклатура.ПустаяСсылка();
	КонецЕсли;
КонецФункции
Функция ПолучитьТранспортноеСредство(Распоряжение) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Распоряжение", Распоряжение);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.ТранспортноеСредство КАК ТранспортноеСредство
	|ИЗ
	|	Документ.AMS_ЛогистическийЛист.Распоряжения КАК т
	|ГДЕ
	|	т.Распоряжение = &Распоряжение";

	Рез = Запрос.Выполнить();

	Если Рез.Пустой() Тогда
		Возврат Справочники.ТранспортныеСредства.ПустаяСсылка();
	Иначе
		Выб = Рез.Выбрать();
		Выб.Следующий();
		Возврат Выб.ТранспортноеСредство;
	КонецЕсли;
КонецФункции
Функция ПолучитьТранспортныеУслуги(Партнер, Сумма, ЦенаВключаетНДС) Экспорт
	Стр = Новый Структура();
	
	ДанныеТранспортныхУслуг = ОбщегоНазначенияУТВызовСервера.ЗначенияРеквизитовОбъекта(Партнер,
		 "_ТранпортнаяУслугаСпособ, _ТранпортнаяУслуга, _ТранпортнаяУслугаПроцент, _ТранпортнаяУслугаСумма");
	
	Если ДанныеТранспортныхУслуг._ТранпортнаяУслугаСпособ = 0 Тогда 
		Цена = Сумма * ДанныеТранспортныхУслуг._ТранпортнаяУслугаПроцент / 100;
	Иначе
		Цена = ДанныеТранспортныхУслуг._ТранпортнаяУслугаСумма;
	КонецЕсли;
	
	Номенклатура = ДанныеТранспортныхУслуг._ТранпортнаяУслуга;
	СтавкаНДС    = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Номенклатура, "СтавкаНДС");
	Ставка       = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(СтавкаНДС, "Ставка");
	
	Если ЦенаВключаетНДС Тогда
		Цена  = Цена * (100 + Ставка) / 100;
	КонецЕсли;
	
	Стр.Вставить("Номенклатура", Номенклатура);
	Стр.Вставить("КоличествоУпаковок",         1);
	Стр.Вставить("Количество",                 1);
	Стр.Вставить("Цена",                       Цена);
	Стр.Вставить("СтавкаНДС",                  СтавкаНДС);
	Стр.Вставить("Сумма",                      Цена);
	Стр.Вставить("СуммаНДС",                   Цена * Ставка / 100);
	Стр.Вставить("СуммаСНДС",                  Стр.Сумма + Стр.СуммаНДС);
	Стр.Вставить("ТипНоменклатуры",            ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга"));
	Стр.Вставить("БезВозвратнойТары",          Истина);
	Стр.Вставить("СуммаБезВозвратнойТары",     Стр.Сумма);
	Стр.Вставить("СуммаНДСБезВозвратнойТары",  Стр.СуммаНДС);
	Стр.Вставить("СуммаСНДСБезВозвратнойТары", Стр.СуммаСНДС);
	
	Возврат Стр;	
КонецФункции
Функция ПолучитьТелефонПартнера(Партнер) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Партнер", Партнер);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Представление КАК Представление
	|ИЗ
	|	Справочник.Партнеры.КонтактнаяИнформация КАК т
	|ГДЕ
	|	т.Ссылка = &Партнер
	|	И т.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонПартнера)";

	Рез = Запрос.Выполнить();

	Если рез.Пустой() Тогда
		Возврат "";
	Иначе
		Выб = Рез.Выбрать();
		Выб.Следующий();
		Возврат Выб.Представление;
	КонецЕсли;
КонецФункции
Функция ПолучитьТелефонКонтрагента(Контрагент) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Контрагент", Контрагент);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Представление КАК Представление
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК т
	|ГДЕ
	|	т.Ссылка = &Контрагент
	|	И т.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента)";

	Рез = Запрос.Выполнить();

	Если рез.Пустой() Тогда
		Возврат "";
	Иначе
		Выб = Рез.Выбрать();
		Выб.Следующий();
		Возврат Выб.Представление;
	КонецЕсли;
КонецФункции
Функция ПолучитьТелефонОрганизации(Организация) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Представление КАК Представление
	|ИЗ
	|	Справочник.Организации.КонтактнаяИнформация КАК т
	|ГДЕ
	|	т.Ссылка = &Организация
	|	И т.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонОрганизации)";

	Рез = Запрос.Выполнить();

	Если рез.Пустой() Тогда
		Возврат "";
	Иначе
		Выб = Рез.Выбрать();
		Выб.Следующий();
		Возврат Выб.Представление;
	КонецЕсли;
КонецФункции
Функция ПолучитьТелефонМобильныйФизическиеЛица(ФизическоеЛицо) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Представление КАК Представление
	|ИЗ
	|	Справочник.ФизическиеЛица.КонтактнаяИнформация КАК т
	|ГДЕ
	|	т.Ссылка = &ФизическоеЛицо
	|	И т.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонМобильныйФизическиеЛица)";

	Рез = Запрос.Выполнить();

	Если рез.Пустой() Тогда
		Возврат "";
	Иначе
		Выб = Рез.Выбрать();
		Выб.Следующий();
		Возврат Выб.Представление;
	КонецЕсли;
КонецФункции
Функция ПолучитьОсновнуюОрганизацию() Экспорт
	Возврат ОрганизацияКемикал();
КонецФункции
Функция ПолучитьГрузоотправителяКемикал() Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИНН", "7733272907");
	Запрос.УстановитьПараметр("КПП", "505045001");
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Контрагенты.Ссылка КАК Грузоотправитель
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ИНН = &ИНН
	|	И Контрагенты.КПП = &КПП";

	Рез = Запрос.Выполнить();

	Если Рез.Пустой() Тогда
		Возврат Неопределено;

	Иначе
		Выб = Рез.Выбрать();
		Выб.Следующий();
		Возврат Выб.Грузоотправитель;
	КонецЕсли;
КонецФункции
Функция ПолучитьОтсрочкуПлатежаКлиента(Соглашение) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МАКСИМУМ(ГрафикиОплатыЭтапы.Сдвиг) КАК Сдвиг
	|ИЗ
	|	Справочник.СоглашенияСКлиентами КАК СоглашенияСКлиентами
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГрафикиОплаты.Этапы КАК ГрафикиОплатыЭтапы
	|		ПО СоглашенияСКлиентами.ГрафикОплаты = ГрафикиОплатыЭтапы.Ссылка
	|ГДЕ
	|	СоглашенияСКлиентами.Ссылка = &Соглашение";

	Запрос.УстановитьПараметр("Соглашение", Соглашение);

	Рез = Запрос.Выполнить();

	Если Рез.Пустой() Тогда
		Возврат 0;

	Иначе
		Выб = Рез.Выбрать();
		Выб.Следующий();
		Возврат Выб.Сдвиг;
	КонецЕсли;
КонецФункции
Функция ПолучитьИзСоглашенияВидЦеныМега(Соглашение) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	т.ВидЦен КАК ВидЦен
		|ИЗ
		|	Справочник.СоглашенияСКлиентами.ЦеновыеГруппы КАК т
		|ГДЕ
		|	т.Ссылка = &Соглашение";
	
	Запрос.УстановитьПараметр("Соглашение", Соглашение);
	
	Рез = Запрос.Выполнить();
	
	Если Рез.Пустой() Тогда
		Возврат Неопределено;
	
	Иначе
		Выб = Рез.Выбрать();
		Выб.Следующий();
		
		Возврат Выб.ВидЦен;
	КонецЕсли;
КонецФункции	

Функция ПолучитьСвойСклад() Экспорт
	Если Пользователи.РолиДоступны("_НачальникСклада,_КладовщикСклада") И Не ЭтоKhors() Тогда
		Возврат СкладПродукции();

	ИначеЕсли Пользователи.РолиДоступны("_Цех1") Тогда
		Возврат Цех1();

	ИначеЕсли Пользователи.РолиДоступны("_Цех2") Тогда
		Возврат Цех2();

	ИначеЕсли Пользователи.РолиДоступны("_Цех3") Тогда
		Возврат Цех3();

	ИначеЕсли Пользователи.РолиДоступны("_Цех4") Тогда
		Возврат Цех4();

	Иначе
		Возврат Справочники.Склады.ПустаяСсылка();
	КонецЕсли;
КонецФункции
Функция ПолучитьСтатьюДоходовДляКорректировки() Экспорт
	Возврат ПланыВидовХарактеристик.СтатьиДоходов.НайтиПоКоду("УТ-000006");
КонецФункции
Функция ПолучитьСтатьюРасходовДляКорректировки() Экспорт
	Возврат ПланыВидовХарактеристик.СтатьиРасходов.НайтиПоКоду("01-000027");
КонецФункции
Функция ПолучитьЦехНоменклатуры(Номенклатура) Экспорт
	Возврат мср.СоответствиеВидНоменклатурыЦех().Получить(Номенклатура.ВидНоменклатуры);
КонецФункции

Функция УдалитьПовторяющиесяЭлементыМассива(Массив) Экспорт
	ТекущийИндекс = 0;
	ВсегоЭлементов = Массив.Количество();
	Пока ТекущийИндекс < ВсегоЭлементов Цикл
		Индекс2 = ТекущийИндекс + 1;
		Пока Индекс2 < ВсегоЭлементов Цикл
			Если Массив[Индекс2] = Массив[ТекущийИндекс] Тогда
				Массив.Удалить(Индекс2);
				ВсегоЭлементов = ВсегоЭлементов - 1;
			Иначе
				Индекс2 = Индекс2 + 1;
			КонецЕсли;
		КонецЦикла;
		ТекущийИндекс = ТекущийИндекс + 1;
	КонецЦикла;
	Возврат Массив;
КонецФункции

Функция ЭтоКонтрагентПартнера(Партнер, Контрагент) Экспорт
	ПартнерКонтрагента  = Контрагент.Партнер;
	ГоловноеПредприятие = Партнер.Родитель;

	Если Партнер = ПартнерКонтрагента Тогда
		Возврат Истина;
	ИначеЕсли ПартнерКонтрагента = ГоловноеПредприятие Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

#Область РеализацияТоваровУслуг

Процедура ПроверитьВозможностьСозданияРеализацииНаОснованииЗаказаКлиента(ЗаказКлиента, Отказ) Экспорт
	Если Пользователи.РолиДоступны("_ГлавныйБухгалтер, _Бухгалтер") Тогда
		Возврат;
	КонецЕсли;
	
	МассивСтрок = ПолучитьТоварыНеУказанныеКОтгрузке(ЗаказКлиента);
	Для Каждого Стр Из МассивСтрок Цикл
		Текст = "В строке %1 списка ""Товары"" для номенклатуры ""%2"" не указано действие ""Отгрузить""";
		Текст = СтрШаблон(Текст, Стр.НомерСтроки, Стр.Номенклатура);
		ОбщегоНазначения.СообщитьПользователю(Текст,,,, Отказ);
		Возврат;
	КонецЦикла;
		
	//@skip-check bsl-legacy-check-string-literal
	ДатаОтгрузки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаказКлиента, "ДатаОтгрузки");
	Если ДатаОтгрузки = Дата(1,1,1) Тогда
		Текст = "Не заполнено поле ""Дата отгрузки""";
		ОбщегоНазначения.СообщитьПользователю(Текст,, "Объект.ДатаОтгрузки",, Отказ);
	КонецЕсли;
	
	Если ЭтоПродажаНаЭкспорт(ЗаказКлиента) Тогда
		Возврат;
	КонецЕсли;
	
	ДатаСегодня    = НачалоДня(ПолучитьРабочийДень(0,,,Истина));
	ДатаРеализации = КонецДня(ПолучитьРабочийДень(1,,,Истина));
	
	Если ДатаОтгрузки < ДатаСегодня Тогда //вчера
		Текст = "Дата отгрузки не может быть меньше %1";
		Текст = СтрШаблон(Текст, Формат(ДатаРеализации, "ДЛФ=ДД"));
		ОбщегоНазначения.СообщитьПользователю(Текст,, "Объект.ДатаОтгрузки",, Отказ);
		
	ИначеЕсли ДатаОтгрузки > ДатаРеализации Тогда //послезавтра
		Текст = "Дата отгрузки не может превышать  %1";
		Текст = СтрШаблон(Текст, Формат(ДатаРеализации, "ДЛФ=ДД"));
		ОбщегоНазначения.СообщитьПользователю(Текст,, "Объект.ДатаОтгрузки",, Отказ);
	КонецЕсли;
КонецПроцедуры

Процедура ИзменитьПартнерДопИнфо(Партнер, Значение) Экспорт
	Объект = Партнер.ПолучитьОбъект();
	Объект.ДополнительнаяИнформация = Значение;
	Объект.Записать();
КонецПроцедуры
Функция ПоместитьВоВременноеХранилищеТовары(Знач Объект) Экспорт
	Отбор = Новый Структура("Номенклатура", ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"));
	МассивПустыхСтрок = Объект.Товары.НайтиСтроки(Отбор);
	Для Каждого Стр Из МассивПустыхСтрок Цикл
		Объект.Товары.Удалить(Стр);
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Товары", Объект.Товары.Выгрузить( , "Номенклатура, Упаковка, Количество, ВидЦены, Сумма, ПроцентРучнойСкидки"));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.Упаковка КАК Упаковка,
	|	т.Количество КАК Количество,
	|	т.ВидЦены КАК ВидЦены,
	|	т.Сумма КАК Сумма,
	|	т.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	&Товары КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.Номенклатура КАК Номенклатура,
	|	вт.Упаковка КАК Упаковка,
	|	вт.Количество КАК Количество,
	|	вт.ВидЦены КАК ВидЦены,
	|	вт.Сумма КАК Сумма,
	|	вт.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки
	|ИЗ
	|	вт КАК вт
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК ном
	|		ПО вт.Номенклатура = ном.Ссылка
	|			И (ном.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар))";
	
	// Доставка
	//@skip-check bsl-legacy-check-string-literal
	Массив   = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Партнер, "_ТранпортнаяУслуга")));
	Доставка = Массив.Количество() > 0;
	
	// ЦеныПоСоглашению
	Товары = Запрос.Выполнить().Выгрузить();
	Табл = Товары.Скопировать(, "ВидЦены");
	Табл.Свернуть("ВидЦены");
	
	ЦеныПоСоглашению = Ложь;
	
	Для Каждого Стр Из Табл Цикл
		Если ЗначениеЗаполнено(Стр.ВидЦены) Тогда
			ЦеныПоСоглашению = Истина;
		КонецЕсли;	
	КонецЦикла;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "ДатаОтгрузки") Тогда //это заказ клиента
		ДатаДокумента = Объект.ДатаОтгрузки;
	Иначе
		ДатаДокумента = Объект.Дата;
	КонецЕсли;

	Данные = Новый Структура;
	Данные.Вставить("ДатаДокумента", ДатаДокумента);
	Данные.Вставить("Товары", Товары);
	Данные.Вставить("Ссылка", Объект.Ссылка);
	Данные.Вставить("Проведен", Объект.Проведен);
	Данные.Вставить("Соглашение", Объект.Соглашение);
	Данные.Вставить("Партнер", Объект.Партнер);
	Данные.Вставить("Склад", Объект.Склад);
	Данные.Вставить("Доставка", Доставка);
	Данные.Вставить("ЦеныПоСоглашению", ЦеныПоСоглашению);
	
	
	Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ПередачаТоваровХранителю") Тогда
		Данные.Вставить("ПравилоПродажи", Справочники.AMS_ПравилаПродаж.ПустаяСсылка());
	Иначе
		Данные.Вставить("ПравилоПродажи", Объект.AMS_ПравилоПродажи);
	КонецЕсли;	

	Возврат ПоместитьВоВременноеХранилище(Данные);
КонецФункции

Функция ПолучитьПравилоПродажи(Дата, Партнер, Контрагент = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);

	Если Контрагент = Неопределено Тогда
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	т.Ссылка КАК ПравилоПродажи
		|ИЗ
		|	Справочник.AMS_ПравилаПродаж КАК т
		|ГДЕ
		|	НЕ т.ПометкаУдаления
		|	И т.Владелец = &Партнер
		|	И т.СтатусПравилаПродажи = ЗНАЧЕНИЕ(Перечисление.AMS_СтатусыПравилПродаж.Действует)
		|	И т.Основное";
	Иначе
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	т.Ссылка КАК ПравилоПродажи
		|ИЗ
		|	Справочник.AMS_ПравилаПродаж КАК т
		|ГДЕ
		|	НЕ т.ПометкаУдаления
		|	И т.Владелец = &Партнер
		|	И т.СтатусПравилаПродажи = ЗНАЧЕНИЕ(Перечисление.AMS_СтатусыПравилПродаж.Действует)
		|	И т.Контрагент = &Контрагент";
	КонецЕсли;

	Рез = Запрос.Выполнить();

	Если Рез.Пустой() Тогда
		Возврат Справочники.AMS_ПравилаПродаж.ПустаяСсылка();
	Иначе
		Выб = Рез.Выбрать(); 
		Выб.Следующий(); 
		Возврат Выб.ПравилоПродажи;
	КонецЕсли;
КонецФункции
Функция ПолучитьДанныеПравилПродажи(Правило) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Правило", Правило);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.АдресДоставки КАК АдресДоставки,
	|	т.АдресДоставкиЗначенияПолей КАК АдресДоставкиЗначенияПолей,
	|	т.АдресДоставкиЗначение КАК АдресДоставкиЗначение,
	|	т.АдресДоставкиПеревозчика КАК АдресДоставкиПеревозчика,
	|	т.АдресДоставкиПеревозчикаЗначение КАК АдресДоставкиПеревозчикаЗначение,
	|	т.АдресДоставкиПеревозчикаЗначенияПолей КАК АдресДоставкиПеревозчикаЗначенияПолей,
	|	т.Договор.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента,
	|	т.Договор.БанковскийСчет КАК БанковскийСчет,
	|	т.Договор.БанковскийСчет КАК БанковскийСчетОрганизации,
	|	т.ВремяДоставкиПо КАК ВремяДоставкиПо,
	|	т.ВремяДоставкиС КАК ВремяДоставкиС,
	|	т.Грузоотправитель КАК Грузоотправитель,
	|	т.Грузополучатель КАК Грузополучатель,
	|	т.ДатаОтгрузки КАК ДатаОтгрузки,
	|	т.Договор КАК Договор,
	|	т.ДополнительнаяИнформацияПоДоставке КАК ДополнительнаяИнформацияПоДоставке,
	|	т.ЗонаДоставки КАК ЗонаДоставки,
	|	т.Контрагент КАК Контрагент,
	|	т.Обрешетка КАК AMS_Обрешетка,
	|	т.Организация КАК Организация,
	|	т.Основание КАК Основание,
	|	т.ОснованиеДата КАК ОснованиеДата,
	|	т.ОснованиеНомер КАК ОснованиеНомер,
	|	т.Основание КАК AMS_Основание,
	|	т.ОснованиеДата КАК AMS_ОснованиеДата,
	|	т.ОснованиеНомер КАК AMS_ОснованиеНомер,
	|	т.Соглашение КАК Соглашение,
	|	т.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
	|	т.ОсобыеУсловияПеревозкиОписание КАК ОсобыеУсловияПеревозкиОписание,
	|	т.Партнер КАК Партнер,
	|	т.ПеревозчикПартнер КАК ПеревозчикПартнер,
	|	т.СпособДоставки КАК СпособДоставки,
	|	т.СпособПередачиТоваров КАК AMS_СпособПередачиТоваров,
	|	т.УсловияОтгрузки КАК AMS_УсловияОтгрузки,
	|	т.Партнер.ОсновнойМенеджер КАК Менеджер
	|ИЗ
	|	Справочник.AMS_ПравилаПродаж КАК т
	|ГДЕ
	|	т.Ссылка = &Правило";
	
	Табл = Запрос.Выполнить().Выгрузить();
	
	Стр = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Табл[0]);
	
	Возврат Стр;
КонецФункции
Функция ПроверитьПравилоПродажи(Дата, Правило) Экспорт
	Партнер = Правило.Владелец;
	Соглаше = Правило.Соглашение;

	Соглашения = ПолучитьДействующиеСоглашенияПартнера(Дата, Партнер);

	Если Соглашения.Найти(Соглаше, "Ссылка") = Неопределено Тогда
		ТекстОшибки = НСтр("ru='Правило продаж имеет не разрешённое к применению Соглашение.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , "Объект.AMS_ПравилоПродажи");
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
КонецФункции
Функция ПолучитьДействующиеСоглашенияПартнера(Дата, Партнер) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Запрос.УстановитьПараметр("ДатаДокумента", Дата);
	Запрос.УстановитьПараметр("Действует", "Действует");
	Запрос.УстановитьПараметр("Индивидуальное", "Индивидуальное");
	Запрос.УстановитьПараметр("Типовое", "Типовое");
	Запрос.УстановитьПараметр("ТолькоИндивидуальные", Ложь);
	Запрос.УстановитьПараметр("ТолькоИспользуемыеВРаботеТП", Ложь);
	Запрос.УстановитьПараметр("ТолькоТиповые", Ложь);

	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	т.Ссылка КАК Ссылка,
	|	т.ПометкаУдаления КАК ПометкаУдаления,
	|	т.Номер КАК Номер,
	|	т.Дата КАК Дата,
	|	т.Валюта КАК Валюта,
	|	т.ГрафикОплаты КАК ГрафикОплаты,
	|	т.СуммаДокумента КАК СуммаДокумента,
	|	т.Типовое КАК Типовое,
	|	т.ВидЦен КАК ВидЦен,
	|	т.Статус КАК Статус,
	|	т.Регулярное КАК Регулярное,
	|	т.СегментНоменклатуры КАК СегментНоменклатуры,
	|	т.ДатаНачалаДействия КАК ДатаНачалаДействия,
	|	т.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	|	т.Менеджер КАК Менеджер,
	|	т.Наименование КАК Наименование,
	|	т.Комментарий КАК Комментарий,
	|	т.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	т.Организация КАК Организация,
	|	т.Контрагент КАК Контрагент,
	|	ВЫРАЗИТЬ(&Партнер КАК Справочник.Партнеры) КАК ПартнерОтбор,
	|	ВЫБОР
	|		КОГДА т.Типовое
	|			ТОГДА &Типовое
	|		ИНАЧЕ &Индивидуальное
	|	КОНЕЦ КАК ТипСоглашения,
	|	ВЫБОР
	|		КОГДА т.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСоглашенийСКлиентами.Действует)
	|			ТОГДА &Действует
	|	КОНЕЦ КАК Состояние,
	|	ВЫБОР
	|		КОГДА т.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСоглашенийСКлиентами.НеСогласовано)
	|				И (т.ДатаНачалаДействия <> ДАТАВРЕМЯ(1, 1, 1)
	|						И т.ДатаНачалаДействия < &ДатаДокумента
	|					ИЛИ т.ДатаОкончанияДействия <> ДАТАВРЕМЯ(1, 1, 1)
	|						И т.ДатаОкончанияДействия < &ДатаДокумента)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СогласованиеПросрочено,
	|	ВЫБОР
	|		КОГДА т.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСоглашенийСКлиентами.Действует)
	|				И (т.ДатаОкончанияДействия <> ДАТАВРЕМЯ(1, 1, 1)
	|					И т.ДатаОкончанияДействия < &ДатаДокумента)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СрокДействияИстек,
	|	ВЫБОР
	|		КОГДА т.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСоглашенийСКлиентами.Действует)
	|				И (т.ДатаНачалаДействия <> ДАТАВРЕМЯ(1, 1, 1)
	|					И т.ДатаНачалаДействия > &ДатаДокумента)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СрокДействияНеНаступил,
	|	ВЫБОР
	|		КОГДА т.Типовое
	|				И т.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСоглашенийСКлиентами.Действует)
	|			ТОГДА 0
	|		КОГДА НЕ т.Типовое
	|				И т.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСоглашенийСКлиентами.Действует)
	|			ТОГДА 3
	|	КОНЕЦ КАК КартинкаСостояния,
	|	т.ДоступноВнешнимПользователям КАК ДоступноВнешнимПользователям,
	|	т.СегментПартнеров КАК СегментПартнеров
	|ИЗ
	|	Справочник.СоглашенияСКлиентами КАК т
	|ГДЕ
	|	т.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСоглашенийСКлиентами.Действует)
	|	И НЕ т.ПометкаУдаления
	|	И ВЫБОР
	|			КОГДА &ТолькоТиповые = ИСТИНА
	|					И &ТолькоИндивидуальные = ЛОЖЬ
	|					И (т.Типовое
	|						И (т.СегментПартнеров = ЗНАЧЕНИЕ(Справочник.СегментыПартнеров.ПустаяСсылка)
	|							ИЛИ т.СегментПартнеров В
	|								(ВЫБРАТЬ
	|									ПартнерыСегмента.Сегмент
	|								ИЗ
	|									РегистрСведений.ПартнерыСегмента КАК ПартнерыСегмента
	|								ГДЕ
	|									ПартнерыСегмента.Партнер = &Партнер)))
	|				ТОГДА ИСТИНА
	|			КОГДА &ТолькоИндивидуальные = ИСТИНА
	|					И НЕ &ТолькоТиповые = ИСТИНА
	|					И (НЕ т.Типовое
	|						И (т.СегментПартнеров = ЗНАЧЕНИЕ(Справочник.СегментыПартнеров.ПустаяСсылка)
	|							ИЛИ т.СегментПартнеров В
	|								(ВЫБРАТЬ
	|									ПартнерыСегмента.Сегмент
	|								ИЗ
	|									РегистрСведений.ПартнерыСегмента КАК ПартнерыСегмента
	|								ГДЕ
	|									ПартнерыСегмента.Партнер = &Партнер)))
	|					И (&Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|						ИЛИ т.Партнер = &Партнер)
	|				ТОГДА ИСТИНА
	|			КОГДА &ТолькоТиповые = ЛОЖЬ
	|					И &ТолькоИндивидуальные = ЛОЖЬ
	|					И (т.СегментПартнеров = ЗНАЧЕНИЕ(Справочник.СегментыПартнеров.ПустаяСсылка)
	|						ИЛИ т.СегментПартнеров В
	|							(ВЫБРАТЬ
	|								ПартнерыСегмента.Сегмент
	|							ИЗ
	|								РегистрСведений.ПартнерыСегмента КАК ПартнерыСегмента
	|							ГДЕ
	|								ПартнерыСегмента.Партнер = &Партнер)
	|						ИЛИ &Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка))
	|					И (&Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|						ИЛИ т.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|						ИЛИ т.Партнер = &Партнер)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ТолькоИспользуемыеВРаботеТП = ИСТИНА
	|					И т.ИспользуетсяВРаботеТорговыхПредставителей
	|				ТОГДА ИСТИНА
	|			КОГДА &ТолькоИспользуемыеВРаботеТП = ЛОЖЬ
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ";

	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции
Функция ПолучитьДополнительнаяИнформация(Объект) Экспорт
	Возврат Объект.ДополнительнаяИнформация;
КонецФункции

#КонецОбласти

#Область СрокГодности

Функция ПолучитьСрокГодности(ДатаПроизводства, ГоденДо, ВидНоменклатуры) Экспорт
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ВидНоменклатуры", ВидНоменклатуры);
	Запрос.УстановитьПараметр("ГоденДо", ГоденДо);
	Запрос.УстановитьПараметр("ДатаПроизводства", ДатаПроизводства);
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СерииНоменклатуры.Ссылка КАК Серия
	|ИЗ
	|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|ГДЕ
	|	СерииНоменклатуры.ВидНоменклатуры = &ВидНоменклатуры
	|	И СерииНоменклатуры.ГоденДо = &ГоденДо
	|	И СерииНоменклатуры.ДатаПроизводства = &ДатаПроизводства";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Серия;
	
	Иначе
		СерияОбъект = Справочники.СерииНоменклатуры.СоздатьЭлемент();
		
		СерияОбъект.ВидНоменклатуры = ВидНоменклатуры;
		СерияОбъект.ГоденДо = ГоденДо;
		СерияОбъект.ДатаПроизводства = ДатаПроизводства;
		
		СерияОбъект.Записать();
		
		Возврат СерияОбъект.Ссылка;
	КонецЕсли;
КонецФункции

#КонецОбласти

#Область ПЕЧАТЬ

Процедура ЗаписатьСобытиеДокумента(Реализация, Событие) Экспорт
	Если Не (Пользователи.РолиДоступны("_БухгалтерСклада, _КладовщикСклада, _НачальникСклада") Или ЭтоKhors()) Тогда
		Возврат;
	КонецЕсли;

	Если Событие = Перечисления.AMS_СобытияРеализации.ПечатьУПД Тогда
		Если ТипЗнч(Реализация) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
			Реализация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Реализация, "ДокументОснование");
		КонецЕсли;

		Если Не ЕстьОперацияПечатьПоследняяУПД(Реализация) Тогда
			РегистрыСведений.AMS_ИсторияРеализации.ЗаписатьСобытиеДокумента(Реализация, Событие);
		КонецЕсли;

	ИначеЕсли Событие = Перечисления.AMS_СобытияРеализации.ПечатьТОРГ12 И Не ЕстьОперацияПечатьПоследняяУПД(Реализация) Тогда
		РегистрыСведений.AMS_ИсторияРеализации.ЗаписатьСобытиеДокумента(Реализация, Событие);

	ИначеЕсли Событие = Перечисления.AMS_СобытияРеализации.ОтменаПечати Тогда
		РегистрыСведений.AMS_ИсторияРеализации.ЗаписатьСобытиеДокумента(Реализация, Событие);
		
	ИначеЕсли Событие = Перечисления.AMS_СобытияРеализации.ПечатьСН Тогда
		Если Не ЕстьОперацияПечатьПоследняяСН(Реализация) Тогда
			РегистрыСведений.AMS_ИсторияРеализации.ЗаписатьСобытиеДокумента(Реализация, Событие);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция ЕстьТранспортДоставки(Распоряжение) Экспорт
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Распоряжение", Распоряжение);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Распоряжение КАК Распоряжение
	|ИЗ
	|	Документ.AMS_ЛогистическийЛист.Распоряжения КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.AMS_ЛогистическийЛист КАК д
	|		ПО т.Ссылка = д.Ссылка
	|ГДЕ
	|	д.Проведен
	|	И (т.Распоряжение = &Распоряжение
	|			ИЛИ т.ОбъединеннаяЗагрузка = &Распоряжение)";

	Рез = Запрос.Выполнить();

	Возврат Не Рез.Пустой();
КонецФункции
Функция ПечатьРазрешена(ПараметрКоманды, ИмяМакета) Экспорт
	УстановитьПривилегированныйРежим(Истина);

	Если ИмяМакета = "СчетНаОплату" Или ИмяМакета = "Спецификация" Или ИмяМакета = "СертификатыНоменклатурыРеестр"
		Или ИмяМакета = "СертификатыНоменклатурыИзображенияИзДокументов" Или ИмяМакета = "СертификатыНоменклатурыИзображенияИзДокументовБезДублей"
		Или Пользователи.РолиДоступны("_ГлавныйБухгалтер,_Директор,_Бухгалтер") Или ЭтоKhors() Тогда

		Возврат Истина;
	КонецЕсли;

	Если (Пользователи.РолиДоступны("_НачальникСклада,_КладовщикСклада")) И (ИмяМакета = "СН" Или ИмяМакета
		= "ПалетнаяЭтикетка") Тогда
		Возврат Истина;
	КонецЕсли;

	Распоряжение = ПараметрКоманды[0];

	Если Не ТипЗнч(Распоряжение) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Возврат Истина;
	КонецЕсли;
		
	//@skip-check bsl-legacy-check-string-literal
	Статус = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Распоряжение, "AMS_СтатусРеализации");
	Если Статус = Перечисления.AMS_СтатусыРеализаций.Заказ Или Статус = Перечисления.AMS_СтатусыРеализаций.Стикерование Тогда
		Возврат Ложь;
	КонецЕсли;

	Если Пользователи.РолиДоступны("_СтаршийМенеджер, AMS_МенеджерПродаж") Тогда
		ИмяГруппыДоступа = ПолучитьИмяГруппыДоступаРеализации(Распоряжение);
		Если СтрНайти(ИмяГруппыДоступа, "Сети") > 0 Или СтрНайти(ИмяГруппыДоступа, "Ашан") > 0 Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;

	Возврат Истина;
КонецФункции
Функция ЕстьОперацияПечатьПоследняя(Реализация) Экспорт
	Если Не ЗначениеЗаполнено(Реализация) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Реализация", Реализация);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Реал.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ Док
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК Реал
	|ГДЕ
	|	Реал.Ссылка = &Реализация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ист.Документ КАК Реализация,
	|	МАКСИМУМ(Ист.Период) КАК ДатаСН
	|ПОМЕСТИТЬ СН
	|ИЗ
	|	Док КАК Док
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.AMS_ИсторияРеализации КАК Ист
	|		ПО Док.Ссылка = Ист.Документ
	|ГДЕ
	|	Ист.Событие = ЗНАЧЕНИЕ(Перечисление.AMS_СобытияРеализации.ПечатьСН)
	|СГРУППИРОВАТЬ ПО
	|	Ист.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ист.Документ КАК Реализация,
	|	МАКСИМУМ(Ист.Период) КАК ДатаУПД
	|ПОМЕСТИТЬ УПД
	|ИЗ
	|	Док КАК Док
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.AMS_ИсторияРеализации КАК Ист
	|		ПО Док.Ссылка = Ист.Документ
	|ГДЕ
	|	Ист.Событие = ЗНАЧЕНИЕ(Перечисление.AMS_СобытияРеализации.ПечатьУПД)
	|	ИЛИ Ист.Событие = ЗНАЧЕНИЕ(Перечисление.AMS_СобытияРеализации.ПечатьТОРГ12)
	|СГРУППИРОВАТЬ ПО
	|	Ист.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ист.Документ КАК Реализация,
	|	МАКСИМУМ(Ист.Период) КАК ДатаОтмены
	|ПОМЕСТИТЬ Отмена
	|ИЗ
	|	Док КАК Док
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.AMS_ИсторияРеализации КАК Ист
	|		ПО Док.Ссылка = Ист.Документ
	|ГДЕ
	|	Ист.Событие = ЗНАЧЕНИЕ(Перечисление.AMS_СобытияРеализации.ОтменаПечати)
	|СГРУППИРОВАТЬ ПО
	|	Ист.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Док.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА Отмена.ДатаОтмены ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|				КОГДА СН.ДатаСН ЕСТЬ NULL
	|					ТОГДА ЛОЖЬ
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|			КОГДА СН.ДатаСН > Отмена.ДатаОтмены
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	КОНЕЦ КАК ЕстьСН,
	|	ВЫБОР
	|		КОГДА Отмена.ДатаОтмены ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|				КОГДА УПД.ДатаУПД ЕСТЬ NULL
	|					ТОГДА ЛОЖЬ
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|			КОГДА УПД.ДатаУПД > Отмена.ДатаОтмены
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	КОНЕЦ КАК ЕстьУПД
	|ПОМЕСТИТЬ Печать
	|ИЗ
	|	Док КАК Док
	|		ЛЕВОЕ СОЕДИНЕНИЕ СН КАК СН
	|		ПО Док.Ссылка = СН.Реализация
	|		ЛЕВОЕ СОЕДИНЕНИЕ УПД КАК УПД
	|		ПО Док.Ссылка = УПД.Реализация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Отмена КАК Отмена
	|		ПО Док.Ссылка = Отмена.Реализация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Печать.Ссылка КАК Ссылка
	|ИЗ
	|	Печать КАК Печать
	|ГДЕ
	|	Печать.ЕстьСН
	|	ИЛИ Печать.ЕстьУПД";

	Возврат Не Запрос.Выполнить().Пустой();
КонецФункции

#КонецОбласти

#Область ИнициализацияПеременных

Функция ВидНоменклатурыМатериал() Экспорт
	Возврат Справочники.ВидыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("db15f390-2675-4757-ae00-9b76aadaadff"));
КонецФункции
Функция ВидНоменклатурыОсновные() Экспорт
	Возврат Справочники.ВидыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("fc22eea4-788f-4822-8137-20fca3c02e44"));
КонецФункции
Функция ВидНоменклатурыРасходные() Экспорт
	Возврат Справочники.ВидыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("b76d3492-6353-4d82-b47f-0a94b7aed3bc"));
КонецФункции
Функция ВидНоменклатурыУслуга() Экспорт
	Возврат Справочники.ВидыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("7d5c5e9c-6f27-4c6e-94c2-6c01a3e6b28e"));
КонецФункции

Функция ВидНоменклатурыФабрикатЦеха1() Экспорт
	Возврат Справочники.ВидыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("f5cfdf6f-e797-47bb-8be0-6dcd68d07b65"));
КонецФункции
Функция ВидНоменклатурыФабрикатЦеха2() Экспорт
	Возврат Справочники.ВидыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("5a66c88f-ee2c-4d16-ad14-766f8c2a49a9"));
КонецФункции
Функция ВидНоменклатурыФабрикатЦеха3() Экспорт
	Возврат Справочники.ВидыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("0b19e0af-9eaa-46c5-ad41-ae23c4dfa61d"));
КонецФункции
Функция ВидыНоменклатурыФабрикаты() Экспорт
	ВидыНоменклатуры = Новый Массив();;
	ВидыНоменклатуры.Добавить(ВидНоменклатурыФабрикатЦеха1());
	ВидыНоменклатуры.Добавить(ВидНоменклатурыФабрикатЦеха2());
	ВидыНоменклатуры.Добавить(ВидНоменклатурыФабрикатЦеха3());
	
	Возврат ВидыНоменклатуры;
КонецФункции
Функция ЭтоФабрикат(Номенклатура) Экспорт
	ВидНоменклатуры = Номенклатура.ВидНоменклатуры;

	Возврат ВидНоменклатуры = ВидНоменклатурыФабрикатЦеха1()
		Или ВидНоменклатуры = ВидНоменклатурыФабрикатЦеха2()
		Или ВидНоменклатуры = ВидНоменклатурыФабрикатЦеха3();
КонецФункции

Функция ВидНоменклатурыПродукцияЦеха1() Экспорт
//	ТекстИдентификатора = Строка(Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Товар",Истина).УникальныйИдентификатор()); 
	Возврат Справочники.ВидыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("30e1cb90-252e-429a-b6dc-029ada9073ea"));
КонецФункции

Функция ВидНоменклатурыПродукцияЦеха1_ЧЗ_Косметика() Экспорт
	Возврат Справочники.ВидыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("5fc1e37a-243a-11f1-8e96-a4bf015601f9"));
КонецФункции

Функция ВидНоменклатурыПродукцияЦеха2() Экспорт
	Возврат Справочники.ВидыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("e9a13cf0-d20b-449b-8bac-f6e136cac706"));
КонецФункции

Функция ВидНоменклатурыПродукцияЦеха2_ЧЗ_Косметика() Экспорт
	Возврат Справочники.ВидыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("4e348697-243a-11f1-8e96-a4bf015601f9"));
КонецФункции

Функция ВидНоменклатурыПродукцияЦеха3() Экспорт
	Возврат Справочники.ВидыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("3b260aa8-c329-4ddc-bf9f-d638f7dbd2cc"));
КонецФункции

Функция ВидНоменклатурыПродукцияЦеха3_ЧЗ_Косметика() Экспорт
	Возврат Справочники.ВидыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("9683267c-2377-11f1-8e96-a4bf015601f9"));
КонецФункции

Функция ВидНоменклатурыПродукцияЦеха3_ЧЗ_Масло() Экспорт
	Возврат Справочники.ВидыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("30e9bcdf-2377-11f1-8e96-a4bf015601f9"));
КонецФункции

Функция ВидНоменклатурыПродукцияНаборы() Экспорт
	Возврат Справочники.ВидыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("72648d9d-1616-11f0-8e3c-a4bf015601f8"));
КонецФункции

Функция ВидНоменклатурыТовар() Экспорт
	Возврат Справочники.ВидыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("03c25f12-6955-11f0-8e3f-a4bf015601f8"));
КонецФункции

Функция ВидыНоменклатурыПродукции() Экспорт
	ВидыНоменклатуры = Новый Массив();;
	ВидыНоменклатуры.Добавить(ВидНоменклатурыПродукцияЦеха1());
	ВидыНоменклатуры.Добавить(ВидНоменклатурыПродукцияЦеха1_ЧЗ_Косметика());
	ВидыНоменклатуры.Добавить(ВидНоменклатурыПродукцияЦеха2());
	ВидыНоменклатуры.Добавить(ВидНоменклатурыПродукцияЦеха2_ЧЗ_Косметика());
	ВидыНоменклатуры.Добавить(ВидНоменклатурыПродукцияЦеха3());
	ВидыНоменклатуры.Добавить(ВидНоменклатурыПродукцияЦеха3_ЧЗ_Косметика());
	ВидыНоменклатуры.Добавить(ВидНоменклатурыПродукцияЦеха3_ЧЗ_Масло());
	ВидыНоменклатуры.Добавить(ВидНоменклатурыПродукцияНаборы());
	ВидыНоменклатуры.Добавить(ВидНоменклатурыТовар());
	
	Возврат ВидыНоменклатуры;
КонецФункции

Функция ВидыНоменклатурыЦеха1() Экспорт
	ВидыНоменклатуры = Новый Массив();;
	ВидыНоменклатуры.Добавить(ВидНоменклатурыПродукцияЦеха1());
	ВидыНоменклатуры.Добавить(ВидНоменклатурыПродукцияЦеха1_ЧЗ_Косметика());
	Возврат ВидыНоменклатуры;
КонецФункции

Функция ВидыНоменклатурыЦеха2() Экспорт
	ВидыНоменклатуры = Новый Массив();;
	ВидыНоменклатуры.Добавить(ВидНоменклатурыПродукцияЦеха2());
	ВидыНоменклатуры.Добавить(ВидНоменклатурыПродукцияЦеха2_ЧЗ_Косметика());
	Возврат ВидыНоменклатуры;
КонецФункции

Функция ВидыНоменклатурыЦеха3() Экспорт
	ВидыНоменклатуры = Новый Массив();;
	ВидыНоменклатуры.Добавить(ВидНоменклатурыПродукцияЦеха3());
	ВидыНоменклатуры.Добавить(ВидНоменклатурыПродукцияЦеха3_ЧЗ_Косметика());
	ВидыНоменклатуры.Добавить(ВидНоменклатурыПродукцияЦеха3_ЧЗ_Масло());
	Возврат ВидыНоменклатуры;
КонецФункции

Функция ВидыНоменклатуры_ЧЗ_Масло() Экспорт
	ВидыНоменклатуры = Новый Массив();;
	ВидыНоменклатуры.Добавить(ВидНоменклатурыПродукцияЦеха3_ЧЗ_Масло());
	Возврат ВидыНоменклатуры;
КонецФункции

Функция ВидыНоменклатуры_ЧЗ_Косметика() Экспорт
	ВидыНоменклатуры = Новый Массив();;
	ВидыНоменклатуры.Добавить(ВидНоменклатурыПродукцияЦеха1_ЧЗ_Косметика());
	ВидыНоменклатуры.Добавить(ВидНоменклатурыПродукцияЦеха2_ЧЗ_Косметика());
	ВидыНоменклатуры.Добавить(ВидНоменклатурыПродукцияЦеха3_ЧЗ_Косметика());
	Возврат ВидыНоменклатуры;
КонецФункции

Функция ЭтоПродукцияAMS(Номенклатура) Экспорт
	ВидНоменклатуры = Номенклатура.ВидНоменклатуры;
	Возврат ВидНоменклатуры = ВидНоменклатурыПродукцияЦеха1()
		Или ВидНоменклатуры = ВидНоменклатурыПродукцияЦеха1_ЧЗ_Косметика()
		Или ВидНоменклатуры = ВидНоменклатурыПродукцияЦеха2()
		Или ВидНоменклатуры = ВидНоменклатурыПродукцияЦеха2_ЧЗ_Косметика()
		Или ВидНоменклатуры = ВидНоменклатурыПродукцияЦеха3()
		Или ВидНоменклатуры = ВидНоменклатурыПродукцияЦеха3_ЧЗ_Косметика()
		Или ВидНоменклатуры = ВидНоменклатурыПродукцияЦеха3_ЧЗ_Масло()
		Или ВидНоменклатуры = ВидНоменклатурыПродукцияНаборы();
КонецФункции


//Вид цены Маркетплейс

Функция ВидЦеныМаркетплейс() Экспорт
	//ТекстИдентификатора = Строка(Справочники.ВидыЦен.НайтиПоНаименованию("Маркетплейс",Истина).УникальныйИдентификатор()); 
	Возврат Справочники.ВидыЦен.ПолучитьСсылку(Новый УникальныйИдентификатор("c6010d86-1eb2-11f0-8e3d-a4bf015601f8"));
КонецФункции

//Прайс Базовый

Функция ВидЦены020000() Экспорт
	Возврат Справочники.ВидыЦен.ПолучитьСсылку(Новый УникальныйИдентификатор("879b2af5-b752-11e8-8da9-a4bf015601f8"));
КонецФункции
Функция ВидЦены050000() Экспорт
	Возврат Справочники.ВидыЦен.ПолучитьСсылку(Новый УникальныйИдентификатор("879b2af6-b752-11e8-8da9-a4bf015601f8"));
КонецФункции
Функция ВидЦены100000() Экспорт
	Возврат Справочники.ВидыЦен.ПолучитьСсылку(Новый УникальныйИдентификатор("56d9ed9d-c710-11e8-8dab-a4bf015601f9"));
КонецФункции
Функция ВидЦены250000() Экспорт
	Возврат Справочники.ВидыЦен.ПолучитьСсылку(Новый УникальныйИдентификатор("879b2af7-b752-11e8-8da9-a4bf015601f8"));
КонецФункции
Функция ВидЦены500000() Экспорт
	Возврат Справочники.ВидыЦен.ПолучитьСсылку(Новый УникальныйИдентификатор("879b2af8-b752-11e8-8da9-a4bf015601f8"));
КонецФункции
Функция ВидЦены900000() Экспорт
	Возврат Справочники.ВидыЦен.ПолучитьСсылку(Новый УникальныйИдентификатор("879b2af9-b752-11e8-8da9-a4bf015601f8"));
КонецФункции

//Прайс Оптовый

Функция ВидЦены2() Экспорт
	Возврат Справочники.ВидыЦен.ПолучитьСсылку(Новый УникальныйИдентификатор("879b2adf-b752-11e8-8da9-a4bf015601f8"));
КонецФункции
Функция ВидЦеныМ3() Экспорт
	Возврат Справочники.ВидыЦен.ПолучитьСсылку(Новый УникальныйИдентификатор("879b2af1-b752-11e8-8da9-a4bf015601f8"));
КонецФункции
Функция ВидЦены3() Экспорт
	Возврат Справочники.ВидыЦен.ПолучитьСсылку(Новый УникальныйИдентификатор("879b2ae0-b752-11e8-8da9-a4bf015601f8"));
КонецФункции
Функция ВидЦеныМ4() Экспорт
	Возврат Справочники.ВидыЦен.ПолучитьСсылку(Новый УникальныйИдентификатор("879b2af2-b752-11e8-8da9-a4bf015601f8"));
КонецФункции
Функция ВидЦены4() Экспорт
	Возврат Справочники.ВидыЦен.ПолучитьСсылку(Новый УникальныйИдентификатор("879b2ae1-b752-11e8-8da9-a4bf015601f8"));
КонецФункции

//Прайс Базовый МЕГА

Функция ВидЦеныМЕГА20() Экспорт
	Возврат Справочники.ВидыЦен.ПолучитьСсылку(Новый УникальныйИдентификатор("879b2aeb-b752-11e8-8da9-a4bf015601f8"));
КонецФункции
Функция ВидЦеныМЕГА50() Экспорт
	Возврат Справочники.ВидыЦен.ПолучитьСсылку(Новый УникальныйИдентификатор("879b2aec-b752-11e8-8da9-a4bf015601f8"));
КонецФункции
Функция ВидЦеныМЕГА75() Экспорт
	Возврат Справочники.ВидыЦен.ПолучитьСсылку(Новый УникальныйИдентификатор("879b2aed-b752-11e8-8da9-a4bf015601f8"));
КонецФункции
Функция ВидЦеныМЕГА100() Экспорт
	Возврат Справочники.ВидыЦен.ПолучитьСсылку(Новый УникальныйИдентификатор("879b2aee-b752-11e8-8da9-a4bf015601f8"));
КонецФункции

//Прайс Оптовый МЕГА

Функция ВидЦеныМЕГА250() Экспорт
	Возврат Справочники.ВидыЦен.ПолучитьСсылку(Новый УникальныйИдентификатор("879b2aef-b752-11e8-8da9-a4bf015601f8"));
КонецФункции
Функция ВидЦеныМЕГА500() Экспорт
	Возврат Справочники.ВидыЦен.ПолучитьСсылку(Новый УникальныйИдентификатор("879b2af0-b752-11e8-8da9-a4bf015601f8"));
КонецФункции
Функция ВидЦеныМЕГА1000() Экспорт
	Возврат Справочники.ВидыЦен.ПолучитьСсылку(Новый УникальныйИдентификатор("4b4fb630-d2d4-11e8-8dab-a4bf015601f9"));
КонецФункции

Функция ГруппыДоступаПартнеровСети() Экспорт
	Возврат Справочники.ГруппыДоступаПартнеров.ПолучитьСсылку(Новый УникальныйИдентификатор("63734142-5a46-11e2-b68f-001e67078c9d"));
КонецФункции

Функция ГруппаПользователейРуководительПродаж() Экспорт
	//ТекстИдентификатора = Строка(Справочники.ГруппыПользователей.НайтиПоНаименованию("Продажи - руководитель",Истина).УникальныйИдентификатор()); 
	Возврат Справочники.ГруппыПользователей.ПолучитьСсылку(
		Новый УникальныйИдентификатор("5bc36c8a-c977-11e9-8dc2-a4bf015601f9"));
КонецФункции
Функция ГруппаПользователейМенеджерыПродаж() Экспорт
	//ТекстИдентификатора = Строка(Справочники.ГруппыПользователей.НайтиПоНаименованию("Продажи - менеджеры",Истина).УникальныйИдентификатор()); 
	Возврат Справочники.ГруппыПользователей.ПолучитьСсылку(
		Новый УникальныйИдентификатор("5875b4b4-2cda-11e1-a88c-001e67078c9d"));
КонецФункции

Функция НоменклатураПродукция() Экспорт
	//ТекстИдентификатора = Строка(Справочники.Номенклатура.НайтиПоКоду("01-0002065 ").УникальныйИдентификатор());
	Массив = Новый Массив;

	Массив.Добавить(Справочники.Номенклатура.ПолучитьСсылку(
		Новый УникальныйИдентификатор("3df605f6-2c18-11e1-be25-001e67078c9d"))); //Медиа
	Массив.Добавить(Справочники.Номенклатура.ПолучитьСсылку(
		Новый УникальныйИдентификатор("3218588c-8d59-11eb-8dea-a4bf015601f8"))); //Кемикал

	Возврат Массив;
КонецФункции
Функция НоменклатураГруппаПродукцияКемикал() Экспорт
	Возврат Справочники.Номенклатура.ПолучитьСсылку(
		Новый УникальныйИдентификатор("3218588c-8d59-11eb-8dea-a4bf015601f8")); //Кемикал
КонецФункции
Функция НоменклатураСырье() Экспорт
	//ТекстИдентификатора = Строка(Справочники.Номенклатура.НайтиПоКоду("О0000000517").УникальныйИдентификатор()); 
	Возврат Справочники.Номенклатура.ПолучитьСсылку(
		Новый УникальныйИдентификатор("d24519bc-48e5-11dd-a518-000423b8c4ce"));
КонецФункции
Функция НоменклатураКрасители() Экспорт
	//ТекстИдентификатора = Строка(Справочники.Номенклатура.НайтиПоКоду("О0000001052").УникальныйИдентификатор()); 
	Возврат Справочники.Номенклатура.ПолучитьСсылку(
		Новый УникальныйИдентификатор("69ce2350-7d01-11de-b492-000423b8c4ce"));
КонецФункции
Функция НоменклатураОтдушки() Экспорт
	//ТекстИдентификатора = Строка(Справочники.Номенклатура.НайтиПоКоду("О0000000519").УникальныйИдентификатор()); 
	Возврат Справочники.Номенклатура.ПолучитьСсылку(
		Новый УникальныйИдентификатор("7e744237-48e2-11dd-b9ea-0013d4c416e7"));
КонецФункции
Функция НоменклатураКоробки() Экспорт
	//ТекстИдентификатора = Строка(Справочники.Номенклатура.НайтиПоКоду("О0000000413").УникальныйИдентификатор()); 
	Возврат Справочники.Номенклатура.ПолучитьСсылку(
		Новый УникальныйИдентификатор("c9293210-466e-11dd-a518-000423b8c4ce"));
КонецФункции
Функция НоменклатураКанистры() Экспорт
	//ТекстИдентификатора = Строка(Справочники.Номенклатура.НайтиПоКоду("О0000000411").УникальныйИдентификатор()); 
	Возврат Справочники.Номенклатура.ПолучитьСсылку(
		Новый УникальныйИдентификатор("b667d566-466a-11dd-a518-000423b8c4ce"));
КонецФункции
Функция НоменклатураФлаконы() Экспорт
	//ТекстИдентификатора = Строка(Справочники.Номенклатура.НайтиПоКоду("О0000000638").УникальныйИдентификатор()); 
	Возврат Справочники.Номенклатура.ПолучитьСсылку(
		Новый УникальныйИдентификатор("e0e9b648-67a8-11dd-a518-000423b8c4ce"));
КонецФункции
Функция НоменклатураКрышки() Экспорт
	//ТекстИдентификатора = Строка(Справочники.Номенклатура.НайтиПоКоду("01-00000306").УникальныйИдентификатор()); 
	Возврат Справочники.Номенклатура.ПолучитьСсылку(
		Новый УникальныйИдентификатор("baa9d735-ccbd-11e1-b591-001e67078c9d"));
КонецФункции
Функция НоменклатураЭтикетки() Экспорт
	//ТекстИдентификатора = Строка(Справочники.Номенклатура.НайтиПоКоду("О0000000412").УникальныйИдентификатор()); 
	Возврат Справочники.Номенклатура.ПолучитьСсылку(
		Новый УникальныйИдентификатор("b667d567-466a-11dd-a518-000423b8c4ce"));
КонецФункции
Функция НоменклатураУпаковка() Экспорт
	//ТекстИдентификатора = Строка(Справочники.Номенклатура.НайтиПоКоду("О0000000564").УникальныйИдентификатор()); 
	Возврат Справочники.Номенклатура.ПолучитьСсылку(
		Новый УникальныйИдентификатор("c69bb6b1-4995-11dd-a518-000423b8c4ce"));
КонецФункции

Функция ОрганизацияСобственникПродукции() Экспорт
	Возврат ОрганизацияКемикал();
КонецФункции
Функция ОрганизацияАМССтарая() Экспорт
	Возврат Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор("6cb55ba0-0ec4-491b-8a65-24ff369799a9"));
КонецФункции
Функция ОрганизацияАМСНовая() Экспорт
	Возврат Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор("17e181b7-8f7d-42f9-be02-16e7a174fe15"));
КонецФункции
Функция ОрганизацияКемикал() Экспорт
	Возврат Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор("fbf64857-1226-11ea-8dcb-a4bf015601f8"));
КонецФункции
Функция ОрганизацияТД() Экспорт
	Возврат Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор("39deb209-6534-45d2-8327-020422d28957"));
КонецФункции
Функция ОрганизацияТрейд() Экспорт
	Возврат Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор("003a8cc2-84ca-11ea-8ddb-a4bf015601f8"));
КонецФункции

Функция ПартнерАМС() Экспорт
//	ТекстИдентификатора = Строка(Справочники.Партнеры.НайтиПоКоду("01-00000244").УникальныйИдентификатор()); 
	Возврат Справочники.Партнеры.ПолучитьСсылку(Новый УникальныйИдентификатор("4b03bbc9-69e6-11e2-af1e-001e67078c9c"));
КонецФункции

Функция ПодразделениеЦех1() Экспорт
	//ТекстИдентификатора = Строка(Справочники.СтруктураПредприятия.НайтиПоКоду("01-000002").УникальныйИдентификатор());
	Возврат Справочники.СтруктураПредприятия.ПолучитьСсылку(Новый УникальныйИдентификатор("667cfc7d-958f-11e8-9dbb-001e67078c9d"));
КонецФункции
Функция ПодразделениеЦех2() Экспорт
	Возврат Справочники.СтруктураПредприятия.ПолучитьСсылку(Новый УникальныйИдентификатор("667cfc7e-958f-11e8-9dbb-001e67078c9d"));
КонецФункции
Функция ПодразделениеЦех3() Экспорт
	Возврат Справочники.СтруктураПредприятия.ПолучитьСсылку(Новый УникальныйИдентификатор("6f48d240-958f-11e8-9dbb-001e67078c9d"));
КонецФункции
Функция ПодразделениеЦех4() Экспорт
	Возврат Справочники.СтруктураПредприятия.ПолучитьСсылку(Новый УникальныйИдентификатор("d8125b36-8de2-11ef-8e33-a4bf015601f8"));
КонецФункции

Функция РаботаВодителяПогрузчика() Экспорт
	//ТекстИдентификатора2 = Строка(Справочники._Работы.НайтиПоНаименованию("Водитель погрузчика",Истина).УникальныйИдентификатор()); 
	Возврат Справочники._Работы.ПолучитьСсылку(Новый УникальныйИдентификатор("1c8872a8-442e-11eb-8de4-a4bf015601f8"));
КонецФункции

Функция СкладПродукции() Экспорт
	Возврат Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор("b74a3238-3b87-4aa3-9b3e-e2fce30ca08e"));
КонецФункции
Функция СкладЗолушки() Экспорт
//	ТекстИдентификатора = Строка(Справочники.Склады.НайтиПоНаименованию("Склад товаров Золушки").УникальныйИдентификатор()); 
	Возврат Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор("4875e772-1ecd-11f1-8e96-a4bf015601f9"));
КонецФункции
Функция СкладТрейд() Экспорт
//	ТекстИдентификатора = Строка(Справочники.Склады.НайтиПоНаименованию("Склад товаров АМС Трейд").УникальныйИдентификатор()); 
	Возврат Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор("e4556124-1ecd-11f1-8e96-a4bf015601f9"));
КонецФункции
Функция СкладКомпании() Экспорт
	Возврат Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор("1312ef62-27e8-4216-b176-777a8efa0802"));
КонецФункции
Функция Цех1() Экспорт
	Возврат Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор("e8d2dd4c-5094-4d8a-98e1-f5fb4ec069e6"));
КонецФункции
Функция Цех2() Экспорт
	Возврат Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор("259eecdb-3879-4b54-b325-9c07fc109a6d"));
КонецФункции
Функция Цех3() Экспорт
	Возврат Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор("d09a1c7f-a7d2-411c-ae2c-cef63d947f8a"));
КонецФункции
Функция Цех4() Экспорт
	Возврат Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор("bb8134c5-82ef-11ef-8e32-a4bf015601f8"));
КонецФункции
Функция Цех1_МатериалыВПроизводстве() Экспорт
	Возврат Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор("fe453a99-7aff-11e8-8b97-001e67078c9d"));
КонецФункции
Функция Цех2_МатериалыВПроизводстве() Экспорт
	Возврат Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор("fe453a9a-7aff-11e8-8b97-001e67078c9d"));
КонецФункции
Функция Цех3_МатериалыВПроизводстве() Экспорт
	Возврат Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор("fe453a98-7aff-11e8-8b97-001e67078c9d"));
КонецФункции
Функция Цех4_МатериалыВПроизводстве() Экспорт
	Возврат Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор("bb8134c6-82ef-11ef-8e32-a4bf015601f8"));
КонецФункции
Функция СкладРасходныхМатериалов() Экспорт
	Возврат Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор("70d1cb11-dcde-11e3-8337-001e67078c9d"));
КонецФункции
Функция СкладБракованнойПродукции() Экспорт
	Возврат Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор("a020438f-17e1-11e9-8db9-a4bf015601f9"));
КонецФункции
Функция СкладКарантин() Экспорт
	Возврат Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор("3efab8d8-7a56-11ea-8dda-a4bf015601f8"));
КонецФункции
Функция СкладЛаборатория() Экспорт
	Возврат Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор("30e04f94-f2fb-11e8-8db3-a4bf015601f9"));
КонецФункции
Функция СкладМосква() Экспорт
	Возврат Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор("3f703864-c57d-11e8-8dab-a4bf015601f9"));
КонецФункции
Функция СкладМО() Экспорт
	Возврат Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор("1006d515-ef27-11e8-8db2-a4bf015601f9"));
КонецФункции
Функция СкладКомплектацииУпаковки() Экспорт
//	ТекстИдентификатора = Строка(Справочники.Склады.НайтиПоНаименованию("Склад комплектации и упаковки").УникальныйИдентификатор()); 
	Возврат Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор("2bfa59d0-30a8-11f0-8e3d-a4bf015601f8"));
КонецФункции
Функция СкладМПКТ() Экспорт
//	ТекстИдентификатора = Строка(Справочники.Склады.НайтиПоНаименованию("Склад ГК МПКТ").УникальныйИдентификатор()); 
	Возврат Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор("53aa03c6-f85f-11ef-8e3b-a4bf015601f8"));
КонецФункции

Функция СкладТНЦ() Экспорт
	Возврат Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор("9084ced2-9595-11e8-9dbb-001e67078c9d"));
КонецФункции
Функция СкладСборкиНаборов() Экспорт
	//ТекстИдентификатора = Строка(Справочники.Склады.НайтиПоНаименованию("Склад комплектации и упаковки").УникальныйИдентификатор());
	Возврат Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор("2bfa59d0-30a8-11f0-8e3d-a4bf015601f8"));
КонецФункции
Функция СписокЦеховПроизводстваПродукции() Экспорт
	СписокЦехов = Новый Массив();
	СписокЦехов.Добавить(Цех1());
	СписокЦехов.Добавить(Цех2());
	СписокЦехов.Добавить(Цех3());
	
	Возврат СписокЦехов;
КонецФункции

Функция СегментыНоменклатурыБытхим() Экспорт
	//ТекстИдентификатора = Строка(Справочники.СегментыНоменклатуры.НайтиПоКоду("01-00000007").УникальныйИдентификатор());
	Возврат Справочники.СегментыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("bccc811a-f54f-11e2-92bb-001e67078c9c"));
КонецФункции
Функция СегментыНоменклатурыИнсектициды() Экспорт
	Возврат Справочники.СегментыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("07086fb6-f54e-11e2-92bb-001e67078c9c"));
КонецФункции
Функция СегментыНоменклатурыКонтракт() Экспорт
	Возврат Справочники.СегментыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("90719f47-f54e-11e2-92bb-001e67078c9c"));
КонецФункции
Функция СегментыНоменклатурыКосметика() Экспорт
	//ТекстИдентификатора = Строка(Справочники.Номенклатура.НайтиПоКоду("01-0002065 ").УникальныйИдентификатор());
	Возврат Справочники.СегментыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("cb973076-f54e-11e2-92bb-001e67078c9c"));
КонецФункции
Функция СегментыНоменклатурыМега() Экспорт
	Возврат Справочники.СегментыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("f15c460f-f54e-11e2-92bb-001e67078c9c"));
КонецФункции
Функция СегментыНоменклатурыМоющие() Экспорт
	Возврат Справочники.СегментыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("3c1296c9-f54f-11e2-92bb-001e67078c9c"));
КонецФункции
Функция СегментыНоменклатурыСтирка() Экспорт
	Возврат Справочники.СегментыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("6b2d91f5-f54f-11e2-92bb-001e67078c9c"));
КонецФункции
Функция СегментыНоменклатурыЧистота() Экспорт
	Возврат Справочники.СегментыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("e6fc4455-f54f-11e2-92bb-001e67078c9c"));
КонецФункции
Функция СегментыНоменклатурыМатериалыЦеха1() Экспорт
	Возврат Справочники.СегментыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("f2b0f952-32f8-4f5f-b948-b11499c6e561"));
КонецФункции
Функция СегментыНоменклатурыМатериалыЦеха2() Экспорт
	Возврат Справочники.СегментыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("08f436b3-ba72-43f7-9ec4-c8aabc228697"));
КонецФункции
Функция СегментыНоменклатурыМатериалыЦеха3() Экспорт
	Возврат Справочники.СегментыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("8469ef87-5c64-435d-b9ef-4ee14e197f74"));
КонецФункции
Функция СегментыНоменклатурыМатериалыЦеха4() Экспорт
	Возврат Справочники.СегментыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("916d8ac1-9d32-11ef-8e33-a4bf015601f8"));
КонецФункции
Функция СегментыНоменклатурыПолуфабрикатыЦеха1() Экспорт
	Возврат Справочники.СегментыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("d148d092-5dd1-4eb7-ac8c-fcbc797f8b84"));
КонецФункции
Функция СегментыНоменклатурыПолуфабрикатыЦеха2() Экспорт
	Возврат Справочники.СегментыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("7ae9d0ce-456a-4221-97cf-87d638d6277d"));
КонецФункции
Функция СегментыНоменклатурыПолуфабрикатыЦеха3() Экспорт
	Возврат Справочники.СегментыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("f93acce7-2f4a-43ea-b358-0a13a5642241"));
КонецФункции
Функция СегментыНоменклатурыПродукцияПереработки() Экспорт
	Возврат Справочники.СегментыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("ddbc01ba-4cc8-4e1b-9a27-8e68d9fb3399"));
КонецФункции
Функция СегментыНоменклатурыПродукцияЦеха1() Экспорт
	Возврат Справочники.СегментыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("b0b84aef-89e7-4a75-8b48-af8449e6bc46"));
КонецФункции
Функция СегментыНоменклатурыПродукцияЦеха2() Экспорт
	Возврат Справочники.СегментыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("3f3b259e-5eaa-41b3-a188-ad3b9702ab8c"));
КонецФункции
Функция СегментыНоменклатурыПродукцияЦеха3() Экспорт
	Возврат Справочники.СегментыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("aaa612df-3b64-4582-a694-0bf030f6879b"));
КонецФункции
Функция СегментыНоменклатурыПродукцияЦеха4() Экспорт
	Возврат Справочники.СегментыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("916d8ac0-9d32-11ef-8e33-a4bf015601f8"));
КонецФункции
Функция СегментыНоменклатурыУпаковкаЦеха1() Экспорт
	Возврат Справочники.СегментыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("7082b927-c5f7-42a4-8ce2-a2783a5ad41e"));
КонецФункции
Функция СегментыНоменклатурыУпаковкаЦеха2() Экспорт
	Возврат Справочники.СегментыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("5bd40f4f-0c0e-4c20-a72f-ee2d94cddc1c"));
КонецФункции
Функция СегментыНоменклатурыУпаковкаЦеха3() Экспорт
	Возврат Справочники.СегментыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("5622b7c0-c2b7-477c-beef-0ed67174b617"));
КонецФункции
Функция СегментыНоменклатурыПродукцияКомпании() Экспорт
	Возврат Справочники.СегментыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("80e02d8c-9e0b-4175-9dcb-78573d134c86"));
КонецФункции
Функция СегментыНоменклатурыРасходныеПроизводства() Экспорт
	Возврат Справочники.СегментыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("80d8a720-1cb2-11e5-8c19-001e67078c9d"));
КонецФункции
Функция СегментыНоменклатурыСтарая() Экспорт
	Возврат Справочники.СегментыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("fb698a54-2c91-11e5-a58c-001e67078c9d"));
КонецФункции
Функция СегментыНоменклатурыФабрикатыСПереходящимОстатком() Экспорт
	//ТекстИдентификатора = Строка(Справочники.СегментыНоменклатуры.НайтиПоНаименованию("Фабрикаты с переходящим остатком",Истина).УникальныйИдентификатор()); 
	Возврат Справочники.СегментыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("ecbd265e-8c12-11e9-8dbe-a4bf015601f9"));
КонецФункции

Функция СегментыПартнеровОсобыйРасчетПалет() Экспорт
	Возврат Справочники.СегментыПартнеров.ПолучитьСсылку(
		Новый УникальныйИдентификатор("0c968b1c-20b7-11ea-8dcf-a4bf015601f8"));
КонецФункции
Функция СегментыПартнеровОтгрузкаПозже() Экспорт
	Возврат Справочники.СегментыПартнеров.ПолучитьСсылку(
		Новый УникальныйИдентификатор("1185a8aa-3e80-11e9-8db9-a4bf015601f9"));
КонецФункции
Функция СегментыПартнеровОтгрузкаРаньше() Экспорт
	Возврат Справочники.СегментыПартнеров.ПолучитьСсылку(
		Новый УникальныйИдентификатор("6328262f-6975-11e4-994d-001e67078c9d"));
КонецФункции
Функция СегментыПартнеровПродажиЗапрещены() Экспорт
	Возврат Справочники.СегментыПартнеров.ПолучитьСсылку(
		Новый УникальныйИдентификатор("f6ac0414-1201-4793-b7d0-3d54404e7d5d"));
КонецФункции
Функция СегментыПартнеровСети() Экспорт
	Возврат Справочники.СегментыПартнеров.ПолучитьСсылку(
		Новый УникальныйИдентификатор("63915655-f6bc-11e3-acd3-001e67078c9d"));
КонецФункции

Функция ПодразделениеПроизводство() Экспорт
//	ТекстИдентификатора = Строка(Справочники.СтруктураПредприятия.НайтиПоКоду("000000002").УникальныйИдентификатор()); 
	Возврат Справочники.СтруктураПредприятия.ПолучитьСсылку(Новый УникальныйИдентификатор("58531780-2b4b-4a04-9f16-bf4a073ee9b3"));
КонецФункции

Функция УпаковкаПалета() Экспорт 
	//ТекстИдентификатора = Строка(Справочники.УпаковкиЕдиницыИзмерения.НайтиПоКоду("999").УникальныйИдентификатор()); 
	Возврат Справочники.УпаковкиЕдиницыИзмерения.ПолучитьСсылку(
		Новый УникальныйИдентификатор("4cebc90e-e795-11e1-99d7-001e67078c9c"));
КонецФункции

Функция ФизЛицаПапкаЦех1() Экспорт 
//    Строка(Справочники.ФизическиеЛица.НайтиПоНаименованию("Замесчики цеха 1",Истина).УникальныйИдентификатор())
	Возврат Справочники.ФизическиеЛица.ПолучитьСсылку(
		Новый УникальныйИдентификатор("a306a21e-ab98-11e8-80bd-60a44c3ef664"));
КонецФункции
Функция ФизЛицаПапкаЗамесчики1() Экспорт 
//    Строка(Справочники.ФизическиеЛица.НайтиПоНаименованию("Замесчики цеха 1",Истина).УникальныйИдентификатор())
	Возврат Справочники.ФизическиеЛица.ПолучитьСсылку(
		Новый УникальныйИдентификатор("9138cd04-44f9-11eb-8de4-a4bf015601f8"));
КонецФункции
Функция ФизЛицаПапкаМеханики1() Экспорт 
//    Строка(Справочники.ФизическиеЛица.НайтиПоНаименованию("Механики цеха 1",Истина).УникальныйИдентификатор())
	Возврат Справочники.ФизическиеЛица.ПолучитьСсылку(
		Новый УникальныйИдентификатор("0facb731-44fa-11eb-8de4-a4bf015601f8"));
КонецФункции
Функция ФизЛицаПапкаКладовщики1() Экспорт 
//    Строка(Справочники.ФизическиеЛица.НайтиПоНаименованию("Кладовщики цеха 1",Истина).УникальныйИдентификатор())
	Возврат Справочники.ФизическиеЛица.ПолучитьСсылку(
		Новый УникальныйИдентификатор("f7243393-44f9-11eb-8de4-a4bf015601f8"));
КонецФункции
Функция ФизЛицаПапкаГрузчики1() Экспорт 
//    Строка(Справочники.ФизическиеЛица.НайтиПоНаименованию("Грузчики цеха 1",Истина).УникальныйИдентификатор())
	Возврат Справочники.ФизическиеЛица.ПолучитьСсылку(
		Новый УникальныйИдентификатор("6d8031ee-44f9-11eb-8de4-a4bf015601f8"));
КонецФункции

Функция ФизЛицаПапкаЦех2() Экспорт 
//    Строка(Справочники.ФизическиеЛица.НайтиПоНаименованию("Замесчики цеха 1",Истина).УникальныйИдентификатор())
	Возврат Справочники.ФизическиеЛица.ПолучитьСсылку(
		Новый УникальныйИдентификатор("a306a21f-ab98-11e8-80bd-60a44c3ef664"));
КонецФункции
Функция ФизЛицаПапкаЗамесчики2() Экспорт 
//    Строка(Справочники.ФизическиеЛица.НайтиПоНаименованию("Замесчики цеха 2",Истина).УникальныйИдентификатор())
	Возврат Справочники.ФизическиеЛица.ПолучитьСсылку(
		Новый УникальныйИдентификатор("25bda091-442b-11eb-8de4-a4bf015601f8"));
КонецФункции
Функция ФизЛицаПапкаМеханики2() Экспорт 
//    Строка(Справочники.ФизическиеЛица.НайтиПоНаименованию("Механики цеха 2",Истина).УникальныйИдентификатор())
	Возврат Справочники.ФизическиеЛица.ПолучитьСсылку(
		Новый УникальныйИдентификатор("3932e571-442a-11eb-8de4-a4bf015601f8"));
КонецФункции
Функция ФизЛицаПапкаКладовщики2() Экспорт 
//    Строка(Справочники.ФизическиеЛица.НайтиПоНаименованию("Кладовщики цеха 2",Истина).УникальныйИдентификатор())
	Возврат Справочники.ФизическиеЛица.ПолучитьСсылку(
		Новый УникальныйИдентификатор("728b049a-442d-11eb-8de4-a4bf015601f8"));
КонецФункции
Функция ФизЛицаПапкаГрузчики2() Экспорт 
//    Строка(Справочники.ФизическиеЛица.НайтиПоНаименованию("Грузчики цеха 2",Истина).УникальныйИдентификатор())
	Возврат Справочники.ФизическиеЛица.ПолучитьСсылку(
		Новый УникальныйИдентификатор("3eb5aa7f-4428-11eb-8de4-a4bf015601f8"));
КонецФункции

Функция ФизЛицаПапкаЦех3() Экспорт 
//    Строка(Справочники.ФизическиеЛица.НайтиПоНаименованию("Замесчики цеха 1",Истина).УникальныйИдентификатор())
	Возврат Справочники.ФизическиеЛица.ПолучитьСсылку(
		Новый УникальныйИдентификатор("ad6f605d-ab98-11e8-80bd-60a44c3ef664"));
КонецФункции
Функция ФизЛицаПапкаЗамесчики3() Экспорт 
//    Строка(Справочники.ФизическиеЛица.НайтиПоНаименованию("Замесчики цеха 3",Истина).УникальныйИдентификатор())
	Возврат Справочники.ФизическиеЛица.ПолучитьСсылку(
		Новый УникальныйИдентификатор("c19bc889-44f9-11eb-8de4-a4bf015601f8"));
КонецФункции
Функция ФизЛицаПапкаМеханики3() Экспорт 
//    Строка(Справочники.ФизическиеЛица.НайтиПоНаименованию("Механики цеха 3",Истина).УникальныйИдентификатор())
	Возврат Справочники.ФизическиеЛица.ПолучитьСсылку(
		Новый УникальныйИдентификатор("1b5ab29c-44fa-11eb-8de4-a4bf015601f8"));
КонецФункции
Функция ФизЛицаПапкаКладовщики3() Экспорт 
//    Строка(Справочники.ФизическиеЛица.НайтиПоНаименованию("Кладовщики цеха 3",Истина).УникальныйИдентификатор())
	Возврат Справочники.ФизическиеЛица.ПолучитьСсылку(
		Новый УникальныйИдентификатор("feb8f2e9-44f9-11eb-8de4-a4bf015601f8"));
КонецФункции
Функция ФизЛицаПапкаГрузчики3() Экспорт 
//    Строка(Справочники.ФизическиеЛица.НайтиПоНаименованию("Грузчики цеха 3",Истина).УникальныйИдентификатор())
	Возврат Справочники.ФизическиеЛица.ПолучитьСсылку(
		Новый УникальныйИдентификатор("7407c26c-44f9-11eb-8de4-a4bf015601f8"));
КонецФункции

Функция ЦеноваяГруппаБытоваяХимия() Экспорт
	//ТекстИдентификатора = Строка(Справочники.ЦеновыеГруппы.НайтиПоНаименованию("Бытовая химия",Истина).УникальныйИдентификатор()); 
	Возврат Справочники.ЦеновыеГруппы.ПолучитьСсылку(
		Новый УникальныйИдентификатор("e09e3e43-2d99-11e1-a88c-001e67078c9d"));
КонецФункции
Функция ЦеноваяГруппаКонтрактнаяПродукция() Экспорт
	//ТекстИдентификатора = Строка(Справочники.ЦеновыеГруппы.НайтиПоНаименованию("Контрактная продукция",Истина).УникальныйИдентификатор()); 
	Возврат Справочники.ЦеновыеГруппы.ПолучитьСсылку(
		Новый УникальныйИдентификатор("f227bc12-353e-11e1-a88c-001e67078c9d"));
КонецФункции
Функция ЦеноваяГруппаМЕГА() Экспорт
	//ТекстИдентификатора = Строка(Справочники.ЦеновыеГруппы.НайтиПоНаименованию("МЕГА",Истина).УникальныйИдентификатор()); 
	Возврат Справочники.ЦеновыеГруппы.ПолучитьСсылку(
		Новый УникальныйИдентификатор("e09e3e2f-2d99-11e1-a88c-001e67078c9d"));
КонецФункции

Функция Иванова() Экспорт
	//ТекстИдентификатора = Строка(Справочники.Пользователи.НайтиПоНаименованию("Иванова Светлана Вячеславовна",Истина).УникальныйИдентификатор()); 
	Возврат Справочники.Пользователи.ПолучитьСсылку(
		Новый УникальныйИдентификатор("65bb5243-2bc5-11e1-be25-001e67078c9d"));
КонецФункции
Функция Сулим() Экспорт
	//ТекстИдентификатора = Строка(Справочники.Пользователи.НайтиПоНаименованию("Сулим Нина Викторовна",Истина).УникальныйИдентификатор()); 
	Возврат Справочники.Пользователи.ПолучитьСсылку(
		Новый УникальныйИдентификатор("43253cb1-d4bd-11e5-8123-001e67078c9d"));
КонецФункции
Функция Пирогова() Экспорт
	Возврат Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор("a9f73480-f09b-11e8-8db2-a4bf015601f9"));
КонецФункции
Функция Матрешкина() Экспорт
	//ТекстИдентификатора = Строка(Справочники.Пользователи.НайтиПоНаименованию("Матрешкина Наталья Алексеевна",Истина).УникальныйИдентификатор()); 
	Возврат Справочники.Пользователи.ПолучитьСсылку(
		Новый УникальныйИдентификатор("40577e98-5a1b-11e9-8dbc-a4bf015601f9"));
КонецФункции
Функция ЭтоKhors() Экспорт
	Возврат Пользователи.ТекущийПользователь() = Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор("539d7d9b-2bbb-11e1-be25-001e67078c9d"));
КонецФункции
Функция ЭтоМеренков() Экспорт
	Возврат Пользователи.ТекущийПользователь() = Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор("05a90477-6466-11e2-8b1b-001e67078c9d"));
КонецФункции
Функция ЭтоГлавбух() Экспорт
	Возврат Пользователи.ТекущийПользователь() = Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор("a9f73480-f09b-11e8-8db2-a4bf015601f9"));
КонецФункции
Функция ЭтоЧугункова() Экспорт
	//ТекстИдентификатора = Строка(Справочники.Пользователи.НайтиПоНаименованию("Чугункова Анна Александровна",Истина).УникальныйИдентификатор()); 
	Возврат Пользователи.ТекущийПользователь() = Справочники.Пользователи.ПолучитьСсылку(
		Новый УникальныйИдентификатор("1c968818-d3c0-11e5-8123-001e67078c9d"));
КонецФункции
Функция ЭтоНашаОрганизация(Партнер) Экспорт
	//ТекстИдентификатора = Строка(Справочники.Партнеры.НайтиПоНаименованию("АМС Трейд",Истина).УникальныйИдентификатор());
	Возврат Партнер = Справочники.Партнеры.ПолучитьСсылку(
		Новый УникальныйИдентификатор("4b03bbc9-69e6-11e2-af1e-001e67078c9c")) //АМС Медиа

		Или Партнер = Справочники.Партнеры.ПолучитьСсылку(
		Новый УникальныйИдентификатор("29e3f5d4-b5de-471a-8aba-16b7b016e891")) //ТД ЗОЛУШКА ООО

		Или Партнер = Справочники.Партнеры.ПолучитьСсылку(
		Новый УникальныйИдентификатор("1defafa3-833f-11ea-8ddb-a4bf015601f8")) //АМС Кемикал

		Или Партнер = Справочники.Партнеры.ПолучитьСсылку(
		Новый УникальныйИдентификатор("84be29b0-7a9e-11eb-8de9-a4bf015601f8"));//АМС Трейд
КонецФункции
Функция ГруппаПользователейДежурныйМенеджер() Экспорт
	//ТекстИдентификатора = Строка(Справочники.ГруппыПользователей.НайтиПоНаименованию("Дежурный менеджер",Истина).УникальныйИдентификатор()); 
	Возврат Справочники.ГруппыПользователей.ПолучитьСсылку(
		Новый УникальныйИдентификатор("e627d013-83f8-11ea-8ddb-a4bf015601f8"));
КонецФункции

Функция ЭтоПодчинённыйСклад(Склад) Экспорт
	Если Пользователи.РолиДоступны("_НачальникСклада") 
		И (Склад = СкладПродукции() 
			Или Склад = СкладМО() 
			Или Склад = СкладБракованнойПродукции()) Тогда

		Возврат Истина;

	ИначеЕсли Пользователи.РолиДоступны("_Цех1") И Склад = Цех1() Тогда
		Возврат Истина;

	ИначеЕсли Пользователи.РолиДоступны("_Цех2") И Склад = Цех2() Тогда
		Возврат Истина;

	ИначеЕсли Пользователи.РолиДоступны("_Цех3") И Склад = Цех3() Тогда
		Возврат Истина;

	ИначеЕсли Пользователи.РолиДоступны("_Цех4") И Склад = Цех4() Тогда
		Возврат Истина;

	ИначеЕсли Пользователи.РолиДоступны("_Бухгалтер") Тогда
		Возврат Истина;
	КонецЕсли;

	Возврат Ложь;
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОрганизацияДоступа

Функция ПолучитьГруппуДоступаМенеджера(Пользователь) Экспорт
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь", Пользователь);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ГруппыДоступа.Ссылка КАК Ссылка,
	|	ГруппыПользователейСостав.Пользователь КАК Пользователь
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	Справочник.ГруппыДоступа КАК ГруппыДоступа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
	|			ПО ГруппыДоступаПользователи.Пользователь = ГруппыПользователейСостав.Ссылка
	|		ПО ГруппыДоступа.Ссылка = ГруппыДоступаПользователи.Ссылка
	|ГДЕ
	|	ГруппыПользователейСостав.Пользователь = &Пользователь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ГруппыДоступаЗначенияДоступа.ЗначениеДоступа КАК ГруппаДоступа
	|ИЗ
	|	Справочник.ГруппыДоступа.ЗначенияДоступа КАК ГруппыДоступаЗначенияДоступа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт КАК вт
	|		ПО (вт.Ссылка = ГруппыДоступаЗначенияДоступа.Ссылка)
	|ГДЕ
	|	НЕ(ГруппыДоступаЗначенияДоступа.ЗначениеДоступа.Наименование ПОДОБНО ""%умолчанию%""
	|				ИЛИ ГруппыДоступаЗначенияДоступа.ЗначениеДоступа.Наименование ПОДОБНО ""%Поставщики%""
	|				ИЛИ ГруппыДоступаЗначенияДоступа.ЗначениеДоступа.Наименование ПОДОБНО ""%Перевозчики%"")";

	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ГруппаДоступа");
КонецФункции
Функция ПолучитьИмяГруппыДоступаРеализации(Реализация) Экспорт
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Реализация", Реализация);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ГруппыДоступа.Наименование КАК ГруппаДоступаНаименование
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК Реал
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры КАК Парт
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыДоступаПартнеров КАК ГруппыДоступа
	|			ПО Парт.ГруппаДоступа = ГруппыДоступа.Ссылка
	|		ПО Реал.Партнер = Парт.Ссылка
	|ГДЕ
	|	Реал.Ссылка = &Реализация";

	Рез = Запрос.Выполнить();
	Выб = Рез.Выбрать();
	Выб.Следующий();

	Возврат Выб.ГруппаДоступаНаименование;
КонецФункции

Функция ПолучитьГруппДоступаВсе() Экспорт
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	т.Ссылка КАК ГруппаДоступа
	|ИЗ
	|	Справочник.ГруппыДоступаПартнеров КАК т
	|ГДЕ
	|	НЕ т.ПометкаУдаления
	|	И НЕ(т.Наименование ПОДОБНО ""%по умолчанию%""
	|				ИЛИ т.Наименование ПОДОБНО ""%Поставщики%""
	|				ИЛИ т.Наименование ПОДОБНО ""%Перевозчики%"")
	|
	|УПОРЯДОЧИТЬ ПО
	|	т.Наименование";
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ГруппаДоступа");
КонецФункции
Функция ПолучитьГруппДоступаМенеджера(Пользователь) Экспорт
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь", Пользователь);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ГруппыДоступа.Ссылка КАК Ссылка,
	|	ГруппыПользователейСостав.Пользователь КАК Пользователь
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	Справочник.ГруппыДоступа КАК ГруппыДоступа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
	|			ПО ГруппыДоступаПользователи.Пользователь = ГруппыПользователейСостав.Ссылка
	|		ПО ГруппыДоступа.Ссылка = ГруппыДоступаПользователи.Ссылка
	|ГДЕ
	|	ГруппыПользователейСостав.Пользователь = &Пользователь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ГруппыДоступаЗначенияДоступа.ЗначениеДоступа КАК ГруппаДоступа
	|ИЗ
	|	Справочник.ГруппыДоступа.ЗначенияДоступа КАК ГруппыДоступаЗначенияДоступа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт КАК вт
	|		ПО (вт.Ссылка = ГруппыДоступаЗначенияДоступа.Ссылка)
	|ГДЕ
	|	НЕ(ГруппыДоступаЗначенияДоступа.ЗначениеДоступа.Наименование ПОДОБНО ""%умолчанию%""
	|				ИЛИ ГруппыДоступаЗначенияДоступа.ЗначениеДоступа.Наименование ПОДОБНО ""%Поставщики%""
	|				ИЛИ ГруппыДоступаЗначенияДоступа.ЗначениеДоступа.Наименование ПОДОБНО ""%Перевозчики%"")";

	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ГруппаДоступа");
КонецФункции

#КонецОбласти

#Область ПродажиЦены

Процедура AMS_ПроверитьВозможностьПодбора(Знач Объект, Отказ) Экспорт
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "ДатаОтгрузки") Тогда //это заказ клиента
		Если Не ЗначениеЗаполнено(Объект.ДатаОтгрузки) Тогда
			ТекстСообщения = НСтр("ru='Не заполнено поле ""Дата отгрузки""'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Объект.Ссылка, "Объект.ДатаОтгрузки",,Отказ);
			Возврат;
		КонецЕсли;
	Иначе
		Если Не ЗначениеЗаполнено(Объект.Дата) Тогда
			ТекстСообщения = НСтр("ru='Не заполнено поле ""Дата""'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Объект.Ссылка, "Объект.Дата",,Отказ);
			Возврат;
		КонецЕсли;
	КонецЕсли;
		
	Если Не ЗначениеЗаполнено(Объект.Партнер) Тогда
		ТекстСообщения = НСтр("ru='Не заполнено поле ""Клиент""'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Объект.Ссылка, "Объект.Партнер",,Отказ);
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Товары", Объект.Товары.Выгрузить(,"НомерСтроки, Номенклатура, Упаковка"));

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.НомерСтроки КАК НомерСтроки,
	|	т.Номенклатура КАК Номенклатура,
	|	т.Упаковка КАК Упаковка
	|ПОМЕСТИТЬ тов
	|ИЗ
	|	&Товары КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тов.НомерСтроки КАК НомерСтроки,
	|	тов.Номенклатура КАК Номенклатура
	|ИЗ
	|	тов КАК тов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНом
	|		ПО тов.Номенклатура = СпрНом.Ссылка
	|		И (СпрНом.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар))
	|ГДЕ
	|	тов.Упаковка <> СпрНом._Упаковка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тов.НомерСтроки КАК НомерСтроки,
	|	тов.Номенклатура КАК Номенклатура
	|ИЗ
	|	тов КАК тов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНом
	|		ПО тов.Номенклатура = СпрНом.Ссылка
	|		И (СпрНом.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.AMS_Продукция.Товары КАК Продукция
	|		ПО тов.Номенклатура = Продукция.Номенклатура
	|ГДЕ
	|	Продукция.Ссылка ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";

	Пакет = Запрос.ВыполнитьПакет();

	Если Не Пакет[1].Пустой() Тогда
		Выб = Пакет[1].Выбрать();
		Пока Выб.Следующий() Цикл
			ОбщегоНазначения.СообщитьПользователю("В строке № " + Выб.НомерСтроки + " указана упаковка не установленная к продажи.", , , , Отказ);
		КонецЦикла;
	КонецЕсли;

	Если Не Пакет[2].Пустой() Тогда
		Выб = Пакет[2].Выбрать();
		Пока Выб.Следующий() Цикл
			ОбщегоНазначения.СообщитьПользователю("В строке № " + Выб.НомерСтроки + " указана номенклатура не установленная к продажи.", , , , Отказ);
		КонецЦикла;
	КонецЕсли;

	Если Отказ Тогда
		ОбщегоНазначения.СообщитьПользователю("Для изменения документа обратитесь к бухгалтеру.");
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьПараметрыДляПрайса(ТипПрайса, ВариантПрайса, Соглашение = Неопределено, ВидЦеныБытХим = Неопределено,
	ВидЦеныМега = Неопределено) Экспорт
	МассивЦеноваяГруппа   = Новый Массив;
	МассивЦенИзСоглашения = Новый Массив;
	МассивВидЦены1        = Новый Массив;
	МассивВидЦены2        = Новый Массив;
	МассивВидЦены3        = Новый Массив;
	МассивВидЦены4        = Новый Массив;
	МассивВидЦены5        = Новый Массив;
	МассивВидЦены6        = Новый Массив;

	Если ВариантПрайса = 1 Тогда
		ВидЦеныБытХим = Соглашение.ВидЦен;
		МассивВидЦены1.Добавить(ВидЦеныБытХим);

		МассивЦеноваяГруппа.Добавить(ЦеноваяГруппаБытоваяХимия());
		Стр = Соглашение.ЦеновыеГруппы.Найти(ЦеноваяГруппаМЕГА(), "ЦеноваяГруппа");
		Если ЗначениеЗаполнено(Стр) Тогда
			МассивЦеноваяГруппа.Добавить(ЦеноваяГруппаМЕГА());
			ВидЦеныМега = Стр.ВидЦен;
			МассивВидЦены1.Добавить(ВидЦеныМега);
		КонецЕсли;

		Табл = Соглашение.Товары.Выгрузить( , "Номенклатура,Цена");
		Для Каждого Стр Из Табл Цикл
			МассивЦенИзСоглашения.Добавить(ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Стр));
		КонецЦикла;

	ИначеЕсли ВариантПрайса = 2 Тогда
		МассивВидЦены1.Добавить(ВидЦеныБытХим);
		МассивВидЦены1.Добавить(ВидЦеныМега);

		МассивЦеноваяГруппа.Добавить(ЦеноваяГруппаМЕГА());
		МассивЦеноваяГруппа.Добавить(ЦеноваяГруппаБытоваяХимия());

	ИначеЕсли ВариантПрайса = 3 Тогда
		МассивВидЦены1.Добавить(ВидЦеныБытХим);

		МассивЦеноваяГруппа.Добавить(ЦеноваяГруппаБытоваяХимия());

	ИначеЕсли ВариантПрайса = 4 Тогда
		МассивВидЦены1.Добавить(ВидЦеныМега);

		МассивЦеноваяГруппа.Добавить(ЦеноваяГруппаМЕГА());

	ИначеЕсли ВариантПрайса = 5 Тогда
		МассивВидЦены1.Добавить(ВидЦены020000());
		МассивВидЦены2.Добавить(ВидЦены050000());
		МассивВидЦены3.Добавить(ВидЦены100000());
		МассивВидЦены4.Добавить(ВидЦены250000());
		МассивВидЦены5.Добавить(ВидЦены500000());
		МассивВидЦены6.Добавить(ВидЦены900000());

		МассивЦеноваяГруппа.Добавить(ЦеноваяГруппаБытоваяХимия());

	ИначеЕсли ВариантПрайса = 6 Тогда
		МассивВидЦены1.Добавить(ВидЦены2());
		МассивВидЦены2.Добавить(ВидЦеныМ3());
		МассивВидЦены3.Добавить(ВидЦены3());
		МассивВидЦены4.Добавить(ВидЦеныМ4());
		МассивВидЦены5.Добавить(ВидЦены4());
		МассивВидЦены6.Добавить(Справочники.ВидыЦен.ПустаяСсылка());

		МассивЦеноваяГруппа.Добавить(ЦеноваяГруппаБытоваяХимия());

	ИначеЕсли ВариантПрайса = 7 Тогда
		МассивВидЦены1.Добавить(ВидЦеныМЕГА20());
		МассивВидЦены2.Добавить(ВидЦеныМЕГА50());
		МассивВидЦены3.Добавить(ВидЦеныМЕГА75());
		МассивВидЦены4.Добавить(ВидЦеныМЕГА100());
		МассивВидЦены5.Добавить(Справочники.ВидыЦен.ПустаяСсылка());
		МассивВидЦены6.Добавить(Справочники.ВидыЦен.ПустаяСсылка());

		МассивЦеноваяГруппа.Добавить(ЦеноваяГруппаМЕГА());

	ИначеЕсли ВариантПрайса = 8 Тогда
		МассивВидЦены1.Добавить(ВидЦеныМЕГА250());
		МассивВидЦены2.Добавить(ВидЦеныМЕГА500());
		МассивВидЦены3.Добавить(Справочники.ВидыЦен.ПустаяСсылка());
		МассивВидЦены4.Добавить(Справочники.ВидыЦен.ПустаяСсылка());
		МассивВидЦены5.Добавить(Справочники.ВидыЦен.ПустаяСсылка());
		МассивВидЦены6.Добавить(Справочники.ВидыЦен.ПустаяСсылка());

		МассивЦеноваяГруппа.Добавить(ЦеноваяГруппаМЕГА());

	КонецЕсли;

	Парам = Новый Структура;
	Парам.Вставить("ТипПрайса", ТипПрайса);
	Парам.Вставить("ВариантПрайса", ВариантПрайса);
	Парам.Вставить("ЦеноваяГруппа", МассивЦеноваяГруппа);
	Парам.Вставить("ЦеныСоглашения", МассивЦенИзСоглашения);
	Парам.Вставить("ВидЦены1", МассивВидЦены1);
	Парам.Вставить("ВидЦены2", МассивВидЦены2);
	Парам.Вставить("ВидЦены3", МассивВидЦены3);
	Парам.Вставить("ВидЦены4", МассивВидЦены4);
	Парам.Вставить("ВидЦены5", МассивВидЦены5);
	Парам.Вставить("ВидЦены6", МассивВидЦены6);

	Возврат Парам;
КонецФункции

#КонецОбласти

#Область ЗаписьРегистрСведений

Процедура ЗаписатьРегистрТоварныеОграничения(ПараметрыЗаписи) Экспорт
	УстановитьПривилегированныйРежим(Истина);

	МенеджерЗаписи = РегистрыСведений.ТоварныеОграничения.СоздатьМенеджерЗаписи();
    
    МенеджерЗаписи.Склад        = ПараметрыЗаписи.Склад;
	МенеджерЗаписи.Номенклатура = ПараметрыЗаписи.Номенклатура;
	
	МенеджерЗаписи.Прочитать();
    
	Если Не МенеджерЗаписи.Выбран() Тогда 
        МенеджерЗаписи.Склад        = ПараметрыЗаписи.Склад;
    	МенеджерЗаписи.Номенклатура = ПараметрыЗаписи.Номенклатура;
	КонецЕсли;		
    
    МенеджерЗаписи[ПараметрыЗаписи.Ресурс] = ПараметрыЗаписи.Значение;
    
    МенеджерЗаписи.Записать(Истина);
КонецПроцедуры

#КонецОбласти

#Область ПримерыОбразцы

//@skip-warning
Функция ПримерНумерацииСтрокВЗапросе()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Реал.Ссылка КАК Распоряжение
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК Реал
	|ГДЕ
	|	Реал.Проведен
	|	И Реал.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.Самовывоз)
	|	И Реал.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОЛИЧЕСТВО(вт1.Распоряжение) КАК НомерСтроки,
	|	вт.Распоряжение КАК Распоряжение
	|ИЗ
	|	вт КАК вт
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт КАК вт1
	|		ПО вт.Распоряжение >= вт1.Распоряжение
	|
	|СГРУППИРОВАТЬ ПО
	|	вт.Распоряжение
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";

	Возврат Запрос.Выполнить();
КонецФункции
//@skip-warning
&НаСервере
Функция ПолучитьДоступныеГруппыДоступа()
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ГруппыДоступа.Ссылка КАК Ссылка,
	|	ГруппыПользователейСостав.Пользователь КАК Пользователь
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	Справочник.ГруппыДоступа КАК ГруппыДоступа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
	|			ПО ГруппыДоступаПользователи.Пользователь = ГруппыПользователейСостав.Ссылка
	|		ПО ГруппыДоступа.Ссылка = ГруппыДоступаПользователи.Ссылка
	|ГДЕ
	|	ГруппыПользователейСостав.Пользователь = &Пользователь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ГруппыДоступаЗначенияДоступа.ЗначениеДоступа КАК ГруппаДоступа
	|ИЗ
	|	Справочник.ГруппыДоступа.ЗначенияДоступа КАК ГруппыДоступаЗначенияДоступа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт КАК вт
	|		ПО (вт.Ссылка = ГруппыДоступаЗначенияДоступа.Ссылка)";

	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ГруппаДоступа");
КонецФункции

#КонецОбласти

#Область МенеджерВременныхТаблиц

Процедура ПолучитьПродукциюДляВ2В(МВТ) Экспорт
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = МВТ;

	Запрос.УстановитьПараметр("ВидНомЦех1",  ВидНоменклатурыПродукцияЦеха1());
	Запрос.УстановитьПараметр("ВидНомЦех2",  ВидНоменклатурыПродукцияЦеха2());
	Запрос.УстановитьПараметр("ВидНомЦех3",  ВидНоменклатурыПродукцияЦеха3());
	Запрос.УстановитьПараметр("ВидНомНабор", ВидНоменклатурыПродукцияНаборы());
	Запрос.УстановитьПараметр("ВидНомТовар", ВидНоменклатурыТовар());
	
	Запрос.УстановитьПараметр("Цех1",           Цех1());
	Запрос.УстановитьПараметр("Цех2",           Цех2());
	Запрос.УстановитьПараметр("Цех3",           Цех3());
	Запрос.УстановитьПараметр("СкладНаборов",   СкладСборкиНаборов());
	Запрос.УстановитьПараметр("СкладПродукции", СкладПродукции());

	Запрос.Текст =
	"ВЫБРАТЬ
	|	Прод.Родитель КАК ВидПродукции,
	|	Прод.Родитель.Наименование КАК ВидПродукцииНаименование,
	|	Прод.Ссылка КАК НазначениеПродукции,
	|	Прод.Наименование КАК НазначениеПродукцииНаименование,
	|	ПродТовары.НомерСтроки КАК НомерСтроки,
	|	ПродТовары.Номенклатура КАК Номенклатура,
	|	ПродТовары.ТоварныйЗнак КАК ТоварныйЗнак,
	|	ПродТовары.ТоварныйЗнак.Порядок КАК ТоварныйЗнакПорядок,
	|	ПродТовары.Маркер КАК Маркер,
	|	ПродТовары.Упаковка КАК УпаковкаСтрока,
	|	ПродТовары.Объем КАК ОбъемСтрока,
	|	ПродТовары.СрокГодности КАК СрокГодности,
	|	ПродТовары.Прайс КАК Прайс,
	|	ПродТовары.Заказ КАК Заказ,
	|	ПродТовары.Подбор КАК Подбор,
	|	ПродТовары.В2В КАК В2В,
	|	ПродТовары.ЧестныйЗнак КАК ЧестныйЗнак,
	|	Ном.ВидНоменклатуры КАК ВидНоменклатуры,
	|	Ном.Артикул КАК Артикул,
	|	Ном.Наименование КАК НоменклатураНаименование,
	|	Ном.ВесЕдиницаИзмерения КАК ЕдиницаИзмеренияВеса,
	|	Ном.Код КАК SKU,
	|	Ном.ВесЧислитель КАК ВесНетто,
	|	Ном.НаборУпаковок КАК НаборУпаковок,
	|	Ном._Упаковка КАК ОсновнаяУпаковка,
	|	Ном.НаименованиеПолное КАК НоменклатураНаименованиеПолное,
	|	Ном.КоэффициентЕдиницыДляОтчетов КАК Кфц,
	|	Ном.КодТНВЭД КАК КодТНВЭД,
	|	Ном._Фабрикат КАК Фабрикат,
	|	Ном._КоличествоФабрикатаВУпаковке КАК КоличествоФабрикатаВУпаковке,
	|	Ном.ЦеноваяГруппа КАК ЦеноваяГруппа,
	|	ВЫРАЗИТЬ(Ном.Описание КАК СТРОКА(1024)) КАК Описание,
	|	ВЫБОР
	|		КОГДА Ном.НаборУпаковок = ЗНАЧЕНИЕ(Справочник.НаборыУпаковок.ИндивидуальныйДляНоменклатуры)
	|			ТОГДА Ном.Ссылка
	|		ИНАЧЕ Ном.НаборУпаковок
	|	КОНЕЦ КАК ВладелецНабораУпаковок
	|ПОМЕСТИТЬ Тов
	|ИЗ
	|	Справочник.AMS_Продукция КАК Прод
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.AMS_Продукция.Товары КАК ПродТовары
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|			ПО ПродТовары.Номенклатура = Ном.Ссылка
	|		ПО Прод.Ссылка = ПродТовары.Ссылка
	|ГДЕ
	|	НЕ Прод.ЭтоГруппа
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Тов.Номенклатура КАК Номенклатура,
	|	Штрихкоды.Штрихкод КАК ШтрихкодШт
	|ПОМЕСТИТЬ ШтрихЕд1
	|ИЗ
	|	Тов КАК Тов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК Штрихкоды
	|		ПО Тов.Номенклатура = Штрихкоды.Номенклатура
	|ГДЕ
	|	(Штрихкоды.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|	ИЛИ Штрихкоды.Упаковка.Числитель = 1)
	|	И Штрихкоды.Номенклатура В
	|		(ВЫБРАТЬ
	|			т.Номенклатура КАК Номенклатура
	|		ИЗ
	|			Тов КАК т)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Тов.Номенклатура КАК Номенклатура,
	|	Штрихкоды.Штрихкод КАК ШтрихкодШт
	|ПОМЕСТИТЬ ШтрихЕд2
	|ИЗ
	|	Тов КАК Тов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений._ШтрихкодыКанистр КАК Штрихкоды
	|		ПО Тов.Номенклатура = Штрихкоды.Номенклатура
	|ГДЕ
	|	Штрихкоды.Номенклатура В
	|		(ВЫБРАТЬ
	|			т.Номенклатура КАК Номенклатура
	|		ИЗ
	|			Тов КАК т)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Тов.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ШтрихЕд1.ШтрихкодШт, ШтрихЕд2.ШтрихкодШт) КАК ШтрихкодШт
	|ПОМЕСТИТЬ ШтрихЕд
	|ИЗ
	|	Тов КАК Тов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ШтрихЕд1 КАК ШтрихЕд1
	|		ПО Тов.Номенклатура = ШтрихЕд1.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ШтрихЕд2 КАК ШтрихЕд2
	|		ПО Тов.Номенклатура = ШтрихЕд2.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Тов.Номенклатура КАК Номенклатура,
	|	Штрихкоды.Штрихкод КАК ШтрихкодУпак
	|ПОМЕСТИТЬ ШтрихКор
	|ИЗ
	|	Тов КАК Тов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК Штрихкоды
	|		ПО Тов.Номенклатура = Штрихкоды.Номенклатура
	|ГДЕ
	|	Штрихкоды.Упаковка = Штрихкоды.Номенклатура._Упаковка
	|	И Штрихкоды.Номенклатура В
	|		(ВЫБРАТЬ
	|			т.Номенклатура КАК Номенклатура
	|		ИЗ
	|			Тов КАК т)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Тов.Номенклатура КАК Номенклатура,
	|	Штрихкоды.Штрихкод КАК ШтрихкодПал
	|ПОМЕСТИТЬ ШтрихПал
	|ИЗ
	|	Тов КАК Тов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК Штрихкоды
	|		ПО Тов.Номенклатура = Штрихкоды.Номенклатура
	|ГДЕ
	|	Штрихкоды.Упаковка.ЕдиницаИзмерения.Наименование = ""пал""
	|	И Штрихкоды.Номенклатура В
	|		(ВЫБРАТЬ
	|			т.Номенклатура КАК Номенклатура
	|		ИЗ
	|			Тов КАК т)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Тов.Номенклатура КАК Номенклатура,
	|	Упак.Ссылка КАК ШтЕд,
	|	Упак.Вес КАК ШтВес,
	|	Упак.Глубина КАК ШтДлина,
	|	Упак.Ширина КАК ШтШирина,
	|	Упак.Высота КАК ШтВысота,
	|	Упак.Объем КАК ШтОбъем,
	|	Упак.Типоразмер КАК ШтТипоразмер
	|ПОМЕСТИТЬ ЕдШт
	|ИЗ
	|	Тов КАК Тов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК Упак
	|		ПО Тов.ВладелецНабораУпаковок = Упак.Владелец
	|		ИЛИ Тов.Номенклатура = Упак.Владелец
	|ГДЕ
	|	Упак.Числитель = 1
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Тов.Номенклатура КАК Номенклатура,
	|	Упак.Ссылка КАК КорЕд,
	|	Упак.Вес КАК КорВес,
	|	Упак.Глубина КАК КорДлина,
	|	Упак.Ширина КАК КорШирина,
	|	Упак.Высота КАК КорВысота,
	|	Упак.Объем КАК КорОбъем,
	|	Упак.Типоразмер КАК КорТипоразмер,
	|	Упак.Числитель / ВЫБОР
	|		КОГДА Упак.Знаменатель = 0
	|			ТОГДА 1
	|		ИНАЧЕ Упак.Знаменатель
	|	КОНЕЦ КАК КорКфц
	|ПОМЕСТИТЬ ЕдКор
	|ИЗ
	|	Тов КАК Тов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК Упак
	|		ПО Тов.ОсновнаяУпаковка = Упак.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Тов.Номенклатура КАК Номенклатура,
	|	Упак.Ссылка КАК ПалЕд,
	|	Упак.Вес КАК ПалВес,
	|	Упак.Высота КАК ПалВысота,
	|	Упак.Объем КАК ПалОбъем,
	|	Упак.Типоразмер КАК ПалТипоразмер,
	|	Упак.Числитель / ВЫБОР
	|		КОГДА Упак.Знаменатель = 0
	|			ТОГДА 1
	|		ИНАЧЕ Упак.Знаменатель
	|	КОНЕЦ КАК КолУпакПалета
	|ПОМЕСТИТЬ ЕдПал
	|ИЗ
	|	Тов КАК Тов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК Упак
	|		ПО Тов.ВладелецНабораУпаковок = Упак.Владелец
	|ГДЕ
	|	Упак.ЕдиницаИзмерения.НаименованиеПолное = ""Палета""
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Тов.ВидПродукции КАК ВидПродукции,
	|	Тов.ВидПродукцииНаименование КАК ВидПродукцииНаименование,
	|	Тов.НазначениеПродукции КАК НазначениеПродукции,
	|	Тов.НазначениеПродукцииНаименование КАК НазначениеПродукцииНаименование,
	|	Тов.НомерСтроки КАК НомерСтроки,
	|	Тов.SKU КАК SKU,
	|	Тов.Артикул КАК Артикул,
	|	Тов.Номенклатура КАК Номенклатура,
	|	Тов.НоменклатураНаименование КАК НоменклатураНаименование,
	|	Тов.НоменклатураНаименованиеПолное КАК НоменклатураНаименованиеПолное,
	|	Тов.Описание КАК Описание,
	|	Тов.ОсновнаяУпаковка КАК ОсновнаяУпаковка,
	|	Тов.ТоварныйЗнак КАК Бренд,
	|	Тов.ТоварныйЗнакПорядок КАК БрендПорядок,
	|	Тов.Маркер КАК Маркер,
	|	Тов.УпаковкаСтрока КАК УпаковкаСтрока,
	|	Тов.ОбъемСтрока КАК ОбъемСтрока,
	|	Тов.СрокГодности КАК СрокГодности,
	|	Тов.Прайс КАК Прайс,
	|	Тов.Заказ КАК Заказ,
	|	Тов.Подбор КАК Подбор,
	|	Тов.В2В КАК В2В,
	|	Тов.ЧестныйЗнак КАК ЧестныйЗнак,
	|	Тов.НаборУпаковок КАК НаборУпаковок,
	|	Тов.ВладелецНабораУпаковок КАК ВладелецНабораУпаковок,
	|	Тов.Кфц КАК Кфц,
	|	Тов.КодТНВЭД КАК КодТНВЭД,
	|	Тов.Фабрикат КАК Фабрикат,
	|	Тов.КоличествоФабрикатаВУпаковке КАК КоличествоФабрикатаВУпаковке,
	|	Тов.ЦеноваяГруппа КАК ЦеноваяГруппа,
	|	Тов.ЕдиницаИзмеренияВеса КАК ЕдиницаИзмеренияВеса,
	|	Тов.ВесНетто КАК ВесНетто,
	|	ШтрихЕд.ШтрихкодШт КАК ШтрихкодШт,
	|	ЕдШт.ШтЕд КАК ШтЕд,
	|	ЕдШт.ШтВес КАК ШтВес,
	|	ЕдШт.ШтДлина КАК ШтДлина,
	|	ЕдШт.ШтШирина КАК ШтШирина,
	|	ЕдШт.ШтВысота КАК ШтВысота,
	|	ЕдШт.ШтОбъем КАК ШтОбъем,
	|	ЕдШт.ШтТипоразмер КАК ШтТипоразмер,
	|	ШтрихКор.ШтрихкодУпак КАК ШтрихкодУпак,
	|	ЕдКор.КорЕд КАК КорЕд,
	|	ЕдКор.КорВес КАК КорВес,
	|	ЕдКор.КорДлина КАК КорДлина,
	|	ЕдКор.КорШирина КАК КорШирина,
	|	ЕдКор.КорВысота КАК КорВысота,
	|	ЕдКор.КорОбъем КАК КорОбъем,
	|	ЕдКор.КорТипоразмер КАК КорТипоразмер,
	|	ЕдКор.КорКфц КАК КорКфц,
	|	ШтрихПал.ШтрихкодПал КАК ШтрихкодПал,
	|	ЕдПал.ПалЕд КАК ПалЕд,
	|	ЕдПал.ПалВес КАК ПалВес,
	|	ЕдПал.ПалВысота КАК ПалВысота,
	|	ЕдПал.ПалОбъем КАК ПалОбъем,
	|	ЕдПал.ПалТипоразмер КАК ПалТипоразмер,
	|	ЕдПал.КолУпакПалета КАК КолУпакПалета,
	|	ВЫБОР
	|		КОГДА Тов.ВидНоменклатуры = &ВидНомЦех1
	|			ТОГДА &Цех1
	|		КОГДА Тов.ВидНоменклатуры = &ВидНомЦех2
	|			ТОГДА &Цех2
	|		КОГДА Тов.ВидНоменклатуры = &ВидНомЦех3
	|			ТОГДА &Цех3
	|		КОГДА Тов.ВидНоменклатуры = &ВидНомНабор
	|			ТОГДА &СкладНаборов
	|		КОГДА Тов.ВидНоменклатуры = &ВидНомТовар
	|			ТОГДА &СкладПродукции
	|	КОНЕЦ КАК Склад
	|ПОМЕСТИТЬ Продукция
	|ИЗ
	|	Тов КАК Тов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ШтрихКор КАК ШтрихКор
	|		ПО Тов.Номенклатура = ШтрихКор.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ШтрихПал КАК ШтрихПал
	|		ПО Тов.Номенклатура = ШтрихПал.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЕдШт КАК ЕдШт
	|		ПО Тов.Номенклатура = ЕдШт.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЕдКор КАК ЕдКор
	|		ПО Тов.Номенклатура = ЕдКор.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЕдПал КАК ЕдПал
	|		ПО Тов.Номенклатура = ЕдПал.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ШтрихЕд КАК ШтрихЕд
	|		ПО Тов.Номенклатура = ШтрихЕд.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура";

	Запрос.Выполнить();
КонецПроцедуры

Процедура ПолучитьПродукцию(МВТ, ПараметрыМВТ) Экспорт
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = МВТ;

	//@skip-check bsl-legacy-check-string-literal
	РодительПартнера = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыМВТ.Партнер, "Родитель", Истина);

	Запрос.УстановитьПараметр("ВидНомЦех1",  ВидНоменклатурыПродукцияЦеха1());
	Запрос.УстановитьПараметр("ВидНомЦех2",  ВидНоменклатурыПродукцияЦеха2());
	Запрос.УстановитьПараметр("ВидНомЦех3",  ВидНоменклатурыПродукцияЦеха3());
	Запрос.УстановитьПараметр("ВидНомНабор", ВидНоменклатурыПродукцияНаборы());
	Запрос.УстановитьПараметр("ВидНомТовар", ВидНоменклатурыТовар());
	
	Запрос.УстановитьПараметр("Цех1", Цех1());
	Запрос.УстановитьПараметр("Цех2", Цех2());
	Запрос.УстановитьПараметр("Цех3", Цех3());
	Запрос.УстановитьПараметр("СкладНаборов",   СкладСборкиНаборов());
	Запрос.УстановитьПараметр("СкладПродукции", СкладПродукции());
	
	Запрос.УстановитьПараметр("ДатаЦены",           ПараметрыМВТ.ДатаЦены);
	Запрос.УстановитьПараметр("МЕГА",               ПараметрыМВТ.МЕГА);
	Запрос.УстановитьПараметр("Соглашение",         ПараметрыМВТ.Соглашение);
	Запрос.УстановитьПараметр("ВидЦены",            ПараметрыМВТ.ВидЦены);
	Запрос.УстановитьПараметр("РодительИлиПартнер", ?(ЗначениеЗаполнено(РодительПартнера), РодительПартнера, ПараметрыМВТ.Партнер));
	Запрос.УстановитьПараметр("Партнер",            ПараметрыМВТ.Партнер);
	Запрос.УстановитьПараметр("ПравилоПродажи",     ПараметрыМВТ.ПравилоПродажи);
	Запрос.УстановитьПараметр("Дефис",              "-");

	Запрос.Текст =
	"ВЫБРАТЬ
	|	Прод.Родитель КАК ТипПродукции,
	|	Прод.Родитель.Наименование КАК ТипПродукцииНаименование,
	|	Прод.Ссылка КАК НазначениеПродукции,
	|	Прод.Наименование КАК НазначениеПродукцииНаименование,
	|	ПродТов.ТоварныйЗнак КАК ТоварныйЗнак,
	|	ПродТов.ТоварныйЗнак.Порядок КАК ТоварныйЗнакПорядок,
	|	ПродТов.НомерСтроки КАК НомерСтроки,
	|	ПродТов.Номенклатура КАК Номенклатура,
	|	Ном.Наименование КАК Наименование,
	|	Ном.НаименованиеПолное КАК НаименованиеПолное,
	|	ПродТов.Маркер КАК Маркер,
	|	ПродТов.Объем КАК ОбъемСтрока,
	|	ПродТов.СрокГодности КАК СрокГодности,
	|	ПродТов.Упаковка КАК УпаковкаСтрока,
	|	Ном._Упаковка КАК Упаковка,
	|	Ном._Упаковка.Вес КАК ВесУпаковка,
	|	Ном._Упаковка.Объем КАК ОбъемУпаковка,
	|	Ном.Код КАК Код,
	|	Ном.Артикул КАК Артикул,
	|	Ном.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Ном.ВидНоменклатуры КАК ВидНоменклатуры,
	|	ВЫБОР
	|		КОГДА Ном.ВидНоменклатуры = &ВидНомЦех1
	|			ТОГДА &Цех1
	|		КОГДА Ном.ВидНоменклатуры = &ВидНомЦех2
	|			ТОГДА &Цех2
	|		КОГДА Ном.ВидНоменклатуры = &ВидНомЦех3
	|			ТОГДА &Цех3
	|		КОГДА Ном.ВидНоменклатуры = &ВидНомНабор
	|			ТОГДА &СкладНаборов
	|		КОГДА Ном.ВидНоменклатуры = &ВидНомТовар
	|			ТОГДА &СкладПродукции
	|	КОНЕЦ КАК Склад,
	|	Ном.КоэффициентЕдиницыДляОтчетов КАК КоличествоУпаковка,
	|	Ном.КоэффициентЕдиницыДляОтчетов КАК Кфц,
	|	Ном._Фабрикат КАК Фабрикат,
	|	Ном._КоличествоФабрикатаВУпаковке КАК КоличествоФабрикатаВУпаковке,
	|	Ном.ЦеноваяГруппа КАК ЦеноваяГруппа,
	|	ВЫБОР
	|		КОГДА Ном.НаборУпаковок = ЗНАЧЕНИЕ(Справочник.НаборыУпаковок.ИндивидуальныйДляНоменклатуры)
	|			ТОГДА Ном.Ссылка
	|		ИНАЧЕ Ном.НаборУпаковок
	|	КОНЕЦ КАК ВладелецНабораУпаковок,
	|	Ном.КодТНВЭД КАК КодТНВЭД,
	|	ПродТов.КфцРРЦ КАК КфцРРЦ,
	|	Ном.СтавкаНДС КАК СтавкаНДС,
	|	Ном.СтавкаНДС.Ставка КАК СтавкаНДССтавка,
	|	ПродТов.Прайс КАК Прайс,
	|	ПродТов.Заказ КАК Заказ,
	|	ПродТов.Подбор КАК Подбор,
	|	ПродТов.В2В КАК В2В,
	|	ПродТов.ЧестныйЗнак КАК ЧестныйЗнак
	|ПОМЕСТИТЬ Ном
	|ИЗ
	|	Справочник.AMS_Продукция КАК Прод
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.AMS_Продукция.Товары КАК ПродТов
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|			ПО ПродТов.Номенклатура = Ном.Ссылка
	|		ПО Прод.Ссылка = ПродТов.Ссылка
	|ГДЕ
	|	НЕ Прод.ЭтоГруппа
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ном.Номенклатура КАК Номенклатура,
	|	СогТов.ВидЦены КАК ВидЦены,
	|	СогТов.Цена КАК Цена
	|ПОМЕСТИТЬ ЦенДоп
	|ИЗ
	|	Ном КАК Ном
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами.Товары КАК СогТов
	|		ПО Ном.Номенклатура = СогТов.Номенклатура
	|ГДЕ
	|	СогТов.Ссылка = &Соглашение
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ном.Номенклатура КАК Номенклатура,
	|	СогЦенГр.ВидЦен КАК ВидЦены
	|ПОМЕСТИТЬ ВидЦенЦГ
	|ИЗ
	|	Ном КАК Ном
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами.ЦеновыеГруппы КАК СогЦенГр
	|		ПО Ном.ЦеноваяГруппа = СогЦенГр.ЦеноваяГруппа
	|ГДЕ
	|	СогЦенГр.Ссылка = &Соглашение
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВидЦенЦГ.Номенклатура КАК Номенклатура,
	|	ВидЦенЦГ.ВидЦены КАК ВидЦены,
	|	РегЦены.Цена КАК Цена
	|ПОМЕСТИТЬ ЦенЦГ
	|ИЗ
	|	ВидЦенЦГ КАК ВидЦенЦГ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаЦены,) КАК РегЦены
	|		ПО ВидЦенЦГ.Номенклатура = РегЦены.Номенклатура
	|		И ВидЦенЦГ.ВидЦены = РегЦены.ВидЦены
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ном.Номенклатура КАК Номенклатура,
	|	РегЦены.ВидЦены КАК ВидЦены,
	|	РегЦены.Цена КАК Цена
	|ПОМЕСТИТЬ ЦенОбщ
	|ИЗ
	|	Ном КАК Ном
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаЦены,) КАК РегЦены
	|		ПО Ном.Номенклатура = РегЦены.Номенклатура
	|		И РегЦены.ВидЦены = &ВидЦены
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ном.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ЦенДоп.ВидЦены, ЕСТЬNULL(ЦенЦГ.ВидЦены, ЦенОбщ.ВидЦены)) КАК ВидЦены,
	|	ЕСТЬNULL(ЦенДоп.Цена, ЕСТЬNULL(ЦенЦГ.Цена, ЦенОбщ.Цена)) КАК ЦенаСоглашение
	|ПОМЕСТИТЬ ЦенаСогл
	|ИЗ
	|	Ном КАК Ном
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЦенДоп КАК ЦенДоп
	|		ПО Ном.Номенклатура = ЦенДоп.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЦенЦГ КАК ЦенЦГ
	|		ПО Ном.Номенклатура = ЦенЦГ.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЦенОбщ КАК ЦенОбщ
	|		ПО Ном.Номенклатура = ЦенОбщ.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РегНомКлиентов.Номенклатура КАК Номенклатура,
	|	РегНомКлиентов.ПорядковыйНомер КАК ПорядковыйНомерКлиента,
	|	РегНомКлиентов.Артикул КАК АртикулКлиента
	|ПОМЕСТИТЬ НомКлиента
	|ИЗ
	|	РегистрСведений._НоменклатураКлиентов КАК РегНомКлиентов
	|ГДЕ
	|	РегНомКлиентов.Партнер = &РодительИлиПартнер
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеалТовары.Номенклатура КАК Номенклатура,
	|	ИСТИНА КАК ТоварКлиента
	|ПОМЕСТИТЬ ТовКлиент
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК Реал
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеалТовары
	|		ПО Реал.Ссылка = РеалТовары.Ссылка
	|ГДЕ
	|	Реал.Партнер = &Партнер
	|	И Реал.Дата > ДОБАВИТЬКДАТЕ(&ДатаЦены, ГОД, -1)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КомиссТовары.Номенклатура,
	|	ИСТИНА
	|ИЗ
	|	Документ.ПередачаТоваровХранителю.Товары КАК КомиссТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю КАК Комисс
	|		ПО КомиссТовары.Ссылка = Комисс.Ссылка
	|		И КомиссТовары.ЗаказКлиента = Комисс.Ссылка
	|ГДЕ
	|	Комисс.Партнер = &Партнер
	|	И Комисс.Дата > ДОБАВИТЬКДАТЕ(&ДатаЦены, ГОД, -1)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ТовКлиент.Номенклатура КАК Номенклатура,
	|	ТовКлиент.ТоварКлиента КАК ТоварКлиента
	|ПОМЕСТИТЬ ТовКлиента
	|ИЗ
	|	ТовКлиент КАК ТовКлиент
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	ИСТИНА КАК ВнеПрайса
	|ПОМЕСТИТЬ ТовКонтракт
	|ИЗ
	|	Справочник.AMS_ПравилаПродаж КАК д
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.AMS_ПравилаПродаж.ТоварыВнеПрайса КАК т
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Ном КАК Ном
	|			ПО Ном.Номенклатура = т.Номенклатура
	|		ПО д.Ссылка = т.Ссылка
	|ГДЕ
	|	д.Ссылка = &ПравилоПродажи
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ном.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА ШтрихкодыЕд.Штрихкод ЕСТЬ NULL
	|			ТОГДА ШтрихкодыКан.Штрихкод
	|		ИНАЧЕ ШтрихкодыЕд.Штрихкод
	|	КОНЕЦ КАК ШтрихкодЕд,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|			КОГДА ШтрихкодыЕд.Штрихкод ЕСТЬ NULL
	|				ТОГДА ШтрихкодыКан.Штрихкод
	|			ИНАЧЕ ШтрихкодыЕд.Штрихкод
	|		КОНЕЦ = ШтрихкодыУпак.Штрихкод
	|			ТОГДА &Дефис
	|		ИНАЧЕ ШтрихкодыУпак.Штрихкод
	|	КОНЕЦ КАК ШтрихкодУпак
	|ПОМЕСТИТЬ ШтрифКоды
	|ИЗ
	|	Ном КАК Ном
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыЕд
	|		ПО Ном.Номенклатура = ШтрихкодыЕд.Номенклатура
	|		И (ШтрихкодыЕд.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|		ИЛИ ШтрихкодыЕд.Упаковка.Числитель = 1)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений._ШтрихкодыКанистр КАК ШтрихкодыКан
	|		ПО Ном.Номенклатура = ШтрихкодыКан.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыУпак
	|		ПО Ном.Номенклатура = ШтрихкодыУпак.Номенклатура
	|		И Ном.Номенклатура.КоэффициентЕдиницыДляОтчетов = ШтрихкодыУпак.Упаковка.Числитель
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ном.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА Пал.Числитель ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ Пал.Числитель / Ном.Кфц
	|	КОНЕЦ КАК КоличествоПалета
	|ПОМЕСТИТЬ Палет
	|ИЗ
	|	Ном КАК Ном
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК Пал
	|		ПО Ном.ВладелецНабораУпаковок = Пал.Владелец
	|		И Пал.ЕдиницаИзмерения.Код = ""999""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Ном.ТипПродукции КАК ТипПродукции,
	|	Ном.ТипПродукцииНаименование КАК ТипПродукцииНаименование,
	|	Ном.НазначениеПродукции КАК НазначениеПродукции,
	|	Ном.НазначениеПродукцииНаименование КАК НазначениеПродукцииНаименование,
	|	Ном.ТоварныйЗнак КАК ТоварныйЗнак,
	|	Ном.ТоварныйЗнакПорядок КАК ТоварныйЗнакПорядок,
	|	Ном.НомерСтроки КАК НомерСтроки,
	|	Ном.Номенклатура КАК Номенклатура,
	|	Ном.Наименование КАК Наименование,
	|	Ном.НаименованиеПолное КАК НаименованиеПолное,
	|	Ном.Маркер КАК Маркер,
	|	Ном.СрокГодности КАК СрокГодности,
	|	Ном.УпаковкаСтрока КАК УпаковкаСтрока,
	|	Ном.Упаковка КАК Упаковка,
	|	Ном.ВесУпаковка КАК ВесУпаковка,
	|	Ном.ОбъемСтрока КАК ОбъемСтрока,
	|	Ном.ОбъемУпаковка КАК ОбъемУпаковка,
	|	Ном.Код КАК Код,
	|	Ном.Артикул КАК Артикул,
	|	Ном.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Ном.ВидНоменклатуры КАК ВидНоменклатуры,
	|	Ном.Склад КАК Склад,
	|	Ном.КоличествоУпаковка КАК КоличествоУпаковка,
	|	Ном.Кфц КАК Кфц,
	|	Палет.КоличествоПалета КАК КоличествоПалета,
	|	Ном.Фабрикат КАК Фабрикат,
	|	Ном.КоличествоФабрикатаВУпаковке КАК КоличествоФабрикатаВУпаковке,
	|	Ном.ЦеноваяГруппа КАК ЦеноваяГруппа,
	|	ЦенаСогл.ВидЦены КАК ВидЦеныСоглашение,
	|	ЦенаСогл.ЦенаСоглашение КАК ЦенаСоглашение,
	|	НомКлиента.ПорядковыйНомерКлиента КАК ПорядковыйНомерКлиента,
	|	НомКлиента.АртикулКлиента КАК АртикулКлиента,
	|	ШтрифКоды.ШтрихкодЕд КАК ШтрихкодЕд,
	|	ШтрифКоды.ШтрихкодУпак КАК ШтрихкодУпак,
	|	Ном.КодТНВЭД КАК КодТНВЭД,
	|	Ном.КфцРРЦ КАК КфцРРЦ,
	|	Ном.СтавкаНДС КАК СтавкаНДС,
	|	Ном.СтавкаНДССтавка КАК СтавкаНДССтавка,
	|	Ном.Прайс КАК Прайс,
	|	ЕСТЬNULL(ТовКонтракт.ВнеПрайса, ЛОЖЬ) КАК ВнеПрайса,
	|	Ном.Заказ КАК Заказ,
	|	Ном.Подбор КАК Подбор,
	|	Ном.В2В КАК В2В,
	|	Ном.ЧестныйЗнак КАК ЧестныйЗнак
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	Ном КАК Ном
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЦенаСогл КАК ЦенаСогл
	|		ПО Ном.Номенклатура = ЦенаСогл.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ НомКлиента КАК НомКлиента
	|		ПО Ном.Номенклатура = НомКлиента.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ШтрифКоды КАК ШтрифКоды
	|		ПО Ном.Номенклатура = ШтрифКоды.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТовКонтракт КАК ТовКонтракт
	|		ПО Ном.Номенклатура = ТовКонтракт.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТовКлиента КАК ТовКлиента
	|		ПО Ном.Номенклатура = ТовКлиента.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Палет КАК Палет
	|		ПО Ном.Номенклатура = Палет.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура";

	Запрос.Выполнить();
КонецПроцедуры

Процедура ПолучитьСтоимостьТовара(МВТ, Парам) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = МВТ;

	Запрос.УстановитьПараметр("Номенклатура", Парам.Номенклатура);
	Запрос.УстановитьПараметр("Дата", Парам.Дата);
	Запрос.УстановитьПараметр("ВидНоменклатурыМатериал", ВидНоменклатурыМатериал());

	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Ном.Ссылка КАК Номенклатура
	|ПОМЕСТИТЬ Тов1
	|ИЗ
	|	Справочник.Номенклатура КАК Ном
	|ГДЕ
	|	Ном.Ссылка В (&Номенклатура)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СборкаД.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(СборкаД.Дата) КАК Дата
	|ПОМЕСТИТЬ Давал1
	|ИЗ
	|	Тов1 КАК Тов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СборкаТоваров КАК СборкаД
	|		ПО Тов.Номенклатура = СборкаД.Номенклатура
	|ГДЕ
	|	Тов.Номенклатура.ВидНоменклатуры = &ВидНоменклатурыМатериал
	|СГРУППИРОВАТЬ ПО
	|	СборкаД.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Сборка.Ссылка КАК Ссылка,
	|	Давал1.Номенклатура КАК Номенклатура,
	|	Сборка.Количество КАК Количество,
	|	СборкаТовары.Номенклатура КАК НоменклатураПереработки,
	|	СборкаТовары.Количество КАК КоличествоПереработки
	|ПОМЕСТИТЬ Давал2
	|ИЗ
	|	Давал1 КАК Давал1
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СборкаТоваров КАК Сборка
	|			ПРАВОЕ СОЕДИНЕНИЕ Документ.СборкаТоваров.Товары КАК СборкаТовары
	|			ПО (СборкаТовары.Ссылка = Сборка.Ссылка)
	|		ПО Давал1.Номенклатура = Сборка.Номенклатура
	|		И Давал1.Дата = Сборка.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Тов1.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ Тов2
	|ИЗ
	|	Тов1 КАК Тов1
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Давал2.НоменклатураПереработки
	|ИЗ
	|	Давал2 КАК Давал2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Тов2.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	Тов2 КАК Тов2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(Себест.Период) КАК Период
	|ПОМЕСТИТЬ Закупка1
	|ИЗ
	|	Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров КАК Себест
	|		ПО Товары.Номенклатура = Себест.АналитикаУчетаНоменклатуры.Номенклатура
	|ГДЕ
	|	Себест.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщика)
	|	И Себест.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И Себест.Период <= &Дата
	|	И Себест.Стоимость > 0
	|СГРУППИРОВАТЬ ПО
	|	Товары.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Закупка1.Номенклатура КАК Номенклатура,
	|	Закупка1.Период КАК Период,
	|	Себест.Стоимость / Себест.Количество КАК Цена
	|ПОМЕСТИТЬ Закупка2
	|ИЗ
	|	Закупка1 КАК Закупка1
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров КАК Себест
	|		ПО Закупка1.Номенклатура = Себест.АналитикаУчетаНоменклатуры.Номенклатура
	|		И Закупка1.Период = Себест.Период
	|ГДЕ
	|	Себест.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщика)
	|	И Себест.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И Себест.Период <= &Дата
	|	И Себест.Стоимость > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(Себест.Период) КАК Период
	|ПОМЕСТИТЬ Оприход1
	|ИЗ
	|	Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров КАК Себест
	|		ПО Товары.Номенклатура = Себест.АналитикаУчетаНоменклатуры.Номенклатура
	|ГДЕ
	|	Себест.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОприходованиеТоваров)
	|	И Себест.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И Себест.Период <= &Дата
	|	И Себест.Стоимость > 0
	|СГРУППИРОВАТЬ ПО
	|	Товары.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Оприход1.Номенклатура КАК Номенклатура,
	|	Оприход1.Период КАК Период,
	|	Себест.Стоимость / Себест.Количество КАК Цена
	|ПОМЕСТИТЬ Оприход2
	|ИЗ
	|	Оприход1 КАК Оприход1
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров КАК Себест
	|		ПО Оприход1.Номенклатура = Себест.АналитикаУчетаНоменклатуры.Номенклатура
	|		И Оприход1.Период = Себест.Период
	|ГДЕ
	|	Себест.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОприходованиеТоваров)
	|	И Себест.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И Себест.Период <= &Дата
	|	И Себест.Стоимость > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА Закупка2.Цена ЕСТЬ NULL
	|			ТОГДА ЕСТЬNULL(Оприход2.Цена, 0)
	|		ИНАЧЕ Закупка2.Цена
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ ЦеныВсе
	|ИЗ
	|	Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Закупка2 КАК Закупка2
	|		ПО Товары.Номенклатура = Закупка2.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Оприход2 КАК Оприход2
	|		ПО Товары.Номенклатура = Оприход2.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Давал2.Номенклатура КАК Номенклатура,
	|	Давал2.Количество КАК Количество,
	|	Давал2.НоменклатураПереработки КАК НоменклатураПереработки,
	|	Давал2.КоличествоПереработки КАК КоличествоПереработки,
	|	ЦеныВсе.Цена КАК ЦенаСырья,
	|	Давал2.КоличествоПереработки * ЦеныВсе.Цена КАК СуммаСырья,
	|	Давал2.КоличествоПереработки * ЦеныВсе.Цена / Давал2.Количество КАК СуммаСырьяЕд
	|ПОМЕСТИТЬ Давал3
	|ИЗ
	|	Давал2 КАК Давал2
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЦеныВсе КАК ЦеныВсе
	|		ПО Давал2.НоменклатураПереработки = ЦеныВсе.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Давал3.Номенклатура КАК Номенклатура,
	|	СУММА(Давал3.СуммаСырьяЕд) КАК Цена
	|ПОМЕСТИТЬ Давал4
	|ИЗ
	|	Давал3 КАК Давал3
	|СГРУППИРОВАТЬ ПО
	|	Давал3.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Давал2.Номенклатура КАК Номенклатура,
	|	Цены.Цена КАК Цена
	|ПОМЕСТИТЬ ЦеныПреформ
	|ИЗ
	|	ЦеныВсе КАК Цены
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Давал2 КАК Давал2
	|		ПО Цены.Номенклатура = Давал2.НоменклатураПереработки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЦеныВсе.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(Давал4.Цена, ЦеныВсе.Цена) КАК Цена
	|ПОМЕСТИТЬ ЦенаТовара
	|ИЗ
	|	ЦеныВсе КАК ЦеныВсе
	|		ЛЕВОЕ СОЕДИНЕНИЕ Давал4 КАК Давал4
	|		ПО ЦеныВсе.Номенклатура = Давал4.Номенклатура
	|ГДЕ
	|	НЕ ЦеныВсе.Номенклатура В
	|		(ВЫБРАТЬ
	|			т.НоменклатураПереработки КАК Номенклатура
	|		ИЗ
	|			Давал2 КАК т)";

	Запрос.Выполнить();
КонецПроцедуры

#КонецОбласти

#Область Служебные_НеобходимоОпределитьКудаПоместить

Функция СформироватьМаршрутныйЛист(Парам) Экспорт
	ТабДок = Новый ТабличныйДокумент;
	
	ТабДок.АвтоМасштаб          = Истина;
	ТабДок.ОриентацияСтраницы   = ОриентацияСтраницы.Ландшафт;
	ТабДок.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_МаршрутныйЛист";

	Макет = Документы.AMS_ЛогистическийЛист.ПолучитьМакет("МаршрутныйЛист");

	ОблЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОблДоставка  = Макет.ПолучитьОбласть("Доставка");
	ОблВозврат   = Макет.ПолучитьОбласть("Возврат");
	ОблПодвоз    = Макет.ПолучитьОбласть("Подвоз");
	ОблПодвал    = Макет.ПолучитьОбласть("Подвал");

	Рез = ПолучитьРезультатЗапросаЛогистика(Парам);

	Если Рез.Пустой() Тогда
		Возврат ТабДок;
	КонецЕсли;

	Номер = 0;
	Выб1 = Рез.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выб1.Следующий() Цикл
		Направление = 0;
		Номер = Номер + 1;
		
		//Заголовок
		ЗаполнитьЗначенияСвойств(ОблЗаголовок.Параметры, Выб1);
		ОблЗаголовок.Параметры.Заголовок = "Маршрутный лист № " + ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(
			Парам.Номер, Ложь, Истина) + "/" + Номер + " от " + Формат(Парам.Дата, "ДЛФ=ДД");
		ОблЗаголовок.Параметры.ДатаПогрузки	 = Формат(Выб1.ВремяЗагрузки, "ДФ=""дд ММММ гггг 'г.'""");
		ОблЗаголовок.Параметры.ВремяПогрузки = Формат(Выб1.ВремяЗагрузки, "ДФ=""ЧЧ:мм""");
		ТабДок.Вывести(ОблЗаголовок);
		
		//Шапка
		Если Выб1.ТК Тогда
			ОблШапка  = Макет.ПолучитьОбласть("ШапкаТК");
			ОблСтрока = Макет.ПолучитьОбласть("СтрокаТК");
		Иначе
			ОблШапка  = Макет.ПолучитьОбласть("Шапка");
			ОблСтрока = Макет.ПолучитьОбласть("Строка");
		КонецЕсли;
		ТабДок.Вывести(ОблШапка);

		Выб = Выб1.Выбрать();
		Пока Выб.Следующий() Цикл
			//Направление
			Если Не (Направление = Выб.Направление) Тогда
				Счет = 0;
				Направление = Выб.Направление;

				Если Направление = 1 Тогда
					ТабДок.Вывести(ОблДоставка);
				ИначеЕсли Направление = 2 Тогда
					ТабДок.Вывести(ОблПодвоз);
				ИначеЕсли Направление = 3 Тогда
					ТабДок.Вывести(ОблВозврат);
				КонецЕсли;
			КонецЕсли;
			Счет = Счет + 1;

			ЗаполнитьЗначенияСвойств(ОблСтрока.Параметры, Выб);

			ОблСтрока.Параметры.Сч = Счет;

			Если Выб.СпособДоставки = Перечисления.СпособыДоставки.КПолучателюОпределяетСлужбаДоставки Тогда
				ОблСтрока.Параметры.Партнер = ОблСтрока.Параметры.Партнер.НаименованиеПолное 
				+ ?(ПустаяСтрока(Выб.ТранспортКлиента), "", Символы.ПС + "Транспорт: " + Выб.ТранспортКлиента) 
				+ ?(ПустаяСтрока(Выб.ДоверенностьКлиента), "", Символы.ПС + "Доверенность: " + Выб.ДоверенностьКлиента) 
				+ ?(ПустаяСтрока(Выб.ТелефонВодителяКлиента), "", Символы.ПС + "Телефон: " + Выб.ТелефонВодителяКлиента);
			КонецЕсли;

			ОблСтрока.Параметры.ВремяС	 = Формат(Выб.ВремяС, "ДФ=""ЧЧ:мм""");
			ОблСтрока.Параметры.ВремяПо	 = Формат(Выб.ВремяПо, "ДФ=""ЧЧ:мм""");

			ОблСтрока.Параметры.ДополнительнаяИнформация = ?(ПустаяСтрока(Выб.ДополнительнаяИнформация), "",
				Выб.ДополнительнаяИнформация + Символы.ПС) + "Менеджер: " + Выб.Менеджер + ?(Направление = 2,
				Символы.ПС + "Доставка в " + Выб.Склад, "");

			ОблСтрока.Параметры.Распоряжение = ?(ТипЗнч(Выб.Распоряжение) = Тип(
				"ДокументСсылка.AMS_ПередачаВПереработку"), "Передача в переработку № ", "УПД № ")
				+ ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выб.Номер, Ложь, Истина) + Символы.ПС + " от " + Формат(
				Выб.Дата, "ДЛФ=ДД");

			Если Выб.Направление = 1 Тогда
				Если Выб.СпособПередачиТоваров = 0 Тогда
					ОблСтрока.Параметры.Способ1 = "П";
					ОблСтрока.Параметры.Способ2 = "палетами";
				Иначе
					ОблСтрока.Параметры.Способ1 = "К";
					ОблСтрока.Параметры.Способ2 = "коробками";
				КонецЕсли;

				Если Выб.Обрешетка Тогда
					ОблСтрока.Параметры.Способ3 = "С ОБРЕШЕТКОЙ";
				Иначе
					ОблСтрока.Параметры.Способ3 = "БЕЗ ОБРЕШЕТКИ";
				КонецЕсли;
			КонецЕсли;

			ТабДок.Вывести(ОблСтрока);
		КонецЦикла;

		ОблПодвал.Параметры.Палет = "Итого количество палет: " + Выб1.Палет;
		ТабДок.Вывести(ОблПодвал);

		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЦикла;

	Возврат ТабДок;
КонецФункции

Функция ЕстьОперацияПечатьПоследняяСН(Документ)
	Если Не ЗначениеЗаполнено(Документ) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Документ", Документ);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Ссылка КАК Реализация
	|ПОМЕСТИТЬ док
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК т
	|ГДЕ
	|	т.Ссылка = &Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Документ КАК Документ,
	|	МАКСИМУМ(т.Период) КАК ДатаОтмены
	|ПОМЕСТИТЬ вт1
	|ИЗ
	|	РегистрСведений.AMS_ИсторияРеализации КАК т
	|ГДЕ
	|	т.Документ = &Документ
	|	И т.Событие = ЗНАЧЕНИЕ(Перечисление.AMS_СобытияРеализации.ОтменаПечати)
	|СГРУППИРОВАТЬ ПО
	|	т.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Документ КАК Документ,
	|	МАКСИМУМ(т.Период) КАК ДатаПечати
	|ПОМЕСТИТЬ вт2
	|ИЗ
	|	РегистрСведений.AMS_ИсторияРеализации КАК т
	|ГДЕ
	|	т.Документ = &Документ
	|	И т.Событие = ЗНАЧЕНИЕ(Перечисление.AMS_СобытияРеализации.ПечатьСН)
	|СГРУППИРОВАТЬ ПО
	|	т.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	док.Реализация КАК Реализация,
	|	ВЫБОР
	|		КОГДА вт1.ДатаОтмены ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|				КОГДА вт2.ДатаПечати ЕСТЬ NULL
	|					ТОГДА ЛОЖЬ
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|			КОГДА вт2.ДатаПечати > вт1.ДатаОтмены
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	КОНЕЦ КАК ЕстьПечать
	|ИЗ
	|	док КАК док
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт1 КАК вт1
	|		ПО док.Реализация = вт1.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт2 КАК вт2
	|		ПО док.Реализация = вт2.Документ";

	Рез = Запрос.Выполнить();
	Выб = Рез.Выбрать();
	Выб.Следующий();

	Возврат Выб.ЕстьПечать;
КонецФункции

Функция ЕстьОперацияПечатьПоследняяУПД(Документ)
	Если Не ЗначениеЗаполнено(Документ) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Документ", Документ);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Ссылка КАК Реализация
	|ПОМЕСТИТЬ док
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК т
	|ГДЕ
	|	т.Ссылка = &Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Документ КАК Документ,
	|	МАКСИМУМ(т.Период) КАК ДатаОтмены
	|ПОМЕСТИТЬ вт1
	|ИЗ
	|	РегистрСведений.AMS_ИсторияРеализации КАК т
	|ГДЕ
	|	т.Документ = &Документ
	|	И т.Событие = ЗНАЧЕНИЕ(Перечисление.AMS_СобытияРеализации.ОтменаПечати)
	|СГРУППИРОВАТЬ ПО
	|	т.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Документ КАК Документ,
	|	МАКСИМУМ(т.Период) КАК ДатаПечати
	|ПОМЕСТИТЬ вт2
	|ИЗ
	|	РегистрСведений.AMS_ИсторияРеализации КАК т
	|ГДЕ
	|	т.Документ = &Документ
	|	И (т.Событие = ЗНАЧЕНИЕ(Перечисление.AMS_СобытияРеализации.ПечатьУПД)
	|	ИЛИ т.Событие = ЗНАЧЕНИЕ(Перечисление.AMS_СобытияРеализации.ПечатьТОРГ12))
	|СГРУППИРОВАТЬ ПО
	|	т.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	док.Реализация КАК Реализация,
	|	ВЫБОР
	|		КОГДА вт1.ДатаОтмены ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|				КОГДА вт2.ДатаПечати ЕСТЬ NULL
	|					ТОГДА ЛОЖЬ
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|			КОГДА вт2.ДатаПечати > вт1.ДатаОтмены
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	КОНЕЦ КАК ЕстьПечать
	|ИЗ
	|	док КАК док
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт1 КАК вт1
	|		ПО док.Реализация = вт1.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт2 КАК вт2
	|		ПО док.Реализация = вт2.Документ";

	Рез = Запрос.Выполнить();
	Выб = Рез.Выбрать();
	Выб.Следующий();

	Возврат Выб.ЕстьПечать;
КонецФункции

Функция ПолучитьРезультатЗапросаЛогистика(Парам)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Парам.Лист);
	Запрос.УстановитьПараметр("Перевозчик", Парам.Перевозчик);

	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Рейсы.Ссылка КАК Лист,
	|	Рейсы.Ссылка.Дата КАК Дата,
	|	Рейсы.Ссылка.Номер КАК Номер,
	|	Авто._Перевозчик КАК Перевозчик,
	|	Рейсы.ТранспортноеСредство КАК ТранспортноеСредство,
	|	Рейсы.Водитель КАК Водитель,
	|	Рейсы.ВремяЗагрузки КАК ВремяЗагрузки,
	|	Распоряжения.ПорядокВМаршруте КАК ПорядокВМаршруте,
	|	Распоряжения.Распоряжение КАК Распоряжение
	|ПОМЕСТИТЬ рейсы
	|ИЗ
	|	Документ.AMS_ЛогистическийЛист.Рейсы КАК Рейсы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.AMS_ЛогистическийЛист.Распоряжения КАК Распоряжения
	|		ПО Рейсы.Ссылка = Распоряжения.Ссылка
	|		И Рейсы.ТранспортноеСредство = Распоряжения.ТранспортноеСредство
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТранспортныеСредства КАК Авто
	|		ПО Рейсы.ТранспортноеСредство = Авто.Ссылка
	|ГДЕ
	|	Рейсы.Ссылка = &Ссылка
	|	И Авто._Перевозчик = &Перевозчик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	рейсы.Лист КАК Лист,
	|	рейсы.Дата КАК ДатаЛист,
	|	рейсы.Номер КАК НомерЛист,
	|	рейсы.Перевозчик КАК Перевозчик,
	|	рейсы.ТранспортноеСредство КАК ТранспортноеСредство,
	|	рейсы.Водитель КАК Водитель,
	|	рейсы.ВремяЗагрузки КАК ВремяЗагрузки,
	|	рейсы.ПорядокВМаршруте КАК ПорядокВМаршруте,
	|	рейсы.Распоряжение КАК Распоряжение,
	|	рейсы.Распоряжение.Склад КАК Склад,
	|	ВЫБОР
	|		КОГДА рейсы.Распоряжение ССЫЛКА Документ.ЗаказПоставщику
	|		ИЛИ рейсы.Распоряжение ССЫЛКА Документ.ЗаявкаНаВозвратТоваровОтКлиента
	|			ТОГДА 2
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Направление,
	|	ВЫБОР
	|		КОГДА рейсы.Распоряжение ССЫЛКА Документ.РеализацияТоваровУслуг
	|			ТОГДА ВЫБОР
	|				КОГДА рейсы.Распоряжение.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу)
	|					ТОГДА рейсы.Распоряжение.АдресДоставкиПеревозчика
	|				ИНАЧЕ рейсы.Распоряжение.АдресДоставки
	|			КОНЕЦ
	|		ИНАЧЕ рейсы.Распоряжение.АдресДоставки
	|	КОНЕЦ КАК Адрес,
	|	рейсы.Распоряжение.Партнер КАК Партнер,
	|	ВЫБОР
	|		КОГДА рейсы.Распоряжение ССЫЛКА Документ.AMS_ПередачаВПереработку
	|			ТОГДА рейсы.Распоряжение.Ответственный
	|		ИНАЧЕ рейсы.Распоряжение.Автор
	|	КОНЕЦ КАК Менеджер,
	|	рейсы.Распоряжение.ВремяДоставкиС КАК ВремяС,
	|	рейсы.Распоряжение.ВремяДоставкиПо КАК ВремяПо,
	|	рейсы.Распоряжение.ДополнительнаяИнформацияПоДоставке КАК ДополнительнаяИнформация,
	|	рейсы.Распоряжение.Номер КАК Номер,
	|	рейсы.Распоряжение.Дата КАК Дата,
	|	рейсы.Распоряжение.AMS_КоличествоПалет КАК Палет,
	|	рейсы.Распоряжение.AMS_Вес КАК Вес,
	|	ВЫБОР
	|		КОГДА рейсы.Распоряжение.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ТК,
	|	рейсы.Распоряжение.СпособДоставки КАК СпособДоставки,
	|	рейсы.Распоряжение.ПеревозчикПартнер КАК ПеревозчикПартнер,
	|	рейсы.Распоряжение.AMS_ТранспортКлиента КАК ТранспортКлиента,
	|	рейсы.Распоряжение.AMS_ДоверенностьКлиента КАК ДоверенностьКлиента,
	|	рейсы.Распоряжение.AMS_ТелефонВодителяКлиента КАК ТелефонВодителяКлиента,
	|	рейсы.Распоряжение.AMS_СпособПередачиТоваров КАК СпособПередачиТоваров,
	|	ЕСТЬNULL(рейсы.Распоряжение.AMS_Обрешетка, ЛОЖЬ) КАК Обрешетка
	|ИЗ
	|	рейсы КАК рейсы
	|
	|УПОРЯДОЧИТЬ ПО
	|	Направление,
	|	ПорядокВМаршруте
	|ИТОГИ
	|	МАКСИМУМ(Перевозчик),
	|	МАКСИМУМ(Водитель),
	|	МАКСИМУМ(ВремяЗагрузки),
	|	СУММА(Палет),
	|	СУММА(Вес),
	|	МАКСИМУМ(ТК)
	|ПО
	|	ТранспортноеСредство";

	Возврат Запрос.Выполнить();
КонецФункции

Функция ПолучитьОсновноеПравилоПродаж(Партнер) Экспорт 
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Владелец", Партнер);
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	т.Ссылка КАК ПравилоПродаж
	|ИЗ
	|	Справочник.AMS_ПравилаПродаж КАК т
	|ГДЕ
	|	т.Владелец = &Владелец
	|	И т.Основное
	|	И НЕ т.ПометкаУдаления
	|	И т.СтатусПравилаПродажи = ЗНАЧЕНИЕ(Перечисление.AMS_СтатусыПравилПродаж.Действует)";

	Рез = Запрос.Выполнить();

	Если Рез.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Выб = Рез.Выбрать();
		Выб.Следующий();
		
		Возврат Выб.ПравилоПродаж;
	КонецЕсли;
КонецФункции

Функция ПолучитьОсновнуюСпецификацию(Номенклатура) Экспорт 
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	т.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник._ВариантыСпецификацийНоменклатуры КАК т
	|ГДЕ
	|	т.Владелец = &Номенклатура
	|	И т.Основной
	|	И т.Статус = ЗНАЧЕНИЕ(Перечисление._СтатусыСпецификаций.Действует)";

	Рез = Запрос.Выполнить();

	Если Рез.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Выб = Рез.Выбрать();
		Выб.Следующий();
		
		Возврат Выб.Ссылка;
	КонецЕсли;
КонецФункции

Функция ПолучитьСоставОсновнойСпецификации(Номенклатура) Экспорт 
	МассивДанных = Новый Массив();
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.Количество КАК КоличествоМатериал,
	|	д.Количество КАК КоличествоФабрикат
	|ИЗ
	|	Справочник._ВариантыСпецификацийНоменклатуры.Товары КАК т
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры КАК д
	|		ПО т.Ссылка = д.Ссылка
	|ГДЕ
	|	д.Владелец = &Номенклатура
	|	И д.Основной
	|
	|УПОРЯДОЧИТЬ ПО
	|	т.Номенклатура.Наименование";
	Табл = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Стр Из Табл Цикл
		МассивДанных.Добавить(ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Стр));
	КонецЦикла;
	
	Возврат МассивДанных;
КонецФункции

Функция ПолучитьСтоимостьФабриката(Спецификация, Дата) Экспорт 
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Спецификация", Спецификация);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СпецТ.Номенклатура КАК Номенклатура,
	|	СпецД.Количество КАК Замес,
	|	СпецТ.Количество КАК Норма
	|ИЗ
	|	Справочник._ВариантыСпецификацийНоменклатуры КАК СпецД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры.Товары КАК СпецТ
	|		ПО СпецД.Ссылка = СпецТ.Ссылка
	|ГДЕ
	|	СпецД.Ссылка = &Спецификация
	|	И НЕ СпецТ.Номенклатура.Код = ""01-00000017""";
	
	Табл = Запрос.Выполнить().Выгрузить();
	
	МВТ = Новый МенеджерВременныхТаблиц;
	
	Парам = Новый Структура;
	Парам.Вставить("Дата", Дата);
	Парам.Вставить("Номенклатура", Табл.ВыгрузитьКолонку("Номенклатура"));

	ПолучитьСтоимостьТовара(МВТ, Парам);

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.УстановитьПараметр("Табл", Табл);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.Замес КАК Замес,
	|	т.Норма КАК Норма
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	&Табл КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	вт.Номенклатура КАК Номенклатура,
	|	ЦенаТовара.Цена * вт.Норма КАК Сумма,
	|	вт.Замес КАК Замес
	|ПОМЕСТИТЬ вт1
	|ИЗ
	|	вт КАК вт
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЦенаТовара КАК ЦенаТовара
	|		ПО вт.Номенклатура = ЦенаТовара.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(т.Сумма) / МАКСИМУМ(т.Замес) КАК Стоимость
	|ИЗ
	|	вт1 КАК т";
	
	Рез = Запрос.Выполнить();
	
	Если Рез.Пустой() Тогда
		Возврат 0;		
	Иначе
		Выб = Рез.Выбрать();
		Выб.Следующий();
		
		Возврат Выб.Стоимость;
	КонецЕсли;
КонецФункции

Функция ПолучитьСтоимостьПродукции(Спецификация, СтоимостьФабриката, Дата) Экспорт 
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Спецификация", Спецификация);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СпецТ.Номенклатура КАК Номенклатура,
	|	СпецТ.Количество КАК Количество
	|ИЗ
	|	Справочник._ВариантыСпецификацийНоменклатуры КАК СпецД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры.Товары КАК СпецТ
	|		ПО СпецД.Ссылка = СпецТ.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|		ПО СпецТ.Номенклатура = Ном.Ссылка
	|ГДЕ
	|	СпецД.Ссылка = &Спецификация";
	
	Табл = Запрос.Выполнить().Выгрузить();
	
	Если СтоимостьФабриката = 0 Тогда
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("Табл", Табл);
		Запрос.УстановитьПараметр("ВидыНоменклатуры", ВидыНоменклатурыФабрикаты());
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Табл.Номенклатура КАК Номенклатура,
		|	Табл.Количество КАК Количество
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	&Табл КАК Табл
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт.Номенклатура КАК Номенклатура
		|ИЗ
		|	вт КАК вт
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
		|		ПО вт.Номенклатура = Ном.Ссылка
		|ГДЕ
		|	Ном.ВидНоменклатуры В (&ВидыНоменклатуры)";
		
		Рез = Запрос.Выполнить();
		
		Если Не Рез.Пустой() Тогда
			Выб = Рез.Выбрать();
			Выб.Следующий();
			Фабрикат = Выб.Номенклатура;
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Дата", Дата);
			Запрос.УстановитьПараметр("Номенклатура", Фабрикат);
			
			Запрос.Текст =
				"ВЫБРАТЬ
				|	д.Дата КАК Дата,
				|	ф.Спецификация КАК Спецификация
				|ПОМЕСТИТЬ вт
				|ИЗ
				|	Документ.AMS_ПроизводствоЗаСмену.Фабрикаты КАК ф
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.AMS_ПроизводствоЗаСмену КАК д
				|		ПО ф.Ссылка = д.Ссылка
				|ГДЕ
				|	д.Дата < &Дата
				|	И ф.Номенклатура = &Номенклатура
				|	И НЕ ф.Спецификация = ЗНАЧЕНИЕ(Справочник._ВариантыСпецификацийНоменклатуры.ПустаяСсылка)
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ ПЕРВЫЕ 1
				|	вт.Дата КАК Дата,
				|	вт.Спецификация КАК Спецификация
				|ИЗ
				|	вт КАК вт
				|
				|УПОРЯДОЧИТЬ ПО
				|	Дата УБЫВ";
			
			Рез = Запрос.Выполнить();
			Если Не Рез.Пустой() Тогда
				Выб = Рез.Выбрать();
				Выб.Следующий();
				СпецификацияФабриката = Выб.Спецификация;
				СтоимостьФабриката = ПолучитьСтоимостьФабриката(СпецификацияФабриката, Дата)
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	МВТ = Новый МенеджерВременныхТаблиц;
	
	Парам = Новый Структура;
	Парам.Вставить("Дата", Дата);
	Парам.Вставить("Номенклатура", Табл.ВыгрузитьКолонку("Номенклатура"));

	ПолучитьСтоимостьТовара(МВТ, Парам);

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.УстановитьПараметр("Табл", Табл);
	Запрос.УстановитьПараметр("СтоимостьФабриката", СтоимостьФабриката);
	Запрос.УстановитьПараметр("ВидыНоменклатуры", ВидыНоменклатурыФабрикаты());
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Табл.Номенклатура КАК Номенклатура,
	|	Табл.Количество КАК Количество
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	&Табл КАК Табл
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	вт.Номенклатура КАК Номенклатура,
	|	вт.Количество КАК Количество,
	|	ЦенаТовара.Цена КАК Цена,
	|	ВЫБОР
	|		КОГДА Ном.ВидНоменклатуры В (&ВидыНоменклатуры)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоФабрикат
	|ПОМЕСТИТЬ вт1
	|ИЗ
	|	вт КАК вт
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЦенаТовара КАК ЦенаТовара
	|		ПО вт.Номенклатура = ЦенаТовара.Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|		ПО вт.Номенклатура = Ном.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА т.ЭтоФабрикат
	|			ТОГДА &СтоимостьФабриката
	|		ИНАЧЕ т.Цена
	|	КОНЕЦ * т.Количество КАК Сумма
	|ПОМЕСТИТЬ вт2
	|ИЗ
	|	вт1 КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(т.Сумма) КАК Сумма
	|ИЗ
	|	вт2 КАК т";
	
	Рез = Запрос.Выполнить();
	
	Если Рез.Пустой() Тогда
		Возврат 0;		
	Иначе
		Выб = Рез.Выбрать();
		Выб.Следующий();
		
		Возврат Выб.Сумма;
	КонецЕсли;
КонецФункции

Функция ПолучитьИмяБазы() Экспорт
	ДанныеБазы = Новый Структура();
	
    СтрокаИБ = СтрокаСоединенияИнформационнойБазы(); //File="D:\Base".
    //Возвращает Строка соединения информационной базы, которую, например,
    //можно использовать для запуска 1С:Предприятия средствами встроенного языка
    ПутьИБ = СтрНайти(Врег(СтрокаИБ), "FILE=");

    Если ПутьИБ = 1 тогда // Файловая информационная база 1С:Предприятия 8 (.1CD)

        Возврат Сред(СтрокаИБ,7,СтрДлина(СтрокаИБ)-8)+"\"; // Получим D:\Base

    Иначе
        ПозицияПоиска = СтрНайти(Врег(СтрокаИБ), "SRVR=");
        Если ПозицияПоиска <> 1 Тогда
            Возврат Неопределено;
        КонецЕсли;

        ПозицияТЧК_ЗПТ = СтрНайти(СтрокаИБ, ";");
        ПозСтарт = 6 + 1;
        ПозФиниш = ПозицияТЧК_ЗПТ - 2; //

        ИмяСервера = Сред(СтрокаИБ, ПозСтарт, ПозФиниш - ПозСтарт + 1);
        
        СтрокаИБ = Сред(СтрокаИБ, ПозицияТЧК_ЗПТ + 1);
        ПутьИБ = СтрНайти(Врег(СтрокаИБ), "REF=");// позиция имени сервера
        Если ПутьИБ <> 1 Тогда
            Возврат Неопределено;
        КонецЕсли;

        ПозСтарт = 6;
        ПозицияТЧК_ЗПТ = СтрНайти(СтрокаИБ, ";");
        ПозФиниш = ПозицияТЧК_ЗПТ - 2;

        ИмяИБНаСервере = Сред(СтрокаИБ, ПозСтарт, ПозФиниш - ПозСтарт + 1);
        
        ДанныеБазы.Вставить("ИмяСервера", ИмяСервера);
        ДанныеБазы.Вставить("ИмяБазы", ИмяИБНаСервере);
        ДанныеБазы.Вставить("КаталогВременныхФайлов", КаталогВременныхФайлов());
        
        Возврат ДанныеБазы;
    КонецЕсли;
КонецФункции

#Область СКД

Процедура ВыполнитьСКД(Данные) Экспорт
	СКД       = Данные.СКД;
	Результат = Данные.Результат;
	
	Настройки = Неопределено;
	Данные.Свойство("Настройки", Настройки);

	Вариант = Неопределено;
	Данные.Свойство("Вариант", Вариант);
	
	Параметры = Неопределено;
	Данные.Свойство("Параметры", Параметры);
	
	Расшифровка = Неопределено;
	Данные.Свойство("Расшифровка", Расшифровка);
	
	МакетКомпоновки = Неопределено;
	Данные.Свойство("МакетКомпоновки", МакетКомпоновки);
	
	ВнешниеНаборыДанных = Неопределено;
	Данные.Свойство("ВнешниеНаборыДанных", ВнешниеНаборыДанных);

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;

	Если ТипЗнч(Результат) = Тип("ТабличныйДокумент") Тогда
		ТипГенератора = Тип("ГенераторМакетаКомпоновкиДанных");
	Иначе
		ТипГенератора = Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений");
	КонецЕсли;

	Если Настройки = Неопределено Тогда
		Если Вариант = Неопределено Тогда
			Настройки = СКД.НастройкиПоУмолчанию;
		Иначе
			Настройки = СКД.ВариантыНастроек.Найти(Вариант).Настройки;
		КонецЕсли;
	КонецЕсли;

	Если Параметры <> Неопределено Тогда
		КоллекцияЗначенийПараметров = Настройки.ПараметрыДанных.Элементы;
		Для Каждого Параметр Из Параметры Цикл
			НайденноеЗначениеПараметра = КоллекцияЗначенийПараметров.Найти(Параметр.Ключ);
			Если НайденноеЗначениеПараметра <> Неопределено Тогда
				НайденноеЗначениеПараметра.Использование = Истина;
				НайденноеЗначениеПараметра.Значение = Параметр.Значение;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	МакетКомпоновкиСКД = КомпоновщикМакета.Выполнить(СКД, Настройки, Расшифровка, МакетКомпоновки, ТипГенератора);

	ПроцессорКомпановки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпановки.Инициализировать(МакетКомпоновкиСКД, ВнешниеНаборыДанных, Расшифровка);

	Если ТипЗнч(Результат) = Тип("ТабличныйДокумент") Тогда
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
		ПроцессорВывода.УстановитьДокумент(Результат);
	Иначе
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		ПроцессорВывода.УстановитьОбъект(Результат);
	КонецЕсли;

	ПроцессорВывода.ОтображатьПроцентВывода = Истина;
	ПроцессорВывода.Вывести(ПроцессорКомпановки, Истина);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область Прочие

Функция ЭтоПродажаНаЭкспорт(ЗаказКлиента)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказКлиента);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	т.Договор КАК Договор
	|ИЗ
	|	Документ.ЗаказКлиента КАК т
	|ГДЕ
	|	т.Ссылка = &ЗаказКлиента
	|	И т.Договор.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНаЭкспорт)";
	
	Возврат Не Запрос.Выполнить().Пустой();
КонецФункции

Функция ПолучитьТоварыНеУказанныеКОтгрузке(ЗаказКлиента)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказКлиента);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.НомерСтроки КАК НомерСтроки,
	|	т.Номенклатура.Наименование КАК Номенклатура
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК т
	|ГДЕ
	|	т.Ссылка = &ЗаказКлиента
	|	И НЕ т.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)";
	
	
	Табл = Запрос.Выполнить().Выгрузить();
	
	МассивСтрок = Новый Массив();
	
	Для Каждого Стр Из Табл Цикл
		МассивСтрок.Добавить(ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Стр));
	КонецЦикла;
	
	Возврат МассивСтрок;
КонецФункции

#Область АдресаДоставки

Функция ПолучитьАдресаДоставки(Партнер) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Партнер", Партнер);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.АдресДоставки КАК АдресДоставки,
	|	т.АдресДоставкиЗначение КАК АдресДоставкиЗначение,
	|	т.АдресДоставкиЗначенияПолей КАК АдресДоставкиЗначенияПолей,
	|	т.ВремяДоставкиПо КАК ВремяДоставкиПо,
	|	т.ВремяДоставкиС КАК ВремяДоставкиС,
	|	т.ДополнительнаяИнформацияПоДоставке КАК ДополнительнаяИнформацияПоДоставке,
	|	т.ЗонаДоставки КАК ЗонаДоставки
	|ИЗ
	|	Справочник.AMS_АдресаДоставки КАК т
	|ГДЕ
	|	т.Владелец = &Партнер
	|	И НЕ т.ПометкаУдаления";

	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ПолучитьАдресДоставки(Партнер) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Вид,
	|	т.Представление
	|ИЗ
	|	Справочник.Партнеры.КонтактнаяИнформация КАК т
	|ГДЕ
	|	т.Ссылка = &Партнер
	|	И т.Вид = &АдресДоставки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Вид,
	|	т.Представление
	|ИЗ
	|	Справочник.Партнеры.КонтактнаяИнформация КАК т
	|ГДЕ
	|	т.Ссылка = &Партнер
	|	И т.Вид = &АдресФактический
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Вид,
	|	т.Представление
	|ИЗ
	|	Справочник.Партнеры.КонтактнаяИнформация КАК т
	|ГДЕ
	|	т.Ссылка = &Партнер
	|	И т.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресПартнера)";

	Запрос.УстановитьПараметр("Партнер", Партнер);
	Запрос.УстановитьПараметр("АдресДоставки", Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию(
		"Адрес доставки", Истина));
	Запрос.УстановитьПараметр("АдресФактический", Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию(
		"Фактический адрес", Истина));

	УстановитьПривилегированныйРежим(Истина);

	Рез  = Запрос.ВыполнитьПакет();
	Рез1 = Рез[0];
	Рез2 = Рез[1];
	Рез3 = Рез[2];

	Если Не Рез1.Пустой() Тогда
		Возврат Рез1.Выгрузить().ВыгрузитьКолонку("Представление")[0];

	ИначеЕсли Не Рез2.Пустой() Тогда
		Возврат Рез2.Выгрузить().ВыгрузитьКолонку("Представление")[0];

	ИначеЕсли Не Рез3.Пустой() Тогда
		Возврат Рез3.Выгрузить().ВыгрузитьКолонку("Представление")[0];

	Иначе
		Возврат "";
	КонецЕсли;
КонецФункции

Функция ПолучитьЗонаДоставки(Партнер, АдресДоставки) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Запрос.УстановитьПараметр("АдресДоставки", АдресДоставки);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.ЗонаДоставки КАК ЗонаДоставки
	|ИЗ
	|	Справочник.AMS_АдресаДоставки КАК т
	|ГДЕ
	|	т.Владелец = &Партнер
	|	И т.Наименование = &АдресДоставки";

	Рез = Запрос.Выполнить();

	Если Рез.Пустой() Тогда
		Возврат Справочники.ЗоныДоставки.ПустаяСсылка();
	Иначе
		Выб = Рез.Выбрать();
		Выб.Следующий();
		
		Возврат Выб.ЗонаДоставки;
	КонецЕсли;
КонецФункции

Функция ПолучитьДанныеАдресаДоставки(Партнер, Адрес) Экспорт
	ДанныеАдреса = Новый Структура("АдресДоставки, ЗонаДоставки, Расстояние");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Запрос.УстановитьПараметр("Адрес", Адрес);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Наименование КАК АдресДоставки,
	|	т.ЗонаДоставки КАК ЗонаДоставки,
	|	т.Расстояние КАК Расстояние
	|ИЗ
	|	Справочник.AMS_АдресаДоставки КАК т
	|ГДЕ
	|	т.Владелец = &Партнер
	|	И т.Наименование = &Адрес";

	Рез = Запрос.Выполнить();
	
	Если Рез.Пустой() Тогда
		ДанныеАдреса.АдресДоставки = "";
		ДанныеАдреса.ЗонаДоставки  = Справочники.ЗоныДоставки.ПустаяСсылка();
		ДанныеАдреса.Расстояние    = 0;	
	Иначе
		
		ДанныеАдреса.АдресДоставки = "";
		ДанныеАдреса.ЗонаДоставки  = Справочники.ЗоныДоставки.ПустаяСсылка();
		ДанныеАдреса.Расстояние    = 0;	
	КонецЕсли;
	
	Возврат ДанныеАдреса;
КонецФункции

Процедура ЗаписатьРасстояние(Партнер, АдресДоставки, Расстояние) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Владелец", Партнер);
	Запрос.УстановитьПараметр("АдресДоставки", АдресДоставки);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.AMS_АдресаДоставки КАК т
	|ГДЕ
	|	т.Владелец = &Владелец
	|	И т.АдресДоставки = &АдресДоставки";
	
	Рез = Запрос.Выполнить();
	
	Если Не Рез.Пустой() Тогда
		Выб = Рез.Выбрать(); Выб.Следующий();
		
		АдресДоставки = Выб.Ссылка.ПолучитьОбъект();
		
		АдресДоставки.Расстояние = Расстояние;
		
		АдресДоставки.Записать();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецОбласти

//Процедура СформироватьЗаказКлиента(Форма) ОСТАВИТЬ ДЛЯ ПРИМЕРА ЗАПОЛНЕНИЯ НОВОГО ДОКУМЕНТ
//	Док = Документы.ЗаказКлиента.СоздатьДокумент();//  создать и заполнить документ
//  ЗначениеВДанныеФормы(Док, Форма.Объект); // перенести заполненное в новый документ
//КонецПроцедуры

#КонецОбласти