#Область ОписаниеПеременных

&НаКлиенте
Перем КэшированныеЗначения;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Заполнить список выбора Упаковок
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", Объект.Владелец);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Ссылка КАК Номенклатура,
	|	т.НаборУпаковок КАК НаборУпаковок
	|ПОМЕСТИТЬ Ном
	|ИЗ
	|	Справочник.Номенклатура КАК т
	|ГДЕ
	|	т.Ссылка = &Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ном.Номенклатура КАК Номенклатура,
	|	Упак.Ссылка КАК Упаковка,
	|	Упак.Числитель КАК Числитель
	|ИЗ
	|	Ном КАК Ном
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК Упак
	|		ПО Ном.НаборУпаковок = Упак.Владелец
	|		ИЛИ Ном.Номенклатура = Упак.Владелец
	|
	|УПОРЯДОЧИТЬ ПО
	|	Числитель";
	Элементы.Упаковка.СписокВыбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Упаковка"));

	УправлениеЭлементамиФормы();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Владелец = ТекущийОбъект.Владелец;

    Если AMS_ВызовСервера.ЭтоПродукцияAMS(Владелец) Тогда	
		Данные = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Владелец,"_Фабрикат,_КоличествоФабрикатаВУпаковке");	

		Если НЕ ЗначениеЗаполнено(Объект.Упаковка) Тогда
			Текст = НСтр("ru = 'Не указана упаковка.'");
			ОбщегоНазначения.СообщитьПользователю(Текст,,"Упаковка","Объект",Отказ);
		КонецЕсли;
		
		
		Если ЗначениеЗаполнено(Данные._Фабрикат) Тогда 
			Товары = ТекущийОбъект.Товары;
			Для каждого Стр Из Товары Цикл
			    Если AMS_ВызовСервера.ЭтоФабрикат(Стр.Номенклатура) Тогда	
					КоличествоФабрикатаВУпаковке = Стр.Количество;
				КонецЕсли;
			    
			    Если Стр.Номенклатура = Владелец Тогда	
					Текст = НСтр("ru = 'В строке %НомерСтроки% указан товар ""%НазваниеТовара%"".
					|Один и тот же товар не может являться и продукцией, и входить в состав спецификации одновременно.'");
					
					Текст = СтрЗаменить(Текст, "%НомерСтроки%", Стр.НомерСтроки);
					Текст = СтрЗаменить(Текст, "%НазваниеТовара%", Стр.Номенклатура);
				
					Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары",Стр.НомерСтроки,"Номенклатура");
					
					ОбщегоНазначения.СообщитьПользователю(Текст,,Поле,"Объект",Отказ);
				КонецЕсли;
			КонецЦикла;
			
			Если НЕ КоличествоФабрикатаВУпаковке = Данные._КоличествоФабрикатаВУпаковке Тогда
				Текст = НСтр("ru = 'Неправильно указано количество фабриката. В карточке ""%Номенклатура%"" - %1%, а в спецификации - %2%.'");
				Текст = СтрЗаменить(Текст, "%Номенклатура%", Владелец);
				Текст = СтрЗаменить(Текст, "%1%", Данные._КоличествоФабрикатаВУпаковке);
				Текст = СтрЗаменить(Текст, "%2%", КоличествоФабрикатаВУпаковке);
				
				ОбщегоНазначения.СообщитьПользователю(Текст,,,,Отказ);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	СтатусПриИзмененииСервер();
КонецПроцедуры

&НаКлиенте
Процедура КоличествоФабрикатПриИзменении(Элемент)
	Стр = ОбщегоНазначенияУТВызовСервера.ЗначенияРеквизитовОбъекта(Объект.Владелец, "КоэффициентЕдиницыДляОтчетов,_Упаковка");
	
	Объект.Количество = Объект.КоличествоУпаковок * Стр.КоэффициентЕдиницыДляОтчетов;
	Объект.Упаковка   = Стр._Упаковка;
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПродукцияПриИзменении(Элемент)
	Стр = ОбщегоНазначенияУТВызовСервера.ЗначенияРеквизитовОбъекта(Объект.Владелец, "КоэффициентЕдиницыДляОтчетов,_Упаковка");
	
	Объект.Количество = Объект.КоличествоУпаковок * Стр.КоэффициентЕдиницыДляОтчетов;
	Объект.Упаковка   = Стр._Упаковка;
КонецПроцедуры

&НаКлиенте
Процедура КоличествоФлаконовПриИзменении(Элемент)
	Стр = ОбщегоНазначенияУТВызовСервера.ЗначенияРеквизитовОбъекта(Объект.Владелец, "КоэффициентЕдиницыДляОтчетов,_Упаковка");

	Объект.Количество = Объект.КоличествоУпаковок * Стр.КоэффициентЕдиницыДляОтчетов;
КонецПроцедуры

&НаКлиенте
Процедура УпаковкаПриИзменении(Элемент)
	Объект.Количество = Объект.КоличествоУпаковок * ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Объект.Упаковка, "Числитель");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыУпаковкаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоУпаковокПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеЭлементамиФормы()
	ЭтоKhors = AMS_ВызовСервера.ЭтоKhors();
	
	ЭтоПродукцияAMS = AMS_ВызовСервера.ЭтоПродукцияAMS(Объект.Владелец);
	//@skip-check reading-attribute-from-database
	ЭтоФлаконы = (Объект.Владелец.Родитель = ПредопределенноеЗначение("Справочник.AMS_Константы.ФлаконыАМС").Значение);
	
	Элементы.ГруппаФабрикат.Видимость  = НЕ ЭтоПродукцияAMS И Не ЭтоФлаконы;
	Элементы.ГруппаПродукция.Видимость = ЭтоПродукцияAMS И Не ЭтоФлаконы;
	Элементы.ГруппаФлаконы.Видимость   = ЭтоФлаконы;
	
	Если Объект.Статус = ПредопределенноеЗначение("Перечисление._СтатусыСпецификаций.Действует") Тогда
		Элементы.Основной.Доступность = Истина;
	Иначе
		Элементы.Основной.Доступность = Ложь;
	КонецЕсли;
	
	Элементы.Основной.Доступность = НЕ Объект.Основной И Пользователи.РолиДоступны("_Технолог");
	
	//Если Спецификация уже была записана и есть оформленные документы производства, то необходимо запретить изменения
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		ЕстьОформленныеДокументы = (НЕ ЭтоKhors И ЕстьОформленныеДокументы(Объект.Ссылка));
		Элементы.Товары.ТолькоПросмотр         = ЕстьОформленныеДокументы;
		Элементы.ГруппаВладелец.ТолькоПросмотр = ЕстьОформленныеДокументы;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СтатусПриИзмененииСервер()
	Если Объект.Статус = ПредопределенноеЗначение("Перечисление._СтатусыСпецификаций.Действует") Тогда
		ОсновнаяСпецификация = AMS_ВызовСервера.ПолучитьОсновнуюСпецификацию(Объект.Владелец);
		
		Если НЕ Объект.Основной И НЕ ЗначениеЗаполнено(ОсновнаяСпецификация) Тогда
			Объект.Основной = Истина;
		КонецЕсли;
	Иначе
		Объект.Основной = Ложь;
	КонецЕсли;
	
	УправлениеЭлементамиФормы();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьОформленныеДокументы(Спецификация)
	Владелец = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Спецификация, "Владелец");;
	
	Если AMS_ВызовСервера.ЭтоПродукцияAMS(Владелец) Тогда
		Таблица = "Продукция";
	Иначе
		Таблица = "Фабрикаты";
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Спецификация", Спецификация);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	т.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.AMS_ПроизводствоЗаСмену." + Таблица + " КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.AMS_ПроизводствоЗаСмену КАК д
	|		ПО т.Ссылка = д.Ссылка
	|ГДЕ
	|	д.Проведен
	|	И т.Спецификация = &Спецификация";

	Возврат	НЕ Запрос.Выполнить().Пустой();		
КонецФункции

#КонецОбласти