#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПоказатьОтчет();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПродукция

&НаКлиенте
Процедура ПродукцияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Стр = Элементы.Продукция.ТекущиеДанные;
	
	Если Поле.Имя = "ПродукцияНоменклатура" Тогда
		ПоказатьЗначение(, Стр.Номенклатура);

	ИначеЕсли Поле.Имя = "ПродукцияОписание" Тогда
		Описание = Стр.Описание;
		
		ВвестиСтроку(Стр.Описание, "Описание номенклатуры", , Истина);
		
		Если Не Описание = Стр.Описание Тогда
			ЗаписатьОписание(Стр.Номенклатура, Стр.Описание);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПоказатьОтчет()
	МВТ = Новый МенеджерВременныхТаблиц;
	AMS_ВызовСервера.ПолучитьПродукциюДляВ2В(МВТ);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Продукция.ВидПродукции КАК ВидПродукции,
	|	Продукция.ВидПродукцииНаименование КАК ВидПродукцииНаименование,
	|	Продукция.НазначениеПродукции КАК НазначениеПродукции,
	|	Продукция.НазначениеПродукцииНаименование КАК НазначениеПродукцииНаименование,
	|	Продукция.НомерСтроки КАК НомерСтроки,
	|	Продукция.SKU КАК SKU,
	|	Продукция.Артикул КАК Артикул,
	|	Продукция.Номенклатура КАК Номенклатура,
	|	Продукция.НоменклатураНаименованиеПолное КАК НоменклатураНаименованиеПолное,
	|	Продукция.Бренд КАК Бренд,
	|	Продукция.Маркер КАК Маркер,
	|	Продукция.Описание КАК Описание,
	|	Продукция.УпаковкаСтрока КАК УпаковкаСтрока,
	|	Продукция.ШтДлина КАК ШтДлина,
	|	Продукция.ШтШирина КАК ШтШирина,
	|	Продукция.ШтВысота КАК ШтВысота,
	|	Продукция.ШтВес КАК ШтВес,
	|	Продукция.ЕдиницаИзмеренияВеса КАК ЕдиницаИзмеренияВеса,
	|	Продукция.КорДлина КАК КорДлина,
	|	Продукция.КорШирина КАК КорШирина,
	|	Продукция.КорВысота КАК КорВысота,
	|	Продукция.КорВес КАК КорВес,
	|	Продукция.КорКфц КАК КорКфц,
	|	Продукция.ШтрихкодШт КАК ШтрихкодШт,
	|	Продукция.ШтрихкодУпак КАК ШтрихкодУпак,
	|	Продукция.КорЕд КАК КорЕд,
	|	Продукция.В2В КАК В2В
	|ИЗ
	|	Продукция КАК Продукция
	|ГДЕ
	|	Продукция.В2В
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидПродукцииНаименование,
	|	НазначениеПродукцииНаименование,
	|	НомерСтроки
	|ИТОГИ ПО
	|	ВидПродукции,
	|	НазначениеПродукции";

	Продукция.ПолучитьЭлементы().Очистить();

	Рез = Запрос.Выполнить();
	Выб1 = Рез.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока Выб1.Следующий() Цикл
		Стр1 = Продукция.ПолучитьЭлементы().Добавить();
		Стр1.Номенклатура = Выб1.ВидПродукции;
	
		Выб2 = Выб1.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока Выб2.Следующий() Цикл
			Стр2 = Стр1.ПолучитьЭлементы().Добавить();
			Стр2.Номенклатура = Выб2.НазначениеПродукции;
	
			Выб3 = Выб2.Выбрать();
			Пока Выб3.Следующий() Цикл
				Стр3 = Стр2.ПолучитьЭлементы().Добавить();
				ЗаполнитьЗначенияСвойств(Стр3, Выб3);
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьОписание(Номенклатура, Описание)
	УстановитьПривилегированныйРежим(Истина);
	
	НоменклатураОбъект = Номенклатура.ПолучитьОбъект();
	НоменклатураОбъект.Описание = Описание;
	НоменклатураОбъект.Записать();
КонецПроцедуры

#КонецОбласти
