#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.Склад.СписокВыбора.Добавить(AMS_ВызовСервера.Цех1());
	Элементы.Склад.СписокВыбора.Добавить(AMS_ВызовСервера.Цех2());
	Элементы.Склад.СписокВыбора.Добавить(AMS_ВызовСервера.Цех3());
	Элементы.Склад.СписокВыбора.Добавить(AMS_ВызовСервера.Цех4());
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Не ЗначениеЗаполнено(Склад) Тогда
		Склад = AMS_ВызовСервера.Цех1();
	КонецЕсли;
	
	НастройкаФормы();
	УстановитьУсловноеОформление();
	ПоказатьПлан();
	ПоказатьРасходМатериалов("Упаковка");
	ПоказатьРасходМатериалов("Сырье");
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "Запись_ПроизводствоЗаСмену" Тогда
		ОбновитьИнтерфейс();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	ОчиститьСообщения(); 
	
	НастройкаФормы();
	ПоказатьПлан();
	ПоказатьРасходМатериалов("Упаковка");
	ПоказатьРасходМатериалов("Сырье");
КонецПроцедуры

&НаКлиенте
Процедура СкрытьЗакрытыеПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Статус", ПредопределенноеЗначение(
		"Перечисление._СтатусыПроизводства.Выполнено"), ВидСравненияКомпоновкиДанных.НеРавно, , СкрытьЗакрытые);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Продукция.Отбор, "ПроизводствоЗаСмену",
		Элементы.Список.ТекущаяСтрока, ВидСравненияКомпоновкиДанных.Равно, , Истина);
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ОчиститьСообщения(); 
	ПоказатьПлан();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПлан

&НаКлиенте
Процедура ПланВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;

	Имя = Поле.Имя;

	Если Имя = "ПланНомерСтроки" Или Имя = "ПланАртикул" Или Имя = "ПланНоменклатура" Или Имя = "ПланИтого" Тогда
		Возврат;
	КонецЕсли;

	Стр = Элемент.ТекущиеДанные;

	Номенклатура = Стр.Номенклатура;

	Если ТипЗнч(Номенклатура) = Тип("СправочникСсылка.СегментыНоменклатуры") Тогда
		Возврат;
	КонецЕсли;

	Если Прав(Поле.Имя, 1) = "1" Тогда
		Дата = Дата1;
	ИначеЕсли Прав(Поле.Имя, 1) = "2" Тогда
		Дата = Дата2;
	ИначеЕсли Прав(Поле.Имя, 1) = "3" Тогда
		Дата = Дата3;
	ИначеЕсли Прав(Поле.Имя, 1) = "4" Тогда
		Дата = Дата4;
	КонецЕсли;

	Если Лев(Прав(Поле.Имя, 2), 1) = "Д" Тогда
		Смена = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление._ПроизводственныеСмены.Дневная");
	Иначе
		Смена = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление._ПроизводственныеСмены.Вечерняя");
	КонецЕсли;

	Массив = ПолучитьМассивДокументов_AMS_ПроизводствоЗаСмену(Дата, Смена, Номенклатура);

	Если Не Массив = Неопределено Тогда
		Для Каждого Док Из Массив Цикл
			ПоказатьЗначение( , Док);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУпаковка

&НаКлиенте
Процедура УпаковкаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;

	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Номенклатура = ТекущиеДанные.Номенклатура;

	Если Поле.Имя = "УпаковкаМинЗапас" Тогда
		Оповещение = Новый ОписаниеОповещения("ЗаписатьМинимальноеКоличествоЗапаса", ЭтотОбъект,
			Новый Структура("Номенклатура", Номенклатура));
		
		ПоказатьВводЧисла(Оповещение, ТекущиеДанные.МинЗапас, "Минимальные запасы");

	ИначеЕсли Поле.Имя = "УпаковкаМаксЗапас" Тогда
		Оповещение = Новый ОписаниеОповещения("ЗаписатьМаксимальноеКоличествоЗапаса", ЭтотОбъект,
			Новый Структура("Номенклатура", Номенклатура));
		
		ПоказатьВводЧисла(Оповещение, ТекущиеДанные.МаксЗапас, "Максимальные запасы");
		
	Иначе
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура", Номенклатура);
		Отбор.Вставить("Склад", Склад);

		Период = Новый СтандартныйПериод;
		Период.Вариант = ВариантСтандартногоПериода.Месяц;

		ПользовательскиеНастройки = Новый Структура;
		ПользовательскиеНастройки.Вставить("Период", Период);

		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
		ПараметрыФормы.Вставить("КлючНазначенияИспользования", "УпрЗапасами" + Номенклатура + Склад);
		ПараметрыФормы.Вставить("ВидимостьКомандВариантовОтчетов", Ложь);
		ПараметрыФормы.Вставить("Отбор", Отбор);
		ПараметрыФормы.Вставить("КлючВарианта", "ДвижениеТоваров");
		ПараметрыФормы.Вставить("ПользовательскиеНастройки", ПолучитьИзВременногоХранилища(
			AMS_ВызовСервера.ПолучитьАдресПользовательскиеНастройки("AMS_ДвижениеТоваров", ПользовательскиеНастройки,
			"ДвижениеТоваров")));

		ОткрытьФорму("Отчет.AMS_ДвижениеТоваров.Форма", ПараметрыФормы);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСырье

&НаКлиенте
Процедура СырьеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;

	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Номенклатура = ТекущиеДанные.Номенклатура;

	Если Поле.Имя = "СырьеМинЗапас" Тогда
		Оповещение = Новый ОписаниеОповещения("ЗаписатьМинимальноеКоличествоЗапаса", ЭтотОбъект,
			Новый Структура("Номенклатура", Номенклатура));
		
		ПоказатьВводЧисла(Оповещение, ТекущиеДанные.МинЗапас, "Минимальные запасы");

	ИначеЕсли Поле.Имя = "СырьеМаксЗапас" Тогда
		Оповещение = Новый ОписаниеОповещения("ЗаписатьМаксимальноеКоличествоЗапаса", ЭтотОбъект,
			Новый Структура("Номенклатура", Номенклатура));
		
		ПоказатьВводЧисла(Оповещение, ТекущиеДанные.МаксЗапас, "Максимальные запасы");
		
	Иначе
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура", Номенклатура);
		Отбор.Вставить("Склад", Склад);

		Период = Новый СтандартныйПериод;
		Период.Вариант = ВариантСтандартногоПериода.Месяц;

		ПользовательскиеНастройки = Новый Структура;
		ПользовательскиеНастройки.Вставить("Период", Период);

		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
		ПараметрыФормы.Вставить("КлючНазначенияИспользования", "УпрЗапасами" + Номенклатура + Склад);
		ПараметрыФормы.Вставить("ВидимостьКомандВариантовОтчетов", Ложь);
		ПараметрыФормы.Вставить("Отбор", Отбор);
		ПараметрыФормы.Вставить("КлючВарианта", "ДвижениеТоваров");
		ПараметрыФормы.Вставить("ПользовательскиеНастройки", ПолучитьИзВременногоХранилища(
			AMS_ВызовСервера.ПолучитьАдресПользовательскиеНастройки("AMS_ДвижениеТоваров", ПользовательскиеНастройки,
			"ДвижениеТоваров")));

		ОткрытьФорму("Отчет.AMS_ДвижениеТоваров.Форма", ПараметрыФормы);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Продукция.Отбор, "ПроизводствоЗаСмену",
			ПредопределенноеЗначение("Документ.AMS_ПроизводствоЗаСмену.ПустаяСсылка"), ВидСравненияКомпоновкиДанных.Равно,
			, Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Продукция.Отбор, "ПроизводствоЗаСмену",
			Элемент.ТекущаяСтрока, ВидСравненияКомпоновкиДанных.Равно, , Истина);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	ПоказатьПлан();
КонецПроцедуры

&НаКлиенте
Процедура Отчет_ПроизводствоПродукции(Команда)
	Парам = Новый Структура;
	Парам.Вставить("КлючНазначенияИспользования", "ПроизводствоПродукции");
	ОткрытьФорму("Отчет.AMS_ПроизводствоПродукции.Форма", Парам);
КонецПроцедуры

&НаКлиенте
Процедура Отчет_Зарплата(Команда)
	ОткрытьФорму("Отчет._Зарплата.Форма");
КонецПроцедуры

&НаКлиенте
Процедура Отчёт_ДвижениеТоваров(Команда)
	Парам = Новый Структура;
	Парам.Вставить("КлючНазначенияИспользования", "Сводка номенклатуры");
	ОткрытьФорму("Отчет.AMS_ДвижениеТоваров.Форма", Парам, ЭтотОбъект, "ДвижениеТоваров="
		+ ОбщегоНазначенияКлиент.ДатаСеанса());
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастройкаФормы()
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Склад", Склад,
		ВидСравненияКомпоновкиДанных.Равно, , ЗначениеЗаполнено(Склад));
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Статус", ПредопределенноеЗначение(
		"Перечисление._СтатусыПроизводства.Выполнено"), ВидСравненияКомпоновкиДанных.НеРавно, , СкрытьЗакрытые);
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	УсловноеОформление.Элементы.Очистить();

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Упаковка.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Упаковка.Минус");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ОтборЭлемента.ПравоеЗначение = 0;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветФонаВнимание);

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Сырье.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Сырье.Минус");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ОтборЭлемента.ПравоеЗначение = 0;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветФонаВнимание);

	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Поступления.Имя);

	ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;

	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Поступления.НомерВходящегоДокумента");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;

	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Поступления.ДатаВходящегоДокумента");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветВажного);
КонецПроцедуры

&НаСервере
Процедура ПоказатьПлан()
	//Получить начальную дату
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НАЧАЛОПЕРИОДА(т.Дата, ДЕНЬ) КАК Дата
	|ИЗ
	|	Документ.AMS_ПроизводствоЗаСмену КАК т
	|ГДЕ
	|	т.Склад = &Склад
	|	И НЕ т.Статус В (ЗНАЧЕНИЕ(Перечисление._СтатусыПроизводства.Выполнено), ЗНАЧЕНИЕ(Перечисление._СтатусыПроизводства.РасчётЗарплаты))
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	Рез = Запрос.Выполнить();

	Если Рез.Пустой() Тогда
		Дата1 = НачалоДня(ТекущаяДатаСеанса());
	Иначе
		Выб = Рез.Выбрать();
		Выб.Следующий();
		Дата1 = Выб.Дата;
	КонецЕсли;

	Дата2 = мср.ПолучитьРабочийДень(1, Дата1);
	Дата3 = мср.ПолучитьРабочийДень(2, Дата1);
	Дата4 = мср.ПолучитьРабочийДень(3, Дата1);

	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтрПлан Тогда
		ПоказатьПланПроизводства();

		Элементы.ПланГруппа1.Заголовок = Формат(Дата1, "ДЛФ=ДД");
		Элементы.ПланГруппа2.Заголовок = Формат(Дата2, "ДЛФ=ДД");
		Элементы.ПланГруппа3.Заголовок = Формат(Дата3, "ДЛФ=ДД");
		Элементы.ПланГруппа4.Заголовок = Формат(Дата4, "ДЛФ=ДД");

	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтрУпаковка Тогда
		ПоказатьРасходМатериалов("Упаковка");

		Элементы.УпаковкаГруппа1.Заголовок = Формат(Дата1, "ДЛФ=ДД");
		Элементы.УпаковкаГруппа2.Заголовок = Формат(Дата2, "ДЛФ=ДД");
		Элементы.УпаковкаГруппа3.Заголовок = Формат(Дата3, "ДЛФ=ДД");
		Элементы.УпаковкаГруппа4.Заголовок = Формат(Дата4, "ДЛФ=ДД");

	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтрСырье Тогда
		ПоказатьРасходМатериалов("Сырье");

		Элементы.СырьеГруппа1.Заголовок = Формат(Дата1, "ДЛФ=ДД");
		Элементы.СырьеГруппа2.Заголовок = Формат(Дата2, "ДЛФ=ДД");
		Элементы.СырьеГруппа3.Заголовок = Формат(Дата3, "ДЛФ=ДД");
		Элементы.СырьеГруппа4.Заголовок = Формат(Дата4, "ДЛФ=ДД");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПоказатьПланПроизводства()
	Табл = ПолучитьДанныеПланаПроизводства();

	НомерСтроки = 0;
	Сегмент     = Неопределено;

	План.Очистить();

	Для Каждого Стр Из Табл Цикл
		Если Не Сегмент = Стр.Сегмент Тогда
			Сегмент = Стр.Сегмент;
			НовСтр = План.Добавить();
			НовСтр.Номенклатура = Стр.Сегмент;
		КонецЕсли;

		НовСтр = План.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Стр);

		НомерСтроки = НомерСтроки + 1;
		НовСтр.НомерСтроки = НомерСтроки;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеПланаПроизводства()
	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("Склад", Склад);

	Запрос.УстановитьПараметр("Дата1", Дата1);
	Запрос.УстановитьПараметр("Дата2", Дата2);
	Запрос.УстановитьПараметр("Дата3", Дата3);
	Запрос.УстановитьПараметр("Дата4", Дата4);

	Запрос.УстановитьПараметр("Бытхим", AMS_ВызовСервера.СегментыНоменклатурыБытхим());
	Запрос.УстановитьПараметр("Инсектициды", AMS_ВызовСервера.СегментыНоменклатурыИнсектициды());
	Запрос.УстановитьПараметр("Контракт", AMS_ВызовСервера.СегментыНоменклатурыКонтракт());
	Запрос.УстановитьПараметр("Косметика", AMS_ВызовСервера.СегментыНоменклатурыКосметика());
	Запрос.УстановитьПараметр("Мега", AMS_ВызовСервера.СегментыНоменклатурыМега());
	Запрос.УстановитьПараметр("Моющие", AMS_ВызовСервера.СегментыНоменклатурыМоющие());
	Запрос.УстановитьПараметр("Стирка", AMS_ВызовСервера.СегментыНоменклатурыСтирка());
	Запрос.УстановитьПараметр("Чистота", AMS_ВызовСервера.СегментыНоменклатурыЧистота());

	Запрос.Текст =
	"ВЫБРАТЬ
	|	д.Ссылка КАК Ссылка,
	|	д.Дата КАК Дата,
	|	д.Смена КАК Смена,
	|	прод.Номенклатура КАК Номенклатура,
	|	прод.КоличествоПлан КАК План,
	|	Ном.Артикул КАК Артикул,
	|	Ном._НомерВПрайсе КАК НомерВПрайсе
	|ПОМЕСТИТЬ н
	|ИЗ
	|	Документ.AMS_ПроизводствоЗаСмену КАК д
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.AMS_ПроизводствоЗаСмену.Продукция КАК прод
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|			ПО прод.Номенклатура = Ном.Ссылка
	|		ПО д.Ссылка = прод.Ссылка
	|ГДЕ
	|	д.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата1, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата4, ДЕНЬ)
	|	И д.Склад = &Склад
	|	И НЕ д.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Сегмент КАК Сегмент,
	|	т.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ сег
	|ИЗ
	|	РегистрСведений.НоменклатураСегмента КАК т
	|ГДЕ
	|	т.Сегмент = &Моющие
	|	И т.Номенклатура В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				н.Номенклатура КАК Номенклатура
	|			ИЗ
	|				н КАК н)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	т.Сегмент,
	|	т.Номенклатура
	|ИЗ
	|	РегистрСведений.НоменклатураСегмента КАК т
	|ГДЕ
	|	т.Сегмент = &Стирка
	|	И т.Номенклатура В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				н.Номенклатура КАК Номенклатура
	|			ИЗ
	|				н КАК н)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	т.Сегмент,
	|	т.Номенклатура
	|ИЗ
	|	РегистрСведений.НоменклатураСегмента КАК т
	|ГДЕ
	|	т.Сегмент = &Косметика
	|	И т.Номенклатура В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				н.Номенклатура КАК Номенклатура
	|			ИЗ
	|				н КАК н)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	т.Сегмент,
	|	т.Номенклатура
	|ИЗ
	|	РегистрСведений.НоменклатураСегмента КАК т
	|ГДЕ
	|	т.Сегмент = &Чистота
	|	И т.Номенклатура В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				н.Номенклатура КАК Номенклатура
	|			ИЗ
	|				н КАК н)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	т.Сегмент,
	|	т.Номенклатура
	|ИЗ
	|	РегистрСведений.НоменклатураСегмента КАК т
	|ГДЕ
	|	т.Сегмент = &Инсектициды
	|	И т.Номенклатура В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				н.Номенклатура КАК Номенклатура
	|			ИЗ
	|				н КАК н)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	т.Сегмент,
	|	т.Номенклатура
	|ИЗ
	|	РегистрСведений.НоменклатураСегмента КАК т
	|ГДЕ
	|	т.Сегмент = &Бытхим
	|	И т.Номенклатура В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				н.Номенклатура КАК Номенклатура
	|			ИЗ
	|				н КАК н)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	т.Сегмент,
	|	т.Номенклатура
	|ИЗ
	|	РегистрСведений.НоменклатураСегмента КАК т
	|ГДЕ
	|	т.Сегмент = &Мега
	|	И т.Номенклатура В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				н.Номенклатура КАК Номенклатура
	|			ИЗ
	|				н КАК н)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	т.Сегмент,
	|	т.Номенклатура
	|ИЗ
	|	РегистрСведений.НоменклатураСегмента КАК т
	|ГДЕ
	|	т.Сегмент = &Контракт
	|	И т.Номенклатура В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				н.Номенклатура КАК Номенклатура
	|			ИЗ
	|				н КАК н)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	н.Ссылка КАК Ссылка,
	|	н.Дата КАК Дата,
	|	н.Смена КАК Смена,
	|	н.Номенклатура КАК Номенклатура,
	|	н.Артикул КАК Артикул,
	|	сег.Сегмент КАК Сегмент,
	|	н.НомерВПрайсе КАК НомерВПрайсе,
	|	н.План КАК План,
	|	н.Номенклатура.Наименование КАК НоменклатураНаименование,
	|	сег.Сегмент.Наименование КАК СегментНаименование
	|ПОМЕСТИТЬ Тов
	|ИЗ
	|	н КАК н
	|		ЛЕВОЕ СОЕДИНЕНИЕ сег КАК сег
	|		ПО н.Номенклатура = сег.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тов.Ссылка КАК Ссылка,
	|	тов.Номенклатура КАК Номенклатура,
	|	тов.План КАК ПланД1
	|ПОМЕСТИТЬ День1
	|ИЗ
	|	Тов КАК тов
	|ГДЕ
	|	тов.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата1, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата1, ДЕНЬ)
	|	И тов.Смена = ЗНАЧЕНИЕ(Перечисление._ПроизводственныеСмены.Дневная)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тов.Ссылка КАК Ссылка,
	|	тов.Номенклатура КАК Номенклатура,
	|	тов.План КАК ПланН1
	|ПОМЕСТИТЬ Ночь1
	|ИЗ
	|	Тов КАК тов
	|ГДЕ
	|	тов.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата1, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата1, ДЕНЬ)
	|	И тов.Смена = ЗНАЧЕНИЕ(Перечисление._ПроизводственныеСмены.Вечерняя)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тов.Ссылка КАК Ссылка,
	|	тов.Номенклатура КАК Номенклатура,
	|	тов.План КАК ПланД2
	|ПОМЕСТИТЬ День2
	|ИЗ
	|	Тов КАК тов
	|ГДЕ
	|	тов.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата2, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ)
	|	И тов.Смена = ЗНАЧЕНИЕ(Перечисление._ПроизводственныеСмены.Дневная)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тов.Ссылка КАК Ссылка,
	|	тов.Номенклатура КАК Номенклатура,
	|	тов.План КАК ПланН2
	|ПОМЕСТИТЬ Ночь2
	|ИЗ
	|	Тов КАК тов
	|ГДЕ
	|	тов.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата2, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ)
	|	И тов.Смена = ЗНАЧЕНИЕ(Перечисление._ПроизводственныеСмены.Вечерняя)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тов.Ссылка КАК Ссылка,
	|	тов.Номенклатура КАК Номенклатура,
	|	тов.План КАК ПланД3
	|ПОМЕСТИТЬ День3
	|ИЗ
	|	Тов КАК тов
	|ГДЕ
	|	тов.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата3, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата3, ДЕНЬ)
	|	И тов.Смена = ЗНАЧЕНИЕ(Перечисление._ПроизводственныеСмены.Дневная)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тов.Ссылка КАК Ссылка,
	|	тов.Номенклатура КАК Номенклатура,
	|	тов.План КАК ПланН3
	|ПОМЕСТИТЬ Ночь3
	|ИЗ
	|	Тов КАК тов
	|ГДЕ
	|	тов.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата3, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата3, ДЕНЬ)
	|	И тов.Смена = ЗНАЧЕНИЕ(Перечисление._ПроизводственныеСмены.Вечерняя)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тов.Ссылка КАК Ссылка,
	|	тов.Номенклатура КАК Номенклатура,
	|	тов.План КАК ПланД4
	|ПОМЕСТИТЬ День4
	|ИЗ
	|	Тов КАК тов
	|ГДЕ
	|	тов.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата4, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата4, ДЕНЬ)
	|	И тов.Смена = ЗНАЧЕНИЕ(Перечисление._ПроизводственныеСмены.Дневная)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тов.Ссылка КАК Ссылка,
	|	тов.Номенклатура КАК Номенклатура,
	|	тов.План КАК ПланН4
	|ПОМЕСТИТЬ Ночь4
	|ИЗ
	|	Тов КАК тов
	|ГДЕ
	|	тов.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата4, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата4, ДЕНЬ)
	|	И тов.Смена = ЗНАЧЕНИЕ(Перечисление._ПроизводственныеСмены.Вечерняя)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	д._Основание КАК Ссылка,
	|	т.Номенклатура КАК Номенклатура,
	|	СУММА(т.КоличествоУпаковок) КАК ФактД1
	|ПОМЕСТИТЬ ФактД
	|ИЗ
	|	Документ.ПрочееОприходованиеТоваров КАК д
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПрочееОприходованиеТоваров.Товары КАК т
	|		ПО д.Ссылка = т.Ссылка
	|ГДЕ
	|	д._Основание В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				т.Ссылка КАК Ссылка
	|			ИЗ
	|				День1 КАК т)
	|	И НЕ д._Производство
	|
	|СГРУППИРОВАТЬ ПО
	|	т.Номенклатура,
	|	д._Основание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	СУММА(т.КоличествоУпаковок) КАК ФактН1,
	|	д._Основание КАК Ссылка
	|ПОМЕСТИТЬ ФактН
	|ИЗ
	|	Документ.ПрочееОприходованиеТоваров КАК д
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПрочееОприходованиеТоваров.Товары КАК т
	|		ПО д.Ссылка = т.Ссылка
	|ГДЕ
	|	д._Основание В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				т.Ссылка КАК Ссылка
	|			ИЗ
	|				Ночь1 КАК т)
	|	И НЕ д._Производство
	|
	|СГРУППИРОВАТЬ ПО
	|	т.Номенклатура,
	|	д._Основание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	СУММА(ВЫБОР
	|			КОГДА д.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПеремещенийТоваров.Отгружено)
	|				ТОГДА т.КоличествоУпаковок
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОтгруженоД1,
	|	СУММА(ВЫБОР
	|			КОГДА д.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПеремещенийТоваров.Принято)
	|				ТОГДА т.КоличествоУпаковок
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ПринятоД1,
	|	д._Основание КАК Ссылка
	|ПОМЕСТИТЬ ПеремД
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК д
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров.Товары КАК т
	|		ПО д.Ссылка = т.Ссылка
	|ГДЕ
	|	д._Основание В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				т.Ссылка КАК Ссылка
	|			ИЗ
	|				День1 КАК т)
	|
	|СГРУППИРОВАТЬ ПО
	|	т.Номенклатура,
	|	д._Основание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	СУММА(ВЫБОР
	|			КОГДА д.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПеремещенийТоваров.Отгружено)
	|				ТОГДА т.КоличествоУпаковок
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОтгруженоН1,
	|	СУММА(ВЫБОР
	|			КОГДА д.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПеремещенийТоваров.Принято)
	|				ТОГДА т.КоличествоУпаковок
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ПринятоН1,
	|	д._Основание КАК Ссылка
	|ПОМЕСТИТЬ ПеремН
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК д
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров.Товары КАК т
	|		ПО д.Ссылка = т.Ссылка
	|ГДЕ
	|	д._Основание В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				т.Ссылка КАК Ссылка
	|			ИЗ
	|				Ночь1 КАК т)
	|
	|СГРУППИРОВАТЬ ПО
	|	т.Номенклатура,
	|	д._Основание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Тов.Ссылка КАК Ссылка,
	|	Тов.Дата КАК Дата,
	|	Тов.Смена КАК Смена,
	|	Тов.Номенклатура КАК Номенклатура,
	|	Тов.Артикул КАК Артикул,
	|	Тов.Сегмент КАК Сегмент,
	|	Тов.НомерВПрайсе КАК НомерВПрайсе,
	|	ЕСТЬNULL(День1.ПланД1, 0) КАК ПланД1,
	|	ЕСТЬNULL(ФактД.ФактД1, 0) КАК ФактД1,
	|	ЕСТЬNULL(ПеремД.ОтгруженоД1, 0) КАК ОтгруженоД1,
	|	ЕСТЬNULL(ПеремД.ПринятоД1, 0) КАК ПринятоД1,
	|	ЕСТЬNULL(Ночь1.ПланН1, 0) КАК ПланН1,
	|	ЕСТЬNULL(ФактН.ФактН1, 0) КАК ФактН1,
	|	ЕСТЬNULL(ПеремН.ОтгруженоН1, 0) КАК ОтгруженоН1,
	|	ЕСТЬNULL(ПеремН.ПринятоН1, 0) КАК ПринятоН1,
	|	ЕСТЬNULL(День2.ПланД2, 0) КАК ПланД2,
	|	ЕСТЬNULL(Ночь2.ПланН2, 0) КАК ПланН2,
	|	ЕСТЬNULL(День3.ПланД3, 0) КАК ПланД3,
	|	ЕСТЬNULL(Ночь3.ПланН3, 0) КАК ПланН3,
	|	ЕСТЬNULL(День4.ПланД4, 0) КАК ПланД4,
	|	ЕСТЬNULL(Ночь4.ПланН4, 0) КАК ПланН4,
	|	ЕСТЬNULL(День1.ПланД1, 0) + ЕСТЬNULL(Ночь1.ПланН1, 0) + ЕСТЬNULL(День2.ПланД2, 0) + ЕСТЬNULL(Ночь2.ПланН2, 0) + ЕСТЬNULL(День3.ПланД3, 0) + ЕСТЬNULL(Ночь3.ПланН3, 0) + ЕСТЬNULL(День4.ПланД4, 0) + ЕСТЬNULL(Ночь4.ПланН4, 0) КАК Итого,
	|	Тов.СегментНаименование КАК СегментНаименование,
	|	Тов.НоменклатураНаименование КАК НоменклатураНаименование
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	Тов КАК Тов
	|		ЛЕВОЕ СОЕДИНЕНИЕ День1 КАК День1
	|		ПО Тов.Номенклатура = День1.Номенклатура
	|			И Тов.Ссылка = День1.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Ночь1 КАК Ночь1
	|		ПО Тов.Номенклатура = Ночь1.Номенклатура
	|			И Тов.Ссылка = Ночь1.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ День2 КАК День2
	|		ПО Тов.Номенклатура = День2.Номенклатура
	|			И Тов.Ссылка = День2.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Ночь2 КАК Ночь2
	|		ПО Тов.Номенклатура = Ночь2.Номенклатура
	|			И Тов.Ссылка = Ночь2.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ День3 КАК День3
	|		ПО Тов.Номенклатура = День3.Номенклатура
	|			И Тов.Ссылка = День3.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Ночь3 КАК Ночь3
	|		ПО Тов.Номенклатура = Ночь3.Номенклатура
	|			И Тов.Ссылка = Ночь3.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ День4 КАК День4
	|		ПО Тов.Номенклатура = День4.Номенклатура
	|			И Тов.Ссылка = День4.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Ночь4 КАК Ночь4
	|		ПО Тов.Номенклатура = Ночь4.Номенклатура
	|			И Тов.Ссылка = Ночь4.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ФактД КАК ФактД
	|		ПО Тов.Номенклатура = ФактД.Номенклатура
	|			И Тов.Ссылка = ФактД.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ФактН КАК ФактН
	|		ПО Тов.Номенклатура = ФактН.Номенклатура
	|			И Тов.Ссылка = ФактН.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПеремД КАК ПеремД
	|		ПО Тов.Номенклатура = ПеремД.Номенклатура
	|			И Тов.Ссылка = ПеремД.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПеремН КАК ПеремН
	|		ПО Тов.Номенклатура = ПеремН.Номенклатура
	|			И Тов.Ссылка = ПеремН.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.Сегмент КАК Сегмент,
	|	вт.Артикул КАК Артикул,
	|	вт.Номенклатура КАК Номенклатура,
	|	СУММА(вт.ПланД1) КАК ПланД1,
	|	СУММА(вт.ФактД1) КАК ФактД1,
	|	СУММА(вт.ОтгруженоД1) КАК ОтгруженоД1,
	|	СУММА(вт.ПринятоД1) КАК ПринятоД1,
	|	СУММА(вт.ПланН1) КАК ПланН1,
	|	СУММА(вт.ФактН1) КАК ФактН1,
	|	СУММА(вт.ОтгруженоН1) КАК ОтгруженоН1,
	|	СУММА(вт.ПринятоН1) КАК ПринятоН1,
	|	СУММА(вт.ПланД2) КАК ПланД2,
	|	СУММА(вт.ПланН2) КАК ПланН2,
	|	СУММА(вт.ПланД3) КАК ПланД3,
	|	СУММА(вт.ПланН3) КАК ПланН3,
	|	СУММА(вт.ПланД4) КАК ПланД4,
	|	СУММА(вт.ПланН4) КАК ПланН4,
	|	СУММА(вт.Итого) КАК Итого,
	|	вт.СегментНаименование КАК СегментНаименование,
	|	вт.НоменклатураНаименование КАК НоменклатураНаименование
	|ИЗ
	|	вт КАК вт
	|
	|СГРУППИРОВАТЬ ПО
	|	вт.Артикул,
	|	вт.Сегмент,
	|	вт.Номенклатура,
	|	вт.СегментНаименование,
	|	вт.НоменклатураНаименование
	|
	|УПОРЯДОЧИТЬ ПО
	|	СегментНаименование,
	|	НоменклатураНаименование";

	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

&НаСервере
Процедура ПоказатьРасходМатериалов(ВидМатериала)
	НомерСтроки         = 0;
	КоличествоСообщений = 0;
	ТекстСообщения      = "Необходимо заказать поставку:" + Символы.ПС;
	
	Если ВидМатериала = "Упаковка" Тогда
		ЭлементФормы  = Элементы.СтрУпаковка;
		Табл          = Упаковка;
		ДанныеРасхода = ПолучитьДанныеРасходаУпаковки();
			
	ИначеЕсли ВидМатериала = "Сырье" Тогда
		ЭлементФормы  = Элементы.СтрСырье;	
		Табл          = Сырье;
		ДанныеРасхода = ПолучитьДанныеРасходаСырья();
	КонецЕсли;

	Табл.Очистить();

	Для Каждого Стр Из ДанныеРасхода Цикл
		НомерСтроки = НомерСтроки + 1;
		
		НовСтр = Табл.Добавить();
		
		ЗаполнитьЗначенияСвойств(НовСтр, Стр);

		НовСтр.НомерСтроки = НомерСтроки;
		
		Если Стр.Минус < 0 Тогда
			КоличествоСообщений = КоличествоСообщений + 1;
			ТекстСообщения = ТекстСообщения + КоличествоСообщений + ". " + Стр.Номенклатура + Символы.ПС;
		КонецЕсли;
	КонецЦикла;
	
	Если КоличествоСообщений > 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		ЭлементФормы.ЦветТекстаЗаголовка  = ЦветаСтиля.ЦветОтрицательногоЧисла;
	Иначе
		ЭлементФормы.ЦветТекстаЗаголовка  = Новый Цвет();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеРасходаУпаковки()
	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("ВидыНоменклатуры", AMS_ВызовСервера.ВидыНоменклатурыФабрикаты());

	Запрос.УстановитьПараметр("Дата", Дата1 + (3600 * 9 - 1));
	Запрос.УстановитьПараметр("Дата1", Дата1);
	Запрос.УстановитьПараметр("Дата2", Дата2);
	Запрос.УстановитьПараметр("Дата3", Дата3);
	Запрос.УстановитьПараметр("Дата4", Дата4);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	с.Номенклатура КАК Номенклатура,
	|	СУММА(с.Количество * т.КоличествоПлан) КАК Расход11
	|ПОМЕСТИТЬ вт11
	|ИЗ
	|	Документ.AMS_ПроизводствоЗаСмену.Продукция КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.AMS_ПроизводствоЗаСмену КАК д
	|		ПО т.Ссылка = д.Ссылка
	|		И НЕ д.ПометкаУдаления
	|		И д.Смена = ЗНАЧЕНИЕ(Перечисление._ПроизводственныеСмены.Дневная)
	|		И д.Склад В (&Склад)
	|		И д.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата1, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата1, ДЕНЬ)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры.Товары КАК с
	|		ПО т.Спецификация = с.Ссылка
	|		И НЕ с.Номенклатура.ВидНоменклатуры В (&ВидыНоменклатуры)
	|СГРУППИРОВАТЬ ПО
	|	с.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	с.Номенклатура КАК Номенклатура,
	|	СУММА(с.Количество * т.КоличествоПлан) КАК Расход12
	|ПОМЕСТИТЬ вт12
	|ИЗ
	|	Документ.AMS_ПроизводствоЗаСмену.Продукция КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.AMS_ПроизводствоЗаСмену КАК д
	|		ПО т.Ссылка = д.Ссылка
	|		И НЕ д.ПометкаУдаления
	|		И д.Смена = ЗНАЧЕНИЕ(Перечисление._ПроизводственныеСмены.Вечерняя)
	|		И д.Склад В (&Склад)
	|		И д.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата1, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата1, ДЕНЬ)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры.Товары КАК с
	|		ПО т.Спецификация = с.Ссылка
	|		И НЕ с.Номенклатура.ВидНоменклатуры В (&ВидыНоменклатуры)
	|СГРУППИРОВАТЬ ПО
	|	с.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	с.Номенклатура КАК Номенклатура,
	|	СУММА(с.Количество * т.КоличествоПлан) КАК Расход21
	|ПОМЕСТИТЬ вт21
	|ИЗ
	|	Документ.AMS_ПроизводствоЗаСмену.Продукция КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.AMS_ПроизводствоЗаСмену КАК д
	|		ПО т.Ссылка = д.Ссылка
	|		И НЕ д.ПометкаУдаления
	|		И д.Смена = ЗНАЧЕНИЕ(Перечисление._ПроизводственныеСмены.Дневная)
	|		И д.Склад В (&Склад)
	|		И д.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата2, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры.Товары КАК с
	|		ПО т.Спецификация = с.Ссылка
	|		И НЕ с.Номенклатура.ВидНоменклатуры В (&ВидыНоменклатуры)
	|СГРУППИРОВАТЬ ПО
	|	с.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	с.Номенклатура КАК Номенклатура,
	|	СУММА(с.Количество * т.КоличествоПлан) КАК Расход22
	|ПОМЕСТИТЬ вт22
	|ИЗ
	|	Документ.AMS_ПроизводствоЗаСмену.Продукция КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.AMS_ПроизводствоЗаСмену КАК д
	|		ПО т.Ссылка = д.Ссылка
	|		И НЕ д.ПометкаУдаления
	|		И д.Смена = ЗНАЧЕНИЕ(Перечисление._ПроизводственныеСмены.Вечерняя)
	|		И д.Склад В (&Склад)
	|		И д.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата2, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры.Товары КАК с
	|		ПО т.Спецификация = с.Ссылка
	|		И НЕ с.Номенклатура.ВидНоменклатуры В (&ВидыНоменклатуры)
	|СГРУППИРОВАТЬ ПО
	|	с.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	с.Номенклатура КАК Номенклатура,
	|	СУММА(с.Количество * т.КоличествоПлан) КАК Расход31
	|ПОМЕСТИТЬ вт31
	|ИЗ
	|	Документ.AMS_ПроизводствоЗаСмену.Продукция КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.AMS_ПроизводствоЗаСмену КАК д
	|		ПО т.Ссылка = д.Ссылка
	|		И НЕ д.ПометкаУдаления
	|		И д.Смена = ЗНАЧЕНИЕ(Перечисление._ПроизводственныеСмены.Дневная)
	|		И д.Склад В (&Склад)
	|		И д.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата3, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата3, ДЕНЬ)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры.Товары КАК с
	|		ПО т.Спецификация = с.Ссылка
	|		И НЕ с.Номенклатура.ВидНоменклатуры В (&ВидыНоменклатуры)
	|СГРУППИРОВАТЬ ПО
	|	с.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	с.Номенклатура КАК Номенклатура,
	|	СУММА(с.Количество * т.КоличествоПлан) КАК Расход32
	|ПОМЕСТИТЬ вт32
	|ИЗ
	|	Документ.AMS_ПроизводствоЗаСмену.Продукция КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.AMS_ПроизводствоЗаСмену КАК д
	|		ПО т.Ссылка = д.Ссылка
	|		И НЕ д.ПометкаУдаления
	|		И д.Смена = ЗНАЧЕНИЕ(Перечисление._ПроизводственныеСмены.Вечерняя)
	|		И д.Склад В (&Склад)
	|		И д.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата3, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата3, ДЕНЬ)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры.Товары КАК с
	|		ПО т.Спецификация = с.Ссылка
	|		И НЕ с.Номенклатура.ВидНоменклатуры В (&ВидыНоменклатуры)
	|СГРУППИРОВАТЬ ПО
	|	с.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	с.Номенклатура КАК Номенклатура,
	|	СУММА(с.Количество * т.КоличествоПлан) КАК Расход41
	|ПОМЕСТИТЬ вт41
	|ИЗ
	|	Документ.AMS_ПроизводствоЗаСмену.Продукция КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.AMS_ПроизводствоЗаСмену КАК д
	|		ПО т.Ссылка = д.Ссылка
	|		И НЕ д.ПометкаУдаления
	|		И д.Смена = ЗНАЧЕНИЕ(Перечисление._ПроизводственныеСмены.Дневная)
	|		И д.Склад В (&Склад)
	|		И д.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата4, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата4, ДЕНЬ)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры.Товары КАК с
	|		ПО т.Спецификация = с.Ссылка
	|		И НЕ с.Номенклатура.ВидНоменклатуры В (&ВидыНоменклатуры)
	|СГРУППИРОВАТЬ ПО
	|	с.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	с.Номенклатура КАК Номенклатура,
	|	СУММА(с.Количество * т.КоличествоПлан) КАК Расход42
	|ПОМЕСТИТЬ вт42
	|ИЗ
	|	Документ.AMS_ПроизводствоЗаСмену.Продукция КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.AMS_ПроизводствоЗаСмену КАК д
	|		ПО т.Ссылка = д.Ссылка
	|		И НЕ д.ПометкаУдаления
	|		И д.Смена = ЗНАЧЕНИЕ(Перечисление._ПроизводственныеСмены.Вечерняя)
	|		И д.Склад В (&Склад)
	|		И д.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата4, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата4, ДЕНЬ)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры.Товары КАК с
	|		ПО т.Спецификация = с.Ссылка
	|		И НЕ с.Номенклатура.ВидНоменклатуры В (&ВидыНоменклатуры)
	|СГРУППИРОВАТЬ ПО
	|	с.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт11.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ тов1
	|ИЗ
	|	вт11 КАК вт11
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	вт12.Номенклатура
	|ИЗ
	|	вт12 КАК вт12
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	вт21.Номенклатура
	|ИЗ
	|	вт21 КАК вт21
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	вт22.Номенклатура
	|ИЗ
	|	вт22 КАК вт22
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	вт31.Номенклатура
	|ИЗ
	|	вт31 КАК вт31
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	вт32.Номенклатура
	|ИЗ
	|	вт32 КАК вт32
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	вт41.Номенклатура
	|ИЗ
	|	вт41 КАК вт41
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	вт42.Номенклатура
	|ИЗ
	|	вт42 КАК вт42
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	тов1.Номенклатура КАК Номенклатура,
	|	Ном.Наименование КАК Наименование,
	|	Ном.КоэффициентЕдиницыДляОтчетов КАК Кфц
	|ПОМЕСТИТЬ тов
	|ИЗ
	|	тов1 КАК тов1
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|		ПО тов1.Номенклатура = Ном.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.ВНаличииОстаток КАК Остаток
	|ПОМЕСТИТЬ ост
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(&Дата, Склад = &Склад
	|	И Номенклатура В
	|		(ВЫБРАТЬ
	|			т.Номенклатура КАК Номенклатура
	|		ИЗ
	|			тов КАК т)) КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тов.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ост.Остаток, 0) КАК Остаток,
	|	ЕСТЬNULL(вт11.Расход11, 0) КАК Расход11,
	|	ЕСТЬNULL(ост.Остаток, 0) - ЕСТЬNULL(вт11.Расход11, 0) КАК Остаток11,
	|	ЕСТЬNULL(вт12.Расход12, 0) КАК Расход12,
	|	ЕСТЬNULL(ост.Остаток, 0) - ЕСТЬNULL(вт11.Расход11, 0) - ЕСТЬNULL(вт12.Расход12, 0) КАК Остаток12,
	|	ЕСТЬNULL(вт21.Расход21, 0) КАК Расход21,
	|	ЕСТЬNULL(ост.Остаток, 0) - ЕСТЬNULL(вт11.Расход11, 0) - ЕСТЬNULL(вт12.Расход12, 0) - ЕСТЬNULL(вт21.Расход21, 0) КАК
	|		Остаток21,
	|	ЕСТЬNULL(вт22.Расход22, 0) КАК Расход22,
	|	ЕСТЬNULL(ост.Остаток, 0) - ЕСТЬNULL(вт11.Расход11, 0) - ЕСТЬNULL(вт12.Расход12, 0) - ЕСТЬNULL(вт21.Расход21, 0) -
	|		ЕСТЬNULL(вт22.Расход22, 0) КАК Остаток22,
	|	ЕСТЬNULL(вт31.Расход31, 0) КАК Расход31,
	|	ЕСТЬNULL(ост.Остаток, 0) - ЕСТЬNULL(вт11.Расход11, 0) - ЕСТЬNULL(вт12.Расход12, 0) - ЕСТЬNULL(вт21.Расход21, 0) -
	|		ЕСТЬNULL(вт22.Расход22, 0) - ЕСТЬNULL(вт31.Расход31, 0) КАК Остаток31,
	|	ЕСТЬNULL(вт32.Расход32, 0) КАК Расход32,
	|	ЕСТЬNULL(ост.Остаток, 0) - ЕСТЬNULL(вт11.Расход11, 0) - ЕСТЬNULL(вт12.Расход12, 0) - ЕСТЬNULL(вт21.Расход21, 0) -
	|		ЕСТЬNULL(вт22.Расход22, 0) - ЕСТЬNULL(вт31.Расход31, 0) - ЕСТЬNULL(вт32.Расход32, 0) КАК Остаток32,
	|	ЕСТЬNULL(вт41.Расход41, 0) КАК Расход41,
	|	ЕСТЬNULL(ост.Остаток, 0) - ЕСТЬNULL(вт11.Расход11, 0) - ЕСТЬNULL(вт12.Расход12, 0) - ЕСТЬNULL(вт21.Расход21, 0) -
	|		ЕСТЬNULL(вт22.Расход22, 0) - ЕСТЬNULL(вт31.Расход31, 0) - ЕСТЬNULL(вт32.Расход32, 0) - ЕСТЬNULL(вт41.Расход41,
	|		0) КАК Остаток41,
	|	ЕСТЬNULL(вт42.Расход42, 0) КАК Расход42,
	|	ЕСТЬNULL(ост.Остаток, 0) - ЕСТЬNULL(вт11.Расход11, 0) - ЕСТЬNULL(вт12.Расход12, 0) - ЕСТЬNULL(вт21.Расход21, 0) -
	|		ЕСТЬNULL(вт22.Расход22, 0) - ЕСТЬNULL(вт31.Расход31, 0) - ЕСТЬNULL(вт32.Расход32, 0) - ЕСТЬNULL(вт41.Расход41, 0) -
	|		ЕСТЬNULL(вт42.Расход42, 0) КАК Остаток42,
	|	тов.Наименование КАК Наименование,
	|	тов.Кфц КАК Кфц
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	тов КАК тов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ост КАК ост
	|		ПО тов.Номенклатура = ост.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт11 КАК вт11
	|		ПО тов.Номенклатура = вт11.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт12 КАК вт12
	|		ПО тов.Номенклатура = вт12.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт21 КАК вт21
	|		ПО тов.Номенклатура = вт21.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт22 КАК вт22
	|		ПО тов.Номенклатура = вт22.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт31 КАК вт31
	|		ПО тов.Номенклатура = вт31.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт32 КАК вт32
	|		ПО тов.Номенклатура = вт32.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт41 КАК вт41
	|		ПО тов.Номенклатура = вт41.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт42 КАК вт42
	|		ПО тов.Номенклатура = вт42.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	СУММА(т.Количество) КАК Заказано
	|ПОМЕСТИТЬ заказ
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК д
	|		ПО т.Ссылка = д.Ссылка
	|ГДЕ
	|	НЕ д.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовПоставщикам.Закрыт)
	|	И д.Склад = &Склад
	|СГРУППИРОВАТЬ ПО
	|	т.Номенклатура,
	|	т.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.Номенклатура КАК Номенклатура,
	|	вт.Остаток КАК Остаток,
	|	вт.Расход11 КАК Расход11,
	|	вт.Остаток11 КАК Остаток11,
	|	вт.Расход12 КАК Расход12,
	|	вт.Остаток12 КАК Остаток12,
	|	вт.Расход21 КАК Расход21,
	|	вт.Остаток21 КАК Остаток21,
	|	вт.Расход22 КАК Расход22,
	|	вт.Остаток22 КАК Остаток22,
	|	вт.Расход31 КАК Расход31,
	|	вт.Остаток31 КАК Остаток31,
	|	вт.Расход32 КАК Расход32,
	|	вт.Остаток32 КАК Остаток32,
	|	вт.Расход41 КАК Расход41,
	|	вт.Остаток41 КАК Остаток41,
	|	вт.Расход42 КАК Расход42,
	|	вт.Остаток42 КАК Остаток42,
	|	ЕСТЬNULL(мм.МинимальноеКоличествоЗапаса, 0) / вт.Кфц КАК МинЗапас,
	|	ЕСТЬNULL(мм.МаксимальноеКоличествоЗапаса, 0) / вт.Кфц КАК МаксЗапас,
	|	ЕСТЬNULL(заказ.Заказано, 0) КАК Заказано,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(мм.МинимальноеКоличествоЗапаса, 0) > 0
	|			ТОГДА ЕСТЬNULL(заказ.Заказано, 0) + ЕСТЬNULL(вт.Остаток42, 0) - ЕСТЬNULL(мм.МинимальноеКоличествоЗапаса, 0) /
	|				вт.Кфц
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Минус,
	|	вт.Наименование КАК Наименование
	|ИЗ
	|	вт КАК вт
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварныеОграничения КАК мм
	|		ПО вт.Номенклатура = мм.Номенклатура
	|		И мм.Склад = &Склад
	|		ЛЕВОЕ СОЕДИНЕНИЕ заказ КАК заказ
	|		ПО вт.Номенклатура = заказ.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";

	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

&НаСервере
Функция ПолучитьДанныеРасходаСырья()
	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("ВидыНоменклатуры", AMS_ВызовСервера.ВидыНоменклатурыФабрикаты());

	Запрос.УстановитьПараметр("Дата1", Дата1);
	Запрос.УстановитьПараметр("Дата2", Дата2);
	Запрос.УстановитьПараметр("Дата3", Дата3);
	Запрос.УстановитьПараметр("Дата4", Дата4);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ст.Номенклатура КАК Номенклатура,
	|	СУММА(ст.Количество * пт.КоличествоПлан / сд.Количество) КАК Расход11
	|ПОМЕСТИТЬ вт11
	|ИЗ
	|	Документ.AMS_ПроизводствоЗаСмену.Фабрикаты КАК пт
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.AMS_ПроизводствоЗаСмену КАК пд
	|		ПО пт.Ссылка = пд.Ссылка
	|		И НЕ пд.ПометкаУдаления
	|		И пд.Смена = ЗНАЧЕНИЕ(Перечисление._ПроизводственныеСмены.Дневная)
	|		И пд.Склад В (&Склад)
	|		И пд.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата1, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата1, ДЕНЬ)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры.Товары КАК ст
	|		ПО пт.Спецификация = ст.Ссылка
	|		И НЕ ст.Номенклатура.ВидНоменклатуры В (&ВидыНоменклатуры)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры КАК сд
	|		ПО пт.Спецификация = сд.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК н
	|		ПО ст.Номенклатура = н.Ссылка
	|		И НЕ н.Код = ""01-00000017""
	|СГРУППИРОВАТЬ ПО
	|	ст.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ст.Номенклатура КАК Номенклатура,
	|	СУММА(ст.Количество * пт.КоличествоПлан / сд.Количество) КАК Расход12
	|ПОМЕСТИТЬ вт12
	|ИЗ
	|	Документ.AMS_ПроизводствоЗаСмену.Фабрикаты КАК пт
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.AMS_ПроизводствоЗаСмену КАК пд
	|		ПО пт.Ссылка = пд.Ссылка
	|		И НЕ пд.ПометкаУдаления
	|		И пд.Смена = ЗНАЧЕНИЕ(Перечисление._ПроизводственныеСмены.Вечерняя)
	|		И пд.Склад В (&Склад)
	|		И пд.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата1, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата1, ДЕНЬ)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры.Товары КАК ст
	|		ПО пт.Спецификация = ст.Ссылка
	|		И НЕ ст.Номенклатура.ВидНоменклатуры В (&ВидыНоменклатуры)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры КАК сд
	|		ПО пт.Спецификация = сд.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК н
	|		ПО ст.Номенклатура = н.Ссылка
	|		И НЕ н.Код = ""01-00000017""
	|СГРУППИРОВАТЬ ПО
	|	ст.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ст.Номенклатура КАК Номенклатура,
	|	СУММА(ст.Количество * пт.КоличествоПлан / сд.Количество) КАК Расход21
	|ПОМЕСТИТЬ вт21
	|ИЗ
	|	Документ.AMS_ПроизводствоЗаСмену.Фабрикаты КАК пт
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.AMS_ПроизводствоЗаСмену КАК пд
	|		ПО пт.Ссылка = пд.Ссылка
	|		И НЕ пд.ПометкаУдаления
	|		И пд.Смена = ЗНАЧЕНИЕ(Перечисление._ПроизводственныеСмены.Дневная)
	|		И пд.Склад В (&Склад)
	|		И пд.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата2, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры.Товары КАК ст
	|		ПО пт.Спецификация = ст.Ссылка
	|		И НЕ ст.Номенклатура.ВидНоменклатуры В (&ВидыНоменклатуры)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры КАК сд
	|		ПО пт.Спецификация = сд.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК н
	|		ПО ст.Номенклатура = н.Ссылка
	|		И НЕ н.Код = ""01-00000017""
	|СГРУППИРОВАТЬ ПО
	|	ст.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ст.Номенклатура КАК Номенклатура,
	|	СУММА(ст.Количество * пт.КоличествоПлан / сд.Количество) КАК Расход22
	|ПОМЕСТИТЬ вт22
	|ИЗ
	|	Документ.AMS_ПроизводствоЗаСмену.Фабрикаты КАК пт
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.AMS_ПроизводствоЗаСмену КАК пд
	|		ПО пт.Ссылка = пд.Ссылка
	|		И НЕ пд.ПометкаУдаления
	|		И пд.Смена = ЗНАЧЕНИЕ(Перечисление._ПроизводственныеСмены.Вечерняя)
	|		И пд.Склад В (&Склад)
	|		И пд.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата2, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры.Товары КАК ст
	|		ПО пт.Спецификация = ст.Ссылка
	|		И НЕ ст.Номенклатура.ВидНоменклатуры В (&ВидыНоменклатуры)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры КАК сд
	|		ПО пт.Спецификация = сд.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК н
	|		ПО ст.Номенклатура = н.Ссылка
	|		И НЕ н.Код = ""01-00000017""
	|СГРУППИРОВАТЬ ПО
	|	ст.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ст.Номенклатура КАК Номенклатура,
	|	СУММА(ст.Количество * пт.КоличествоПлан / сд.Количество) КАК Расход31
	|ПОМЕСТИТЬ вт31
	|ИЗ
	|	Документ.AMS_ПроизводствоЗаСмену.Фабрикаты КАК пт
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.AMS_ПроизводствоЗаСмену КАК пд
	|		ПО пт.Ссылка = пд.Ссылка
	|		И НЕ пд.ПометкаУдаления
	|		И пд.Смена = ЗНАЧЕНИЕ(Перечисление._ПроизводственныеСмены.Дневная)
	|		И пд.Склад В (&Склад)
	|		И пд.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата3, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата3, ДЕНЬ)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры.Товары КАК ст
	|		ПО пт.Спецификация = ст.Ссылка
	|		И НЕ ст.Номенклатура.ВидНоменклатуры В (&ВидыНоменклатуры)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры КАК сд
	|		ПО пт.Спецификация = сд.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК н
	|		ПО ст.Номенклатура = н.Ссылка
	|		И НЕ н.Код = ""01-00000017""
	|СГРУППИРОВАТЬ ПО
	|	ст.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ст.Номенклатура КАК Номенклатура,
	|	СУММА(ст.Количество * пт.КоличествоПлан / сд.Количество) КАК Расход32
	|ПОМЕСТИТЬ вт32
	|ИЗ
	|	Документ.AMS_ПроизводствоЗаСмену.Фабрикаты КАК пт
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.AMS_ПроизводствоЗаСмену КАК пд
	|		ПО пт.Ссылка = пд.Ссылка
	|		И НЕ пд.ПометкаУдаления
	|		И пд.Смена = ЗНАЧЕНИЕ(Перечисление._ПроизводственныеСмены.Вечерняя)
	|		И пд.Склад В (&Склад)
	|		И пд.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата3, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата3, ДЕНЬ)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры.Товары КАК ст
	|		ПО пт.Спецификация = ст.Ссылка
	|		И НЕ ст.Номенклатура.ВидНоменклатуры В (&ВидыНоменклатуры)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры КАК сд
	|		ПО пт.Спецификация = сд.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК н
	|		ПО ст.Номенклатура = н.Ссылка
	|		И НЕ н.Код = ""01-00000017""
	|СГРУППИРОВАТЬ ПО
	|	ст.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ст.Номенклатура КАК Номенклатура,
	|	СУММА(ст.Количество * пт.КоличествоПлан / сд.Количество) КАК Расход41
	|ПОМЕСТИТЬ вт41
	|ИЗ
	|	Документ.AMS_ПроизводствоЗаСмену.Фабрикаты КАК пт
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.AMS_ПроизводствоЗаСмену КАК пд
	|		ПО пт.Ссылка = пд.Ссылка
	|		И НЕ пд.ПометкаУдаления
	|		И пд.Смена = ЗНАЧЕНИЕ(Перечисление._ПроизводственныеСмены.Дневная)
	|		И пд.Склад В (&Склад)
	|		И пд.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата4, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата4, ДЕНЬ)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры.Товары КАК ст
	|		ПО пт.Спецификация = ст.Ссылка
	|		И НЕ ст.Номенклатура.ВидНоменклатуры В (&ВидыНоменклатуры)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры КАК сд
	|		ПО пт.Спецификация = сд.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК н
	|		ПО ст.Номенклатура = н.Ссылка
	|		И НЕ н.Код = ""01-00000017""
	|СГРУППИРОВАТЬ ПО
	|	ст.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ст.Номенклатура КАК Номенклатура,
	|	СУММА(ст.Количество * пт.КоличествоПлан / сд.Количество) КАК Расход42
	|ПОМЕСТИТЬ вт42
	|ИЗ
	|	Документ.AMS_ПроизводствоЗаСмену.Фабрикаты КАК пт
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.AMS_ПроизводствоЗаСмену КАК пд
	|		ПО пт.Ссылка = пд.Ссылка
	|		И НЕ пд.ПометкаУдаления
	|		И пд.Смена = ЗНАЧЕНИЕ(Перечисление._ПроизводственныеСмены.Вечерняя)
	|		И пд.Склад В (&Склад)
	|		И пд.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата4, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата4, ДЕНЬ)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры.Товары КАК ст
	|		ПО пт.Спецификация = ст.Ссылка
	|		И НЕ ст.Номенклатура.ВидНоменклатуры В (&ВидыНоменклатуры)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры КАК сд
	|		ПО пт.Спецификация = сд.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК н
	|		ПО ст.Номенклатура = н.Ссылка
	|		И НЕ н.Код = ""01-00000017""
	|СГРУППИРОВАТЬ ПО
	|	ст.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт11.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ тов1
	|ИЗ
	|	вт11 КАК вт11
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	вт12.Номенклатура
	|ИЗ
	|	вт12 КАК вт12
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	вт21.Номенклатура
	|ИЗ
	|	вт21 КАК вт21
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	вт22.Номенклатура
	|ИЗ
	|	вт22 КАК вт22
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	вт31.Номенклатура
	|ИЗ
	|	вт31 КАК вт31
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	вт32.Номенклатура
	|ИЗ
	|	вт32 КАК вт32
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	вт41.Номенклатура
	|ИЗ
	|	вт41 КАК вт41
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	вт42.Номенклатура
	|ИЗ
	|	вт42 КАК вт42
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	тов1.Номенклатура КАК Номенклатура,
	|	Ном.ЕдиницаДляОтчетов КАК Ед,
	|	Ном.КоэффициентЕдиницыДляОтчетов КАК Кфц,
	|	Ном.Наименование КАК Наименование
	|ПОМЕСТИТЬ тов
	|ИЗ
	|	тов1 КАК тов1
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|		ПО тов1.Номенклатура = Ном.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.ВНаличииОстаток КАК Остаток
	|ПОМЕСТИТЬ ост
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(&Дата1, Склад = &Склад
	|	И Номенклатура В
	|		(ВЫБРАТЬ
	|			т.Номенклатура КАК Номенклатура
	|		ИЗ
	|			тов КАК т)) КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	СУММА(т.Количество) КАК Заказано
	|ПОМЕСТИТЬ заказ
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК д
	|		ПО т.Ссылка = д.Ссылка
	|ГДЕ
	|	НЕ д.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовПоставщикам.Закрыт)
	|	И д.Склад = &Склад
	|СГРУППИРОВАТЬ ПО
	|	т.Номенклатура,
	|	т.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тов.Номенклатура КАК Номенклатура,
	|	тов.Ед КАК Ед,
	|	ЕСТЬNULL(ост.Остаток, 0) / тов.Кфц КАК Остаток,
	|	ЕСТЬNULL(вт11.Расход11, 0) / тов.Кфц КАК Расход11,
	|	(ЕСТЬNULL(ост.Остаток, 0) - ЕСТЬNULL(вт11.Расход11, 0)) / тов.Кфц КАК Остаток11,
	|	ЕСТЬNULL(вт12.Расход12, 0) / тов.Кфц КАК Расход12,
	|	(ЕСТЬNULL(ост.Остаток, 0) - ЕСТЬNULL(вт11.Расход11, 0) - ЕСТЬNULL(вт12.Расход12, 0)) / тов.Кфц КАК Остаток12,
	|	ЕСТЬNULL(вт21.Расход21, 0) / тов.Кфц КАК Расход21,
	|	(ЕСТЬNULL(ост.Остаток, 0) - ЕСТЬNULL(вт11.Расход11, 0) - ЕСТЬNULL(вт12.Расход12, 0) - ЕСТЬNULL(вт21.Расход21, 0)) /
	|		тов.Кфц КАК Остаток21,
	|	ЕСТЬNULL(вт22.Расход22, 0) / тов.Кфц КАК Расход22,
	|	(ЕСТЬNULL(ост.Остаток, 0) - ЕСТЬNULL(вт11.Расход11, 0) - ЕСТЬNULL(вт12.Расход12, 0) - ЕСТЬNULL(вт21.Расход21, 0) -
	|		ЕСТЬNULL(вт22.Расход22, 0)) / тов.Кфц КАК Остаток22,
	|	ЕСТЬNULL(вт31.Расход31, 0) / тов.Кфц КАК Расход31,
	|	(ЕСТЬNULL(ост.Остаток, 0) - ЕСТЬNULL(вт11.Расход11, 0) - ЕСТЬNULL(вт12.Расход12, 0) - ЕСТЬNULL(вт21.Расход21, 0) -
	|		ЕСТЬNULL(вт22.Расход22, 0) - ЕСТЬNULL(вт31.Расход31, 0)) / тов.Кфц КАК Остаток31,
	|	ЕСТЬNULL(вт32.Расход32, 0) / тов.Кфц КАК Расход32,
	|	(ЕСТЬNULL(ост.Остаток, 0) - ЕСТЬNULL(вт11.Расход11, 0) - ЕСТЬNULL(вт12.Расход12, 0) - ЕСТЬNULL(вт21.Расход21, 0) -
	|		ЕСТЬNULL(вт22.Расход22, 0) - ЕСТЬNULL(вт31.Расход31, 0) - ЕСТЬNULL(вт32.Расход32, 0)) / тов.Кфц КАК Остаток32,
	|	ЕСТЬNULL(вт41.Расход41, 0) / тов.Кфц КАК Расход41,
	|	(ЕСТЬNULL(ост.Остаток, 0) - ЕСТЬNULL(вт11.Расход11, 0) - ЕСТЬNULL(вт12.Расход12, 0) - ЕСТЬNULL(вт21.Расход21, 0) -
	|		ЕСТЬNULL(вт22.Расход22, 0) - ЕСТЬNULL(вт31.Расход31, 0) - ЕСТЬNULL(вт32.Расход32, 0) - ЕСТЬNULL(вт41.Расход41, 0)) /
	|		тов.Кфц КАК Остаток41,
	|	ЕСТЬNULL(вт42.Расход42, 0) / тов.Кфц КАК Расход42,
	|	(ЕСТЬNULL(ост.Остаток, 0) - ЕСТЬNULL(вт11.Расход11, 0) - ЕСТЬNULL(вт12.Расход12, 0) - ЕСТЬNULL(вт21.Расход21, 0) -
	|		ЕСТЬNULL(вт22.Расход22, 0) - ЕСТЬNULL(вт31.Расход31, 0) - ЕСТЬNULL(вт32.Расход32, 0) - ЕСТЬNULL(вт41.Расход41, 0) -
	|		ЕСТЬNULL(вт42.Расход42, 0)) / тов.Кфц КАК Остаток42,
	|	тов.Наименование КАК Наименование,
	|	тов.Кфц КАК Кфц
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	тов КАК тов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ост КАК ост
	|		ПО тов.Номенклатура = ост.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт11 КАК вт11
	|		ПО тов.Номенклатура = вт11.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт12 КАК вт12
	|		ПО тов.Номенклатура = вт12.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт21 КАК вт21
	|		ПО тов.Номенклатура = вт21.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт22 КАК вт22
	|		ПО тов.Номенклатура = вт22.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт31 КАК вт31
	|		ПО тов.Номенклатура = вт31.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт32 КАК вт32
	|		ПО тов.Номенклатура = вт32.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт41 КАК вт41
	|		ПО тов.Номенклатура = вт41.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт42 КАК вт42
	|		ПО тов.Номенклатура = вт42.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.Номенклатура КАК Номенклатура,
	|	вт.Ед КАК Ед,
	|	вт.Остаток КАК Остаток,
	|	вт.Расход11 КАК Расход11,
	|	вт.Остаток11 КАК Остаток11,
	|	вт.Расход12 КАК Расход12,
	|	вт.Остаток12 КАК Остаток12,
	|	вт.Расход21 КАК Расход21,
	|	вт.Остаток21 КАК Остаток21,
	|	вт.Расход22 КАК Расход22,
	|	вт.Остаток22 КАК Остаток22,
	|	вт.Расход31 КАК Расход31,
	|	вт.Остаток31 КАК Остаток31,
	|	вт.Расход32 КАК Расход32,
	|	вт.Остаток32 КАК Остаток32,
	|	вт.Расход41 КАК Расход41,
	|	вт.Остаток41 КАК Остаток41,
	|	вт.Расход42 КАК Расход42,
	|	вт.Остаток42 КАК Остаток42,
	|	ЕСТЬNULL(мм.МинимальноеКоличествоЗапаса, 0) / вт.Кфц КАК МинЗапас,
	|	ЕСТЬNULL(мм.МаксимальноеКоличествоЗапаса, 0) / вт.Кфц КАК МаксЗапас,
	|	ЕСТЬNULL(заказ.Заказано, 0) КАК Заказано,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(мм.МинимальноеКоличествоЗапаса, 0) > 0
	|			ТОГДА ЕСТЬNULL(заказ.Заказано, 0) + ЕСТЬNULL(вт.Остаток42, 0) - ЕСТЬNULL(мм.МинимальноеКоличествоЗапаса, 0) /
	|				вт.Кфц
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Минус,
	|	вт.Наименование КАК Наименование
	|ИЗ
	|	вт КАК вт
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварныеОграничения КАК мм
	|		ПО вт.Номенклатура = мм.Номенклатура
	|		И мм.Склад = &Склад
	|		ЛЕВОЕ СОЕДИНЕНИЕ заказ КАК заказ
	|		ПО вт.Номенклатура = заказ.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";

	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

&НаСервере
Функция ПолучитьМассивДокументов_AMS_ПроизводствоЗаСмену(Дата, Смена, Номенклатура)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Смена", Смена);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	д.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.AMS_ПроизводствоЗаСмену КАК д
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.AMS_ПроизводствоЗаСмену.Продукция КАК т
	|		ПО д.Ссылка = т.Ссылка
	|ГДЕ
	|	д.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	|	И д.Смена = &Смена
	|	И т.Номенклатура = &Номенклатура";
	Рез = Запрос.Выполнить();

	Если Рез.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Возврат Рез.Выгрузить().ВыгрузитьКолонку("Ссылка");
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ЗаписатьМинимальноеКоличествоЗапаса(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	ПараметрыЗаписи = Новый Структура();
	ПараметрыЗаписи.Вставить("Ресурс", "МинимальноеКоличествоЗапаса");
	ПараметрыЗаписи.Вставить("Значение", Результат);
	ПараметрыЗаписи.Вставить("Склад", Склад);
	ПараметрыЗаписи.Вставить("Номенклатура", ДополнительныеПараметры.Номенклатура);
	
	AMS_ВызовСервера.ЗаписатьРегистрТоварныеОграничения(ПараметрыЗаписи);
		
	ПоказатьПлан();
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьМаксимальноеКоличествоЗапаса(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;	
	КонецЕсли;
		
	ПараметрыЗаписи = Новый Структура();
	ПараметрыЗаписи.Вставить("Ресурс", "МаксимальноеКоличествоЗапаса");
	ПараметрыЗаписи.Вставить("Значение", Результат);
	ПараметрыЗаписи.Вставить("Склад", Склад);
	ПараметрыЗаписи.Вставить("Номенклатура", ДополнительныеПараметры.Номенклатура);
	
	AMS_ВызовСервера.ЗаписатьРегистрТоварныеОграничения(ПараметрыЗаписи);
		
	ПоказатьПлан();
КонецПроцедуры

#КонецОбласти