#Область СлужебныеПроцедурыИФункции

// Функция - возвращает значения параметров шаблона
//
// Параметры:
//  ШаблонСсылка - СправочникСсылка.ДатаМобайл_ШаблоныДокументов - Ссылка на шаблон
//  СписокПараметров - Строка - Список параметров шаблона через запятую
// 
// Возвращаемое значение:
//   Структура 
//
Функция ПолучитьПараметрыШаблона(ШаблонСсылка, СписокПараметров = Неопределено) Экспорт
	
	Если СписокПараметров = Неопределено Тогда
		ПараметрыШаблона = ПолучитьСтруктуруРеквизитовШаблона();
	Иначе 
		ПараметрыШаблона = Новый Структура;
		СписокПараметров = СтрЗаменить(СписокПараметров, "", "");
		СписокПараметров = СтрЗаменить(СписокПараметров, Символы.ПС, "");
		СписокПараметровШаблона = СтрЗаменить(СписокПараметров, ",", Символы.ПС);
		
		КоличествоПараметров = СтрЧислоСтрок(СписокПараметровШаблона);
		
		Для сч = 1 По КоличествоПараметров Цикл 
			ПараметрыШаблона.Вставить(СтрПолучитьСтроку(СписокПараметровШаблона, сч));
		КонецЦикла;
	КонецЕсли;
	
	ТелоЗапроса = "";
	Первый = Истина;
	
	Для каждого ПараметрШаблона Из ПараметрыШаблона Цикл
		ТелоЗапроса = ТелоЗапроса + ?(Первый, "", "," + Символы.ПС + "	") + ПараметрШаблона.Ключ + " КАК " + ПараметрШаблона.Ключ;
		Первый = Ложь;
	КонецЦикла;
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Шаблон", ШаблонСсылка);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	1 = 1
	|ИЗ
	|	Справочник.ДатаМобайл_ШаблоныДокументов КАК ШаблоныДокументов
	|ГДЕ
	|	ШаблоныДокументов.Ссылка = &Шаблон";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", ТелоЗапроса);
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыШаблона, Выборка);
	КонецЕсли;
		
	Возврат ПараметрыШаблона;
	
КонецФункции

// Функция - возвращает значения параметров таб. части шаблона
//
// Параметры:
//  ШаблонСсылка - СправочникСсылка.ДатаМобайл_ШаблоныДокументов - Ссылка на шаблон
//  СписокПараметров - Строка - Список параметров шаблона через запятую
// 
// Возвращаемое значение:
//   Структура 
//
Функция ПолучитьПараметрыТабЧастиШаблона(ШаблонСсылка, ИмяТабЧасти, СписокПараметров = Неопределено) Экспорт
	
	Если СписокПараметров = Неопределено Тогда
		ПараметрыШаблона = Новый Структура;
		
		Для каждого Реквизит Из Метаданные.Справочники.ДатаМобайл_ШаблоныДокументов.ТабличныеЧасти[ИмяТабЧасти].Реквизиты Цикл
			ПараметрыШаблона.Вставить(Реквизит.Имя);
		КонецЦикла;
	Иначе
		ПараметрыШаблона = Новый Структура;		
		СписокПараметров = СтрЗаменить(СписокПараметров, "", "");
		СписокПараметров = СтрЗаменить(СписокПараметров, Символы.ПС, "");
		СписокПараметровШаблона = СтрЗаменить(СписокПараметров, ",", Символы.ПС);
		
		КоличествоПараметров = СтрЧислоСтрок(СписокПараметровШаблона);
		
		Для сч = 1 По КоличествоПараметров Цикл 
			ПараметрыШаблона.Вставить(СтрПолучитьСтроку(СписокПараметровШаблона, сч));
		КонецЦикла;
	КонецЕсли;
	
	ТелоЗапроса = "";
	Первый = Истина;
	
	Для каждого ПараметрШаблона Из ПараметрыШаблона Цикл
		ТелоЗапроса = ТелоЗапроса + ?(Первый, "", "," + Символы.ПС + "	") + ПараметрШаблона.Ключ + " КАК " + ПараметрШаблона.Ключ;
		Первый = Ложь;
	КонецЦикла;
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Шаблон", ШаблонСсылка);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	1 = 1
	|ИЗ
	|	Справочник.ДатаМобайл_ШаблоныДокументов. " + ИмяТабЧасти + " КАК ШаблоныДокументов
	|ГДЕ
	|	ШаблоныДокументов.Ссылка = &Шаблон";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", ТелоЗапроса);
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыШаблона, Выборка);
	КонецЕсли;
		
	Возврат ПараметрыШаблона;
	
КонецФункции

// Функция - возвращает структуру основных параметров шаблона
//
// Параметры:
// 
// Возвращаемое значение:
//   Структура 
//
Функция ПолучитьСтруктуруРеквизитовШаблона() Экспорт
	
	ЗапрашиваемыеРеквизиты = Новый Структура;
	ЗапрашиваемыеРеквизиты.Вставить("ВидДокумента");
	ЗапрашиваемыеРеквизиты.Вставить("ВидДокументаНового");
	ЗапрашиваемыеРеквизиты.Вставить("ИзменятьТипОбеспечения");
	ЗапрашиваемыеРеквизиты.Вставить("ИспользоватьМаркировку");
	ЗапрашиваемыеРеквизиты.Вставить("СоздаватьДокументИСМП");
	ЗапрашиваемыеРеквизиты.Вставить("МаркировкаПроверкаБезСертификатаИС");
	ЗапрашиваемыеРеквизиты.Вставить("ИспользованиеУпаковочныхЛистовПодбор");
	ЗапрашиваемыеРеквизиты.Вставить("ИспользованиеУпаковочныхЛистовПриемка");
	ЗапрашиваемыеРеквизиты.Вставить("ПроводитьРоботом");
	ЗапрашиваемыеРеквизиты.Вставить("ТабличнуюЧастьПриЗагрузкеПодбор");
	ЗапрашиваемыеРеквизиты.Вставить("ГрупповаяРабота");
	ЗапрашиваемыеРеквизиты.Вставить("БыстроеСканирование");
	ЗапрашиваемыеРеквизиты.Вставить("ПользовательДляАвтозаполнения");
	ЗапрашиваемыеРеквизиты.Вставить("ИмяТабличнойЧастиПодбор");
	ЗапрашиваемыеРеквизиты.Вставить("ИмяТабличнойЧастиПриемка");
	ЗапрашиваемыеРеквизиты.Вставить("ИспользоватьПодбор");
	ЗапрашиваемыеРеквизиты.Вставить("ИспользоватьПриемку");
	ЗапрашиваемыеРеквизиты.Вставить("МаркировкаСоздаватьСправочникКМЕслиНеНайден");
	ЗапрашиваемыеРеквизиты.Вставить("МаркировкаПривязыватьGTINКакШтрихкод");
	ЗапрашиваемыеРеквизиты.Вставить("МаркировкаЗавершатьПодборКМВДокументе");
	ЗапрашиваемыеРеквизиты.Вставить("РаспределениеТоваров");
	ЗапрашиваемыеРеквизиты.Вставить("Егаис");
	ЗапрашиваемыеРеквизиты.Вставить("БыстраяПриемка");
	ЗапрашиваемыеРеквизиты.Вставить("БыстраяОтгрузка");
	ЗапрашиваемыеРеквизиты.Вставить("ПроверкаОтборРазмещение");
	ЗапрашиваемыеРеквизиты.Вставить("ТабличнуюЧастьПриЗагрузкеПриемка");
	ЗапрашиваемыеРеквизиты.Вставить("ИмяТабличнойЧастиНовойПодбор");
	ЗапрашиваемыеРеквизиты.Вставить("ИмяТабличнойЧастиНовойПриемка");
	ЗапрашиваемыеРеквизиты.Вставить("ЗагружатьКомментарий");
	ЗапрашиваемыеРеквизиты.Вставить("БыстроеПеремещение");
	ЗапрашиваемыеРеквизиты.Вставить("БыстроеПеремещениеПоОрдеру");
	ЗапрашиваемыеРеквизиты.Вставить("АвтоматическийКомментарийИспользовать");
	ЗапрашиваемыеРеквизиты.Вставить("АвтоматическийКомментарий");
	ЗапрашиваемыеРеквизиты.Вставить("ИспользованиеЯчеекПодбор");
	ЗапрашиваемыеРеквизиты.Вставить("ИспользованиеСерийниковПодбор");
	ЗапрашиваемыеРеквизиты.Вставить("СерииВОтдельнойТЧ");
	ЗапрашиваемыеРеквизиты.Вставить("ИспользоватьТиповыеУпаковочныеЛисты");
	ЗапрашиваемыеРеквизиты.Вставить("БазовыеЕдиницыПриЗагрузке");
	ЗапрашиваемыеРеквизиты.Вставить("БазовыеУпаковкиПриЗагрузке");
	ЗапрашиваемыеРеквизиты.Вставить("ИспользованиеЯчеекПриемка");
	ЗапрашиваемыеРеквизиты.Вставить("ИспользованиеСерийниковПриемка");	
	ЗапрашиваемыеРеквизиты.Вставить("ОткрыватьДокументыПослеЗагрузкиБезЗаписи");
	ЗапрашиваемыеРеквизиты.Вставить("ОбрабатыватьРоботом");
	ЗапрашиваемыеРеквизиты.Вставить("ИспользоватьГрупповойДокумент");
	ЗапрашиваемыеРеквизиты.Вставить("ИспользоватьДопФормы");
	ЗапрашиваемыеРеквизиты.Вставить("МаркировкаЗапретитьПодборНемаркируемыхТоваров");
	ЗапрашиваемыеРеквизиты.Вставить("МаркировкаПерезаписатьХешУпаковок");
	ЗапрашиваемыеРеквизиты.Вставить("МаркировкаЗаписыватьПолныйКМ");
	ЗапрашиваемыеРеквизиты.Вставить("СоздаватьСчетФактураВыданный");
	ЗапрашиваемыеРеквизиты.Вставить("РежимКомплектации");
	ЗапрашиваемыеРеквизиты.Вставить("ЕГАИСПонижатьДетализациюПроверкиТТНДоБутылок");
	ЗапрашиваемыеРеквизиты.Вставить("ЕГАИСЗавершатьПодборКМВДокументе");
	ЗапрашиваемыеРеквизиты.Вставить("МаркировкаИгнорироватьНесоответствиеТовараПоЕАNиКМ");
	ЗапрашиваемыеРеквизиты.Вставить("РежимПроведения");
	ЗапрашиваемыеРеквизиты.Вставить("ОтменаПроведения");
	ЗапрашиваемыеРеквизиты.Вставить("ИсточникСерии");
	ЗапрашиваемыеРеквизиты.Вставить("ЗаполнятьКодыМаркировкиВПодчиненномДокументе");
	ЗапрашиваемыеРеквизиты.Вставить("УчитыватьСерийниковВЗаданииПодбор");
	ЗапрашиваемыеРеквизиты.Вставить("МаркировкаНеЗаписыватьНулевойМРЦ");
	ЗапрашиваемыеРеквизиты.Вставить("ПроверкаОСГ");
	ЗапрашиваемыеРеквизиты.Вставить("ЯчейкиСправочноеРазмещениеПодбор"); 
	ЗапрашиваемыеРеквизиты.Вставить("НаборыВариантыЗаполнения");
	
	Возврат ЗапрашиваемыеРеквизиты;						
	
КонецФункции

// Функция - возвращает признак выводить в документе ТСД
//  реквизит "Новый документ" как табличную часть
//
// Параметры:
//  ШаблонСсылка - СправочникСсылка.ДатаМобайл_ШаблоныДокументов - Ссылка на шаблон
// 
// Возвращаемое значение:
//   Булево 
//
Функция НовыйДокументКакТабличнаяЧасть(ШаблонСсылка) Экспорт

	Результат = Ложь;
	
	Если Не ЗначениеЗаполнено(ШаблонСсылка) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ШаблоныДокументов.ВидДокументаНового КАК ВидДокументаНового
	|ИЗ
	|	Справочник.ДатаМобайл_ШаблоныДокументов КАК ШаблоныДокументов
	|ГДЕ
	|	ШаблоныДокументов.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", ШаблонСсылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Если СокрЛП(Выборка.ВидДокументаНового) = "ВыводИзОборотаИСМП" Тогда
			Результат = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
