#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;

	Дата                  = Параметры.Дата;
	Смена                 = Параметры.Смена;
	Статус                = Параметры.Статус;
	Склад                 = Параметры.Склад;
	Продукция             = Параметры.Продукция;
	СпецификацияПродукции = Параметры.СпецификацияПродукции;
	Фабрикат              = Параметры.Фабрикат;
	СпецификацияФабриката = Параметры.СпецификацияФабриката;
	МассивПродукция       = Параметры.МассивПродукция;
	МассивФабрикаты       = Параметры.МассивФабрикаты;

	Если Смена = Перечисления._ПроизводственныеСмены.Дневная Тогда
		Дата = НачалоДня(Дата) + AMS_ВызовСервера.ПолучитьВремя(8, 59);
	Иначе
		Дата = НачалоДня(Дата) + AMS_ВызовСервера.ПолучитьВремя(11, 59);
	КонецЕсли;

	Если Не ЗначениеЗаполнено(СпецификацияПродукции) Тогда
		СпецификацияПродукции = AMS_ВызовСервера.ПолучитьОсновнуюСпецификацию(Продукция);
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Фабрикат) Тогда
		//@skip-check bsl-legacy-check-string-literal
		Фабрикат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Продукция, "_Фабрикат");

		Если Не ЗначениеЗаполнено(Фабрикат) Тогда
			ОбщегоНазначения.СообщитьПользователю(
				"Для продукции не установлен реквизит ""Фабрикат"". Обратитесь к бухгалтеру производства.", , , , Отказ);
		КонецЕсли;
	КонецЕсли;

	СпецификацияФабриката = AMS_ВызовСервера.ПолучитьОсновнуюСпецификацию(Фабрикат);

	Для Каждого Стр Из МассивПродукция Цикл
		НовСтр = тчПродукция.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Стр);
	КонецЦикла;

	Для Каждого Стр Из МассивФабрикаты Цикл
		НовСтр = тчФабрикаты.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Стр);
	КонецЦикла;

	Строки = тчФабрикаты.НайтиСтроки(Новый Структура("Номенклатура", Фабрикат));

	Если Строки.Количество() > 0 Тогда
		Стр = Строки[0];
		КоличествоПлан = Стр.КоличествоПлан;
		КоличествоФакт = Стр.КоличествоФакт;
	КонецЕсли;

	//@skip-check bsl-legacy-check-string-literal
	КоличествоВЗамесе = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СпецификацияФабриката, "Количество");
	Замес             = КоличествоПлан / ?(КоличествоВЗамесе = 0, 1, КоличествоВЗамесе);
	ОстатокПосле      = ОстатокДо + КоличествоПлан - КоличествоФакт;

	ЗаполнитьТаблПродукция();
	ЗаполнитьТаблМатериалы();
	ЗаполнитьЦеныПродукции();
	НастройкаФормы(Статус);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	РассчитатьКоличествоПродукции(Ложь);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СпецификацияПриИзменении(Элемент)
	Модифицированность = Истина;

	ЗаполнитьТаблМатериалы();
КонецПроцедуры

&НаКлиенте
Процедура ОстатокДоПриИзменении(Элемент)
	Модифицированность = Истина;

	РассчитатьКоличествоПродукции(Истина);
	ЗаполнитьТаблМатериалы();
	ЗаполнитьУпаковка();
КонецПроцедуры

&НаКлиенте
Процедура ЗамесПриИзменении(Элемент)
	Модифицированность = Истина;

	РассчитатьКоличествоПродукции(Истина);
	ЗаполнитьТаблМатериалы();
	ЗаполнитьУпаковка();
КонецПроцедуры

&НаКлиенте
Процедура ЗамесРегулирование(Элемент, Направление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;

	Модифицированность   = Истина;

	Замес = Замес + Направление;

	РассчитатьКоличествоПродукции(Истина);
	ЗаполнитьТаблМатериалы();
	ЗаполнитьУпаковка();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблПродукция

&НаКлиенте
Процедура ПродукцияПриАктивизацииСтроки(Элемент)
	Стр = Элементы.ТаблПродукция.ТекущиеДанные;

	Если Стр = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Стр.Номенклатура = ТекущаяПродукция Тогда
		Возврат;
	КонецЕсли;

	ТекущаяПродукция    = Стр.Номенклатура;
	ТекущаяСпецификация = Стр.Спецификация;
	ТекущееКоличество = ?(Стр.КоличествоФакт = 0, Стр.КоличествоПлан, Стр.КоличествоФакт);

	ПодключитьОбработчикОжидания("ЗаполнитьУпаковкаПриАктивизацииСтроки", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияМеткаПриИзменении(Элемент)
	Модифицированность = Истина;

	Стр = ТекущийЭлемент.ТекущиеДанные;

	Если Стр.Метка Тогда
		Стр.КоличествоПлан      = Цел((ОстатокДо + КоличествоПлан - ТаблПродукция.Итог("КоличествоФабриката"))
			/ Стр.КоличествоВУпаковке);
		Стр.КоличествоФабриката = ?(Стр.КоличествоФакт = 0, Стр.КоличествоПлан, Стр.КоличествоФакт)
			* Стр.КоличествоВУпаковке;
	Иначе
		Стр.КоличествоПлан      = 0;
		Стр.КоличествоФакт      = 0;
		Стр.КоличествоФабриката = 0;
	КонецЕсли;

	Стр.Сумма = Стр.Цена + КоличествоПлан;

	ТекущееКоличество = ?(Стр.КоличествоФакт = 0, Стр.КоличествоПлан, Стр.КоличествоФакт);

	КоличествоФакт = ТаблПродукция.Итог("КоличествоФабриката");

	ОстатокПосле = ОстатокДо + КоличествоПлан - КоличествоФакт;

	ЗаполнитьУпаковка();
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияСпецификацияПриИзменении(Элемент)
	Стр = Элементы.ТаблПродукция.ТекущиеДанные;
	ТекущаяСпецификация = Стр.Спецификация;

	ЗаполнитьУпаковка();
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияПланПриИзменении(Элемент)
	Модифицированность = Истина;

	Стр = ТекущийЭлемент.ТекущиеДанные;

	ТекущееКоличество = ?(Стр.КоличествоФакт = 0, Стр.КоличествоПлан, Стр.КоличествоФакт);

	Если Стр.КоличествоПлан = 0 Тогда
		Стр.Метка               = Ложь;
		Стр.КоличествоФакт      = 0;
		Стр.КоличествоФабриката = 0;
	Иначе
		Стр.Метка               = Истина;
		Стр.КоличествоФабриката = Стр.КоличествоВУпаковке * ТекущееКоличество;
	КонецЕсли;

	Стр.Сумма = Стр.Цена * ТекущееКоличество;

	КоличествоФакт = ТаблПродукция.Итог("КоличествоФабриката");

	ОстатокПосле = ОстатокДо + КоличествоПлан - КоличествоФакт;

	ЗаполнитьУпаковка();
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияФактПриИзменении(Элемент)
	Модифицированность = Истина;

	Стр = ТекущийЭлемент.ТекущиеДанные;

	ТекущееКоличество = ?(Стр.КоличествоФакт = 0, Стр.КоличествоПлан, Стр.КоличествоФакт);

	Если Стр.КоличествоФакт > 0 И Стр.КоличествоПлан = 0 Тогда
		Стр.Метка          = Истина;
		Стр.КоличествоПлан = Стр.КоличествоФакт;
	Иначе
	КонецЕсли;

	Стр.КоличествоФабриката = Стр.КоличествоВУпаковке * ТекущееКоличество;

	Стр.Сумма = Стр.Цена * ТекущееКоличество;

	КоличествоФакт = ТаблПродукция.Итог("КоличествоФабриката");

	ОстатокПосле = ОстатокДо + КоличествоПлан - КоличествоФакт;

	ЗаполнитьУпаковка();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	ПеренестиВДокументНаКлиенте();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастройкаФормы(Статус)
	Если AMS_ВызовСервера.ЭтоKhors() Тогда
		Возврат;	
	КонецЕсли;
	
	РазрешитьИзменениеСпецификаций = AMS_ВызовСервера.ЕстьПравоАМС(Перечисления.AMS_Права.ИзменениеСпецификацийВДокументеПроизводствоЗаСмену);
	
	Элементы.Цена.Видимость               = РазрешитьИзменениеСпецификаций;
	Элементы.Сумма.Видимость              = РазрешитьИзменениеСпецификаций;
	Элементы.ГруппаСтоимость.Видимость    = РазрешитьИзменениеСпецификаций;
	Элементы.МатериалыСтоимость.Видимость = РазрешитьИзменениеСпецификаций;
	Элементы.ПродукцияСтоимость.Видимость = РазрешитьИзменениеСпецификаций;
	Элементы.УпаковкаСтоимость.Видимость  = РазрешитьИзменениеСпецификаций;

	Элементы.СпецификацияФабриката.ТолькоПросмотр = Не РазрешитьИзменениеСпецификаций;
	Элементы.ПродукцияСпецификация.ТолькоПросмотр = Не РазрешитьИзменениеСпецификаций;
	
	Выполнено = (Статус = Перечисления._СтатусыПроизводства.Выполнено)
			Или (Статус = Перечисления._СтатусыПроизводства.РасчётЗарплаты);
	
	Элементы.Замес.ТолькоПросмотр         = Выполнено;
	Элементы.ПродукцияПлан.ТолькоПросмотр = Выполнено;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблПродукция()
	Строки = тчПродукция.НайтиСтроки(Новый Структура("Фабрикат", Фабрикат));

	ПродукцияДокумента = Новый ТаблицаЗначений;
	ПродукцияДокумента.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ПродукцияДокумента.Колонки.Добавить("Спецификация",
		Новый ОписаниеТипов("СправочникСсылка._ВариантыСпецификацийНоменклатуры"));
	ПродукцияДокумента.Колонки.Добавить("КоличествоПлан", Новый ОписаниеТипов("Число"));
	ПродукцияДокумента.Колонки.Добавить("КоличествоФакт", Новый ОписаниеТипов("Число"));

	Для Каждого Стр Из Строки Цикл
		НовСтр = ПродукцияДокумента.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Стр);
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Фабрикат", Фабрикат);
	Запрос.УстановитьПараметр("ПродукцияДокумента", ПродукцияДокумента);
	Запрос.УстановитьПараметр("ПродукцияФабриката", ПолучитьПродукциюФабриката(Фабрикат));

	Запрос.Текст =
	"ВЫБРАТЬ
	|	таб.Номенклатура КАК Номенклатура,
	|	таб.Спецификация КАК Спецификация,
	|	таб.КоличествоПлан КАК КоличествоПлан,
	|	таб.КоличествоФакт КАК КоличествоФакт
	|ПОМЕСТИТЬ товДокумента
	|ИЗ
	|	&ПродукцияДокумента КАК таб
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	таб.Номенклатура КАК Номенклатура,
	|	таб.Спецификация КАК Спецификация
	|ПОМЕСТИТЬ товФабриката
	|ИЗ
	|	&ПродукцияФабриката КАК таб
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тов.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(док.Спецификация, тов.Спецификация) КАК Спецификация,
	|	ВЫБОР
	|		КОГДА док.Номенклатура ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Метка,
	|	док.КоличествоПлан КАК КоличествоПлан,
	|	док.КоличествоФакт КАК КоличествоФакт
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	товФабриката КАК тов
	|		ЛЕВОЕ СОЕДИНЕНИЕ товДокумента КАК док
	|		ПО тов.Номенклатура = док.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.Номенклатура КАК Номенклатура,
	|	вт.Спецификация КАК Спецификация,
	|	вт.Метка КАК Метка,
	|	ЕСТЬNULL(вт.КоличествоПлан, 0) КАК КоличествоПлан,
	|	ЕСТЬNULL(вт.КоличествоФакт, 0) КАК КоличествоФакт,
	|	ЕСТЬNULL(Спец.Количество, 0) КАК КоличествоВУпаковке,
	|	ВЫБОР
	|		КОГДА вт.КоличествоФакт = 0
	|			ТОГДА ЕСТЬNULL(Спец.Количество, 0) * ЕСТЬNULL(вт.КоличествоПлан, 0)
	|		ИНАЧЕ ЕСТЬNULL(Спец.Количество, 0) * ЕСТЬNULL(вт.КоличествоФакт, 0)
	|	КОНЕЦ КАК КоличествоФабриката,
	|	Ном.Наименование КАК Наименование
	|ИЗ
	|	вт КАК вт
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры.Товары КАК Спец
	|		ПО вт.Спецификация = Спец.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|		ПО вт.Номенклатура = Ном.Ссылка
	|ГДЕ
	|	Спец.Номенклатура = &Фабрикат
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";

	Результат = Запрос.Выполнить();

	Табл = РеквизитФормыВЗначение("ТаблПродукция");
	
	Табл.Очистить();

	НомерСтроки = 0;
	ЕстьМетка   = Ложь;

	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		НомерСтроки = НомерСтроки + 1;

		НовСтр = Табл.Добавить();

		ЗаполнитьЗначенияСвойств(НовСтр, Выборка);

		НовСтр.НомерСтроки = НомерСтроки;
		Если НовСтр.КоличествоПлан > 0 Или НовСтр.КоличествоФакт > 0 Тогда
			НовСтр.Метка = Истина;
			ЕстьМетка    = Истина;
		КонецЕсли;
	КонецЦикла;

	Если ЗначениеЗаполнено(Продукция) Тогда
		Стр = Табл.Найти(Продукция, "Номенклатура");
	Иначе
		Стр = Табл[0];
	КонецЕсли;

	Если Не Стр = Неопределено И Не ЕстьМетка Тогда
		Стр.Метка = Истина;
	КонецЕсли;

	ЗначениеВРеквизитФормы(Табл, "ТаблПродукция");

	Если ЗначениеЗаполнено(Продукция) И Не Стр = Неопределено Тогда
		Элементы.ТаблПродукция.ТекущаяСтрока = Стр.НомерСтроки - 1;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьПродукциюФабриката(Фабрикат)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Фабрикат", Фабрикат);
	Запрос.УстановитьПараметр("СегментыНоменклатурыСтарая", AMS_ВызовСервера.СегментыНоменклатурыСтарая());

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Ссылка.Владелец КАК Номенклатура,
	|	т.Ссылка КАК Спецификация
	|ИЗ
	|	Справочник._ВариантыСпецификацийНоменклатуры.Товары КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры КАК д
	|			ПО д.Владелец = Ном.Ссылка
	|		ПО д.Ссылка = т.Ссылка
	|ГДЕ
	|	т.Ссылка.Основной
	|	И т.Номенклатура = &Фабрикат
	|	И НЕ т.Ссылка.Владелец В
	|		(ВЫБРАТЬ
	|			т.Номенклатура КАК Номенклатура
	|		ИЗ
	|			РегистрСведений.НоменклатураСегмента КАК т
	|		ГДЕ
	|			т.Сегмент = &СегментыНоменклатурыСтарая)";

	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

&НаСервере
Процедура ЗаполнитьЦеныПродукции()
	Фабрикаты = Новый ТаблицаЗначений;
	Фабрикаты.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Фабрикаты.Колонки.Добавить("Спецификация",
		Новый ОписаниеТипов("СправочникСсылка._ВариантыСпецификацийНоменклатуры"));

	Стр = Фабрикаты.Добавить();
	Стр.Номенклатура = Фабрикат;
	Стр.Спецификация = СпецификацияФабриката;

	ТабЦен = ПолучитьЦены(Фабрикаты, ТаблПродукция.Выгрузить( , "Номенклатура,Спецификация"), Дата);

	Для Каждого Стр Из ТабЦен Цикл
		Строки = ТаблПродукция.НайтиСтроки(Новый Структура("Номенклатура", Стр.Продукция));
		Если Строки.Количество() > 0 Тогда
			ТекСтр = Строки[0];
			ТекСтр.Цена  = Стр.Цена;
			ТекСтр.Сумма = Стр.Цена * ?(ТекСтр.КоличествоФакт = 0, ТекСтр.КоличествоПлан, ТекСтр.КоличествоФакт);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьЦены(Фабрикаты, Продукция, Дата)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Фабрикаты", Фабрикаты);
	Запрос.УстановитьПараметр("Продукция", Продукция);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Вода", Справочники.Номенклатура.НайтиПоКоду("01-00000017"));

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ф.Номенклатура КАК Фабрикат,
	|	ф.Спецификация КАК Спецификация
	|ПОМЕСТИТЬ ф
	|ИЗ
	|	&Фабрикаты КАК ф
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	п.Номенклатура КАК Продукция,
	|	п.Спецификация КАК Спецификация
	|ПОМЕСТИТЬ п
	|ИЗ
	|	&Продукция КАК п
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ф.Фабрикат КАК Фабрикат,
	|	т.Номенклатура КАК Номенклатура,
	|	т.Количество / ЕСТЬNULL(с.Количество, 1) КАК Количество
	|ПОМЕСТИТЬ фтовары
	|ИЗ
	|	ф КАК ф
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры КАК с
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры.Товары КАК т
	|			ПО с.Ссылка = т.Ссылка
	|		ПО ф.Спецификация = с.Ссылка
	|ГДЕ
	|	НЕ т.Номенклатура = &Вода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вз.Номенклатура КАК Номенклатура,
	|	Цены.Цена / ЕСТЬNULL(Цены.Упаковка.Числитель, 1) / ном.КоэффициентЕдиницыДляОтчетов КАК Цена
	|ПОМЕСТИТЬ фцены
	|ИЗ
	|	(ВЫБРАТЬ
	|		Цены.Номенклатура КАК Номенклатура,
	|		МАКСИМУМ(Цены.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.ЦеныНоменклатурыПоставщиков КАК Цены
	|	ГДЕ
	|		Цены.Номенклатура В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					т.Номенклатура КАК Номенклатура
	|				ИЗ
	|					фтовары КАК т)
	|		И Цены.Период < &Дата
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Цены.Номенклатура) КАК вз
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатурыПоставщиков КАК Цены
	|		ПО вз.Номенклатура = Цены.Номенклатура
	|			И вз.Период = Цены.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК ном
	|		ПО вз.Номенклатура = ном.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	фтовары.Фабрикат КАК Фабрикат,
	|	СУММА(ЕСТЬNULL(фтовары.Количество, 0) * ЕСТЬNULL(фцены.Цена, 0)) КАК Цена
	|ПОМЕСТИТЬ ф1
	|ИЗ
	|	фтовары КАК фтовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ фцены КАК фцены
	|		ПО фтовары.Номенклатура = фцены.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	фтовары.Фабрикат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	п.Продукция КАК Продукция,
	|	т.Номенклатура КАК Номенклатура,
	|	т.Количество КАК Количество
	|ПОМЕСТИТЬ птовары
	|ИЗ
	|	п КАК п
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры.Товары КАК т
	|		ПО п.Спецификация = т.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вз.Номенклатура КАК Номенклатура,
	|	Цены.Цена / ЕСТЬNULL(Цены.Упаковка.Числитель, 1) / ном.КоэффициентЕдиницыДляОтчетов КАК Цена
	|ПОМЕСТИТЬ пцены
	|ИЗ
	|	(ВЫБРАТЬ
	|		Цены.Номенклатура КАК Номенклатура,
	|		МАКСИМУМ(Цены.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.ЦеныНоменклатурыПоставщиков КАК Цены
	|	ГДЕ
	|		Цены.Номенклатура В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					т.Номенклатура КАК Номенклатура
	|				ИЗ
	|					птовары КАК т)
	|		И Цены.Период < &Дата
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Цены.Номенклатура) КАК вз
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатурыПоставщиков КАК Цены
	|		ПО вз.Номенклатура = Цены.Номенклатура
	|			И вз.Период = Цены.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК ном
	|		ПО вз.Номенклатура = ном.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	птовары.Продукция КАК Продукция,
	|	СУММА(ЕСТЬNULL(птовары.Количество, 0) * ЕСТЬNULL(пцены.Цена, ЕСТЬNULL(ф1.Цена, 0))) КАК Цена
	|ИЗ
	|	птовары КАК птовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ пцены КАК пцены
	|		ПО птовары.Номенклатура = пцены.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ф1 КАК ф1
	|		ПО птовары.Номенклатура = ф1.Фабрикат
	|
	|СГРУППИРОВАТЬ ПО
	|	птовары.Продукция";

	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблМатериалы()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Фабрикаты", тчФабрикаты.Выгрузить());
	Запрос.УстановитьПараметр("Фабрикат", Фабрикат);
	Запрос.УстановитьПараметр("Спецификация", СпецификацияФабриката);
	Запрос.УстановитьПараметр("КоличествоПлан", КоличествоПлан);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Склад", Склад);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.Спецификация КАК Спецификация,
	|	т.КоличествоПлан КАК КоличествоПлан
	|ПОМЕСТИТЬ ф
	|ИЗ
	|	&Фабрикаты КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ф.Номенклатура КАК Номенклатура,
	|	ф.Спецификация КАК Спецификация,
	|	ф.КоличествоПлан КАК КоличествоПлан
	|ПОМЕСТИТЬ ф1
	|ИЗ
	|	ф КАК ф
	|ГДЕ
	|	НЕ ф.Номенклатура = &Фабрикат
	|	И ф.КоличествоПлан > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Фабрикат КАК Номенклатура,
	|	&Спецификация КАК Спецификация,
	|	&КоличествоПлан КАК КоличествоПлан
	|ПОМЕСТИТЬ ф2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СпецТ.Номенклатура КАК Номенклатура,
	|	СУММА(СпецТ.Количество * ф1.КоличествоПлан / СпецД.Количество) КАК Количество
	|ПОМЕСТИТЬ ф1м
	|ИЗ
	|	ф1 КАК ф1
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры КАК СпецД
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры.Товары КАК СпецТ
	|			ПО СпецД.Ссылка = СпецТ.Ссылка
	|		ПО ф1.Спецификация = СпецД.Ссылка
	|ГДЕ
	|	НЕ СпецТ.Номенклатура.Код = ""01-00000017""
	|СГРУППИРОВАТЬ ПО
	|	СпецТ.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СпецТ.Номенклатура КАК Номенклатура,
	|	СпецТ.Количество * ф2.КоличествоПлан / СпецД.Количество КАК Количество,
	|	СпецТ.Количество КАК Норма
	|ПОМЕСТИТЬ ф2м
	|ИЗ
	|	ф2 КАК ф2
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры КАК СпецД
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры.Товары КАК СпецТ
	|			ПО СпецД.Ссылка = СпецТ.Ссылка
	|		ПО ф2.Спецификация = СпецД.Ссылка
	|ГДЕ
	|	НЕ СпецТ.Номенклатура.Код = ""01-00000017""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ф2м.Номенклатура КАК Номенклатура,
	|	Ном.ЕдиницаДляОтчетов КАК Ед,
	|	ЕСТЬNULL(ф2м.Норма, 0) / Ном.КоэффициентЕдиницыДляОтчетов КАК Норма,
	|	ЕСТЬNULL(Ост.ВНаличииОстаток, 0) / Ном.КоэффициентЕдиницыДляОтчетов КАК Остаток,
	|	ЕСТЬNULL(ф1м.Количество, 0) / Ном.КоэффициентЕдиницыДляОтчетов КАК РасходЗаСмену,
	|	ЕСТЬNULL(ф2м.Количество, 0) / Ном.КоэффициентЕдиницыДляОтчетов КАК Количество,
	|	(ЕСТЬNULL(Ост.ВНаличииОстаток, 0) - ЕСТЬNULL(ф1м.Количество, 0) - ЕСТЬNULL(ф2м.Количество, 0)) /
	|		Ном.КоэффициентЕдиницыДляОтчетов КАК ОстатокПосле,
	|	Ном.Наименование КАК Наименование,
	|	Ном.КоэффициентЕдиницыДляОтчетов КАК КоэффициентЕдиницыДляОтчетов
	|ИЗ
	|	ф2м КАК ф2м
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(&Дата, Склад = &Склад) КАК Ост
	|		ПО ф2м.Номенклатура = Ост.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|		ПО ф2м.Номенклатура = Ном.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ф1м КАК ф1м
	|		ПО ф2м.Номенклатура = ф1м.Номенклатура";

	Табл = Запрос.Выполнить().Выгрузить();
	
	МВТ = Новый МенеджерВременныхТаблиц;
	
	Парам = Новый Структура;
	Парам.Вставить("Дата", Дата);
	Парам.Вставить("Номенклатура", Табл.ВыгрузитьКолонку("Номенклатура"));

	AMS_ВызовСервера.ПолучитьСтоимостьТовара(МВТ, Парам);

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.УстановитьПараметр("Табл", Табл);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.Ед КАК Ед,
	|	т.Норма КАК Норма,
	|	т.Остаток КАК Остаток,
	|	т.РасходЗаСмену КАК РасходЗаСмену,
	|	т.Количество КАК Количество,
	|	т.ОстатокПосле КАК ОстатокПосле,
	|	т.Наименование КАК Наименование,
	|	т.КоэффициентЕдиницыДляОтчетов КАК КоэффициентЕдиницыДляОтчетов
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	&Табл КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	т.Номенклатура КАК Номенклатура,
	|	т.Ед КАК Ед,
	|	т.Норма КАК Норма,
	|	т.Остаток КАК Остаток,
	|	т.РасходЗаСмену КАК РасходЗаСмену,
	|	т.Количество КАК Количество,
	|	т.ОстатокПосле КАК ОстатокПосле,
	|	ЦенаТовара.Цена * т.КоэффициентЕдиницыДляОтчетов КАК Цена,
	|	ЦенаТовара.Цена * т.Количество * т.КоэффициентЕдиницыДляОтчетов КАК Сумма,
	|	т.Наименование КАК Наименование
	|ИЗ
	|	вт КАК т
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЦенаТовара КАК ЦенаТовара
	|		ПО т.Номенклатура = ЦенаТовара.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	
	ТаблМатериалы.Очистить();
	
	Рез = Запрос.Выполнить();
	Выб = Рез.Выбрать();
	
	НомерСтроки = 0;
	
	Пока Выб.Следующий() Цикл
		Стр = ТаблМатериалы.Добавить();
		
		НомерСтроки = НомерСтроки + 1;
		ЗаполнитьЗначенияСвойств(Стр, Выб);
		Стр.НомерСтроки = НомерСтроки;
	КонецЦикла;

	Сумма = ТаблМатериалы.Итог("Сумма");
	Цена  = ?(КоличествоПлан > 0, Сумма / КоличествоПлан, 0);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУпаковка()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Продукция", тчПродукция.Выгрузить());
	Запрос.УстановитьПараметр("ТекущаяПродукция", ТекущаяПродукция);
	Запрос.УстановитьПараметр("ТекущаяСпецификация", ТекущаяСпецификация);
	Запрос.УстановитьПараметр("ТекущееКоличество", ТекущееКоличество);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("ВидыНоменклатуры", AMS_ВызовСервера.ВидыНоменклатурыФабрикаты());

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.Спецификация КАК Спецификация,
	|	т.КоличествоПлан КАК КоличествоПлан,
	|	т.КоличествоФакт КАК КоличествоФакт
	|ПОМЕСТИТЬ п
	|ИЗ
	|	&Продукция КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	п.Номенклатура КАК Номенклатура,
	|	п.Спецификация КАК Спецификация,
	|	ВЫБОР
	|		КОГДА п.КоличествоФакт = 0
	|			ТОГДА п.КоличествоПлан
	|		ИНАЧЕ п.КоличествоФакт
	|	КОНЕЦ КАК Количество
	|ПОМЕСТИТЬ п1
	|ИЗ
	|	п КАК п
	|ГДЕ
	|	НЕ п.Номенклатура = &ТекущаяПродукция
	|	И (п.КоличествоПлан > 0
	|	ИЛИ п.КоличествоФакт > 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ТекущаяПродукция КАК Номенклатура,
	|	&ТекущаяСпецификация КАК Спецификация,
	|	&ТекущееКоличество КАК Количество
	|ПОМЕСТИТЬ п2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СпецТ.Номенклатура КАК Номенклатура,
	|	СУММА(п1.Количество * СпецТ.Количество) КАК Количество
	|ПОМЕСТИТЬ п1м
	|ИЗ
	|	п1 КАК п1
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры.Товары КАК СпецТ
	|		ПО п1.Спецификация = СпецТ.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|		ПО СпецТ.Номенклатура = Ном.Ссылка
	|ГДЕ
	|	НЕ Ном.ВидНоменклатуры В (&ВидыНоменклатуры)
	|СГРУППИРОВАТЬ ПО
	|	СпецТ.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СпецТ.Номенклатура КАК Номенклатура,
	|	п2.Количество * СпецТ.Количество КАК Количество,
	|	СпецТ.Количество КАК Норма
	|ПОМЕСТИТЬ п2м
	|ИЗ
	|	п2 КАК п2
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры.Товары КАК СпецТ
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|			ПО СпецТ.Номенклатура = Ном.Ссылка
	|		ПО п2.Спецификация = СпецТ.Ссылка
	|ГДЕ
	|	НЕ Ном.ВидНоменклатуры В (&ВидыНоменклатуры)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	п2м.Номенклатура КАК Номенклатура,
	|	Ном.ЕдиницаДляОтчетов КАК Ед,
	|	ЕСТЬNULL(п2м.Норма, 0) / Ном.КоэффициентЕдиницыДляОтчетов КАК Норма,
	|	ЕСТЬNULL(Ост.ВНаличииОстаток, 0) / Ном.КоэффициентЕдиницыДляОтчетов КАК Остаток,
	|	ЕСТЬNULL(п1м.Количество, 0) / Ном.КоэффициентЕдиницыДляОтчетов КАК РасходЗаСмену,
	|	ЕСТЬNULL(п2м.Количество, 0) / Ном.КоэффициентЕдиницыДляОтчетов КАК Количество,
	|	(ЕСТЬNULL(Ост.ВНаличииОстаток, 0) - ЕСТЬNULL(п1м.Количество, 0) - ЕСТЬNULL(п2м.Количество, 0)) /
	|		Ном.КоэффициентЕдиницыДляОтчетов КАК ОстатокПосле,
	|	Ном.Наименование КАК Наименование,
	|	Ном.КоэффициентЕдиницыДляОтчетов КАК КоэффициентЕдиницыДляОтчетов
	|ИЗ
	|	п2м КАК п2м
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(&Дата, Склад = &Склад) КАК Ост
	|		ПО п2м.Номенклатура = Ост.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|		ПО п2м.Номенклатура = Ном.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ п1м КАК п1м
	|		ПО п2м.Номенклатура = п1м.Номенклатура";

	Табл = Запрос.Выполнить().Выгрузить();

	МВТ = Новый МенеджерВременныхТаблиц;
	
	Парам = Новый Структура;
	Парам.Вставить("Дата", Дата);
	Парам.Вставить("Номенклатура", Табл.ВыгрузитьКолонку("Номенклатура"));

	AMS_ВызовСервера.ПолучитьСтоимостьТовара(МВТ, Парам);

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.УстановитьПараметр("Табл", Табл);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.Ед КАК Ед,
	|	т.Норма КАК Норма,
	|	т.Остаток КАК Остаток,
	|	т.РасходЗаСмену КАК РасходЗаСмену,
	|	т.Количество КАК Количество,
	|	т.ОстатокПосле КАК ОстатокПосле,
	|	т.Наименование КАК Наименование,
	|	т.КоэффициентЕдиницыДляОтчетов КАК КоэффициентЕдиницыДляОтчетов
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	&Табл КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	вт.Номенклатура КАК Номенклатура,
	|	вт.Ед КАК Ед,
	|	вт.Норма КАК Норма,
	|	вт.Остаток КАК Остаток,
	|	вт.РасходЗаСмену КАК РасходЗаСмену,
	|	вт.Количество КАК Количество,
	|	вт.ОстатокПосле КАК ОстатокПосле,
	|	ЦенаТовара.Цена * вт.КоэффициентЕдиницыДляОтчетов КАК Цена,
	|	ЦенаТовара.Цена * вт.Количество * вт.КоэффициентЕдиницыДляОтчетов КАК Сумма,
	|	вт.Наименование КАК Наименование
	|ИЗ
	|	вт КАК вт
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЦенаТовара КАК ЦенаТовара
	|		ПО вт.Номенклатура = ЦенаТовара.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	
	ТаблУпаковка.Очистить();
	
	Рез = Запрос.Выполнить();
	Выб = Рез.Выбрать();
	
	НомерСтроки = 0;
	
	Пока Выб.Следующий() Цикл
		Стр = ТаблУпаковка.Добавить();
		
		НомерСтроки = НомерСтроки + 1;
		ЗаполнитьЗначенияСвойств(Стр, Выб);
		Стр.НомерСтроки = НомерСтроки;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьКоличествоПродукции(Пересчёт)
	КоличествоПлан = КоличествоВЗамесе * Замес;
	
	// Определить строку для расчета:
	ПродукцияКоличество = ТаблПродукция.Количество();

	Если ПродукцияКоличество = 1 Тогда
		// если строка одна, то считаем эту строку
		НомерСтроки = 1;

	Иначе
		МассивСтрокСМеткой = ТаблПродукция.НайтиСтроки(Новый Структура("Метка", Истина));

		Если МассивСтрокСМеткой.Количество() = 1 Тогда
			// если Метка одна, то считаем строку с этой меткой
			НомерСтроки = МассивСтрокСМеткой[0].НомерСтроки;

		Иначе
			// иначе, если Метка не одна
			Для Каждого Стр Из МассивСтрокСМеткой Цикл
				НомерСтроки = Стр.НомерСтроки;
				Если Стр.КоличествоПлан = 0 Тогда
					// если КоличествоПлан = 0, то не считаем
					Прервать;
				КонецЕсли;
				// считаем последнюю с меткой строку
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	// Выполнить расчет строке
	Если НомерСтроки <> Неопределено Тогда
		СчетСтрок   = 0;
		Расфасовано = 0;

		Для Каждого Стр Из ТаблПродукция Цикл
			СчетСтрок = СчетСтрок + 1;

			Если СчетСтрок < НомерСтроки Тогда
				Расфасовано = Расфасовано + Стр.КоличествоФабриката;

			ИначеЕсли СчетСтрок = НомерСтроки Тогда
				Стр.Метка = Истина;
				Если Пересчёт Тогда
					Стр.КоличествоПлан = Цел((ОстатокДо + КоличествоПлан - Расфасовано) / Стр.КоличествоВУпаковке);  //расчёт по замесам
				КонецЕсли;
				Стр.КоличествоФабриката = ?(Стр.КоличествоФакт = 0, Стр.КоличествоПлан, Стр.КоличествоФакт)
					* Стр.КоличествоВУпаковке;
			Иначе
				Стр.Метка               = Ложь;
				Стр.КоличествоПлан      = 0;
				Стр.КоличествоФакт      = 0;
				Стр.КоличествоФабриката = 0;
			КонецЕсли;

			Стр.Сумма = Стр.Цена * ?(Стр.КоличествоФакт = 0, Стр.КоличествоПлан, Стр.КоличествоФакт);

			Если Стр.Номенклатура = ТекущаяПродукция Тогда
				ТекущееКоличество = ?(Стр.КоличествоФакт = 0, Стр.КоличествоПлан, Стр.КоличествоФакт);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	КоличествоФакт = ТаблПродукция.Итог("КоличествоФабриката");

	ОстатокПосле = ОстатокДо + КоличествоПлан - КоличествоФакт;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьУпаковкаПриАктивизацииСтроки()
	ЗаполнитьУпаковка();
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокументНаКлиенте()
	Если Не AMS_ВызовСервера.ВходитВСегмент(Фабрикат,
				AMS_ВызовСервера.СегментыНоменклатурыФабрикатыСПереходящимОстатком())
		И КоличествоПлан = 0 
		И КоличествоФакт > 0 Тогда
			
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не указано количество замесов.", , "Замес");
		Возврат;

	ИначеЕсли КоличествоПлан > 0 И КоличествоФакт = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не указана продукция для упаковки.", ,
			ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Продукция", ТаблПродукция.Количество(), "Метка"));
		Возврат;
	КонецЕсли;
	
	//Снятие модифицированности, т.к. перед закрытием признак проверяется.
	Модифицированность = Ложь;

	Закрыть(ПолучитьДанные());
КонецПроцедуры

&НаСервере
Функция ПолучитьДанные()
	//Фабрикат
	ДанныеФабрикат = Новый Структура;
	ДанныеФабрикат.Вставить("Номенклатура", Фабрикат);
	ДанныеФабрикат.Вставить("Спецификация", СпецификацияФабриката);
	ДанныеФабрикат.Вставить("КоличествоПлан", КоличествоПлан);
	ДанныеФабрикат.Вставить("КоличествоФакт", КоличествоФакт);
	ДанныеФабрикат.Вставить("Цена", Цена);  
	
	//Продукция
	ДанныеПродукция = Новый Массив;
	Для Каждого Стр Из ТаблПродукция Цикл
		Данные = Новый Структура;
		Данные.Вставить("Фабрикат", Фабрикат);
		Данные.Вставить("Номенклатура", Стр.Номенклатура);
		Данные.Вставить("Спецификация", Стр.Спецификация);
		Данные.Вставить("КоличествоПлан", Стр.КоличествоПлан);
		Данные.Вставить("КоличествоФакт", Стр.КоличествоФакт);
		Данные.Вставить("Цена", Стр.Цена);

		ДанныеПродукция.Добавить(Данные);
	КонецЦикла;

	Парам = Новый Структура;
	Парам.Вставить("Фабрикат", ДанныеФабрикат);
	Парам.Вставить("Продукция", ДанныеПродукция);

	Возврат Парам;
КонецФункции

#КонецОбласти