
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьОтборДокументовПеремещенияТоваровПоСтатусу();

	ИсключитьСклады = Новый СписокЗначений;
	ИсключитьСклады.Добавить(Справочники.Склады.НайтиПоНаименованию("Цех №1 Материалы в производстве",Истина));
	ИсключитьСклады.Добавить(Справочники.Склады.НайтиПоНаименованию("Цех №2 Материалы в производстве",Истина));
	ИсключитьСклады.Добавить(Справочники.Склады.НайтиПоНаименованию("Цех №3 Материалы в производстве",Истина));
	ИсключитьСклады.Добавить(Справочники.Склады.НайтиПоНаименованию("Цех №4 Материалы в производстве",Истина));
	
	ДокументыПеремещения.Параметры.УстановитьЗначениеПараметра("ИсключитьСклады",ИсключитьСклады);
	
	Если Пользователи.РолиДоступны("_БухгалтерСклада") И Не Пользователи.РолиДоступны("_НачальникСклада") Тогда
		Склад            = AMS_ВызовСервера.СкладПродукции();
		СкладПолучатель  = AMS_ВызовСервера.СкладКарантин();
		
		Элементы.Страницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
		Элементы.Страницы.ТекущаяСтраница    = Элементы.СтраницаПеремещениеТоваров;
		Элементы.ГруппаСклады.Доступность    = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НастройкаФормы();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "Запись_СборкаТоваров" ИЛИ ИмяСобытия = "Запись_ПеремещениеТоваров" Тогда
		//ПоказатьБракВЦехе();
		НастройкаФормы();
	
		ОбновитьОтображениеДанных();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	НастройкаФормы();
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	НастройкаФормы();
КонецПроцедуры

&НаКлиенте
Процедура СкладПолучательПриИзменении(Элемент)
	НастройкаФормы();
КонецПроцедуры

&НаКлиенте
Процедура СтатусДокументовПеремещениеТоваровПриИзменении(Элемент)
	УстановитьОтборДокументовПеремещенияТоваровПоСтатусу();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДокументыПеремещения

&НаКлиенте
Процедура ДокументыПеремещенияПриАктивизацииСтроки(Элемент)
	Если Элемент.ТекущиеДанные = Неопределено Тогда 
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ТоварыПеремещение.Отбор,"Ссылка",,ВидСравненияКомпоновкиДанных.Равно,,Истина);
    Иначе
        Док = Элемент.ТекущаяСтрока;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ТоварыПеремещение.Отбор,"Ссылка",Док,ВидСравненияКомпоновкиДанных.Равно,,Истина);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДокументыОприходования

&НаКлиенте
Процедура ДокументыОприходованияПриАктивизацииСтроки(Элемент)
	Если Элемент.ТекущиеДанные = Неопределено Тогда 
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ТоварыОприходование.Отбор,"Ссылка",,ВидСравненияКомпоновкиДанных.Равно,,Истина);
    Иначе
        Док = Элемент.ТекущаяСтрока;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ТоварыОприходование.Отбор,"Ссылка",Док,ВидСравненияКомпоновкиДанных.Равно,,Истина);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДокументыСписания

&НаКлиенте
Процедура ДокументыСписанияПриАктивизацииСтроки(Элемент)
	Если Элемент.ТекущиеДанные = Неопределено Тогда 
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ТоварыСписание.Отбор,"Ссылка",,ВидСравненияКомпоновкиДанных.Равно,,Истина);
    Иначе
        Док = Элемент.ТекущаяСтрока;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ТоварыСписание.Отбор,"Ссылка",Док,ВидСравненияКомпоновкиДанных.Равно,,Истина);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДокументыПроизводства

&НаКлиенте
Процедура ДокументыПроизводстваПриАктивизацииСтроки(Элемент)
	Если Элемент.ТекущиеДанные = Неопределено Тогда 
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ТоварыСборки.Отбор,"Ссылка",,ВидСравненияКомпоновкиДанных.Равно,,Истина);
    Иначе
        Док = Элемент.ТекущаяСтрока;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ТоварыСборки.Отбор,"Ссылка",Док,ВидСравненияКомпоновкиДанных.Равно,,Истина);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДокументыСборкаНаборов

&НаКлиенте
Процедура ДокументыСборкаНаборовПриАктивизацииСтроки(Элемент)
	Если Элемент.ТекущиеДанные = Неопределено Тогда 
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(МатериалыСборкаНаборов.Отбор,"Ссылка",,ВидСравненияКомпоновкиДанных.Равно,,Истина);
    Иначе
        Док = Элемент.ТекущаяСтрока;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(МатериалыСборкаНаборов.Отбор,"Ссылка",Док,ВидСравненияКомпоновкиДанных.Равно,,Истина);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыМатериалыСборкаНаборов

&НаКлиенте
Процедура МатериалыСборкаНаборовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПоказатьЗначение(,Элемент.ТекущиеДанные.Номенклатура);	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВедомостьПоТоварамНаСкладах(Команда)
	ОткрытьФорму("Отчет.ВедомостьПоТоварамНаСкладах.Форма");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастройкаФормы()
	Элементы.Склад.Заголовок = "Склад";
	
	Имя = Элементы.Страницы.ТекущаяСтраница.Заголовок;
	
	Если Имя = "Перемещение товаров" Тогда
		Элементы.Склад.Заголовок = "Склад отправитель";
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ДокументыПеремещения.Отбор,"СкладОтправитель",Склад,ВидСравненияКомпоновкиДанных.Равно,,ЗначениеЗаполнено(Склад));
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ДокументыПеремещения.Отбор,"СкладПолучатель",СкладПолучатель,ВидСравненияКомпоновкиДанных.ВСписке,,ЗначениеЗаполнено(СкладПолучатель));
		
	ИначеЕсли Имя = "Оприходование излишков" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ДокументыОприходования.Отбор,"Склад",Склад,ВидСравненияКомпоновкиДанных.Равно,,ЗначениеЗаполнено(Склад));
		
	ИначеЕсли Имя = "Списание недостач" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ДокументыСписания.Отбор,"Склад",Склад,ВидСравненияКомпоновкиДанных.Равно,,ЗначениеЗаполнено(Склад));
		
	ИначеЕсли Имя = "Производство" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ДокументыПроизводства.Отбор,"Склад",Склад,ВидСравненияКомпоновкиДанных.Равно,,ЗначениеЗаполнено(Склад));
		
	ИначеЕсли Имя = "Разборка коробок" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ДокументыРазборки.Отбор,"Склад",Склад,ВидСравненияКомпоновкиДанных.Равно,,ЗначениеЗаполнено(Склад));
		
	ИначеЕсли Имя = "Пересчеты товаров" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ДокументыПересчёты.Отбор,"Склад",Склад,ВидСравненияКомпоновкиДанных.Равно,,ЗначениеЗаполнено(Склад));
		
	ИначеЕсли Имя = "Сборка наборов" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ДокументыСборкаНаборов.Отбор,"Склад",Склад,ВидСравненияКомпоновкиДанных.Равно,,ЗначениеЗаполнено(Склад));
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборДокументовПеремещенияТоваровПоСтатусу()
	СтатусОтгружено = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.СтатусыПеремещенийТоваров.Отгружено");
		
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ДокументыПеремещения.Отбор,"Статус",СтатусОтгружено,ВидСравненияКомпоновкиДанных.Равно,,ФлагОтгружено);
КонецПроцедуры


#КонецОбласти
