#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	Движения._ЦеныФасовкиПродукции.Записывать = Истина;
	Для Каждого Стр Из Товары Цикл
		Движение = Движения._ЦеныФасовкиПродукции.Добавить();

		Движение.Период       = Дата;
		Движение.Номенклатура = Стр.Номенклатура;
		Движение.Цена         = Стр.Цена;
	КонецЦикла;

	Движения._ЦеныРабот.Записывать = Истина;
	Для Каждого Стр Из Работы Цикл
		Движение = Движения._ЦеныРабот.Добавить();

		Движение.Период = Дата;
		Движение.Работа = Стр.Работа;
		Движение.Цена   = Стр.Цена;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#КонецЕсли