
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция СтатусЗакрытИспользуется() Экспорт
	
	Возврат  ПолучитьФункциональнуюОпцию("НеЗакрыватьЗаказыПоставщикамБезПолногоПоступления")
		Или ПолучитьФункциональнуюОпцию("НеЗакрыватьЗаказыПоставщикамБезПолнойОплаты");
	
КонецФункции 

#КонецОбласти

#КонецЕсли


#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	Возврат;
	//!~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~1-1
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	
	ДанныеВыбора.Добавить(Перечисления.СтатусыЗаказовПоставщикам.НеСогласован);
	ДанныеВыбора.Добавить(Перечисления.СтатусыЗаказовПоставщикам.Согласован);
	ДанныеВыбора.Добавить(Перечисления.СтатусыЗаказовПоставщикам.Подтвержден);
	
	Если ПолучитьФункциональнуюОпцию("НеЗакрыватьЗаказыПоставщикамБезПолногоПоступления")
		ИЛИ ПолучитьФункциональнуюОпцию("НеЗакрыватьЗаказыПоставщикамБезПолнойОплаты") Тогда
		
		ДанныеВыбора.Добавить(Перечисления.СтатусыЗаказовПоставщикам.Закрыт);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
