
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	КоличествоНаборов = Параметры.Наборы.Количество();

	Если КоличествоНаборов <= 1 Тогда
		Элементы.УдалитьВсеСтрокиНаборов.Заголовок = НСтр("ru = 'Удалить все строки набора'");
		Сообщение = НСтр("ru = 'Удаляемые строки входят в набор:'");
	Иначе
		Элементы.УдалитьВсеСтрокиНаборов.Заголовок = НСтр("ru = 'Удалить все строки наборов'");
		Сообщение = НСтр("ru = 'Удаляемые строки входят в наборы:'");
	КонецЕсли;
	
	Если Параметры.Прочее.Количество() > 0 Тогда
		Элементы.РедактироватьНабор.Видимость         = Ложь;
		Если КоличествоНаборов <= 1 Тогда
			Сообщение = НСтр("ru = 'Некоторые из удаляемых строк входят в состав набора:'");
		Иначе
			Сообщение = НСтр("ru = 'Некоторые из удаляемых строк входят в состав наборов:'");
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Копирование Тогда
		Элементы.РедактироватьНабор.Видимость = Истина;
		Элементы.УдалитьВсеСтрокиНаборов.Видимость = Ложь;
		Если КоличествоНаборов <= 1 Тогда
			Сообщение = НСтр("ru = 'Выделенная строка входит в набор:'");
		Иначе
			Сообщение = НСтр("ru = 'Выделенная строки входят в наборы:'");
		КонецЕсли;
	КонецЕсли;
	
	Если КоличествоНаборов > 1 Тогда
		Элементы.РедактироватьНабор.Видимость = Ложь;
	КонецЕсли;
	
	ПредставленияНаборов = Новый Массив;
	Для Каждого СтрокаНабора Из Параметры.Наборы Цикл
		ПредставленияНаборов.Добавить(НоменклатураКлиентСервер.ПредставлениеНоменклатуры(СтрокаНабора.НоменклатураНабора,
			СтрокаНабора.ХарактеристикаНабора));
	КонецЦикла;
	Элементы.СообщениеНаборы.Высота = КоличествоНаборов;
	СообщениеНаборы = СтрСоединить(ПредставленияНаборов, Символы.ПС);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РедактироватьНабор(Команда)
	Закрыть("РедактироватьНабор");
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть("Отмена");
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсеСтроки(Команда)
	Закрыть("УдалитьВесьНабор");
КонецПроцедуры

#КонецОбласти
