
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий 


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	// Пропускаем обработку, чтобы гарантировать получение формы объекта при передаче параметра "АвтоТест".
	Если ДанныеЗаполнения = "АвтоТест" Тогда
		Возврат;
	КонецЕсли;
	
	ИнициализироватьДокумент(ДанныеЗаполнения);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ОбработкаПроведенияДокумента();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Статус = Перечисления.СтатусыПланов.Утвержден Тогда
		Если Проведен Тогда
			РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения;
		Иначе
			РежимЗаписи = РежимЗаписиДокумента.Запись;
		КонецЕсли;
//		Движения.AMS_ПланыПродаж.Очистить();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	Если ОбщегоНазначенияУТКлиентСервер.АвторизованВнешнийПользователь() Тогда
		Возврат;
	КонецЕсли;
	
	Автор = Пользователи.ТекущийПользователь();
	
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДатаСеанса();
		Год  = НачалоГода(Дата);
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Менеджер) Тогда
		Менеджер = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Статус) Тогда
		Статус = ПредопределенноеЗначение("Перечисление.СтатусыПланов.ВПодготовке");
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведенияДокумента()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	д.Ссылка КАК Ссылка,
	|	д.Год КАК Год,
	|	д.Менеджер КАК Менеджер,
	|	т.НомерСтроки КАК НомерСтроки,
	|	т.Партнер КАК Партнер,
	|	т.Сумма1 КАК Сумма1,
	|	т.Сумма2 КАК Сумма2,
	|	т.Сумма3 КАК Сумма3,
	|	т.Сумма4 КАК Сумма4,
	|	т.Сумма5 КАК Сумма5,
	|	т.Сумма6 КАК Сумма6,
	|	т.Сумма7 КАК Сумма7,
	|	т.Сумма8 КАК Сумма8,
	|	т.Сумма9 КАК Сумма9,
	|	т.Сумма10 КАК Сумма10,
	|	т.Сумма11 КАК Сумма11,
	|	т.Сумма12 КАК Сумма12
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	Документ.AMS_ПланированиеПродаж.Клиенты КАК т
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.AMS_ПланированиеПродаж КАК д
	|		ПО т.Ссылка = д.Ссылка
	|ГДЕ
	|	д.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.Партнер КАК Партнер,
	|	КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(вт.Год, МЕСЯЦ, 0), МЕСЯЦ) КАК Дата,
	|	вт.Сумма1 КАК Сумма,
	|	вт.Партнер.AMS_СегментРынка КАК СегментРынка,
	|	вт.Партнер.ГруппаДоступа КАК ГруппаДоступа,
	|	вт.Менеджер КАК Менеджер
	|ИЗ
	|	вт КАК вт
	|ГДЕ
	|	вт.Сумма1 > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	вт.Партнер,
	|	КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(вт.Год, МЕСЯЦ, 1), МЕСЯЦ),
	|	вт.Сумма2,
	|	вт.Партнер.AMS_СегментРынка,
	|	вт.Партнер.ГруппаДоступа,
	|	вт.Менеджер
	|ИЗ
	|	вт КАК вт
	|ГДЕ
	|	вт.Сумма2 > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	вт.Партнер,
	|	КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(вт.Год, МЕСЯЦ, 2), МЕСЯЦ),
	|	вт.Сумма3,
	|	вт.Партнер.AMS_СегментРынка,
	|	вт.Партнер.ГруппаДоступа,
	|	вт.Менеджер
	|ИЗ
	|	вт КАК вт
	|ГДЕ
	|	вт.Сумма3 > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	вт.Партнер,
	|	КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(вт.Год, МЕСЯЦ, 3), МЕСЯЦ),
	|	вт.Сумма4,
	|	вт.Партнер.AMS_СегментРынка,
	|	вт.Партнер.ГруппаДоступа,
	|	вт.Менеджер
	|ИЗ
	|	вт КАК вт
	|ГДЕ
	|	вт.Сумма4 > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	вт.Партнер,
	|	КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(вт.Год, МЕСЯЦ, 4), МЕСЯЦ),
	|	вт.Сумма5,
	|	вт.Партнер.AMS_СегментРынка,
	|	вт.Партнер.ГруппаДоступа,
	|	вт.Менеджер
	|ИЗ
	|	вт КАК вт
	|ГДЕ
	|	вт.Сумма5 > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	вт.Партнер,
	|	КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(вт.Год, МЕСЯЦ, 5), МЕСЯЦ),
	|	вт.Сумма6,
	|	вт.Партнер.AMS_СегментРынка,
	|	вт.Партнер.ГруппаДоступа,
	|	вт.Менеджер
	|ИЗ
	|	вт КАК вт
	|ГДЕ
	|	вт.Сумма6 > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	вт.Партнер,
	|	КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(вт.Год, МЕСЯЦ, 6), МЕСЯЦ),
	|	вт.Сумма7,
	|	вт.Партнер.AMS_СегментРынка,
	|	вт.Партнер.ГруппаДоступа,
	|	вт.Менеджер
	|ИЗ
	|	вт КАК вт
	|ГДЕ
	|	вт.Сумма7 > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	вт.Партнер,
	|	КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(вт.Год, МЕСЯЦ, 7), МЕСЯЦ),
	|	вт.Сумма8,
	|	вт.Партнер.AMS_СегментРынка,
	|	вт.Партнер.ГруппаДоступа,
	|	вт.Менеджер
	|ИЗ
	|	вт КАК вт
	|ГДЕ
	|	вт.Сумма8 > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	вт.Партнер,
	|	КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(вт.Год, МЕСЯЦ, 8), МЕСЯЦ),
	|	вт.Сумма9,
	|	вт.Партнер.AMS_СегментРынка,
	|	вт.Партнер.ГруппаДоступа,
	|	вт.Менеджер
	|ИЗ
	|	вт КАК вт
	|ГДЕ
	|	вт.Сумма9 > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	вт.Партнер,
	|	КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(вт.Год, МЕСЯЦ, 9), МЕСЯЦ),
	|	вт.Сумма10,
	|	вт.Партнер.AMS_СегментРынка,
	|	вт.Партнер.ГруппаДоступа,
	|	вт.Менеджер
	|ИЗ
	|	вт КАК вт
	|ГДЕ
	|	вт.Сумма10 > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	вт.Партнер,
	|	КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(вт.Год, МЕСЯЦ, 10), МЕСЯЦ),
	|	вт.Сумма11,
	|	вт.Партнер.AMS_СегментРынка,
	|	вт.Партнер.ГруппаДоступа,
	|	вт.Менеджер
	|ИЗ
	|	вт КАК вт
	|ГДЕ
	|	вт.Сумма11 > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	вт.Партнер,
	|	КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(вт.Год, МЕСЯЦ, 11), МЕСЯЦ),
	|	вт.Сумма12,
	|	вт.Партнер.AMS_СегментРынка,
	|	вт.Партнер.ГруппаДоступа,
	|	вт.Менеджер
	|ИЗ
	|	вт КАК вт
	|ГДЕ
	|	вт.Сумма12 > 0";

	Рез = Запрос.Выполнить(); Выб = Рез.Выбрать();

	Движения.AMS_ПланыПродаж.Записывать = Истина;

	Пока Выб.Следующий() Цикл
		Движение = Движения.AMS_ПланыПродаж.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Выб);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
