#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("ВыполнитьДействие", ВыполнитьДействие);
	Параметры.Свойство("ТранспортноеСредство", ТранспортноеСредство);
	Параметры.Свойство("Водитель", Водитель);
	Параметры.Свойство("СтоимостьДоставки", СтоимостьДоставки);

	Организация = Неопределено;
	Параметры.Свойство("Организация", Организация);

	Распоряжение = Неопределено;
	Параметры.Свойство("Распоряжение", Распоряжение);

	МассивРаспоряжений = Неопределено;
	Параметры.Свойство("МассивРаспоряжений", МассивРаспоряжений);

	Если ВыполнитьДействие = "Отменить доставку" Тогда
		Заголовок                                    = "Отмена доставки";
		Элементы.ФормаОтменитьДоставку.Заголовок     = "Отменить доставку";
		Элементы.РаспоряженияГруппаДоплата.Видимость = Ложь;
		НомерСтроки                                  = 0;

		Для Каждого Распоряжение Из МассивРаспоряжений Цикл
			НомерСтроки = НомерСтроки + 1;

			СтрДок = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Распоряжение, "Партнер,AMS_КоличествоПалет,AMS_Вес");

			НовСтр = Распоряжения.Добавить();

			НовСтр.НомерСтроки     = НомерСтроки;
			НовСтр.Распоряжение    = Распоряжение;
			НовСтр.Партнер         = СтрДок.Партнер;
			НовСтр.КоличествоПалет = СтрДок.AMS_КоличествоПалет;
			НовСтр.Вес             = СтрДок.AMS_Вес;
		КонецЦикла;

	ИначеЕсли ВыполнитьДействие = "Возврат товара" Тогда
		Заголовок                                = "Возврат товара";
		Элементы.ФормаОтменитьДоставку.Заголовок = "Выполнить";
		Вес                                      = 0;
		НомерСтроки                              = 0;

		Массив = Новый Массив;
		Для Каждого Стр Из МассивРаспоряжений Цикл
			Массив.Добавить(Стр.Распоряжение);
		КонецЦикла;
		
		//@skip-check bsl-legacy-check-string-literal
		СоотДокВес = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(Массив, "AMS_Вес");

		Для Каждого КлючЗначение Из СоотДокВес Цикл
			Вес = Вес + КлючЗначение.Значение;
		КонецЦикла;

		Для Каждого Стр Из МассивРаспоряжений Цикл
			НомерСтроки = НомерСтроки + 1;

			НовСтр = Распоряжения.Добавить();

			ЗаполнитьЗначенияСвойств(НовСтр, Стр);

			НовСтр.НомерСтроки  = НомерСтроки;
			НовСтр.Организация  = Организация;
		КонецЦикла;

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПричинаПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтменитьДоставку(Команда)
	Если Не ЗначениеЗаполнено(Причина) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнено поле ""Причина отмены доставки"".");
		Возврат;
	КонецЕсли;

	Модифицированность = Ложь; //Снятие модифицированности, т.к. перед закрытием признак проверяется

	Закрыть(ПолучитьДанныеДляОтменыДоставки());
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьДанныеДляОтменыДоставки()
	Результат = Новый Структура;

	Если ВыполнитьДействие = "Отменить доставку" Тогда
		МассивРаспоряжений = Новый Массив;

		Для Каждого Стр Из Распоряжения Цикл
			СтрДок = Новый Структура;

			Док = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Стр.Распоряжение, "Номер, Дата");

			СтрДок.Вставить("ПредставлениеРаспоряжения", ОбщегоНазначенияУТ.ПолучитьПредставлениеДокумента(
				Стр.Распоряжение, Док.Номер, Док.Дата));
			СтрДок.Вставить("Распоряжение", Стр.Распоряжение);
			СтрДок.Вставить("Партнер", Стр.Партнер);
			СтрДок.Вставить("Вес", Стр.Вес);
			СтрДок.Вставить("КоличествоПалет", Стр.КоличествоПалет);

			МассивРаспоряжений.Добавить(СтрДок);
		КонецЦикла;

		Результат.Вставить("ТранспортноеСредство", ТранспортноеСредство);
		Результат.Вставить("Водитель", Водитель);
		Результат.Вставить("ДатаОтменыДоставки", ТекущаяДатаСеанса());
		Результат.Вставить("Причина", Причина);
		Результат.Вставить("МассивРаспоряжений", МассивРаспоряжений);

	ИначеЕсли ВыполнитьДействие = "Возврат товара" Тогда
		МассивРаспоряжений = Новый Массив;

		Для Каждого Стр Из Распоряжения Цикл
			СтрДок = Новый Структура;

			Док = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Стр.Распоряжение, "Номер, Дата");

			Если ТипЗнч(Стр.Распоряжение) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
				Или ТипЗнч(Стр.Распоряжение) = Тип("ДокументСсылка.AMS_ПередачаВПереработку") Тогда
				Подвоз = Ложь;
				
			ИначеЕсли ТипЗнч(Стр.Распоряжение) = Тип("ДокументСсылка.ЗаказПоставщику")
				Или ТипЗнч(Стр.Распоряжение) = Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента") Тогда
				Подвоз = Истина;
			КонецЕсли;

			СтрДок.Вставить("ПредставлениеРаспоряжения", ОбщегоНазначенияУТ.ПолучитьПредставлениеДокумента(
				Стр.Распоряжение, Док.Номер, Док.Дата));
			СтрДок.Вставить("Подвоз", Подвоз);
			СтрДок.Вставить("Распоряжение", Стр.Распоряжение);
			СтрДок.Вставить("Партнер", Стр.Партнер);
			СтрДок.Вставить("Организация", Стр.Организация);
			СтрДок.Вставить("ОрганизацияЗаказа", Стр.ОрганизацияЗаказа);
			СтрДок.Вставить("СуммаДокумента", Стр.СуммаДокумента);
			СтрДок.Вставить("СтоимостьЧека", Стр.СтоимостьЧека);
			СтрДок.Вставить("ПунктДоговора", Стр.ПунктДоговора);
			СтрДок.Вставить("СуммаШтрафа", Стр.СуммаШтрафа);
			СтрДок.Вставить("СодержаниеПретензии", Стр.СодержаниеПретензии);
			СтрДок.Вставить("СуммаПретензии", Стр.СуммаПретензии);
			СтрДок.Вставить("Вес", Стр.Вес);
			СтрДок.Вставить("КоличествоПалет", Стр.КоличествоПалет);

			МассивРаспоряжений.Добавить(СтрДок);
		КонецЦикла;

		Результат.Вставить("ТранспортноеСредство", ТранспортноеСредство);
		Результат.Вставить("Водитель", Водитель);
		Результат.Вставить("ДатаОтменыДоставки", ТекущаяДатаСеанса());
		Результат.Вставить("Причина", Причина);
		Результат.Вставить("МассивРаспоряжений", МассивРаспоряжений);
	КонецЕсли;

	Возврат Результат;
КонецФункции

#КонецОбласти