
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьОтключениеБезопасногоРежима(Истина);
	
	ДатаВозможностиСклада = мср.ПолучитьРабочийДень(1);
	
	УстановитьДатыПрайса();
	
	УстановитьУсловноеОформление();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НастройкаФормы();
	
	ПоказатьПродажи();
	
	Заголовок = ПолучитьЗаголовок();
	
	ПодключитьОбработчикОжидания("ОбновитьЗаголовокФормы", 60);
	ПодключитьОбработчикОжидания("ПоказатьВозможностиСклада", 0.1, Истина);
	ПодключитьОбработчикОжидания("ПоказатьНовыхКлиентов", 1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "Запись_ЗаказКлиента" 
		Или ИмяСобытия = "Запись_ОтгрузкаТоваровКлиенту"
		Или ИмяСобытия = "Запись_РеализацияТоваровУслуг"
		Или ИмяСобытия = "Запись_ЛогистическийЛист" 
		Или ИмяСобытия = "Запись_РасходныйОрдерНаТовары" Тогда
			
		ПоказатьПродажи();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ГруппаДоступаПриИзменении(Элемент)
	ПоказатьПродажи();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ПодключитьОбработчикОжидания("ПоказатьВозможностиСклада", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница = Элементы.СтраницаПродажи Тогда
		ПоказатьПродажи();

	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаБланк Тогда
		СформироватьБланкЗаказа();

	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаПрайсы Тогда
		СформироватьПрайсЛист();
	КонецЕсли;
	
	НастройкаФормы();
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПрайсовПриСменеСтраницы(Элемент, ТекущаяСтраница)
	УстановитьДатыПрайса();
	СформироватьПрайсЛист();
	НастройкаФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПартнерПриИзменении(Элемент)
	ПартнерПриИзмененииНаСервере();

	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаБланк Тогда
		СформироватьБланкЗаказа();

	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПрайсы Тогда
		СформироватьПрайсЛист();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПравилоПродажиПриИзменении(Элемент)
	ЗаполнитьШапкуПоПравилуПродаж();

	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаБланк Тогда
		СформироватьБланкЗаказа();

	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПрайсы Тогда
		СформироватьПрайсЛист();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоглашениеПриИзменении(Элемент)
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаБланк Тогда
		СформироватьБланкЗаказа();

	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПрайсы Тогда
		СформироватьПрайсЛист();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТабДокОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДатаПрайсаБХПриИзменении(Элемент)
	УстановитьЗначениеКонстанты("_ДатаПрайса",ДатаПрайсаБХ);
	УстановитьДатыПрайса();
	СформироватьПрайсЛист();
	НастройкаФормы();
КонецПроцедуры


&НаКлиенте
Процедура ДатаПрайсаМЕГАПриИзменении(Элемент)
	УстановитьЗначениеКонстанты("_ДатаПрайса",ДатаПрайсаМЕГА);
	УстановитьДатыПрайса();
	СформироватьПрайсЛист();
	НастройкаФормы();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПрайсаПроизвольнаяПриИзменении(Элемент)
	УстановитьДатыПрайса();
	СформироватьПрайсЛист();
	НастройкаФормы();
КонецПроцедуры

&НаКлиенте
Процедура ДатаЦеныПроизвольнаяПриИзменении(Элемент)
	УстановитьДатыПрайса();
	СформироватьПрайсЛист();
	НастройкаФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПрайсТехническийПриИзменении(Элемент)
	СформироватьПрайсЛист();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПродажи

&НаКлиенте
Процедура ПродажиПриАктивизацииСтроки(Элемент)
	Стр = Элементы.Продажи.ТекущиеДанные;

	Если Стр = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаказКлиента = Стр.ЗаказКлиента;
	Реализация   = Стр.Реализация;
	
	Если ЗначениеЗаполнено(Реализация) Тогда
		Данные = ОбщегоНазначенияУТВызовСервера.ЗначенияРеквизитовОбъекта(Реализация, "AMS_ПравилоПродажи, Соглашение, АдресДоставки");
		Элементы.ПродажиГруппаПечатьОтРеализации.Видимость = Истина;
	Иначе
		Данные = ОбщегоНазначенияУТВызовСервера.ЗначенияРеквизитовОбъекта(ЗаказКлиента, "AMS_ПравилоПродажи, Соглашение, АдресДоставки");
		Элементы.ПродажиГруппаПечатьОтРеализации.Видимость = Ложь;
	КонецЕсли;

	Партнер        = Стр.Клиент;
	ПравилоПродажи = Данные.AMS_ПравилоПродажи;
	Соглашение     = Данные.Соглашение;
	АдресДоставки  = Данные.АдресДоставки;
	ИнфоЛимит      = ?(Стр.Лимит > 0, "Лимит: " + Стр.Лимит + "/" + Стр.СуммаЛимит, "");
КонецПроцедуры

&НаКлиенте
Процедура ПродажиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Стр = Элемент.ТекущиеДанные;

	Если Стр = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле.Имя = "ПродажиСуммаДокумента" Или Поле.Имя = "ПродажиДолгКлиентаПросрочен"
		Или Поле.Имя = "ПродажиДолгНаш" Или Поле.Имя = "ПродажиСуммаЛимит" Тогда
		
		Отбор = Новый Структура;
		Отбор.Вставить("Организация", Стр.Организация);
		Отбор.Вставить("Клиент", Стр.Клиент);
	
		Парам = Новый Структура;
		Парам.Вставить("ВидимостьКомандВариантовОтчетов", Ложь);
		Парам.Вставить("СформироватьПриОткрытии", Истина);
		Парам.Вставить("КлючНазначенияИспользования", Стр.Клиент);
		Парам.Вставить("Отбор", Отбор);
	
		ОткрытьФорму("Отчет.AMS_РасчетыСКлиентами.Форма", Парам, ЭтотОбъект);
			
	ИначеЕсли Не ЗначениеЗаполнено(Стр.ЗаказКлиента) И ЗначениеЗаполнено(Стр.Реализация) Тогда
		ПоказатьЗначение(, Стр.Реализация);
	
	ИначеЕсли ЗначениеЗаполнено(Стр.ЗаказКлиента) И Не ЗначениеЗаполнено(Стр.Реализация) Тогда
		ПоказатьЗначение(, Стр.ЗаказКлиента);
	
	ИначеЕсли Поле.Имя = "ПродажиСостоянияЗаказ" Или Поле.Имя = "ПродажиНомер" Или Поле.Имя = "ПродажиДата" Тогда
		ПоказатьЗначение(, Стр.ЗаказКлиента);
	
	Иначе	
		ПоказатьЗначение(, Стр.Реализация);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область Продажи

&НаКлиенте
Процедура КнопкаОбновить(Команда)
	ПоказатьПродажи();
КонецПроцедуры

&НаКлиенте
Процедура КнопкаСоздатьЗаказКлиента(Команда)
	ОткрытьФорму("Документ.ЗаказКлиента.ФормаОбъекта");
КонецПроцедуры

&НаКлиенте
Процедура КнопкаСоздатьРеализациюТоворомУслуг(Команда)
	ТекущиеДанные = Элементы.Продажи.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;		
	КонецЕсли;
		
	ЗаказКлиента = ТекущиеДанные.ЗаказКлиента;
	
	Если Не ЗначениеЗаполнено(ЗаказКлиента) Тогда
		Текст = "Не выбран заказ клиента.";
		ПоказатьПредупреждение(, Текст, 10);
		Возврат;
	КонецЕсли;
	
	Если Не AMS_ВызовСервера.ЭтоKhors() Тогда
		Отказ = Ложь;
		AMS_ВызовСервера.ПроверитьВозможностьСозданияРеализацииНаОснованииЗаказаКлиента(ЗаказКлиента, Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	МассивСсылок = Новый Массив;
	МассивСсылок.Добавить(ЗаказКлиента);

	ПараметрыОткрытия = СозданиеНаОснованииУТВызовСервера.РеализацияТоваровУслугПараметрыОткрытияФормы(МассивСсылок);

	ОткрытьФорму("Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента", ПараметрыОткрытия);
КонецПроцедуры

&НаКлиенте
Процедура КнопкаОбеспечение(Команда)
	Отбор = Новый Структура;
	Отбор.Вставить("Дата", ОбщегоНазначенияКлиент.ДатаСеанса());
	Отбор.Вставить("СкладПродукции", AMS_ВызовСервера.СкладПродукции());

	Парам = Новый Структура;
	Парам.Вставить("КлючНазначенияИспользования", "Обеспечение");
	Парам.Вставить("СформироватьПриОткрытии", Истина);
	Парам.Вставить("ВидимостьКомандВариантовОтчетов", Ложь);
	Парам.Вставить("Отбор", Отбор);
		
	ОткрытьФорму("Отчет.AMS_Обеспечение.Форма", Парам, ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область Отчёты

&НаКлиенте
Процедура ОтчетПродажиПродукции(Команда)
	Парам = Новый Структура;
	Парам.Вставить("КлючНазначенияИспользования", "Продажи" + Объект.ГруппаДоступа);
	
	ОткрытьФорму("Отчет.AMS_ПродажиПродукции.Форма", Парам, ЭтотОбъект, ОбщегоНазначенияКлиент.ДатаСеанса());
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПродажиПоРегионам(Команда)
	Парам = Новый Структура;
	Парам.Вставить("КлючНазначенияИспользования", "ПродажиПоРегионам" + Объект.ГруппаДоступа);
	ОткрытьФорму("Отчет.AMS_ПродажиПоРегионам.Форма", Парам, ЭтотОбъект, ОбщегоНазначенияКлиент.ДатаСеанса());
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПлатежнаяДисциплинаКлиентов(Команда)
	ОткрытьФорму("Отчет.AMS_ПлатежнаяДисциплинаКлиентов.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ОтчетДинамикаПродаж(Команда)
	ОткрытьФорму("Отчет.AMS_ДинамикаПродаж.Форма", , ЭтотОбъект, ОбщегоНазначенияКлиент.ДатаСеанса());
КонецПроцедуры

&НаКлиенте
Процедура ОтчетОтгрузкиПоДням(Команда)
	ОткрытьФорму("Отчет.AMS_ДинамикаОтгрузок.Форма", , ЭтотОбъект, ОбщегоНазначенияКлиент.ДатаСеанса());
КонецПроцедуры

&НаКлиенте
Процедура ОтчетСравнениеПродаж(Команда)
	ОткрытьФорму("Отчет.AMS_ПродажиСравнениеПоРазличнымЦенам.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ОтчетНовыеКлиенты(Команда)
	Парам = Новый Структура;
	Парам.Вставить("Продукция", AMS_ВызовСервера.НоменклатураГруппаПродукцияКемикал());
	ОткрытьФорму("Отчет.AMS_НовыеКлиенты.Форма", Парам, ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область Печать

&НаКлиенте
Процедура ПечатьКомплектДокумента(Команда)
	ТекущиеДанные = Элементы.Продажи.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Ложь;

	СпособДоставки  = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Реализация, "СпособДоставки");
	СпособСамовывоз = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление.СпособыДоставки.Самовывоз");
	Самовывоз      = (СпособДоставки = СпособСамовывоз);

	Если Не ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Реализация, "AMS_УтвержденаОтгрузка") Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Документ не утверждён к отгрузке.", , , , Отказ);
	КонецЕсли;

	Если Не Самовывоз И Не AMS_ВызовСервера.ВключенВЛогитическийЛист(Реализация) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Документ не включен в логистический лист.", , , , Отказ);
	КонецЕсли;

	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	Парам = Новый Структура("Документ", Реализация);
	ОткрытьФорму("Обработка.AMS_Продажи.Форма.ФормаПечать", Парам, ЭтотОбъект, , , , ,
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЗаказКлиента(Команда)
	Если ЗначениеЗаполнено(Реализация) Тогда
		AMS_Клиент.ВыполнитьКомандуПечати(Реализация, "СчетНаОплату", Новый Структура("Заголовок", "ЗаказКлиента"));
	Иначе
		AMS_Клиент.ВыполнитьКомандуПечати(ЗаказКлиента, "СчетНаОплату", Новый Структура("Заголовок", "ЗаказКлиента"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПечатьСчетНаОплату(Команда)
	Если ЗначениеЗаполнено(Реализация) Тогда
		AMS_Клиент.ВыполнитьКомандуПечати(Реализация, "СчетНаОплату", Новый Структура("Заголовок", "Счет"));
	Иначе
		AMS_Клиент.ВыполнитьКомандуПечати(ЗаказКлиента, "СчетНаОплату", Новый Структура("Заголовок", "Счет"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПечатьУПД(Команда)
	AMS_Клиент.ВыполнитьКомандуПечати(Реализация, "УПД");
КонецПроцедуры

&НаКлиенте
Процедура ПечатьСкладскаяНакладная(Команда)
	УтвержденаОтгрузка = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Реализация, "AMS_УтвержденаОтгрузка");
	
	Если Не УтвержденаОтгрузка Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Печать запрещена, так как отгрузка не утверждена.");
	
	Иначе	
		AMS_Клиент.ВыполнитьКомандуПечати(Реализация, "СН");
		AMS_ВызовСервера.ЗаписатьСобытиеДокумента(Реализация, ПредопределенноеЗначение("Перечисление.AMS_СобытияРеализации.ПечатьСН"));
		ПоказатьПродажи();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПечатьУпаковочныйЛист(Команда)
	AMS_Клиент.ВыполнитьКомандуПечати(Реализация, "УпаковочныйЛист");
КонецПроцедуры

&НаКлиенте
Процедура ПечатьДоверенность(Команда)
	AMS_Клиент.ВыполнитьКомандуПечати(Реализация, "Доверенность");
КонецПроцедуры

&НаКлиенте
Процедура ПечатьТранспортнаяНакладная(Команда)
	Парам = Новый Структура("ТранспортноеСредство,Распоряжение,Образец", Неопределено, Реализация, Истина);

	AMS_Клиент.ВыполнитьКомандуПечати(Реализация, "ТН", Парам);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьТТН(Команда)
	AMS_Клиент.ВыполнитьКомандуПечати(Реализация, "ТТН");
КонецПроцедуры

&НаКлиенте
Процедура ПечатьТОРГ_12(Команда)
	AMS_Клиент.ВыполнитьКомандуПечати(Реализация, "ТОРГ12", Новый Структура("ВыводитьУслуги", Ложь));
КонецПроцедуры

&НаКлиенте
Процедура ПечатьСчетФактура(Команда)
	AMS_Клиент.ВыполнитьКомандуПечати(Реализация, "СчетФактура", Новый Структура("ПечатьВВалюте", Ложь));
КонецПроцедуры

&НаКлиенте
Процедура ПечатьСпецификации(Команда)
	AMS_Клиент.ВыполнитьКомандуПечати(Реализация, "Спецификация");
КонецПроцедуры

&НаКлиенте
Процедура ПечатьСпецификацииЭкспорт(Команда)
	AMS_Клиент.ВыполнитьКомандуПечати(Реализация, "СпецификацияЭкспорт");
КонецПроцедуры

&НаКлиенте
Процедура ПечатьАктаОРасхождениях(Команда)
	AMS_Клиент.ВыполнитьКомандуПечати(Реализация, "АктОРасхождениях");
КонецПроцедуры

&НаКлиенте
Процедура ПечатьПалетнаяЭтикетка(Команда)
	AMS_Клиент.ВыполнитьКомандуПечати(Реализация, "ПалетнаяЭтикетка");
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЗаявкаПеревозчику(Команда)
	Если ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Реализация, "СпособДоставки")
		= ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу") Тогда
		AMS_Клиент.ВыполнитьКомандуПечати(Реализация, "ЗаявкаПеревозчику");
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			"Заявка перевозчику оформляется при способе доставки ""До перевозчика"".");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПечатьСертификатыНоменклатурыРеестр(Команда)
	AMS_Клиент.ВыполнитьКомандуПечати(Реализация, "СертификатыНоменклатурыРеестр");
КонецПроцедуры

&НаКлиенте
Процедура ПечатьСертификатыНоменклатурыБезДублей(Команда)
	AMS_Клиент.ВыполнитьКомандуПечати(Реализация, "СертификатыНоменклатурыИзображенияИзДокументовБезДублей");
КонецПроцедуры

&НаКлиенте
Процедура ПечатьНакладнаяНаПалеты(Команда)
	AMS_Клиент.ВыполнитьКомандуПечати(Реализация, "НакладнаяНаПалеты");
КонецПроцедуры

&НаКлиенте
Процедура ПечатьРазрешитьИзменения(Команда)
	Если AMS_ВызовСервера.ЕстьОперацияПечатьПоследняя(Реализация) Тогда
		Оповещение = Новый ОписаниеОповещения("РазрешитьИзмененияЗавершение", ЭтотОбъект);
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр(
			"ru = 'Разрешить изменение документа ""%1""?'"), Реализация);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Нет запрета на изменение.");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПечатьПрайс(Команда)
	ТекСтр = Элементы.Страницы.ТекущаяСтраница;
	
	Если ТекСтр = Элементы.СтраницаБланк Тогда
		ТабДок = ТабДокБланк;
	
	ИначеЕсли ТекСтр = Элементы.СтраницаПрайсы Тогда
		ТекСтр = Элементы.СтраницыПрайсов.ТекущаяСтраница;
		
		Если ТекСтр = Элементы.СтраницаПрайс Тогда
			ТабДок = ТабДокПрайс;
		
		ИначеЕсли ТекСтр = Элементы.СтраницаПрайсОпт Тогда
			ТабДок = ТабДокПрайсОпт;
			
		ИначеЕсли ТекСтр = Элементы.СтраницаПрайсОптСНГ Тогда
			ТабДок = ТабДокПрайсОптСНГ;
			
		ИначеЕсли ТекСтр = Элементы.СтраницаПрайсСети Тогда
			ТабДок = ТабДокПрайсСети;
			
		ИначеЕсли ТекСтр = Элементы.СтраницаПрайсМЕГА Тогда
			ТабДок = ТабДокПрайсМЕГА;
			
		КонецЕсли;
	КонецЕсли;

	Массив = Новый Массив;
	Массив.Добавить(Партнер);

	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.AMS_Продажи", "Прайс", Массив, Неопределено,
		Новый Структура("ТабличныйДокумент", ТабДок));
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьExcel(Команда)
	ЭтоБланкЗаказа  = Ложь;
	
	ТекСтр = Элементы.Страницы.ТекущаяСтраница;
	
	Если ТекСтр = Элементы.СтраницаБланк Тогда
		Если Не ЗначениеЗаполнено(Партнер) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не заполнено поле ""Партнер"".'"));
			Возврат;
		КонецЕсли;
		
		ИмяПартнера    = СокрЛП(ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Партнер, "Наименование"));
		ИмяФайла       = "Бланк заказа " + ИмяПартнера;
		ЭтоБланкЗаказа = Истина;;
		ТабДок         = ТабДокБланк;
	
	ИначеЕсли ТекСтр = Элементы.СтраницаПрайсы Тогда
		ТекСтр = Элементы.СтраницыПрайсов.ТекущаяСтраница;

		Если ТекСтр = Элементы.СтраницаПрайс Тогда
			Если Не ЗначениеЗаполнено(Партнер) Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не заполнено поле ""Партнер"".'"));
				Возврат;
			КонецЕсли;
			
			ИмяПартнера = СокрЛП(ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Партнер, "Наименование"));
			ИмяФайла    = "Прайс-лист " + ИмяПартнера;
			ТабДок      = ТабДокПрайс;
		
		ИначеЕсли ТекСтр = Элементы.СтраницаПрайсОпт Тогда
			ИмяФайла    = "Прайс-лист оптовый бытовая химия";
			ТабДок = ТабДокПрайсОпт;
	
		ИначеЕсли ТекСтр = Элементы.СтраницаПрайсОптСНГ Тогда
			ИмяФайла    = "Прайс-лист оптовый бытовая химия (СНГ)";
			ТабДок = ТабДокПрайсОптСНГ;
	
		ИначеЕсли ТекСтр = Элементы.СтраницаПрайсСети Тогда
			ИмяФайла    = "Прайс-лист оптовый бытовая химия (Сети)";
			ТабДок = ТабДокПрайсСети;
		
		ИначеЕсли ТекСтр = Элементы.СтраницаПрайсМЕГА Тогда
			ИмяФайла    = "Прайс-лист МЕГА";
			ТабДок = ТабДокПрайсМЕГА;
		КонецЕсли;
	КонецЕсли;

	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Заголовок          = "Выберите каталог для сохранения ЗАКАЗА";
	Диалог.Фильтр             = "Файлы Excel (*.xlsx;*.xls)|*.xlsx;*.xls|";
	Диалог.МножественныйВыбор = Ложь;
	Диалог.ПолноеИмяФайла     = ИмяФайла;

	Если Диалог.Выбрать() Тогда
		Состояние("Создание файла EXCEL.");

		ИмяФайла = Диалог.ПолноеИмяФайла;

		ТабДок.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.XLSX);

		Если ЭтоБланкЗаказа Тогда
			ОтредактироватьФайлЗаказаEXCEL(ИмяФайла);
		КонецЕсли;

		Состояние();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ВыполнитьВыгрузкуПродаж(Команда)
	ВыполнитьВыгрузкуПродажНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Продажи

&НаКлиенте
Процедура ПоказатьПродажи()
	ПоказатьПродажиНаСервере();
	
	Для Каждого Стр Из Объект.Продажи Цикл
		Если Стр.ЗаказКлиента = ЗаказКлиента Или Стр.Реализация = Реализация Тогда
			Элементы.Продажи.ТекущаяСтрока = Стр.ПолучитьИдентификатор();
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПоказатьПродажиНаСервере()
	Коннектор = РеквизитФормыВЗначение("Объект");
	Коннектор.ЗаполнитьТаблицуПродажи();
	ЗначениеВДанныеФормы(Коннектор, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗаголовокФормы() Экспорт
	Заголовок = ПолучитьЗаголовок();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗаголовок()
	УстановитьПривилегированныйРежим(Истина);
	
	ТекДата = ТекущаяДатаСеанса();
	
	Если ДеньНедели(ТекДата) = 1 Тогда
		ДатаНачала    = НачалоНедели(НачалоНедели(ТекДата) - 3600);
		ДатаОкончания = КонецНедели(НачалоНедели(ТекДата) - 3600);
	Иначе
		ДатаНачала 	  = НачалоНедели(ТекДата);
		ДатаОкончания = КонецНедели(ТекДата);
	КонецЕсли;		

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);

	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	д.Ссылка КАК Ссылка,
	|	д.СуммаДокумента КАК СуммаДокумента
	|ПОМЕСТИТЬ Продано
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК д
	|ГДЕ
	|	д.Проведен
	|	И НЕ д.AMS_СтатусРеализации В (ЗНАЧЕНИЕ(Перечисление.AMS_СтатусыРеализаций.Заказ), ЗНАЧЕНИЕ(Перечисление.AMS_СтатусыРеализаций.Стикерование), ЗНАЧЕНИЕ(Перечисление.AMS_СтатусыРеализаций.КОтгрузке))
	|	И д.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	д.Ссылка,
	|	д.СуммаДокумента
	|ИЗ
	|	Документ.ОтчетКомиссионера КАК д
	|ГДЕ
	|	д.Проведен
	|	И д.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(Продано.СуммаДокумента) КАК Продано
	|ПОМЕСТИТЬ вт1
	|ИЗ
	|	Продано КАК Продано
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	д.Ссылка КАК Ссылка,
	|	д.СуммаДокумента КАК Поступило
	|ПОМЕСТИТЬ Оплачено
	|ИЗ
	|	Документ.ПоступлениеБезналичныхДенежныхСредств КАК д
	|ГДЕ
	|	д.Проведен
	|	И д.ПроведеноБанком
	|	И д.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента)
	|	И д.ДатаПроведенияБанком МЕЖДУ &ДатаНачала И &ДатаОкончания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(Оплачено.Поступило) КАК Оплачено
	|ПОМЕСТИТЬ вт2
	|ИЗ
	|	Оплачено КАК Оплачено
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	вт1.Продано КАК Продано,
	|	вт2.Оплачено КАК Оплачено
	|ИЗ
	|	вт1 КАК вт1
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт2 КАК вт2
	|		ПО (ИСТИНА)";

	Рез = Запрос.Выполнить();

	Если Рез.Пустой() Тогда
		ТекстЗаголовка = "План продаж";
		
	Иначе
		Выб = Рез.Выбрать();
		Выб.Следующий();
		
		Продано  = ?(Выб.Продано = NULL, 0, Выб.Продано);
		Оплачено = ?(Выб.Оплачено = NULL, 0, Выб.Оплачено);
		
		Если Продано = 0 И Оплачено = 0 Тогда
			ТекстЗаголовка = НСтр("ru='План продаж'");
		Иначе
			ТекстЗаголовка = НСтр("ru='Продано на %Продано% руб., Поступило %Оплачено% руб.'");
			ТекстЗаголовка = СтрЗаменить(ТекстЗаголовка, "%Продано%", ?(Продано = 0, "0", Формат(Продано, "ЧДЦ=0")));
			ТекстЗаголовка = СтрЗаменить(ТекстЗаголовка, "%Оплачено%", ?(Оплачено = 0, "0", Формат(Оплачено, "ЧДЦ=0")));
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТекстЗаголовка;
КонецФункции

&НаКлиенте
Процедура ПоказатьВозможностиСклада() Экспорт
	ИнфоСклад = ПолучитьВозвожностиСклада(ДатаВозможностиСклада);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВозвожностиСклада(ДатаОтгрузки)
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаОтгрузки", ДатаОтгрузки);
	Запрос.УстановитьПараметр("СкладПродукции", AMS_ВызовСервера.СкладПродукции());

	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА т.ДокументОтгрузки ССЫЛКА Документ.ЗаказКлиента
	|			ТОГДА т.ДокументОтгрузки.ДатаОтгрузки
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(т.ДокументОтгрузки.Дата, ДЕНЬ)
	|	КОНЕЦ КАК ДатаОтгрузки,
	|	т.ДокументОтгрузки КАК ДокументОтгрузки
	|ПОМЕСТИТЬ КОтгр
	|ИЗ
	|	РегистрНакопления.ТоварыКОтгрузке.Остатки(, Склад = &СкладПродукции) КАК т
	|ГДЕ
	|	(ТИПЗНАЧЕНИЯ(т.ДокументОтгрузки) = ТИП(Документ.ЗаказКлиента)
	|			ИЛИ ТИПЗНАЧЕНИЯ(т.ДокументОтгрузки) = ТИП(Документ.РеализацияТоваровУслуг))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(т.ДокументОтгрузки.AMS_УтвержденаОтгрузка, ЛОЖЬ) КАК УтвержденаОтгрузка,
	|	т.ДокументОтгрузки.AMS_КоличествоУпаковок КАК КоличествоУпаковок
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	КОтгр КАК т
	|ГДЕ
	|	т.ДатаОтгрузки = &ДатаОтгрузки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ВЫБОР
	|			КОГДА вт.УтвержденаОтгрузка
	|				ТОГДА ЕСТЬNULL(вт.КоличествоУпаковок, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КОтгрузке,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ вт.УтвержденаОтгрузка
	|				ТОГДА ЕСТЬNULL(вт.КоличествоУпаковок, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Резерв
	|ИЗ
	|	вт КАК вт";

	Рез = Запрос.Выполнить();

	Если Рез.Пустой() Тогда
		Возврат "";
	Иначе
		Выб = Рез.Выбрать();
		Выб.Следующий();

		Возможность = AMS_ВызовСервера.ПолучитьВозможностиСклада(ДатаОтгрузки);
		Остаток     = Возможность - ?(Выб.КОтгрузке = NULL, 0, Выб.КОтгрузке) - ?(Выб.Резерв = NULL, 0, Выб.Резерв);

		Возврат "- " + Возможность + ": к отгрузке - " 
			+ ?(Выб.КОтгрузке = 0 Или Выб.КОтгрузке = NULL, "0", Формат(Выб.КОтгрузке, "ЧДЦ=0")) 
			+ ", в резерве - " + ?(Выб.Резерв = 0 Или Выб.Резерв = NULL, "0", Формат(Выб.Резерв, "ЧДЦ=0")) 
			+ ", остаток - " + Формат(Остаток, "ЧДЦ=0") + " упак.";
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ПоказатьНовыхКлиентов() Экспорт
	ИнфоНовыеКлиенты = ПолучитьНовыхКлиентов();
	
	НастройкаФормы();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНовыхКлиентов()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СкладПродукции", AMS_ВызовСервера.СкладПродукции());

	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Реализации.Партнер КАК Партнер
	|ПОМЕСТИТЬ КлиентыВсе
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК Реализации
	|ГДЕ
	|	Реализации.Склад = &СкладПродукции
	|	И Реализации.AMS_СтатусРеализации В (ЗНАЧЕНИЕ(Перечисление.AMS_СтатусыРеализаций.Заказ),
	|		ЗНАЧЕНИЕ(Перечисление.AMS_СтатусыРеализаций.КОтгрузке), ЗНАЧЕНИЕ(Перечисление.AMS_СтатусыРеализаций.Стикерование))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Партнер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Реализации.Партнер КАК Партнер
	|ПОМЕСТИТЬ КлиентыСтарые
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК Реализации
	|ГДЕ
	|	Реализации.Склад = &СкладПродукции
	|	И НЕ Реализации.AMS_СтатусРеализации В (ЗНАЧЕНИЕ(Перечисление.AMS_СтатусыРеализаций.Заказ),
	|		ЗНАЧЕНИЕ(Перечисление.AMS_СтатусыРеализаций.КОтгрузке), ЗНАЧЕНИЕ(Перечисление.AMS_СтатусыРеализаций.Стикерование))
	|	И Реализации.Партнер В
	|		(ВЫБРАТЬ
	|			т.Партнер КАК Партнер
	|		ИЗ
	|			КлиентыВсе КАК т)
	|СГРУППИРОВАТЬ ПО
	|	Реализации.Партнер
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Партнер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КлиентыВсе.Партнер КАК Партнер,
	|	КлиентыВсе.Партнер.Наименование КАК НаименованиеПартнера
	|ИЗ
	|	КлиентыВсе КАК КлиентыВсе
	|ГДЕ
	|	НЕ КлиентыВсе.Партнер В
	|		(ВЫБРАТЬ
	|			КлиентыСтарые.Партнер КАК Партнер
	|		ИЗ
	|			КлиентыСтарые КАК КлиентыСтарые)";

	Рез = Запрос.Выполнить();

	ТекстОтвета = "";
	
	Если Рез.Пустой() Тогда
		Возврат ТекстОтвета;
	
	Иначе
		Выб = Рез.Выбрать();
		Пока Выб.Следующий() Цикл
			ТекстОтвета = ТекстОтвета + " " + Выб.НаименованиеПартнера + ";";
		КонецЦикла;

		Возврат Лев(ТекстОтвета, СтрДлина(ТекстОтвета) - 1);
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура РазрешитьИзмененияЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		AMS_ВызовСервера.ЗаписатьСобытиеДокумента(Реализация, ПредопределенноеЗначение("Перечисление.AMS_СобытияРеализации.ОтменаПечати"));

		Если Не AMS_ВызовСервера.ЕстьОперацияПечатьПоследняя(Реализация) Тогда
			ОчиститьСообщения();
			ОбщегоНазначенияКлиент.СообщитьПользователю("Дано разрешение на изменение.");
		КонецЕсли;

		ПоказатьПродажи();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область БланЗаказа

&НаСервере
Процедура ПартнерПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Партнер) Тогда
		УстановитьПравилоПродажи();

		Если Не ЗначениеЗаполнено(ПравилоПродажи) Тогда
			УстановитьДанныеПоРеализации();
		КонецЕсли;

		Если Не ЗначениеЗаполнено(Соглашение) Тогда
			УстановитьСоглашение();
		КонецЕсли;

	Иначе
		ПравилоПродажи = Неопределено;
		Соглашение     = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьПравилоПродажи()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	т.Ссылка КАК ПравилоПродажи,
	|	т.Соглашение КАК Соглашение,
	|	т.АдресДоставки КАК АдресДоставки,
	|	т.СпособДоставки КАК СпособДоставки
	|ИЗ
	|	Справочник.AMS_ПравилаПродаж КАК т
	|ГДЕ
	|	т.Владелец = &Партнер
	|	И т.СтатусПравилаПродажи = ЗНАЧЕНИЕ(Перечисление.AMS_СтатусыПравилПродаж.Действует)
	|	И т.Основное";

	Рез = Запрос.Выполнить();

	Если Рез.Пустой() Тогда
		ПравилоПродажи = Неопределено;
		Соглашение     = Неопределено;
		АдресДоставки  = Неопределено;

	Иначе
		Выб = Рез.Выбрать();
		Выб.Следующий();

		ПравилоПродажи = Выб.ПравилоПродажи;
		Соглашение     = Выб.Соглашение;
		АдресДоставки  = Выб.АдресДоставки;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьДанныеПоРеализации()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	д.AMS_ПравилоПродажи КАК ПравилоПродажи,
	|	д.Соглашение КАК Соглашение,
	|	д.СпособДоставки КАК СпособДоставки,
	|	д.АдресДоставки КАК АдресДоставки
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК д
	|ГДЕ
	|	д.Партнер = &Партнер
	|
	|УПОРЯДОЧИТЬ ПО
	|	д.МоментВремени УБЫВ";

	Рез = Запрос.Выполнить();

	Если Не Рез.Пустой() Тогда
		Выб = Рез.Выбрать();
		Выб.Следующий();

		ПравилоПродажи = Выб.ПравилоПродажи;
		Соглашение     = Выб.Соглашение;
		АдресДоставки  = Выб.АдресДоставки;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьСоглашение()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	т.Ссылка КАК Соглашение
	|ИЗ
	|	Справочник.СоглашенияСКлиентами КАК т
	|ГДЕ
	|	т.Партнер = &Партнер
	|	И т.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСоглашенийСКлиентами.Действует)
	|	И т.ДатаНачалаДействия <= &Дата
	|	И ВЫБОР
	|			КОГДА т.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ т.ДатаОкончанияДействия >= &Дата
	|		КОНЕЦ";

	Рез = Запрос.Выполнить();

	Если Не Рез.Пустой() Тогда
		Выб = Рез.Выбрать();
		Выб.Следующий();
		Соглашение = Выб.Соглашение;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьШапкуПоПравилуПродаж()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПравилоПродажи", ПравилоПродажи);
	Запрос.Текст =
	"ВЫБРАТЬ
	|   т.Соглашение КАК Соглашение,
	|   т.СпособДоставки КАК СпособДоставки,
	|   т.АдресДоставки КАК АдресДоставки
	|ИЗ
	|   Справочник.AMS_ПравилаПродаж КАК т
	|ГДЕ
	|   т.Ссылка = &ПравилоПродажи";

	Рез = Запрос.Выполнить();
	Выб = Рез.Выбрать();
	Выб.Следующий();

	Соглашение     = Выб.Соглашение;
	АдресДоставки  = Выб.АдресДоставки;
КонецПроцедуры

&НаСервере
Процедура СформироватьБланкЗаказа()
	Рез = ПолучитьДанныеБланкЗаказа();

	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Бланк");

	ОблШапка               = Макет.ПолучитьОбласть("Шапка");
	ОблТипПродукции        = Макет.ПолучитьОбласть("ТипПродукции");
	ОблНазначениеПродукции = Макет.ПолучитьОбласть("НазначениеПродукции");
	ОблТоварныйЗнак        = Макет.ПолучитьОбласть("ТоварныйЗнак");
	ОблСтрока              = Макет.ПолучитьОбласть("Товар");
	ОблСтрока1              = Макет.ПолучитьОбласть("Товар1");

	ТабДокБланк.Очистить();

	ТабДокБланк.НачатьАвтогруппировкуСтрок();

	//@skip-check bsl-legacy-check-string-literal
	ИмяПокупателя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Партнер, "НаименованиеПолное");
	ОблШапка.Параметры.Покупатель    = "Покупатель: " + ИмяПокупателя;
	ОблШапка.Параметры.АдресДоставки = "Адрес доставки: " + АдресДоставки;

	ТабДокБланк.Вывести(ОблШапка);

	Выб1 = Рез.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выб1.Следующий() Цикл
		ОблТипПродукции.Параметры.Заполнить(Выб1);
		ТабДокБланк.Вывести(ОблТипПродукции, 1, "ТипПродукции", Истина);

		Выб2 = Выб1.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока Выб2.Следующий() Цикл
			ОблНазначениеПродукции.Параметры.Заполнить(Выб2);
			ТабДокБланк.Вывести(ОблНазначениеПродукции, 2, "НазначениеПродукции", Истина);

			Выб3 = Выб2.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока Выб3.Следующий() Цикл
				ОблТоварныйЗнак.Параметры.Заполнить(Выб3);
				ТабДокБланк.Вывести(ОблТоварныйЗнак, 3, "ТоварныйЗнак", Истина);

				Выб4 = Выб3.Выбрать();
				Пока Выб4.Следующий() Цикл
					Если Выб4.Маркер = "NEW" Или Выб4.Маркер = "Спец/предл" Тогда
						ОблСтрока1.Параметры.Заполнить(Выб4);
						ТабДокБланк.Вывести(ОблСтрока1);
					Иначе	
						ОблСтрока.Параметры.Заполнить(Выб4);
						ТабДокБланк.Вывести(ОблСтрока);
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

	ТабДокБланк.ЗакончитьАвтогруппировкуСтрок();

	ТабДокБланк.ФиксацияСверху = 5;
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеБланкЗаказа()
	МВТ = Новый МенеджерВременныхТаблиц;

	ПараметрыМВТ = Новый Структура;
	ПараметрыМВТ.Вставить("ДатаЦены", ДатаЦены);
	ПараметрыМВТ.Вставить("БазоваяЦена", Справочники.ВидыЦен.НайтиПоНаименованию("Базовая", Истина));
	ПараметрыМВТ.Вставить("МЕГА", Справочники.ЦеновыеГруппы.НайтиПоНаименованию("МЕГА", Истина));
	ПараметрыМВТ.Вставить("СкидкаБХ", 0);
	ПараметрыМВТ.Вставить("СкидкаМЕГА", 0);
	ПараметрыМВТ.Вставить("Соглашение", Соглашение);
	//@skip-check bsl-legacy-check-string-literal
	ПараметрыМВТ.Вставить("ВидЦены", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Соглашение, "ВидЦен"));
	ПараметрыМВТ.Вставить("Партнер", Партнер);
	ПараметрыМВТ.Вставить("ПравилоПродажи", ПравилоПродажи);

	AMS_ВызовСервера.ПолучитьПродукцию(МВТ, ПараметрыМВТ);

	Запрос = Новый Запрос;

	Запрос.МенеджерВременныхТаблиц = МВТ;

	ЗапросТекст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Товары.ТипПродукции КАК ТипПродукции,
	|	Товары.ТипПродукцииНаименование КАК ТипПродукцииНаименование,
	|	Товары.НазначениеПродукции КАК НазначениеПродукции,
	|	Товары.НазначениеПродукцииНаименование КАК НазначениеПродукцииНаименование,
	|	Товары.ТоварныйЗнак КАК ТоварныйЗнак,
	|	Товары.ТоварныйЗнакПорядок КАК ТоварныйЗнакПорядок,
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	Товары.НаименованиеПолное КАК НаименованиеПолное,
	|	Товары.Код КАК Код,
	|	Товары.Артикул КАК Артикул,
	|	Товары.Маркер КАК Маркер,
	|	Товары.АртикулКлиента КАК АртикулКлиента,
	|	Товары.ШтрихкодЕд КАК ШтрихкодЕд,
	|	Товары.ШтрихкодУпак КАК ШтрихкодУпак,
	|	Товары.КодТНВЭД КАК КодТНВЭД,
	|	Товары.КоличествоУпаковка КАК КоличествоУпаковка,
	|	Товары.КоличествоПалета КАК КоличествоПалета,
	|	Товары.ВесУпаковка КАК Вес,
	|	Товары.ОбъемУпаковка КАК Объем,
	|	Товары.Заказ КАК Заказ,
	|	Товары.ВнеПрайса КАК ВнеПрайса,
	|	Товары.ЦенаСоглашение КАК Цена,
	|	Товары.ЦенаСоглашение * 1.22 КАК ЦенаСНДС
	|ИЗ
	|	Товары КАК Товары
	|ГДЕ
	|	ВЫБОР
	|			КОГДА Товары.Заказ
	|					ИЛИ НЕ Товары.Заказ
	|						И Товары.ВнеПрайса
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТипПродукцииНаименование,
	|	НазначениеПродукцииНаименование,
	|	ТоварныйЗнакПорядок,
	|	НомерСтроки
	|ИТОГИ ПО
	|	ТипПродукции,
	|	НазначениеПродукции,
	|	ТоварныйЗнак";

	Запрос.Текст = ЗапросТекст;

	Возврат Запрос.Выполнить();
КонецФункции

&НаКлиенте
Процедура ОтредактироватьФайлЗаказаEXCEL(ИмяФайла)
	XlLastCell = 11;

	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.Visible       = Ложь;
		Excel.DisplayAlerts = Ложь;
		Книга = Excel.WorkBooks.Open(ИмяФайла);
	Исключение
		ОбщегоНазначенияКлиент.СообщитьПользователю("Проблемы с подключением к Excel. " + ОписаниеОшибки());
		Возврат;
	КонецПопытки;

	ExcelЛист = Книга.WorkSheets(1);

	ActiveCell = Excel.ActiveCell.SpecialCells(XlLastCell);

	RowCount      = ActiveCell.Row; // Количество строк
	Колонка_Место = 15;
	Строка_Итого  = 6;

	ExcelОкно = Книга.Windows(1);
	ExcelОкно.SplitRow    = Строка_Итого;
	ExcelОкно.FreezePanes = True;

	ExcelЛист.Cells(Строка_Итого, Колонка_Место).FormulaR1C1Local     = "=СУММ(R[1]C:R[500]C)";  //Количество единиц
	ExcelЛист.Cells(Строка_Итого, Колонка_Место + 1).FormulaR1C1Local = "=СУММ(R[1]C:R[500]C)";  //Количество мест
	ExcelЛист.Cells(Строка_Итого, Колонка_Место + 2).FormulaR1C1Local = "=СУММ(R[1]C:R[500]C)";  //Количество палет
	ExcelЛист.Cells(Строка_Итого, Колонка_Место + 3).FormulaR1C1Local = "=ЦЕЛОЕ(RC[-1])*0,02 + СУММ(R[1]C:R[500]C)";  //Вес
	ExcelЛист.Cells(Строка_Итого, Колонка_Место + 4).FormulaR1C1Local = "=СУММ(R[1]C:R[500]C)";  //Объём
	ExcelЛист.Cells(Строка_Итого, Колонка_Место + 5).FormulaR1C1Local = "=СУММ(R[1]C:R[500]C)";  //Сумма
	ExcelЛист.Cells(Строка_Итого, Колонка_Место + 6).FormulaR1C1Local = "=СУММ(R[1]C:R[500]C)";  //Сумма с НДС

	Для Сч = 8 По RowCount Цикл
		КодНоменклатуры = ExcelЛист.Cells(Сч, 3).value;
		Если КодНоменклатуры = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		ExcelЛист.Cells(Сч, Колонка_Место).FormulaR1C1Local = "=RC[-6]*RC[1]";                  //Количество единиц

		ExcelЛист.Cells(Сч, Колонка_Место + 1).Locked = 0;
		ExcelЛист.Cells(Сч, Колонка_Место + 6).Locked = 0;

		КолМестНаПалете = ExcelЛист.Cells(Сч, 10).value;

		Если КолМестНаПалете = Неопределено Тогда
			ExcelЛист.Cells(Сч, Колонка_Место + 2).FormulaR1C1Local = "=0";
		Иначе
			ExcelЛист.Cells(Сч, Колонка_Место + 2).FormulaR1C1Local = "=ОКРУГЛ(RC[-1]/RC[-7];2)";   //Количество палет
		КонецЕсли;

		ExcelЛист.Cells(Сч, Колонка_Место + 3).FormulaR1C1Local = "=ОКРУГЛ(RC[-7]*RC[-2]/1000;3)";  //Вес
		ExcelЛист.Cells(Сч, Колонка_Место + 4).FormulaR1C1Local = "=ОКРУГЛ(RC[-7]*RC[-3]/1000;3)";  //Объём
		ExcelЛист.Cells(Сч, Колонка_Место + 5).FormulaR1C1Local = "=ОКРУГЛ(RC[-7]*RC[-5];2)";       //Сумма
		
		Если ОбщегоНазначенияКлиент.ДатаСеанса() < Дата(2026,1,1) Тогда
			ExcelЛист.Cells(Сч, Колонка_Место + 6).FormulaR1C1Local = "=ОКРУГЛ(RC[-8]*RC[-6]*1,2;2)";   //Сумма с НДС
		Иначе
			ExcelЛист.Cells(Сч, Колонка_Место + 6).FormulaR1C1Local = "=ОКРУГЛ(RC[-8]*RC[-6]*1,22;2)";   //Сумма с НДС
		КонецЕсли;

		ExcelЛист.Cells(Сч, Колонка_Место + 2).NumberFormat = "0,00";   //Количество палет
		ExcelЛист.Cells(Сч, Колонка_Место + 3).NumberFormat = "0,000";  //Вес
		ExcelЛист.Cells(Сч, Колонка_Место + 4).NumberFormat = "0,000";  //Объём
		ExcelЛист.Cells(Сч, Колонка_Место + 5).NumberFormat = "0,00";   //Сумма
		ExcelЛист.Cells(Сч, Колонка_Место + 6).NumberFormat = "0,00";   //Сумма с НДС
	КонецЦикла;

	ExcelЛист.Columns(2).ColumnWidth = 0;

	ДанныеПартнера     = ОбщегоНазначенияУТВызовСервера.ЗначенияРеквизитовОбъекта(Партнер,
		"_АртикулКлиента, _АртикулКлиентаПлюс");
	ЕстьАртикулКлиента = ДанныеПартнера._АртикулКлиента Или ДанныеПартнера._АртикулКлиентаПлюс;

	Если Не ЕстьАртикулКлиента Тогда
		ExcelЛист.Columns(5).ColumnWidth = 0;
	КонецЕсли;
	
	ExcelЛист.Protect();

	Попытка
		ExcelЛист.SaveAs(ИмяФайла);
	Исключение
		ОбщегоНазначенияКлиент.СообщитьПользователю("Файл не сохранён! " + ОписаниеОшибки());
	КонецПопытки;

	Книга.Close();
	Excel.Quit();
КонецПроцедуры

#КонецОбласти

#Область ПрайсЛисты

&НаКлиенте
Процедура СформироватьПрайсЛист()
	ТекущаяСтраница = Элементы.СтраницыПрайсов.ТекущаяСтраница;
	
	Если ТекущаяСтраница = Элементы.СтраницаПрайс Тогда
		СформироватьПрайсЛистКлиента();

	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаПрайсОпт Тогда
		СформироватьПрайс("ПрайсОпт");

	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаПрайсОптСНГ Тогда
		СформироватьПрайс("ПрайсОптСНГ");

	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаПрайсСети Тогда
		СформироватьПрайс("ПрайсСети");

	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаПрайсМЕГА Тогда
		СформироватьПрайс("ПрайсМЕГА");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьДатыПрайса()
	ТекущаяСтраница = Элементы.СтраницыПрайсов.ТекущаяСтраница;
	
	ЭтоПрайсБХ = (ТекущаяСтраница = Элементы.СтраницаПрайс 
			Или ТекущаяСтраница = Элементы.СтраницаПрайсОпт 
			Или ТекущаяСтраница = Элементы.СтраницаПрайсОптСНГ 
			Или ТекущаяСтраница = Элементы.СтраницаПрайсСети);
	
	ДатаПрайсаБХ = Константы._ДатаПрайса.Получить(); 
	ДатаПрайсаМЕГА = Константы._ДатаПрайсаМЕГА.Получить(); 

	Если ДатаПрайсаПроизвольная = Дата(1,1,1) Тогда
		Если ЭтоПрайсБХ Тогда
			ДатаПрайса = ДатаПрайсаБХ; 
		Иначе
			ДатаПрайса = ДатаПрайсаМЕГА; 
		КонецЕсли;
	Иначе		
		ДатаПрайса = ДатаПрайсаПроизвольная; 
	КонецЕсли;
	
	Если ДатаЦеныПроизвольная = Дата(1,1,1) Тогда
		ДатаЦены = ТекущаяДатаСеанса();
	Иначе		
		ДатаЦены = ДатаЦеныПроизвольная;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьЗначениеКонстанты(Константа,Значение)
	Константы[Константа].Установить(Значение);
КонецПроцедуры

&НаСервере
Процедура СформироватьПрайсЛистКлиента()
	НомерСтроки = 0;

	Рез = ПолучитьДанныеПрайсаКлиента();

	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("ПрайсКлиента");

	ОблЛоготип             = Макет.ПолучитьОбласть("Логотип");
	ОблТипПродукции        = Макет.ПолучитьОбласть("ТипПродукции");
	ОблНазначениеПродукции = Макет.ПолучитьОбласть("НазначениеПродукции");
	ОблТоварныйЗнак        = Макет.ПолучитьОбласть("ТоварныйЗнак");
	ОблПодвал              = Макет.ПолучитьОбласть("Подвал");
	ОблШапка               = Макет.ПолучитьОбласть("Шапка");
	ОблТовар               = Макет.ПолучитьОбласть("Товар");

	ТабДокПрайс.Очистить();

	ТабДокПрайс.НачатьАвтогруппировкуСтрок();

	ОблЛоготип.Параметры.Срок = "Действителен с " + Формат(ДатаПрайса, "ДЛФ=ДД");
	ТабДокПрайс.Вывести(ОблЛоготип);

	ТабДокПрайс.Вывести(ОблШапка);

	Выб1 = Рез.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выб1.Следующий() Цикл
		ОблТипПродукции.Параметры.Заполнить(Выб1);
		ТабДокПрайс.Вывести(ОблТипПродукции, 1, "Тип", Истина);

		Выб2 = Выб1.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока Выб2.Следующий() Цикл
			ОблНазначениеПродукции.Параметры.Заполнить(Выб2);
			ТабДокПрайс.Вывести(ОблНазначениеПродукции, 2, "Назанчение", Истина);

			Выб3 = Выб2.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока Выб3.Следующий() Цикл
				ОблТоварныйЗнак.Параметры.Заполнить(Выб3);
				ТабДокПрайс.Вывести(ОблТоварныйЗнак, 3, "Знак", Истина);

				Выб4 = Выб3.Выбрать();
				Пока Выб4.Следующий() Цикл
					НомерСтроки = НомерСтроки + 1;

					ОблТовар.Параметры.Заполнить(Выб4);

					ОблТовар.Параметры.НомерСтроки = НомерСтроки;

					ТабДокПрайс.Вывести(ОблТовар, 4, "Строка", Истина);
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

	ТабДокПрайс.ЗакончитьАвтогруппировкуСтрок();

	ТабДокПрайс.ФиксацияСверху = 12;

	ТабДокПрайс.Вывести(ОблПодвал); 
	
	ОтформатироватьТабДок(ТабДокПрайс, 9);
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеПрайсаКлиента()
	ЦеноваяГруппаБХ  = Справочники.ЦеновыеГруппы.НайтиПоНаименованию("Бытовая химия");
	ЦеноваяГруппаМЕГА = Справочники.ЦеновыеГруппы.НайтиПоНаименованию("МЕГА");
	
	//@skip-check bsl-legacy-check-string-literal
	ВидЦен1 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Соглашение, "ВидЦен");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Соглашение", Соглашение);
	Запрос.УстановитьПараметр("ЦеноваяГруппа", ЦеноваяГруппаМЕГА);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.ВидЦен КАК ВидЦен
	|ИЗ
	|	Справочник.СоглашенияСКлиентами.ЦеновыеГруппы КАК т
	|ГДЕ
	|	т.Ссылка = &Соглашение
	|	И т.ЦеноваяГруппа = &ЦеноваяГруппа";
	
	Рез = Запрос.Выполнить();
	
	Если Рез.Пустой() Тогда
		ВидЦен2 = Справочники.ВидыЦен.ПустаяСсылка();
	Иначе
		Выб = Рез.Выбрать();
		Выб.Следующий();
		ВидЦен2 = Выб.ВидЦен;
	КонецЕсли;

	ВидЦенРРЦ = Новый Массив;
	ВидЦенРРЦ.Добавить(Справочники.ВидыЦен.НайтиПоРеквизиту("Идентификатор", "Более1Млн"));          // Более 1 млн.
	ВидЦенРРЦ.Добавить(Справочники.ВидыЦен.НайтиПоРеквизиту("Идентификатор", "МЕГАОт500000БезНДС")); // МЕГА Более 1 млн.

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаЦены", ДатаЦены);
	Запрос.УстановитьПараметр("ЦеноваяГруппаБХ", ЦеноваяГруппаБХ);
	Запрос.УстановитьПараметр("ЦеноваяГруппаМЕГА", ЦеноваяГруппаМЕГА);
	Запрос.УстановитьПараметр("Соглашение", Соглашение);
	Запрос.УстановитьПараметр("ВидЦен1", ВидЦен1);
	Запрос.УстановитьПараметр("ВидЦен2", ВидЦен2);
	Запрос.УстановитьПараметр("ВидЦенРРЦ", ВидЦенРРЦ);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	AMS_Продукция.Родитель.Наименование КАК ТипПродукции,
	|	AMS_Продукция.Наименование КАК НазначениеПродукции,
	|	AMS_ПродукцияТовары.ТоварныйЗнак КАК ТоварныйЗнак,
	|	AMS_ПродукцияТовары.ТоварныйЗнак.Порядок КАК ТоварныйЗнакПорядок,
	|	AMS_ПродукцияТовары.НомерСтроки КАК НомерСтроки,
	|	AMS_ПродукцияТовары.Номенклатура КАК Номенклатура,
	|	AMS_ПродукцияТовары.КфцРРЦ КАК КфцРРЦ,
	|	Ном.НаименованиеПолное КАК НаименованиеПолное,
	|	AMS_ПродукцияТовары.Маркер КАК Маркер,
	|	Ном.Артикул КАК Артикул,
	|	AMS_ПродукцияТовары.Объем КАК Объем,
	|	Ном.КоэффициентЕдиницыДляОтчетов КАК КолНаМесто,
	|	Ном.ЦеноваяГруппа КАК ЦеноваяГруппа
	|ПОМЕСТИТЬ Ном
	|ИЗ
	|	Справочник.AMS_Продукция КАК AMS_Продукция
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.AMS_Продукция.Товары КАК AMS_ПродукцияТовары
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|			ПО AMS_ПродукцияТовары.Номенклатура = Ном.Ссылка
	|		ПО AMS_Продукция.Ссылка = AMS_ПродукцияТовары.Ссылка
	|ГДЕ
	|	НЕ AMS_Продукция.ЭтоГруппа
	|	И AMS_ПродукцияТовары.Прайс
	|	И (Ном.ЦеноваяГруппа = &ЦеноваяГруппаБХ
	|			ИЛИ Ном.ЦеноваяГруппа = &ЦеноваяГруппаМЕГА)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	(100 + д.Ставка) / 100 КАК Ставка
	|ПОМЕСТИТЬ Ндс
	|ИЗ
	|	Справочник.СтавкиНДС КАК д
	|ГДЕ
	|	д.Основная
	|	И ВЫБОР
	|			КОГДА д.КонецПериода = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА &ДатаЦены >= д.НачалоПериода
	|			ИНАЧЕ &ДатаЦены МЕЖДУ д.НачалоПериода И д.КонецПериода
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегЦены.Номенклатура КАК Номенклатура,
	|	РегЦены.Цена КАК ЦенаРРЦ
	|ПОМЕСТИТЬ ЦеныРРЦ
	|ИЗ
	|	Ном КАК Ном
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаЦены, ВидЦены В (&ВидЦенРРЦ)) КАК РегЦены
	|		ПО Ном.Номенклатура = РегЦены.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегЦены.Номенклатура КАК Номенклатура,
	|	РегЦены.Цена КАК Цена1
	|ПОМЕСТИТЬ Цены1
	|ИЗ
	|	Ном КАК Ном
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаЦены, ВидЦены = &ВидЦен1) КАК РегЦены
	|		ПО Ном.Номенклатура = РегЦены.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегЦены.Номенклатура КАК Номенклатура,
	|	РегЦены.Цена КАК Цена2
	|ПОМЕСТИТЬ Цены2
	|ИЗ
	|	Ном КАК Ном
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаЦены, ВидЦены = &ВидЦен2) КАК РегЦены
	|		ПО Ном.Номенклатура = РегЦены.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА т.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА т.Цена
	|		ИНАЧЕ т.Цена / т.Упаковка.Числитель
	|	КОНЕЦ КАК Цена3
	|ПОМЕСТИТЬ Цены3
	|ИЗ
	|	Справочник.СоглашенияСКлиентами.Товары КАК т
	|ГДЕ
	|	т.Ссылка = &Соглашение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ном.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(Цены3.Цена3, ЕСТЬNULL(Цены2.Цена2, Цены1.Цена1)) КАК Цена
	|ПОМЕСТИТЬ Цены
	|ИЗ
	|	Ном КАК Ном
	|		ЛЕВОЕ СОЕДИНЕНИЕ Цены1 КАК Цены1
	|		ПО Ном.Номенклатура = Цены1.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Цены2 КАК Цены2
	|		ПО Ном.Номенклатура = Цены2.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Цены3 КАК Цены3
	|		ПО Ном.Номенклатура = Цены3.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Ном.ТипПродукции КАК ТипПродукции,
	|	Ном.НазначениеПродукции КАК НазначениеПродукции,
	|	Ном.ТоварныйЗнак КАК ТоварныйЗнак,
	|	Ном.ТоварныйЗнакПорядок КАК ТоварныйЗнакПорядок,
	|	Ном.НомерСтроки КАК НомерСтроки,
	|	Ном.Номенклатура КАК Номенклатура,
	|	Ном.НаименованиеПолное КАК НаименованиеПолное,
	|	Ном.Маркер КАК Маркер,
	|	Ном.Артикул КАК Артикул,
	|	Ном.Объем КАК Объем,
	|	Ном.КолНаМесто КАК КолНаМесто,
	|	ЦеныРРЦ.ЦенаРРЦ КАК ЦенаРРЦ,
	|	ЦеныРРЦ.ЦенаРРЦ * Ндс.Ставка * Ном.КфцРРЦ КАК ЦенаРРЦСНДС,
	|	Цены.Цена КАК Цена,
	|	Цены.Цена * Ндс.Ставка КАК ЦенаСНДС
	|ИЗ
	|	Ном КАК Ном
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЦеныРРЦ КАК ЦеныРРЦ
	|		ПО Ном.Номенклатура = ЦеныРРЦ.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Цены КАК Цены
	|		ПО Ном.Номенклатура = Цены.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Ндс КАК Ндс
	|		ПО (ИСТИНА)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТипПродукции,
	|	НазначениеПродукции,
	|	ТоварныйЗнакПорядок,
	|	НомерСтроки
	|ИТОГИ ПО
	|	ТипПродукции,
	|	НазначениеПродукции,
	|	ТоварныйЗнак";

	Возврат Запрос.Выполнить();
КонецФункции

&НаСервере
Процедура СформироватьПрайс(Прайс)
	ПараметрыПрайса = ПолучитьПараметрыПрайса(Прайс);
	
	Если Прайс = "ПрайсОпт" Тогда
		ИмяМакета = "ПрайсОпт";
		ТабДок = ТабДокПрайсОпт;

	ИначеЕсли Прайс = "ПрайсОптСНГ" Тогда
		ИмяМакета = "ПрайсОптСНГ";
		ТабДок = ТабДокПрайсОптСНГ;

	ИначеЕсли Прайс = "ПрайсСети" Тогда
		ИмяМакета = "ПрайсСети";
		ТабДок = ТабДокПрайсСети;

	ИначеЕсли Прайс = "ПрайсМЕГА" Тогда
		ИмяМакета = "ПрайсМЕГА";
		ТабДок = ТабДокПрайсМЕГА;
	КонецЕсли;	

	Рез = ПолучитьДанныеПрайса(ПараметрыПрайса);

	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет(ИмяМакета);

	ОблЛоготип             = Макет.ПолучитьОбласть("Логотип");
	ОблТипПродукции        = Макет.ПолучитьОбласть("ТипПродукции");
	ОблНазначениеПродукции = Макет.ПолучитьОбласть("НазначениеПродукции");
	ОблТоварныйЗнак        = Макет.ПолучитьОбласть("ТоварныйЗнак");
	ОблПодвал              = Макет.ПолучитьОбласть("Подвал");
	ОблШапка               = Макет.ПолучитьОбласть("Шапка");
	ОблТовар               = Макет.ПолучитьОбласть("Товар");

	ТабДок.ПолеСлева               = 5;
	ТабДок.ПолеСправа              = 5;
	ТабДок.РазмерКолонтитулаСверху = 0;
	ТабДок.РазмерКолонтитулаСнизу  = 0;
	ТабДок.АвтоМасштаб             = Истина;
	ТабДок.ОриентацияСтраницы      = ОриентацияСтраницы.Портрет;
	ТабДок.ИмяПараметровПечати     = "ПАРАМЕТРЫ_ПЕЧАТИ_МойПрайс";
	ТабДок.ФиксацияСверху          = 13; 
	
	ТабДок.Очистить();

	ТабДок.НачатьАвтогруппировкуСтрок();

	ОблЛоготип.Параметры.Срок = "Действителен с " + Формат(ДатаПрайса, "ДЛФ=ДД");
	ТабДок.Вывести(ОблЛоготип);

	ОблШапка.Параметры.Заполнить(ПараметрыПрайса);
	ТабДок.Вывести(ОблШапка);

	НомерСтроки = 0;

	Выб1 = Рез.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выб1.Следующий() Цикл
		ОблТипПродукции.Параметры.Заполнить(Выб1);
		ТабДок.Вывести(ОблТипПродукции, 1, "Тип", Истина);

		Выб2 = Выб1.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока Выб2.Следующий() Цикл
			ОблНазначениеПродукции.Параметры.Заполнить(Выб2);
			ТабДок.Вывести(ОблНазначениеПродукции, 2, "Назначение", Истина);

			Выб3 = Выб2.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока Выб3.Следующий() Цикл
				ОблТоварныйЗнак.Параметры.Заполнить(Выб3);
				ТабДок.Вывести(ОблТоварныйЗнак, 3, "Знак", Истина);

				Выб4 = Выб3.Выбрать();
				Пока Выб4.Следующий() Цикл
					НомерСтроки = НомерСтроки + 1;

					ОблТовар.Параметры.Заполнить(Выб4);

					ОблТовар.Параметры.НомерСтроки = НомерСтроки;

					ТабДок.Вывести(ОблТовар, 4, "Строка", Истина);
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

	ТабДок.ЗакончитьАвтогруппировкуСтрок();

	ТабДок.Вывести(ОблПодвал);
	
	Если Не ПрайсТехнический Тогда
		ОтформатироватьТабДок(ТабДок);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыПрайса(Прайс)
	Если Прайс = "ПрайсОпт" Тогда
		ЦеноваяГруппа = AMS_ВызовСервера.ЦеноваяГруппаБытоваяХимия();
		
		ВидЦен1 = Справочники.ВидыЦен.НайтиПоНаименованию("До 100 000", Истина);
		ВидЦен2 = Справочники.ВидыЦен.НайтиПоНаименованию("От 100 000 до 349 999", Истина);
		ВидЦен3 = Справочники.ВидыЦен.НайтиПоНаименованию("От 350 000 до 699 999", Истина);
		ВидЦен4 = Справочники.ВидыЦен.НайтиПоНаименованию("От 700 000 до 999 999", Истина);
		ВидЦен5 = Справочники.ВидыЦен.НайтиПоНаименованию("Более 1 млн.", Истина);
		ВидЦен6 = Справочники.ВидыЦен.НайтиПоНаименованию("Более 1 млн.", Истина);

	ИначеЕсли Прайс = "ПрайсОптСНГ" Тогда
		ЦеноваяГруппа = AMS_ВызовСервера.ЦеноваяГруппаБытоваяХимия();

		ВидЦен1 = Справочники.ВидыЦен.НайтиПоНаименованию("СНГ До 100 000", Истина);
		ВидЦен2 = Справочники.ВидыЦен.НайтиПоНаименованию("СНГ От 100 000 до 349 999", Истина);
		ВидЦен3 = Справочники.ВидыЦен.НайтиПоНаименованию("СНГ От 350 000 до 699 999", Истина);
		ВидЦен4 = Справочники.ВидыЦен.НайтиПоНаименованию("СНГ От 700 000 до 999 999", Истина);
		ВидЦен5 = Справочники.ВидыЦен.НайтиПоНаименованию("СНГ Более 1 млн.", Истина);
		ВидЦен6 = Справочники.ВидыЦен.НайтиПоНаименованию("Более 1 млн.", Истина);

	ИначеЕсли Прайс = "ПрайсСети" Тогда
		ЦеноваяГруппа = AMS_ВызовСервера.ЦеноваяГруппаБытоваяХимия();

		ВидЦен1 = Справочники.ВидыЦен.НайтиПоНаименованию("Food", Истина);
		ВидЦен2 = Справочники.ВидыЦен.НайтиПоНаименованию("Non food", Истина);
		ВидЦен3 = Справочники.ВидыЦен.НайтиПоНаименованию("Food/Non food", Истина);
		ВидЦен4 = Справочники.ВидыЦен.НайтиПоНаименованию("Food/Non food", Истина);
		ВидЦен5 = Справочники.ВидыЦен.НайтиПоНаименованию("Food/Non food", Истина);
		ВидЦен6 = Справочники.ВидыЦен.НайтиПоНаименованию("Более 1 млн.", Истина);

	ИначеЕсли Прайс = "ПрайсМЕГА" Тогда
		ЦеноваяГруппа = AMS_ВызовСервера.ЦеноваяГруппаМЕГА();

		ВидЦен1 = Справочники.ВидыЦен.НайтиПоНаименованию("МЕГА До 100 000", Истина);
		ВидЦен2 = Справочники.ВидыЦен.НайтиПоНаименованию("МЕГА От 100 000 до 349 999", Истина);
		ВидЦен3 = Справочники.ВидыЦен.НайтиПоНаименованию("МЕГА От 350 000 до 699 999", Истина);
		ВидЦен4 = Справочники.ВидыЦен.НайтиПоНаименованию("МЕГА От 700 000 до 999 999", Истина);
		ВидЦен5 = Справочники.ВидыЦен.НайтиПоНаименованию("МЕГА Более 1 млн.", Истина);
		ВидЦен6 = Справочники.ВидыЦен.НайтиПоНаименованию("МЕГА Более 1 млн.", Истина);
	КонецЕсли;	

	Парам = Новый Структура;
	Парам.Вставить("ЦеноваяГруппа", ЦеноваяГруппа);
	Парам.Вставить("ВидЦен1", ВидЦен1);
	Парам.Вставить("ВидЦен2", ВидЦен2);
	Парам.Вставить("ВидЦен3", ВидЦен3);
	Парам.Вставить("ВидЦен4", ВидЦен4);
	Парам.Вставить("ВидЦен5", ВидЦен5);
	Парам.Вставить("ВидЦен6", ВидЦен6);

	Возврат Парам;
КонецФункции

&НаСервере
Функция ПолучитьДанныеПрайса(ПараметрыПрайса)
	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("ДатаЦены", ДатаЦены);
	Запрос.УстановитьПараметр("ЦеноваяГруппа", ПараметрыПрайса.ЦеноваяГруппа);
	Запрос.УстановитьПараметр("ВидЦен1", ПараметрыПрайса.ВидЦен1);
	Запрос.УстановитьПараметр("ВидЦен2", ПараметрыПрайса.ВидЦен2);
	Запрос.УстановитьПараметр("ВидЦен3", ПараметрыПрайса.ВидЦен3);
	Запрос.УстановитьПараметр("ВидЦен4", ПараметрыПрайса.ВидЦен4);
	Запрос.УстановитьПараметр("ВидЦен5", ПараметрыПрайса.ВидЦен5);
	Запрос.УстановитьПараметр("ВидЦен6", ПараметрыПрайса.ВидЦен6);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	AMS_Продукция.Родитель.Наименование КАК ТипПродукции,
	|	AMS_Продукция.Наименование КАК НазначениеПродукции,
	|	AMS_ПродукцияТовары.ТоварныйЗнак КАК ТоварныйЗнак,
	|	AMS_ПродукцияТовары.ТоварныйЗнак.Порядок КАК ТоварныйЗнакПорядок,
	|	AMS_ПродукцияТовары.НомерСтроки КАК НомерСтроки,
	|	AMS_ПродукцияТовары.Номенклатура КАК Номенклатура,
	|	AMS_ПродукцияТовары.КфцРРЦ КАК КфцРРЦ,
	|	Ном.НаименованиеПолное КАК НаименованиеПолное,
	|	AMS_ПродукцияТовары.Маркер КАК Маркер,
	|	Ном.Артикул КАК Артикул,
	|	AMS_ПродукцияТовары.Объем КАК Объем,
	|	Ном.КоэффициентЕдиницыДляОтчетов КАК КолНаМесто
	|ПОМЕСТИТЬ Ном
	|ИЗ
	|	Справочник.AMS_Продукция КАК AMS_Продукция
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.AMS_Продукция.Товары КАК AMS_ПродукцияТовары
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|			ПО AMS_ПродукцияТовары.Номенклатура = Ном.Ссылка
	|		ПО AMS_Продукция.Ссылка = AMS_ПродукцияТовары.Ссылка
	|ГДЕ
	|	НЕ AMS_Продукция.ЭтоГруппа
	|	И AMS_ПродукцияТовары.Прайс
	|	И Ном.ЦеноваяГруппа = &ЦеноваяГруппа
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	(100 + д.Ставка) / 100 КАК Ставка
	|ПОМЕСТИТЬ Ндс
	|ИЗ
	|	Справочник.СтавкиНДС КАК д
	|ГДЕ
	|	д.Основная
	|	И ВЫБОР
	|		КОГДА д.КонецПериода = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА &ДатаЦены >= д.НачалоПериода
	|		ИНАЧЕ &ДатаЦены МЕЖДУ д.НачалоПериода И д.КонецПериода
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегЦены.Номенклатура КАК Номенклатура,
	|	РегЦены.Цена КАК Цена
	|ПОМЕСТИТЬ Цены1
	|ИЗ
	|	Ном КАК Ном
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаЦены, ВидЦены = &ВидЦен1) КАК РегЦены
	|		ПО Ном.Номенклатура = РегЦены.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегЦены.Номенклатура КАК Номенклатура,
	|	РегЦены.Цена КАК Цена
	|ПОМЕСТИТЬ Цены2
	|ИЗ
	|	Ном КАК Ном
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаЦены, ВидЦены = &ВидЦен2) КАК РегЦены
	|		ПО Ном.Номенклатура = РегЦены.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегЦены.Номенклатура КАК Номенклатура,
	|	РегЦены.Цена КАК Цена
	|ПОМЕСТИТЬ Цены3
	|ИЗ
	|	Ном КАК Ном
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаЦены, ВидЦены = &ВидЦен3) КАК РегЦены
	|		ПО Ном.Номенклатура = РегЦены.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегЦены.Номенклатура КАК Номенклатура,
	|	РегЦены.Цена КАК Цена
	|ПОМЕСТИТЬ Цены4
	|ИЗ
	|	Ном КАК Ном
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаЦены, ВидЦены = &ВидЦен4) КАК РегЦены
	|		ПО Ном.Номенклатура = РегЦены.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегЦены.Номенклатура КАК Номенклатура,
	|	РегЦены.Цена КАК Цена
	|ПОМЕСТИТЬ Цены5
	|ИЗ
	|	Ном КАК Ном
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаЦены, ВидЦены = &ВидЦен5) КАК РегЦены
	|		ПО Ном.Номенклатура = РегЦены.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегЦены.Номенклатура КАК Номенклатура,
	|	РегЦены.Цена КАК Цена
	|ПОМЕСТИТЬ Цены6
	|ИЗ
	|	Ном КАК Ном
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаЦены, ВидЦены = &ВидЦен6) КАК РегЦены
	|		ПО Ном.Номенклатура = РегЦены.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Ном.ТипПродукции КАК ТипПродукции,
	|	Ном.НазначениеПродукции КАК НазначениеПродукции,
	|	Ном.ТоварныйЗнак КАК ТоварныйЗнак,
	|	Ном.ТоварныйЗнакПорядок КАК ТоварныйЗнакПорядок,
	|	Ном.НомерСтроки КАК НомерСтроки,
	|	Ном.Номенклатура КАК Номенклатура,
	|	Ном.НаименованиеПолное КАК НаименованиеПолное,
	|	Ном.Маркер КАК Маркер,
	|	Ном.Артикул КАК Артикул,
	|	Ном.Объем КАК Объем,
	|	Ном.КолНаМесто КАК КолНаМесто,
	|	Цены1.Цена КАК Цена1,
	|	Цены2.Цена КАК Цена2,
	|	Цены3.Цена КАК Цена3,
	|	Цены4.Цена КАК Цена4,
	|	Цены5.Цена КАК Цена5,
	|	Цены6.Цена * Ном.КфцРРЦ КАК ЦенаРРЦ,
	|	Цены6.Цена * Ндс.Ставка * Ном.КфцРРЦ КАК ЦенаРРЦСНДС,
	|	Цены1.Цена * Ндс.Ставка КАК Цена1сНДС,
	|	Цены2.Цена * Ндс.Ставка КАК Цена2сНДС,
	|	Цены3.Цена * Ндс.Ставка КАК Цена3сНДС,
	|	Цены4.Цена * Ндс.Ставка КАК Цена4сНДС,
	|	Цены5.Цена * Ндс.Ставка КАК Цена5сНДС
	|ИЗ
	|	Ном КАК Ном
	|		ЛЕВОЕ СОЕДИНЕНИЕ Цены1 КАК Цены1
	|		ПО Ном.Номенклатура = Цены1.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Цены2 КАК Цены2
	|		ПО Ном.Номенклатура = Цены2.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Цены3 КАК Цены3
	|		ПО Ном.Номенклатура = Цены3.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Цены4 КАК Цены4
	|		ПО Ном.Номенклатура = Цены4.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Цены5 КАК Цены5
	|		ПО Ном.Номенклатура = Цены5.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Цены6 КАК Цены6
	|		ПО Ном.Номенклатура = Цены6.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Ндс КАК Ндс
	|		ПО ИСТИНА
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТипПродукции,
	|	НазначениеПродукции,
	|	ТоварныйЗнакПорядок,
	|	НомерСтроки
	|ИТОГИ
	|ПО
	|	ТипПродукции,
	|	НазначениеПродукции,
	|	ТоварныйЗнак";

	Возврат Запрос.Выполнить();
КонецФункции

&НаСервере
Процедура ОтформатироватьТабДок(ТабДок, НомерКолонки = Неопределено)
	Если НомерКолонки = Неопределено Тогда
		НомерКолонки = 7;
	КонецЕсли;

	КоличествоСтрок = ТабДок.ВысотаТаблицы;
	
	Цена0    = Неопределено; Цена1   = Неопределено;
	Верх     = 0;            Низ     = 0;
	ВерхЕсть = Ложь;         НизЕсть = Ложь;
	
	Для НомерСтроки = 1 По КоличествоСтрок Цикл
		Ячейка0 = ТабДок.Область(НомерСтроки, НомерКолонки, НомерСтроки, НомерКолонки);
		Ячейка1 = ТабДок.Область(НомерСтроки + 1, НомерКолонки, НомерСтроки + 1, НомерКолонки);
		
		Если Ячейка0.СодержитЗначение Тогда
			Цена0 = Ячейка0.Значение;
		Иначе
			Цена0    = Неопределено;
			ВерхЕсть = Ложь; НизЕсть  = Ложь;
			Продолжить;
		КонецЕсли;
		
		Если Ячейка1.СодержитЗначение Тогда
			Цена1 = Ячейка1.Значение;
		Иначе			
			Цена1    = Неопределено;
		КонецЕсли;

		Если Цена0 = Цена1 Тогда
			Если Не ВерхЕсть Тогда
				ВерхЕсть = Истина;
				Верх     = Ячейка0.Верх;
			КонецЕсли;
		Иначе	
			Если ВерхЕсть Тогда
				НизЕсть  = Истина;
				Низ      = Ячейка0.Низ;
			КонецЕсли;
		КонецЕсли;
			
		Если ВерхЕсть И НизЕсть Тогда
			ВерхЕсть = Ложь;
			НизЕсть  = Ложь;
			
			Область = ТабДок.Область(Верх, 5, Низ, 5);
			Область.Объединить();
			
			Область = ТабДок.Область(Верх, 6, Низ, 6);
			Область.Объединить();
			
			Область = ТабДок.Область(Верх, 7, Низ, 7);
			Область.Объединить();
			
			Область = ТабДок.Область(Верх, 8, Низ, 8);
			Область.Объединить();
			
			Область = ТабДок.Область(Верх, 9, Низ, 9);
			Область.Объединить();
			
			Область = ТабДок.Область(Верх, 10, Низ, 10);
			Область.Объединить();
			
			Область = ТабДок.Область(Верх, 11, Низ, 11);
			Область.Объединить();

			Область = ТабДок.Область(Верх, 12, Низ, 12);
			Область.Объединить();

			Область = ТабДок.Область(Верх, 13, Низ, 13);
			Область.Объединить();

			Область = ТабДок.Область(Верх, 14, Низ, 14);
			Область.Объединить();

			Область = ТабДок.Область(Верх, 15, Низ, 15);
			Область.Объединить();

			Область = ТабДок.Область(Верх, 16, Низ, 16);
			Область.Объединить();

			Область = ТабДок.Область(Верх, 17, Низ, 17);
			Область.Объединить();

			Область = ТабДок.Область(Верх, 18, Низ, 18);
			Область.Объединить();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункцииОбщие

&НаСервере
Процедура ВыполнитьВыгрузкуПродажНаСервере()
	мср.ВыгрузкаПродаж();
КонецПроцедуры

&НаСервере
Процедура НастройкаФормы()
	Khors     = AMS_ВызовСервера.ЭтоKhors();
	БухМен    = Пользователи.РолиДоступны("_ГлавныйБухгалтер, _Бухгалтер, _СтаршийМенеджер, AMS_МенеджерПродаж"); // только Менеждеры
	БухСклада = Пользователи.РолиДоступны("_БухгалтерСклада");
	Склад     = Пользователи.РолиДоступны("_НачальникСклада, _КладовщикСклада");

	ТекСтр       = Элементы.Страницы.ТекущаяСтраница;
	ТекСтрПрайса = Элементы.СтраницыПрайсов.ТекущаяСтраница;
	
	ТекСтрПродажи = ТекСтр = Элементы.СтраницаПродажи;

	Элементы.ФормаВыполнитьВыгрузкуПродаж.Видимость = Khors;

	Элементы.ГруппаШапкаПланПродаж.Видимость  = ТекСтрПродажи;
	Элементы.ГруппаШапкаБланк_Прайс.Видимость = Не ТекСтрПродажи;
	Элементы.ГруппаПечать.Видимость           = Не ТекСтрПродажи;
	
	Элементы.ГруппаВыборКлиентаБланк_Прайс.Видимость  = (ТекСтр = Элементы.СтраницаБланк Или ТекСтрПрайса = Элементы.СтраницаПрайс);
														
	Элементы.ИнфоНовыеКлиенты.Видимость = Не ПустаяСтрока(ИнфоНовыеКлиенты) И Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПродажи;

	Если (БухСклада Или Склад) И Не Khors Тогда
		Элементы.СтраницаБланк.Видимость = Ложь;		
		Элементы.СтраницаПрайсы.Видимость = Ложь;
	КонецЕсли;

	Элементы.Продажи.КонтекстноеМеню.Видимость = БухМен;

	Элементы.ПродажиПечатьКомплектДокумента.Видимость                = БухСклада;
	Элементы.ПродажиПечатьУПД.Видимость                              = БухМен Или БухСклада;
	Элементы.ПродажиПечатьСкладскаяНакладная.Видимость               = БухМен Или БухСклада Или Склад;
	Элементы.ПродажиПечатьСчетНаОплату.Видимость                     = БухМен;
	Элементы.ПродажиПечатьДоверенность.Видимость                     = БухМен Или БухСклада;
	Элементы.ПродажиПечатьТранспортнаяНакладная.Видимость            = БухМен Или БухСклада;
	Элементы.ПродажиПечатьТТН.Видимость                              = БухМен Или БухСклада;
	Элементы.ПродажиПечатьТОРГ_12.Видимость                          = БухМен Или БухСклада;
	Элементы.ПродажиПечатьСчетФактура.Видимость                      = БухМен Или БухСклада;
	Элементы.ПродажиПечатьСпецификации.Видимость                     = БухМен Или БухСклада;
	Элементы.ПродажиПечатьАктаОРасхождениях.Видимость                = БухМен Или БухСклада;
	Элементы.ПродажиПечатьПалетнаяЭтикетка.Видимость                 = БухМен Или БухСклада Или Склад;
	Элементы.ПродажиПечатьЗаявкаПеревозчику.Видимость                = БухМен Или БухСклада;
	Элементы.ПродажиПечатьСертификатыНоменклатурыРеестр.Видимость    = БухМен Или БухСклада;
	Элементы.ПродажиПечатьСертификатыНоменклатурыБезДублей.Видимость = БухМен Или БухСклада;
	Элементы.ПродажиПечатьНакладнаяНаПалеты.Видимость                = БухМен Или БухСклада;
	
	Элементы.ПродажиПечатьРазрешитьИзменения.Видимость = БухСклада;

	Элементы.ПродажиГруппаОтчеты.Видимость     = БухМен;
	Элементы.ПродажиГруппаДополнительныеОтчеты.Видимость = БухМен;
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	УсловноеОформление.Элементы.Очистить();

	// Просрочен - Красный
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Продажи.Имя);
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.Продажи.Цвет");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 1;
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.ЛососьТемный);

	// Разрешить отгрузку - Зелёный
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Продажи.Имя);
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.Продажи.Цвет");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 2;
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.ЖелтоЗеленый);
	
	// Реезерв Документ реализации оформлен - Желтый
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Продажи.Имя);
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.Продажи.Цвет");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 3;
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Хаки);
	
	// Тендер
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Продажи.Имя);
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.Продажи.Цвет");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 4;
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветШкалыДиаграммы);

	// Цена изменена  в заказе
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПродажиСостоянияЗаказ.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПродажиНомер.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПродажиВ2В.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПродажиДата.Имя);
	
	ГруппаОтбора  = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	ГруппаОтбора.Использование = Истина;
	
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.Продажи.ЦенаИзмененаЗаказ");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.Продажи.ЗаказКлиента");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Заполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветОсобогоТекста);
		
	// Цена изменена  в реализации
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПродажиСостоянияРеализация.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПродажиНомерРеализация.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПродажиДатаРеализация.Имя);
	
	ГруппаОтбора  = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	ГруппаОтбора.Использование = Истина;
	
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.Продажи.ЦенаИзмененаРеализация");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.Продажи.Реализация");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Заполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветОсобогоТекста);

	// Предоплата
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПродажиПартнер.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПродажиКонтрагент.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПродажиСуммаДокумента.Имя);
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.Продажи.Срок");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаКредита);
	
	// Превышение лимита долга
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПродажиСуммаЛимит.Имя);
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.Продажи.СуммаЛимит");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Больше;
	ОтборЭлемента.ПравоеЗначение = 0;
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветОсобогоТекста);
КонецПроцедуры

#КонецОбласти

#КонецОбласти