#Область СлужебныйПрограммныйИнтерфейс

Процедура ПриИзмененииРеквизитаДоговорыКонтрагентов(Объект, Элемент) Экспорт
	Стр = AMS_ВызовСервера.ПолучитьНаименованиеДоговора(Объект.Номер, Объект.Дата, Объект.Организация, Объект.Партнер,
		Объект.Контрагент, Объект.ТипДоговора, Объект.Наименование);

	Объект.Наименование          = Стр.Наименование;
	Объект.НаименованиеДляПечати = Стр.НаименованиеДляПечати;

	Если Элемент = "Контрагент" И Не AMS_ВызовСервера.ЭтоКонтрагентПартнера(Объект.Партнер, Объект.Контрагент) Тогда
		ПоказатьПредупреждение( , """" + Объект.Контрагент + """ не является контрагентом партнёра """ + Объект.Партнер	+ """.");
		Объект.Контрагент = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Справочник.Контрагенты.ПустаяСсылка");

	ИначеЕсли Элемент = "Статус" И Объект.Статус = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент(
		"Перечисление.СтатусыДоговоровКонтрагентов.Действует") Тогда
	КонецЕсли;
КонецПроцедуры

//Процедура ПриИзмененииРеквизитаПеремещениеТоваровСтатусИлиДата(Объект) Экспорт
//	Если AMS_ВызовСервера.ЭтоKhors() Тогда
//		Возврат;
//	КонецЕсли;

//	ДатаСеанса = ОбщегоНазначенияКлиент.ДатаСеанса();

//	
//    Если AMS_ВызовСервера.ДоступнаРоль("_НачальникСклада") Тогда
//	    Если Объект.СкладПолучатель = AMS_ВызовСервера.СкладПродукции()
//			И Объект.Статус = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление.СтатусыПеремещенийТоваров.Принято") 
//			И НЕ ДеньГода(Объект.Дата) = ДеньГода(ДатаСеанса) Тогда
//			
//			Текст = НСтр("ru = 'Товары приняты на Склад продукции могут быть только текущей датой'");
//			ОбщегоНазначенияКлиент.СообщитьПользователю(Текст,Объект.Ссылка,"Объект.Дата");
//			Объект.Статус = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление.СтатусыПеремещенийТоваров.Отгружено");
//		КонецЕсли;
//	КонецЕсли;

//	Если Объект.Дата = НачалоДня(Объект.Дата) Тогда
//		Время = ДатаСеанса - НачалоДня(ДатаСеанса);
//		Объект.Дата = Объект.Дата + Время;
//	КонецЕсли;
//КонецПроцедуры

Процедура ПриИзмененииРеквизитаПересчетТоваровСтатус(Объект, Статус) Экспорт
	Если Не (AMS_ВызовСервера.ЭтоKhors() Или AMS_ВызовСервера.ДоступнаРоль("_ГлавныйБухгалтер")) 
		И Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыПересчетовТоваров.Выполнено") Тогда

		ПоказатьПредупреждение( , "Недостаточно прав. Статус ""Выполнено"" устанавливает Главный бухгалтер.");

		Объект.Статус = Статус;
	КонецЕсли;
КонецПроцедуры

// Функция, вызываемая для открытия форм.
//
// Параметры:
//  ИмяОбъекта - Строка - имя объект, из которого происходит вызов функции.
//  ИмяФормы   - Строка - имя открываемой формы.
//
// Возвращаемое значение:
//  Строка - имя формы
//
Функция ПолучитьПолноеИмяФормы(ИмяОбъекта, ИмяФормы) Экспорт
	СимволТчк = ".";
	
	ПозицияТочки = СтрДлина(ИмяОбъекта);
	
	Пока Не Сред(ИмяОбъекта, ПозицияТочки, 1) = СимволТчк Цикл
		ПозицияТочки = ПозицияТочки - 1;
	КонецЦикла;
	
	Возврат Лев(ИмяОбъекта, ПозицияТочки) + ИмяФормы;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ДоговорыКонтрагентов

Процедура СтатусДоговораПриИзмененииЗавершение(КодВозврата, ДополнительныеПараметры) Экспорт
	Если Не КодВозврата = КодВозвратаДиалога.Да Тогда
		ДополнительныеПараметры.Статус = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент(
			"Перечисление.СтатусыДоговоровКонтрагентов.НеСогласован");
	КонецЕсли
	;
КонецПроцедуры

#КонецОбласти

#Область РеализацияТоваровУслуг

Функция ПолучитьДанныеИзФайла(ИмяФайла, Отказ) Экспорт
	ВыбФайл = Новый Файл(ИмяФайла);
	Если Не ВыбФайл.Существует() Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Файл не существует!");
		Возврат Неопределено;
	КонецЕсли;

	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.Visible       = Ложь;
		Excel.DisplayAlerts = Ложь;
		Excel.WorkBooks.Open(ИмяФайла);
		ExcelЛист = Excel.Sheets(1);
	Исключение
		ОбщегоНазначенияКлиент.СообщитьПользователю("Ошибка. Возможно неверно указан номер листа книги Excel.");
		Возврат Неопределено;
	КонецПопытки;

	ExcelЛист.Unprotect("Sergik");

	МассивСтрок = Новый Массив;

	ВсегоСтрок = ExcelЛист.Cells(1, 1).SpecialCells(11).Row;
	ВсегоКолонок = ExcelЛист.UsedRange.Columns.Count();
	
//	ПерваяЯчейка = ExcelЛист.Range(ExcelЛист.Cells(1, 1), ExcelЛист.Cells(1, 1)).Value;
	
	Если ВсегоКолонок = 18 Или ВсегоКолонок = 19 Тогда
		Если ВсегоКолонок = 18 Тогда
			КолонкаКодТовара  = 6;
			КолонкаКоличество = 14;
			
		ИначеЕсли ВсегоКолонок = 19 Тогда
			КолонкаКодТовара = 7;
			КолонкаКоличество = 15;
		КонецЕсли;

		МассивКодТовара  = ExcelЛист.Range(ExcelЛист.Cells(10, КолонкаКодТовара), ExcelЛист.Cells(ВсегоСтрок, КолонкаКодТовара)).Value.Выгрузить()[0];
		МассивКоличество = ExcelЛист.Range(ExcelЛист.Cells(10, КолонкаКоличество), ExcelЛист.Cells(ВсегоСтрок, КолонкаКоличество)).Value.Выгрузить()[0];
		
	Иначе 
		КолонкаКодТовара  = 2;
		КолонкаКоличество = 15;
		
		МассивКодТовара  = ExcelЛист.Range(ExcelЛист.Cells(9, КолонкаКодТовара), ExcelЛист.Cells(ВсегоСтрок, КолонкаКодТовара)).Value.Выгрузить()[0];
		МассивКоличество = ExcelЛист.Range(ExcelЛист.Cells(9, КолонкаКоличество), ExcelЛист.Cells(ВсегоСтрок, КолонкаКоличество)).Value.Выгрузить()[0];
	КонецЕсли;

	Excel.WorkBooks.Close();
	Excel.Quit();
	Excel.DisplayAlerts = Истина;

	Индекс = МассивКоличество.Количество() - 1;
	Для Сч = 0 По Индекс Цикл
		КодТовара = МассивКодТовара[Сч];
		
		Если КодТовара = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Количество = МассивКоличество[Сч];

		Если Не Количество = Неопределено И Количество > 0 Тогда
			МассивСтрок.Добавить(Новый Структура("КодТовара,Количество", КодТовара, Количество));

			Если Не Количество = Цел(Количество) Тогда
				Номенклатура = AMS_ВызовСервера.ПолучитьНоменклатуруПоКоду(КодТовара);
				ОбщегоНазначенияКлиент.СообщитьПользователю("Для товара """ + Номенклатура
					+ """ указано не целое количество упаковок (" + Окр(Количество, 3) + ").", , , , Отказ);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Возврат МассивСтрок;
КонецФункции

#КонецОбласти

#Область Печать

Процедура ВыполнитьКомандуПечати(Док, Макет, Парам = Неопределено) Экспорт
	СпособДоставки  = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Док, "СпособДоставки");
	СпособСамовывоз = ПредопределенноеЗначение("Перечисление.СпособыДоставки.Самовывоз");
	Самовывоз       = (СпособДоставки = СпособСамовывоз);
		
	Если ТипЗнч(Док) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		ДанныеДок = ОбщегоНазначенияУТВызовСервера.ЗначенияРеквизитовОбъекта(Док, "Проведен,Партнер,AMS_УтвержденаОтгрузка");

		ДокПроведен  = ДанныеДок.Проведен;
		ДокУтвержден = ДанныеДок.AMS_УтвержденаОтгрузка;
		ЕстьЛогЛист  = AMS_ВызовСервера.ВключенВЛогитическийЛист(Док);
		Партнер      = ДанныеДок.Партнер;
	КонецЕсли;

	ЭтоНачСклада = AMS_ВызовСервера.РолиДоступны("_БухгалтерСклада, _НачальникСклада");
	ЭтоKhors     = AMS_ВызовСервера.ЭтоKhors();
	КлиентСети   = AMS_ВызовСервера.ВходитВСегмент(Партнер, AMS_ВызовСервера.СегментыПартнеровСети());

	Массив = Новый Массив;
	Массив.Добавить(Док);

	Сообщение = "";

	Если       (Макет = "УПД"              Или Макет = "СН" Или Макет = "УпаковочныйЛист"
			Или Макет = "Доверенность"     Или Макет = "ТН" 
			Или Макет = "ТТН"              Или Макет = "ТОРГ12" 
			Или Макет = "СчетФактура"      Или Макет = "АктОРасхождениях" 
			Или Макет = "ПалетнаяЭтикетка" Или Макет = "ТОРГ12") 
		И Не ЭтоKhors И Не КлиентСети Тогда

		Если Не ДокПроведен Тогда
			Текст = "Документ не проведен.";
			Сообщение = ?(ПустаяСтрока(Сообщение), Текст, Символы.ПС + Текст);
		КонецЕсли;

		Если Не ДокУтвержден Тогда
			Сообщение = "Документ не утверждён к отгрузке.";
		КонецЕсли;

		Если Не Самовывоз И Не ЕстьЛогЛист И Не ЭтоНачСклада Тогда
			Текст = "Документ не включен в логистический лист.";
			Сообщение = ?(ПустаяСтрока(Сообщение), Текст, Символы.ПС + Текст);
		КонецЕсли;

	ИначеЕсли   Макет = "СчетНаОплату"                  Или Макет = "Спецификация" 
			Или Макет = "СертификатыНоменклатурыРеестр" Или Макет = "ЗаявкаПеревозчику" Тогда
	КонецЕсли;

	Если ПустаяСтрока(Сообщение) Тогда
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.AMS_Продажи", Макет, Массив, Неопределено, Парам);
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(Сообщение);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецОбласти