
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.Партнер.СписокВыбора.ЗагрузитьЗначения(мср.ПолучитьМассивПартнеровДавальческих());

	Элементы.СписаниеНедостачТоваров.Видимость = AMS_ВызовСервера.ЭтоKhors();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	AMS_Сервер.УстановитьВремяДокумента(ТекущийОбъект, "_ПоступлениеИзПереработки", 36000, 39600); //10:00 - 11:00
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Запись_ПоступлениеИзПереработки", ПараметрыЗаписи, Объект.Ссылка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПартнерПриИзменении(Элемент)
	Контрагент = AMS_ВызовСервера.ПолучитьКонтрагентаПартнёра(Объект.Партнер);
	Если Не Контрагент = Неопределено Тогда
		Объект.Контрагент = Контрагент;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодборПреформ(Команда)
	Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Поле ""Контрагент"" не заполнено", Объект.Ссылка,
			"Объект.Контрагент");
		Возврат;
	КонецЕсли;

	АдресВХранилищеДляПодбора = ПолучитьАдресПреформВХранилище();
	Если АдресВХранилищеДляПодбора = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Парам = Новый Структура("АдресВХранилище", АдресВХранилищеДляПодбора);
	ОткрытьФорму("Документ._ПоступлениеИзПереработки.Форма.ПодборБрака", Парам, ЭтотОбъект, , , ,
		Новый ОписаниеОповещения("ОткрытьФормуПодборБракаЗавершение", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ДвижениеДокумента(Команда)
	СсылкаНаОбъект = Объект.Ссылка;
	Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ВидимостьКомандВариантовОтчетов", Ложь);
		ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
		ПараметрыФормы.Вставить("ПараметрКоманды", СсылкаНаОбъект);

		ОткрытьФорму("Отчет.ДвиженияДокумента.Форма", ПараметрыФормы, ЭтотОбъект, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеДокументы(Команда)
	МенюОтчетыУТКлиент.СтруктураПодчиненности(Объект.Ссылка, Неопределено);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьФормуПодборБракаЗавершение(Результат, ДополнительныеПераметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Модифицированность = Истина;

	Объект.Товары.Очистить();

	Для Каждого Стр Из Результат Цикл
		НовСтр = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Стр);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресПреформВХранилище()
	Попытка
		ЗаблокироватьДанныеФормыДляРедактирования();

		Модифицированность = Истина;

		Док = РеквизитФормыВЗначение("Объект");

		Данные = Новый Структура;
		Данные.Вставить("Товары", Док.Товары.Выгрузить( , "Номенклатура,Количество"));
		Данные.Вставить("Контрагент", Док.Контрагент);
		Данные.Вставить("Склад", AMS_ВызовСервера.СкладКомпании());
		Данные.Вставить("Дата", НачалоДня(Док.Дата));

		Возврат ПоместитьВоВременноеХранилище(Данные);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
КонецФункции

#КонецОбласти