
#Область ПрограммныйИнтерфейс

Функция ОбщийМодуль(Имя) Экспорт
	
	Модуль = ОбщегоНазначенияКлиент.ОбщийМодуль(Имя);
	
	#Если Не ВебКлиент Тогда
		
		// В веб-клиенте не проверяется
		// т.к. при обращении к модулям с вызовом сервера типа такого модуля в веб-клиенте не существует.
		
		Если Имя <> "СтроковыеФункцииКлиентСервер" Тогда
			Модуль_СтроковыеФункцииКлиентСервер = ОбщийМодуль("СтроковыеФункцииКлиентСервер");
		КонецЕсли;
		
		Если ТипЗнч(Модуль) <> Тип("ОбщийМодуль") Тогда
			Если Имя <> "СтроковыеФункцииКлиентСервер" Тогда
				ВызватьИсключение Модуль_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Общий модуль ""%1"" не найден.'"), 
				Имя);
			Иначе
				ВызватьИсключение НСтр("ru = 'Неизвестное имя общего модуля - СтроковыеФункцииКлиентСервер. Обратитесь к разработчикам программы.'");			
			КонецЕсли;	
		КонецЕсли;
		
	#КонецЕсли
	
	Возврат Модуль;
	
КонецФункции

Процедура СообщитьПользователю(Знач ТекстСообщения,	Знач КлючДанных = Неопределено,
	Знач Поле = "", Знач ПутьКДанным = "", Отказ = Ложь) Экспорт
	
	Если Отказ Тогда Возврат; КонецЕсли;
	
	Попытка
		Модуль_ОбщегоНазначенияКлиент = ОбщийМодуль("ОбщегоНазначенияКлиент"); 
		
		Модуль_ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, 
		КлючДанных, Поле, ПутьКДанным, Отказ);
		
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст       = ТекстСообщения;
		Сообщение.КлючДанных  = КлючДанных;
		Сообщение.Поле        = Поле;
		Сообщение.ПутьКДанным = ПутьКДанным;
		
		Сообщение.Сообщить();		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти             																	