
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.Склад.СписокВыбора.Добавить(AMS_ВызовСервера.Цех1());
	Элементы.Склад.СписокВыбора.Добавить(AMS_ВызовСервера.Цех2());
	Элементы.Склад.СписокВыбора.Добавить(AMS_ВызовСервера.Цех3());
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Склад", Склад, ВидСравненияКомпоновкиДанных.Равно, , ЗначениеЗаполнено(Склад));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Склад", Склад, ВидСравненияКомпоновкиДанных.Равно, , ЗначениеЗаполнено(Склад));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Отчет_ПроизводствоПродукции(Команда)
	Парам = Новый Структура;
	Парам.Вставить("КлючНазначенияИспользования", "ПроизводствоПродукции");
	ОткрытьФорму("Отчет.AMS_ПроизводствоПродукции.Форма", Парам);
КонецПроцедуры

&НаКлиенте
Процедура Отчет_Зарплата(Команда)
	ОткрытьФорму("Отчет._Зарплата.Форма");
КонецПроцедуры

&НаКлиенте
Процедура Отчёт_ДвижениеТоваров(Команда)
	Парам = Новый Структура;
	Парам.Вставить("КлючНазначенияИспользования", "Сводка номенклатуры");
	ОткрытьФорму("Отчет.AMS_ДвижениеТоваров.Форма", Парам, ЭтотОбъект, "ДвижениеТоваров="
		+ ОбщегоНазначенияКлиент.ДатаСеанса());
КонецПроцедуры

#КонецОбласти
