#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Параметры.Статус = ПредопределенноеЗначение("Перечисление.СтатусыПересчетовТоваров.ВнесениеРезультатов") Тогда
		Элементы.КолФакт.ТолькоПросмотр = Истина;;
		Элементы.КолФакт.ЦветФона       = ЦветаСтиля.ЦветФонаШапкиОтчета;
		
		Элементы.КолУпакФакт.ТолькоПросмотр = Истина;
		Элементы.КолУпакФакт.ЦветФона       = ЦветаСтиля.ЦветФонаШапкиОтчета;
	КонецЕсли;		
	
	Табл = Параметры.Товары;
	
	Для Каждого Стр Из Табл Цикл
		НовСтр = Товары.Добавить();
		
		ЗаполнитьЗначенияСвойств(НовСтр, Стр);
		
		Кфц = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НовСтр.Номенклатура, "КоэффициентЕдиницыДляОтчетов");
		Упаковка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НовСтр.Номенклатура, "_Упаковка");
		
		НовСтр.Упаковка = Упаковка;
		
		НовСтр.КолУпакПоУчету = НовСтр.Количество / Кфц;
		
		НовСтр.КолУпакФакт = Цел(НовСтр.КоличествоФакт / Кфц);
		НовСтр.КолФакт     = НовСтр.КоличествоФакт - НовСтр.КолУпакФакт * Кфц;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура КолФактПриИзменении(Элемент)
	Стр = Элементы.Товары.ТекущиеДанные;
	ПересчитатьСтроку(Стр);
КонецПроцедуры

&НаКлиенте
Процедура КолУпакФактПриИзменении(Элемент)
	Стр = Элементы.Товары.ТекущиеДанные;
	ПересчитатьСтроку(Стр);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	Модифицированность = Ложь;

	Данные = ПолучитьМассивСтрок();

	Закрыть(Данные);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПересчитатьСтроку(Стр)
	Кфц = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Стр.Номенклатура, "КоэффициентЕдиницыДляОтчетов");

	Стр.КоличествоФакт         = Стр.КолУпакФакт * Кфц + Стр.КолФакт;
	Стр.КоличествоУпаковокФакт = Стр.КоличествоФакт;

	Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивСтрок()
	МассивСтрок = Новый Массив;
	
	Табл = Товары.Выгрузить();
	
	Для Каждого Стр Из Табл Цикл
		МассивСтрок.Добавить(ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Стр));
	КонецЦикла;

	Возврат МассивСтрок;
КонецФункции

#КонецОбласти