#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	Табл = Новый ТаблицаЗначений;
	Табл.Колонки.Добавить("КодТовара", Новый ОписаниеТипов("Строка"));
	Табл.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 3)));

	МассивСтрок = Параметры.МассивСтрок;
	
	Если МассивСтрок = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Для каждого Стр Из МассивСтрок Цикл
		НовСтр = Табл.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Стр);
	КонецЦикла;
	
	Партнер = Параметры.Партнер;
	Родитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Партнер, "Родитель");
	Партнер = ?(ЗначениеЗаполнено(Родитель), Родитель, Партнер); 
	
	СопоставитьДанныеПоКод(Табл);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	Стр = Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	Кфц = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Стр.Номенклатура, "КоэффициентЕдиницыДляОтчетов");
	
	Стр.КоличествоУпаковок = Стр.Количество / Кфц;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоУпаковокПриИзменении(Элемент)
	Стр = Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	Кфц = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Стр.Номенклатура, "КоэффициентЕдиницыДляОтчетов");
	
	Стр.Количество = Стр.КоличествоУпаковок * Кфц;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиТовары(Команда)
	ОчиститьСообщения(); 
	
	МассивСтрок = ПолучитьНайденныеТовары();
	
	Если Не МассивСтрок = Неопределено Тогда
		Закрыть(МассивСтрок);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СопоставитьДанныеПоКод(Табл)
	Товары.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Товары",  Табл);
	Запрос.УстановитьПараметр("Партнер", Партнер);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(т.КодТовара КАК СТРОКА(500)) КАК ЗагружаемыйТовар,
	|	т.Количество КАК Количество
	|ПОМЕСТИТЬ Тов
	|ИЗ
	|	&Товары КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Тов.ЗагружаемыйТовар КАК ЗагружаемыйТовар,
	|	Прод.Номенклатура КАК Номенклатура,
	|	Тов.Количество * Ном.КоэффициентЕдиницыДляОтчетов КАК Количество,
	|	Тов.Количество КАК КоличествоУпаковок
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	Тов КАК Тов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.AMS_Продукция.Товары КАК Прод
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|			ПО Прод.Номенклатура = Ном.Ссылка
	|		ПО Тов.ЗагружаемыйТовар = Прод.Номенклатура.Код
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.Номенклатура КАК Номенклатура,
	|	НомКонтр.Код КАК КодКлиента,
	|	НомКонтр.Артикул КАК АртикулКлиента,
	|	НомКонтр.НаименованиеНоменклатуры КАК НоменклатураКлиента
	|ПОМЕСТИТЬ НомКонт
	|ИЗ
	|	вт КАК вт
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НоменклатураКонтрагентов КАК НомКонтр
	|		ПО (&Партнер = НомКонтр.Владелец)
	|			И вт.Номенклатура = НомКонтр.Номенклатура
	|ГДЕ
	|	НЕ НомКонтр.Недействителен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.ЗагружаемыйТовар КАК ЗагружаемыйТовар,
	|	вт.Номенклатура КАК Номенклатура,
	|	вт.Количество КАК Количество,
	|	вт.КоличествоУпаковок КАК КоличествоУпаковок,
	|	НомКонт.КодКлиента КАК КодКлиента,
	|	НомКонт.АртикулКлиента КАК АртикулКлиента,
	|	НомКонт.НоменклатураКлиента КАК НоменклатураКлиента
	|ИЗ
	|	вт КАК вт
	|		ЛЕВОЕ СОЕДИНЕНИЕ НомКонт КАК НомКонт
	|		ПО вт.Номенклатура = НомКонт.Номенклатура";
	
	Товары.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

&НаСервере
Функция ПолучитьНайденныеТовары()
	Отказ       = Ложь;
	МассивСтрок = Новый Массив;
	НомерСтроки = 0;
	
	Для каждого Стр Из Товары Цикл
		НомерСтроки = НомерСтроки + 1;
		
		Если Не ЗначениеЗаполнено(Стр.Номенклатура) Тогда
			ОбщегоНазначения.СообщитьПользователю("По данным для поиска в строке " + НомерСтроки + " совпадений не найдено.",,,,Отказ);
		КонецЕсли;
			
		Если Стр.Количество = 0 Тогда
			ОбщегоНазначения.СообщитьПользователю("В строке " + НомерСтроки + " не указано количество.",,,,Отказ);
		КонецЕсли; 
		
		Если Стр.КоличествоУпаковок - Цел(Стр.КоличествоУпаковок) > 0 Тогда
			ОбщегоНазначения.СообщитьПользователю("В строке " + НомерСтроки + " не указано не целое количество упаковок.",,,,Отказ);
		КонецЕсли; 

		НовСтр = Новый Структура("Номенклатура, Количество");
		НовСтр.Номенклатура = Стр.Номенклатура;
		НовСтр.Количество   = Стр.Количество;
		
		МассивСтрок.Добавить(НовСтр);
	КонецЦикла; 

	Если Отказ Тогда
		Возврат Неопределено;
	Иначе
		Возврат МассивСтрок;
	КонецЕсли;
КонецФункции

#КонецОбласти