#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
		ЗаполнитьПоПоступлению(ДанныеЗаполнения);
	Иначе
		Дата = НачалоДня(ТекущаяДатаСеанса());
		Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	Товары.Ссылка.Дата КАК Период,
	|	Товары.Ссылка.Партнер КАК Партнер,
	|	Товары.Ссылка.Контрагент КАК Контрагент,
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Количество КАК Количество
	|ИЗ
	|	Документ._ВозвратИзПереработки.Товары КАК Товары
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	Рез = Запрос.Выполнить();

	Если Рез.Пустой() Тогда
		Возврат;
	КонецЕсли;

	Движения._ТоварыПереданные.Записывать = Истина;
	Движения._ТоварыПереданные.Загрузить(Рез.Выгрузить());
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПоПоступлению(Основание)
	Стр = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Основание, "Организация,Склад,Менеджер");

	Организация   = Стр.Организация;
	Склад         = Стр.Склад;
	Ответственный = Стр.Менеджер;

	Товары.Очистить();

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Основание);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Товары.Номенклатура,
	|	Товары.Упаковка,
	|	Товары.КоличествоУпаковок,
	|	Товары.Количество,
	|	Товары.Цена,
	|	Товары.Сумма
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг.Товары КАК Товары
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|	И Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Товары.НомерСтроки";

	Результат = Запрос.Выполнить();
	Выборка   = Результат.Выбрать();

	Пока Выборка.Следующий() Цикл
		НовСтр = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#КонецЕсли