#Если НЕ МобильныйАвтономныйСервер Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Наименование");
	Поля.Добавить("Договор");
	Поля.Добавить("ХозяйственнаяОперация");
	Поля.Добавить("НомерДокументаПоступления");
	Поля.Добавить("ДатаДокументаПоступления");
	Поля.Добавить("Партия");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Представление = Данные.Наименование;
	
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		
		#Если Клиент Тогда
			ЭтоОсновнойЯзык = ОбщегоНазначенияУТКлиентПовтИсп.ЭтоОсновнойЯзык();
		#Иначе
			ЭтоОсновнойЯзык = ОбщегоНазначенияУТПовтИсп.ЭтоОсновнойЯзык();
		#КонецЕсли
		
		Если Не ЭтоОсновнойЯзык Тогда
			Представление = КонтрольКачестваКлиентСервер.ПредставлениеКонтролируемойПартии(Данные, ТекущийЯзык().КодЯзыка);
		КонецЕсли;
		
	#КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
