#Область ОписаниеПеременных

&НаКлиенте
Перем КэшированныеЗначения;

&НаКлиенте
Перем ТекущиеДанныеИдентификатор; //используется для передачи текущей строки в обработчик ожидания

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнициализацияНастройкиЗаполненияПоОстаткам();
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтотОбъект);
		
	Элементы.ОформитьАктКонтроля.Доступность = ПравоДоступа("Добавление",
		Метаданные.Документы.АктКонтроляКачестваТоваров);
	
	Если Параметры.ЗаполнитьПоОстаткам Тогда
		
		Аналитики = ПолучитьИзВременногоХранилища(Параметры.Аналитики);
		Объект.Товары.Загрузить(КонтрольКачества.ОстаткиПоАналитикам(Аналитики, Истина, ТекущаяДатаСеанса()));
		ЗаполнитьОчиститьСкладПомещениеПоДаннымТабличнойЧастиДокумента();
		Объект.Организация = Документы.ЗаявкаНаКонтрольКачестваТоваров.ОрганизацияИзКонтролируемойПартии(Объект);
		ЗаполнитьЗначенияСвойств(Объект, Параметры.ДанныеЗаполнения);
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ПриЧтенииСозданииНаСервере();
		
	КонецЕсли;
	
	Если Параметры.ЗаполнитьПоОстаткам Тогда
		
		// ПараметрыУказанияСерий инициализируются в ПриЧтенииСозданииНаСервере.
		НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий);
		
	КонецЕсли;
	
	// Обработчик механизма "Назначения"
	Справочники.Назначения.ФормаДокументаПриСозданииНаСервере(ЭтотОбъект);
	
	// Работа с буфером обмена
	УстановитьДоступностьКомандБуфераОбмена();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	ДополнительныеПараметры.Вставить("ОтложеннаяИнициализация", Истина);
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
	// СтандартныеПодсистемы.РаботаСФайлами
	ПараметрыГиперссылки = РаботаСФайлами.ГиперссылкаФайлов();
	ПараметрыГиперссылки.Размещение = "КоманднаяПанель";
	РаботаСФайлами.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыГиперссылки);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
	СобытияФорм.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтотОбъект, "СканерШтрихкода");
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ПриОткрытии(ЭтотОбъект, Отказ);
	// Конец СтандартныеПодсистемы.РаботаСФайлами

	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОповеститьОПроведенииДокумента(ПараметрыЗаписи);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
		МодульПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойств
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	
	ЗаполнитьПризнакАртикул = Новый Структура("Номенклатура", "Артикул");
	ЗаполнитьПризнакТипНоменклатуры = Новый Структура("Номенклатура", "ТипНоменклатуры");
	ЗаполнитьПризнакТипИзмеряемойВеличины = Новый Структура("Номенклатура", "ТипИзмеряемойВеличины");
	ЗаполнитьПризнакХарактеристикиИспользуются = Новый Структура("Номенклатура", "ХарактеристикиИспользуются");
	ЗаполнитьПризнакИспользованияПомещений = Новый Структура("Дата", Объект.Дата);
	ЗаполнитьПризнакАдресногоХранения = Новый Структура("Дата", Объект.Дата);
	
	СтруктураДействий = Новый Структура();
	СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", ЗаполнитьПризнакАртикул);
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", ЗаполнитьПризнакТипНоменклатуры);
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипИзмеряемойВеличины", ЗаполнитьПризнакТипИзмеряемойВеличины);
	СтруктураДействий.Вставить("ЗаполнитьПризнакХарактеристикиИспользуются", ЗаполнитьПризнакХарактеристикиИспользуются);
	СтруктураДействий.Вставить("ЗаполнитьПризнакИспользованияПомещений", ЗаполнитьПризнакИспользованияПомещений);
	СтруктураДействий.Вставить("ЗаполнитьПризнакАдресногоХранения", ЗаполнитьПризнакАдресногоХранения);
	
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Объект.Товары, СтруктураДействий);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ПриЧтенииСозданииНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Обработка.ПодборТоваровВДокументПродажи.Форма.Форма" Тогда
		
		ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение);
		
	ИначеЕсли
	
		НоменклатураКлиент.ЭтоУказаниеСерий(ИсточникВыбора) Тогда
		НоменклатураКлиент.ОбработатьУказаниеСерии(ЭтотОбъект, ПараметрыУказанияСерий, ВыбранноеЗначение);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ПодключаемоеОборудование
	Если ВводДоступен()
		И Источник = "ПодключаемоеОборудование" Тогда
		
		Если ИмяСобытия = "ScanData"
			И МенеджерОборудованияУТКлиент.ЕстьНеобработанноеСобытие() Тогда
			
			ОбработатьШтрихкоды(МенеджерОборудованияУТКлиент.ПреобразоватьДанныеСоСканераВМассив(Параметр));
			
		КонецЕсли;
		
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
	// Неизвестные штрихкоды
	Если ИмяСобытия = "НеизвестныеШтрихкоды"
		И Источник = "ПодключаемоеОборудование"
		И Параметр.ФормаВладелец = УникальныйИдентификатор Тогда
		
		КэшированныеЗначения.Штрихкоды.Очистить();
		
		ДанныеШтрихкодов = Новый Массив;
		
		Для Каждого ПолученныйШтрихкод Из Параметр.ШтрихкодыНоменклатуры Цикл
			ДанныеШтрихкодов.Добавить(ПолученныйШтрихкод);
		КонецЦикла;
		
		ОбработатьШтрихкоды(ДанныеШтрихкодов);
		
	КонецЕсли;
	
	// Работа с буфером обмена
	Если ИмяСобытия = "КопированиеСтрокВБуферОбмена" Тогда
		УстановитьДоступностьКомандБуфераОбменаНаКлиенте();
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	// СтандартныеПодсистемы.Свойства
	Если ЭтотОбъект.ПараметрыСвойств.Свойство(ТекущаяСтраница.Имя)
			И Не ЭтотОбъект.ПараметрыСвойств.ВыполненаОтложеннаяИнициализация Тогда
		
		СвойстваВыполнитьОтложеннуюИнициализацию();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ПриИзмененииДатыСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	
	ПриИзмененииСкладаСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ПомещениеПриИзменении(Элемент)
	
	ПриИзмененииПомещенияСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ПланироватьРазблокировкуТоваровПриИзменении(Элемент)
	Если Не Объект.ПланироватьРазблокировкуТоваров Тогда
		Объект.ДатаПодтвержденияКачества = '00010101';
	КонецЕсли;
	УстановитьДоступностьДатаПодтвержденияКачестваНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ПричинаБлокировкиТовараПриИзменении(Элемент)
	
	ПричинаБлокировкиТовараПриИзмененииСервер();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	СтрокаТаблицы = Элементы.Товары.ТекущиеДанные;
	
	ЗаполнитьПризнакАртикул = Новый Структура("Номенклатура", "Артикул");
	ЗаполнитьПризнакТипНоменклатуры = Новый Структура("Номенклатура", "ТипНоменклатуры");
	ЗаполнитьПризнакТипИзмеряемойВеличины = Новый Структура("Номенклатура", "ТипИзмеряемойВеличины");
	ЗаполнитьПризнакХарактеристикиИспользуются = Новый Структура("Номенклатура", "ХарактеристикиИспользуются");
	ПроверитьСериюРассчитатьСтатус = Новый Структура("Склад,ПараметрыУказанияСерий",
		СтрокаТаблицы.Склад, ПараметрыУказанияСерий);
	ПроверитьЗаполнитьСклад = ПроверитьЗаполнитьСкладПараметрыДействия(Объект.Склад);
	ЗаполнитьПризнакИспользованияПомещений = Новый Структура("Дата", Объект.Дата);
	ЗаполнитьПризнакАдресногоХранения = Новый Структура("Дата", Объект.Дата);
	
	НоменклатураПриИзмененииПереопределяемый = Новый Структура("ИмяФормы, ИмяТабличнойЧасти",
		ИмяФормы, "Товары");
	
	СтруктураДействий = Новый Структура();
	СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", ЗаполнитьПризнакАртикул);
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", ЗаполнитьПризнакТипНоменклатуры);
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипИзмеряемойВеличины", ЗаполнитьПризнакТипИзмеряемойВеличины);
	СтруктураДействий.Вставить("ЗаполнитьПризнакХарактеристикиИспользуются", ЗаполнитьПризнакХарактеристикиИспользуются);
	СтруктураДействий.Вставить("НоменклатураПриИзмененииПереопределяемый", НоменклатураПриИзмененииПереопределяемый);
	СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", СтрокаТаблицы.Характеристика);
	СтруктураДействий.Вставить("ПроверитьСериюРассчитатьСтатус", ПроверитьСериюРассчитатьСтатус);
	СтруктураДействий.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу", СтрокаТаблицы.Упаковка);
	СтруктураДействий.Вставить("ПроверитьЗаполнитьСклад", ПроверитьЗаполнитьСклад);
	СтруктураДействий.Вставить("ЗаполнитьПомещениеВСтрокеТЧ", Объект.Помещение);
	СтруктураДействий.Вставить("ЗаполнитьПризнакИспользованияПомещений", ЗаполнитьПризнакИспользованияПомещений);
	СтруктураДействий.Вставить("ЗаполнитьПризнакАдресногоХранения", ЗаполнитьПризнакАдресногоХранения);
	
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(СтрокаТаблицы, СтруктураДействий, КэшированныеЗначения);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкладПриИзменении(Элемент)
	
	СтрокаТаблицы = Элементы.Товары.ТекущиеДанные;
	
	ПроверитьСериюРассчитатьСтатус = Новый Структура("Склад, ПараметрыУказанияСерий", СтрокаТаблицы.Склад, ПараметрыУказанияСерий);
	ЗаполнитьПризнакИспользованияПомещений = Новый Структура("Дата", Объект.Дата);
	ЗаполнитьПризнакАдресногоХранения = Новый Структура("Дата", Объект.Дата);
	
	СтруктураДействий = Новый Структура();
	СтруктураДействий.Вставить("ЗаполнитьПризнакИспользованияПомещений", ЗаполнитьПризнакИспользованияПомещений);
	СтруктураДействий.Вставить("ЗаполнитьПризнакАдресногоХранения", ЗаполнитьПризнакАдресногоХранения);
	СтруктураДействий.Вставить("ПроверитьСериюРассчитатьСтатус", ПроверитьСериюРассчитатьСтатус);
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(СтрокаТаблицы, СтруктураДействий, КэшированныеЗначения);
	ОчиститьУпаковкуДляСтрокБезАдресногоХраненияВСтроке(СтрокаТаблицы);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСерияПриИзменении(Элемент)
	
	ВыбранноеЗначение = НоменклатураКлиентСервер.ВыбраннаяСерия();
	
	ВыбранноеЗначение.Значение = Элементы.Товары.ТекущиеДанные.Серия;
	ВыбранноеЗначение.ИдентификаторТекущейСтроки = Элементы.Товары.ТекущиеДанные.ПолучитьИдентификатор();
	
	НоменклатураКлиент.ОбработатьУказаниеСерии(ЭтотОбъект, ПараметрыУказанияСерий, ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСерияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьПодборСерий(Элемент.ТекстРедактирования);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыУпаковкаПриИзменении(Элемент)
	
	СтрокаТаблицы = Элементы.Товары.ТекущиеДанные;
	СтруктураДействий = Новый Структура();
	СтруктураДействий.Вставить("ПересчитатьКоличествоУпаковок");
	
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(СтрокаТаблицы, СтруктураДействий, КэшированныеЗначения);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоУпаковокПриИзменении(Элемент)
	
	СтрокаТаблицы = Элементы.Товары.ТекущиеДанные;
	СтруктураДействий = Новый Структура();
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(СтрокаТаблицы, СтруктураДействий, КэшированныеЗначения);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПомещениеПриИзменении(Элемент)
	
	СтрокаТаблицы = Элементы.Товары.ТекущиеДанные;
	
	ЗаполнитьПризнакАдресногоХранения = Новый Структура("Дата", Объект.Дата);
	
	СтруктураДействий = Новый Структура();
	СтруктураДействий.Вставить("ЗаполнитьПризнакАдресногоХранения", ЗаполнитьПризнакАдресногоХранения);
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(СтрокаТаблицы, СтруктураДействий, КэшированныеЗначения);
	ОчиститьУпаковкуДляСтрокБезАдресногоХраненияВСтроке(СтрокаТаблицы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_КомандаПанелиПрисоединенныхФайлов(Команда)
	 РаботаСФайламиКлиент.КомандаУправленияПрисоединеннымиФайлами(ЭтотОбъект, Команда);
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами

// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	 РаботаСФайламиКлиент.ПолеПредпросмотраПроверкаПеретаскивания(ЭтотОбъект, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами

// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	 РаботаСФайламиКлиент.ПолеПредпросмотраПеретаскивание(ЭтотОбъект, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами

// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраНажатие(Элемент, СтандартнаяОбработка)
	 РаботаСФайламиКлиент.ПолеПредпросмотраНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти

&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Записать(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Провести(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	
	ОбщегоНазначенияУТКлиент.ПровестиИЗакрыть(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьСтроки(Команда)
	
	Если РаботаСТабличнымиЧастямиКлиент.ВыбранаСтрокаДляВыполненияКоманды(Элементы.Товары) Тогда
		ВыделенныеСтроки = Элементы.Товары.ВыделенныеСтроки;
		СкопироватьСтрокиНаСервере(ВыделенныеСтроки);
		РаботаСТабличнымиЧастямиКлиент.ОповеститьПользователяОКопированииСтрок(ВыделенныеСтроки.Количество());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьСтроки(Команда)
	
	ОчиститьСообщения();
	КоличествоТоваровДоВставки = Объект.Товары.Количество();
	
	ПолучитьСтрокиИзБуфераОбмена();
	
	КоличествоВставленных = Объект.Товары.Количество() - КоличествоТоваровДоВставки;
	РаботаСТабличнымиЧастямиКлиент.ОповеститьПользователяОВставкеСтрок(КоличествоВставленных);

КонецПроцедуры

&НаКлиенте
Процедура РазбитьСтроку(Команда)
	
	ТаблицаФормы  = Элементы.Товары;
	ДанныеТаблицы = Объект.Товары;
	
	Оповещение = Новый ОписаниеОповещения("РазбитьСтрокуЗавершение", ЭтотОбъект);
	РаботаСТабличнымиЧастямиКлиент.РазбитьСтроку(ДанныеТаблицы, ТаблицаФормы, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискПоШтрихкоду(Команда)
	
	ОчиститьСообщения();
	Оповещение = Новый ОписаниеОповещения("ТоварыПоискПоШтрихкодуЗавершение", ЭтотОбъект);
	ШтрихкодированиеНоменклатурыКлиент.ПоказатьВводШтрихкода(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьТовары(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Склад", Объект.Склад);
	ПараметрыФормы.Вставить("РежимПодбораБезСуммовыхПараметров", Истина);
	ПараметрыФормы.Вставить("СкрыватьКолонкуВидЦены", Истина);
	ПараметрыФормы.Вставить("СкрыватьКомандуЦеныНоменклатуры", Истина);
	ПараметрыФормы.Вставить("Заголовок", НСтр("ru = 'Подбор товаров'"));
	ПараметрыФормы.Вставить("Дата", Объект.Дата);
	ПараметрыФормы.Вставить("Документ", Объект.Ссылка);
	ПараметрыФормы.Вставить("ПараметрыУказанияСерий", ПараметрыУказанияСерий);
	ПараметрыФормы.Вставить("ОтборПоТипуНоменклатуры", 
		Новый ФиксированныйМассив(НоменклатураКлиентСервер.ОтборПоТоваруМногооборотнойТаре(Ложь)));
	
	ОткрытьФорму("Обработка.ПодборТоваровВДокументПродажи.Форма", ПараметрыФормы, ЭтотОбъект, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОстаткам(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресСхемы", АдресСхемыНастройкаЗаполненияПоОстаткам);
	Если ЗначениеЗаполнено(Объект.Склад) Тогда
		Для Каждого ЭлементОтбора Из НастройкиЗаполненияПоОстаткам.Настройки.Отбор.Элементы Цикл
			Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Склад") Тогда
				НайденныйЭлемент = НастройкиЗаполненияПоОстаткам.ПользовательскиеНастройки.Элементы.Найти(
					ЭлементОтбора.ИдентификаторПользовательскойНастройки);
				НайденныйЭлемент.ПравоеЗначение = Объект.Склад;
				НайденныйЭлемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
				НайденныйЭлемент.Использование = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Помещение) Тогда
		Для Каждого ЭлементОтбора Из НастройкиЗаполненияПоОстаткам.Настройки.Отбор.Элементы Цикл
			Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Помещение") Тогда
				НайденныйЭлемент = НастройкиЗаполненияПоОстаткам.ПользовательскиеНастройки.Элементы.Найти(
					ЭлементОтбора.ИдентификаторПользовательскойНастройки);
				НайденныйЭлемент.ПравоеЗначение = Объект.Помещение;
				НайденныйЭлемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
				НайденныйЭлемент.Использование = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	ПараметрыФормы.Вставить("НастройкиСписка", НастройкиЗаполненияПоОстаткам);
	ПараметрыФормы.Вставить("Заголовок", НСтр("ru = 'Заполнение по остаткам заблокированных товаров'"));
	ПараметрыФормы.Вставить("ЗаголовокКнопкиЗавершитьРедактирование", НСтр("ru = 'Заполнить'"));
	ОписаниеОповещения = Новый ОписаниеОповещения("НастройкаЗаполненияПоОстаткамЗавершение", ЭтотОбъект);
	ОткрытьФорму("Отчет.НастройкаСписка.Форма.НастройкаСписка", ПараметрыФормы, , , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКонтролируемуюПартию(Команда)
	
	Если Не ЕстьСтрокиДляВыполненияКоманды(НСтр("ru='""Контролируемая партия""'")) Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ЗаполнитьКонтролируемуюПартиюПослеВыбора",
		ЭтотОбъект);
	
	ПараметрыФормы = КонтрольКачестваКлиент.НовыйПараметрыФормыВыбораКонтролируемыеПартии();
	ПараметрыФормы.Источник = "Документ.ЗаявкаНаКонтрольКачестваТоваров";
	ПараметрыФормы.Вставить("Отбор", Новый Структура("ПометкаУдаления", Ложь));
	ОткрытьФорму(
		"Справочник.КонтролируемыеПартии.Форма.ФормаВыбора",
		ПараметрыФормы,
		ЭтотОбъект,
		,
		,
		,
		ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеИзТСД(Команда)
	
	ОчиститьСообщения();
	
	ОборудованиеТерминалыСбораДанныхКлиент.НачатьЗагрузкуДанныеИзТСД(
		Новый ОписаниеОповещения("ЗагрузитьИзТСДЗавершение", ЭтотОбъект),
		УникальныйИдентификатор);
		
КонецПроцедуры

&НаКлиенте
Процедура ОформитьИсследование(Команда)
	
	
	Возврат;
	
КонецПроцедуры

&НаКлиенте
Процедура ОформитьАктКонтроля(Команда)
	
	
	Возврат;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКачествоПодтверждено(Команда)
	
	Если Не ЕстьСтрокиДляВыполненияКоманды(НСтр("ru='""Качество подтверждаю""'")) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьКачествоПодтвержденоСервер(Истина);
	
КонецПроцедуры


&НаКлиенте
Процедура СнятьКачествоПодтверждено(Команда)
	
	Если Не ЕстьСтрокиДляВыполненияКоманды(НСтр("ru='""Качество подтверждаю""'")) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьКачествоПодтвержденоСервер(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область УправлениеВидимостью

&НаСервере
Процедура УстановитьВидимостьКолонкиКонтролируемаяПартия()
	
	ЭтоВходнойКонтроль = Объект.ПричинаБлокировкиТовара = Справочники.ПричиныБлокировкиТоваров.ВходнойКонтрольКачестваТовара;
	Элементы.ТоварыКонтролируемаяПартия.Видимость = ЭтоВходнойКонтроль;
	Элементы.ЗаполнитьПоОстаткам.Видимость = ЭтоВходнойКонтроль;
	Элементы.ЗаполнитьКонтролируемуюПартию.Видимость = ЭтоВходнойКонтроль;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	// Товары.Упаковка.
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыУпаковка.Имя);
	
	ГруппаЭлементов = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементов.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	
	ОтборЭлемента = ГруппаЭлементов.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ИспользоватьАдресноеХранение");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	ОтборЭлемента = ГруппаЭлементов.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.Упаковка");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	
	ОтборЭлемента = ГруппаЭлементов.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ТипНоменклатуры");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ТипыНоменклатуры.Товар;
	
	ОтборЭлемента = ГруппаЭлементов.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ТипИзмеряемойВеличины");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ТипыИзмеряемыхВеличин.КоличествоШтук;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	
	// Товары.Упаковка.
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыУпаковка.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.Упаковка");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НезаполненноеПолеТаблицы);
	
	// Товары.Серия.
	
	НоменклатураСервер.УстановитьУсловноеОформлениеСерийНоменклатуры(ЭтотОбъект, "СерииВсегдаВТЧТовары");
	
	// Товары.Характеристика.
	
	НоменклатураСервер.УстановитьУсловноеОформлениеХарактеристикНоменклатуры(ЭтотОбъект, "ТоварыХарактеристика");
	
	// Товары.ЕдиницаИзмерения.
	
	ПараметрыУсловногоОформления = НоменклатураСервер.НовыеПараметрыУсловногоОформленияЕдиницИзмерения(Истина, Истина);
	ПараметрыУсловногоОформления.ПутьКПолюИспользоватьАдресноеХранение = "Объект.Товары.ИспользоватьАдресноеХранение";
	НоменклатураСервер.УстановитьУсловноеОформлениеЕдиницИзмерения(ЭтотОбъект, ПараметрыУсловногоОформления);
	
	// Товары.Помещение.
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыПомещение.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ИспользоватьСкладскиеПомещения");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<помещения не используются>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаОтмененнойСтрокиДокумента);
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	
	// Товары.Ячейка.
	
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыЯчейка.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ИспользоватьАдресноеХранение");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<ячейки не используются>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаОтмененнойСтрокиДокумента);
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементовИсследованияКачестваТоваров()

	ИспользоватьИсследованиеКачестваТоваров = ИсследованияТоваровВключены();
	Элементы.Состояние.Видимость = ИспользоватьИсследованиеКачестваТоваров;
	Элементы.ОформитьАктКонтроля.Видимость = ИспользоватьИсследованиеКачестваТоваров;
	Элементы.ТоварыОформитьИсследование.Видимость = ИспользоватьИсследованиеКачестваТоваров;

КонецПроцедуры

#КонецОбласти

#Область ОбслуживаниеКоманд

&НаКлиентеНаСервереБезКонтекста
Функция ПроверитьЗаполнитьСкладПараметрыДействия(СкладШапки)
	
	Если ЗначениеЗаполнено(СкладШапки) Тогда
		ПараметрыДействия = Новый Структура("СкладПоУмолчанию", СкладШапки);
	Иначе
		ПараметрыДействия = Новый Структура("СкладПоУмолчаниюИзТекущейСтроки");
	КонецЕсли;
	Возврат ПараметрыДействия;
	
КонецФункции

#Область РаботаСБуферомОбмена

&НаСервере
Процедура СкопироватьСтрокиНаСервере(ВыделенныеСтроки)
	
	РаботаСТабличнымиЧастями.СкопироватьСтрокиВБуферОбмена(Объект.Товары, ВыделенныеСтроки);
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьСтрокиИзБуфераОбмена()
	
	ПараметрыОтбора = Новый Соответствие;
	ПараметрыОтбора.Вставить("Номенклатура.ТипНоменклатуры",
		НоменклатураКлиентСервер.ОтборПоТоваруМногооборотнойТаре(Ложь));
	
	Колонки =
		"Номенклатура,
		|Характеристика,
		|Назначение,
		|КонтролируемаяПартия,
		|Серия,
		|Склад,
		|Помещение,
		|Ячейка,
		|Упаковка,
		|КоличествоУпаковок,
		|КачествоПодтверждено";
	
	ТаблицаТоваров = РаботаСТабличнымиЧастями.СтрокиИзБуфераОбмена(ПараметрыОтбора, Колонки);
	
	Если Не ЗначениеЗаполнено(ТаблицаТоваров) Тогда
		Возврат;
	КонецЕсли;
	
	ОбрабатываемыеСтроки = Новый Массив();
	Для Каждого СтрокаТовара Из ТаблицаТоваров Цикл
		
		СтрокаТаблицы = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтрокаТовара);
		Если ЗначениеЗаполнено(Объект.Помещение) Тогда
			СтрокаТаблицы.Помещение = Объект.Помещение;
		КонецЕсли;
		ОбрабатываемыеСтроки.Добавить(СтрокаТаблицы);
		
	КонецЦикла;
	
	ЗаполнитьПризнакАртикул = Новый Структура("Номенклатура", "Артикул");
	ЗаполнитьПризнакТипНоменклатуры = Новый Структура("Номенклатура", "ТипНоменклатуры");
	ЗаполнитьПризнакТипИзмеряемойВеличины = Новый Структура("Номенклатура", "ТипИзмеряемойВеличины");
	ЗаполнитьПризнакХарактеристикиИспользуются = Новый Структура("Номенклатура", "ХарактеристикиИспользуются");
	ЗаполнитьПризнакИспользованияПомещений = Новый Структура("Дата", Объект.Дата);
	ЗаполнитьПризнакАдресногоХранения = Новый Структура("Дата", Объект.Дата);
	ПроверитьЗаполнитьСклад = ПроверитьЗаполнитьСкладПараметрыДействия(Объект.Склад);
	НоменклатураПриИзмененииПереопределяемый = Новый Структура("ИмяФормы, ИмяТабличнойЧасти",
		ИмяФормы, "Товары");
	
	СтруктураДействий = Новый Структура();
	СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", ЗаполнитьПризнакАртикул);
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", ЗаполнитьПризнакТипНоменклатуры);
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипИзмеряемойВеличины", ЗаполнитьПризнакТипИзмеряемойВеличины);
	СтруктураДействий.Вставить("ЗаполнитьПризнакХарактеристикиИспользуются", ЗаполнитьПризнакХарактеристикиИспользуются);
	СтруктураДействий.Вставить("НоменклатураПриИзмененииПереопределяемый", НоменклатураПриИзмененииПереопределяемый);
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	СтруктураДействий.Вставить("ЗаполнитьПризнакИспользованияПомещений", ЗаполнитьПризнакИспользованияПомещений);
	СтруктураДействий.Вставить("ЗаполнитьПризнакАдресногоХранения", ЗаполнитьПризнакАдресногоХранения);
	СтруктураДействий.Вставить("ПроверитьЗаполнитьСклад", ПроверитьЗаполнитьСклад);
	КэшированныеЗначения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(
		ОбрабатываемыеСтроки,
		СтруктураДействий,
		Объект.Товары,
		КэшированныеЗначения);
	
	ПустоеПомещение = Справочники.СкладскиеПомещения.ПустаяСсылка();
	ПустаяЯчейка = Справочники.СкладскиеЯчейки.ПустаяСсылка();
	Для Каждого СтрокаТаблицы Из ОбрабатываемыеСтроки Цикл
		
		Если Не СтрокаТаблицы.ИспользоватьСкладскиеПомещения Тогда
			СтрокаТаблицы.Помещение = ПустоеПомещение;
			СтрокаТаблицы.Ячейка = ПустаяЯчейка;
		КонецЕсли;
		
		Если Не СтрокаТаблицы.ИспользоватьАдресноеХранение Тогда
			СтрокаТаблицы.Ячейка = ПустаяЯчейка;
		КонецЕсли;
		
	КонецЦикла;
	
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий, ОбрабатываемыеСтроки);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьКомандБуфераОбмена()
	
	МассивЭлементов = Новый Массив();
	МассивЭлементов.Добавить("ВставитьСтроки");
	МассивЭлементов.Добавить("ТоварыКонтекстноеМенюВставитьСтроки");
	
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, МассивЭлементов, "Доступность",
		РаботаСТабличнымиЧастями.ЕстьСтрокиВБуфереОбмена());
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьКомандБуфераОбменаНаКлиенте()
	
	МассивЭлементов = Новый Массив();
	МассивЭлементов.Добавить("ВставитьСтроки");
	МассивЭлементов.Добавить("ТоварыКонтекстноеМенюВставитьСтроки");
	
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, МассивЭлементов, "Доступность", Истина);
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура РазбитьСтрокуЗавершение(НоваяСтрока, ДополнительныеПараметры) Экспорт 
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	Если НоваяСтрока <> Неопределено Тогда
		
		СтруктураДействий = Новый Структура();
		СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
		ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
		ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(НоваяСтрока, СтруктураДействий, КэшированныеЗначения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКонтролируемуюПартиюПослеВыбора(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьКонтролируемуюПартиюПослеВыбораСервер(ВыбранноеЗначение);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКонтролируемуюПартиюПослеВыбораСервер(ВыбранноеЗначение)
	
	Для Каждого Идентификатор Из Элементы.Товары.ВыделенныеСтроки Цикл
		
		Объект.Товары.НайтиПоИдентификатору(Идентификатор).КонтролируемаяПартия = ВыбранноеЗначение;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРезультатПроверкиКачестваПослеВыбора(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьРезультатПроверкиКачестваПослеВыбораСервер(ВыбранноеЗначение);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРезультатПроверкиКачестваПослеВыбораСервер(ВыбранноеЗначение)
	
	Для Каждого Идентификатор Из Элементы.Товары.ВыделенныеСтроки Цикл
		
		Объект.Товары.НайтиПоИдентификатору(Идентификатор).РезультатПроверкиКачества = ВыбранноеЗначение;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализацияНастройкиЗаполненияПоОстаткам()
	
	СхемаЗаполненияПоОстаткам = Документы.ЗаявкаНаКонтрольКачестваТоваров.ПолучитьМакет("СхемаЗаполненияПоОстаткам");
	
	ИменаТаблиц = ОбеспечениеВДокументахСервер.НовыеИменаТаблицДляРасчетаОстатковДляУстановкиДействий();
	ИменаТаблиц.ОстаткиКонтролируемыхПартий = "ЗапасыИПотребностиОстаткиКонтролируемыхПартий"; // @query-part-1
	ИменаТаблиц.Результат = "РасчетОстатковДляУстановкиДействий"; // @query-part-1
	ОбеспечениеВДокументахСервер.РасчетОстатковДляУстановкиДействий(
		СхемаЗаполненияПоОстаткам.НаборыДанных.Набор.Запрос, ИменаТаблиц);
	
	АдресСхемыНастройкаЗаполненияПоОстаткам = ПоместитьВоВременноеХранилище(
		СхемаЗаполненияПоОстаткам, УникальныйИдентификатор);
	НастройкиЗаполненияПоОстаткам.Инициализировать(
		Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыНастройкаЗаполненияПоОстаткам));
	НастройкиЗаполненияПоОстаткам.ЗагрузитьНастройки(СхемаЗаполненияПоОстаткам.НастройкиПоУмолчанию);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоОстаткамСервер(Знач КомпоновщикНастроек)
	
	Объект.Товары.Очистить();
	НастройкиЗаполненияПоОстаткам.ЗагрузитьНастройки(КомпоновщикНастроек.ПолучитьНастройки());
	НастройкиЗаполненияПоОстаткам.ЗагрузитьПользовательскиеНастройки(КомпоновщикНастроек.ПользовательскиеНастройки);
	
	СхемаКомпоновкиДанных = Документы.ЗаявкаНаКонтрольКачестваТоваров.ПолучитьМакет("СхемаЗаполненияПоОстаткам");
	НастройкиКомпоновки = НастройкиЗаполненияПоОстаткам.ПолучитьНастройки();
	НастройкиКомпоновки.ПараметрыДанных.Элементы.Найти("Регистратор").Значение = Объект.Ссылка;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,
		НастройкиКомпоновки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	Аналитики = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	КонтрольКачества.ДополнитьТаблицуАналитикКолонкамиОтключеннымиПоФО(Аналитики);
	Объект.Товары.Загрузить(КонтрольКачества.ОстаткиПоАналитикам(Аналитики, Истина, Объект.Дата, Объект.Ссылка));
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий);
	
	ОчиститьСкладПомещениеЕслиИхНесколько();
	
	УстановитьВидимостьСкладаИПомещения();
	ЗаполнитьСлужебныеРеквизитыПриЗаполненииТабличнойЧасти();
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаЗаполненияПоОстаткамЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт

	Если ТипЗнч(РезультатЗакрытия) = Тип("КомпоновщикНастроекКомпоновкиДанных") Тогда
		ЗаполнитьПоОстаткамСервер(РезультатЗакрытия);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение)
	
	ТаблицаТоваров = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресТоваровВХранилище);
	
	ОбрабатываемыеСтроки = Новый Массив();
	Для каждого СтрокаТовара Из ТаблицаТоваров Цикл
		
		СтрокаТаблицы = Объект.Товары.Добавить();
		ОбрабатываемыеСтроки.Добавить(СтрокаТаблицы);
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтрокаТовара,
			"Номенклатура,Характеристика,Упаковка,КоличествоУпаковок,Серия");
		
	КонецЦикла;
	
	ЗаполнитьПризнакАртикул = Новый Структура("Номенклатура", "Артикул");
	ЗаполнитьПризнакТипНоменклатуры = Новый Структура("Номенклатура", "ТипНоменклатуры");
	ЗаполнитьПризнакТипИзмеряемойВеличины = Новый Структура("Номенклатура", "ТипИзмеряемойВеличины");
	ЗаполнитьПризнакХарактеристикиИспользуются = Новый Структура("Номенклатура", "ХарактеристикиИспользуются");
	ЗаполнитьПризнакИспользованияПомещений = Новый Структура("Дата", Объект.Дата);
	ЗаполнитьПризнакАдресногоХранения = Новый Структура("Дата", Объект.Дата);
	ПроверитьЗаполнитьСклад = ПроверитьЗаполнитьСкладПараметрыДействия(Объект.Склад);
	НоменклатураПриИзмененииПереопределяемый = Новый Структура("ИмяФормы, ИмяТабличнойЧасти",
		ИмяФормы, "Товары");
	
	СтруктураДействий = Новый Структура();
	СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", ЗаполнитьПризнакАртикул);
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", ЗаполнитьПризнакТипНоменклатуры);
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипИзмеряемойВеличины", ЗаполнитьПризнакТипИзмеряемойВеличины);
	СтруктураДействий.Вставить("ЗаполнитьПризнакХарактеристикиИспользуются", ЗаполнитьПризнакХарактеристикиИспользуются);
	СтруктураДействий.Вставить("НоменклатураПриИзмененииПереопределяемый", НоменклатураПриИзмененииПереопределяемый);
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	СтруктураДействий.Вставить("ПроверитьЗаполнитьСклад", ПроверитьЗаполнитьСклад);
	СтруктураДействий.Вставить("ЗаполнитьПомещениеВСтрокеТЧ", Объект.Помещение);
	СтруктураДействий.Вставить("ЗаполнитьПризнакИспользованияПомещений", ЗаполнитьПризнакИспользованияПомещений);
	СтруктураДействий.Вставить("ЗаполнитьПризнакАдресногоХранения", ЗаполнитьПризнакАдресногоХранения);
	
	КэшированныеЗначения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(
		ОбрабатываемыеСтроки,
		СтруктураДействий,
		Объект.Товары,
		КэшированныеЗначения);
		
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий, ОбрабатываемыеСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПоискПоШтрихкодуЗавершение(ДанныхШтрихкода, ДополнительныеПараметры) Экспорт
	
	ОбработатьШтрихкоды(ДанныхШтрихкода);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзТСДЗавершение(Результат, Параметры) Экспорт
	
	Если Результат.Результат Тогда
		ОбработатьШтрихкоды(Результат.ТаблицаТоваров);
	Иначе
		МенеджерОборудованияУТКлиент.СообщитьОбОшибке(Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШтрихкоды(ДанныеШтрихкодов)
	
	ОчиститьСообщения();
	
	Если Не ШтрихкодированиеНоменклатурыКлиент.ШтрихкодыВалидны(ДанныеШтрихкодов) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПризнакАртикул = Новый Структура("Номенклатура", "Артикул");
	ЗаполнитьПризнакТипНоменклатуры = Новый Структура("Номенклатура", "ТипНоменклатуры");
	ЗаполнитьПризнакТипИзмеряемойВеличины = Новый Структура("Номенклатура", "ТипИзмеряемойВеличины");
	ЗаполнитьПризнакХарактеристикиИспользуются = Новый Структура("Номенклатура", "ХарактеристикиИспользуются");
	ЗаполнитьПризнакИспользованияПомещений = Новый Структура("Дата", Объект.Дата);
	ЗаполнитьПризнакАдресногоХранения = Новый Структура("Дата", Объект.Дата);
	НоменклатураПриИзмененииПереопределяемый = Новый Структура("ИмяФормы, ИмяТабличнойЧасти",
		ИмяФормы, "Товары");
	ПроверитьЗаполнитьСклад = ПроверитьЗаполнитьСкладПараметрыДействия(Объект.Склад);
	ПроверитьСериюРассчитатьСтатус = Новый Структура("Склад, ПараметрыУказанияСерий", Объект.Склад, ПараметрыУказанияСерий);
	
	СтруктураДействийСДобавленнымиСтроками = Новый Структура();
	СтруктураДействийСДобавленнымиСтроками.Вставить("ЗаполнитьПризнакАртикул", ЗаполнитьПризнакАртикул);
	СтруктураДействийСДобавленнымиСтроками.Вставить("ЗаполнитьПризнакТипНоменклатуры", ЗаполнитьПризнакТипНоменклатуры);
	СтруктураДействийСДобавленнымиСтроками.Вставить("ЗаполнитьПризнакТипИзмеряемойВеличины", ЗаполнитьПризнакТипИзмеряемойВеличины);
	СтруктураДействийСДобавленнымиСтроками.Вставить("ЗаполнитьПризнакХарактеристикиИспользуются", ЗаполнитьПризнакХарактеристикиИспользуются);
	СтруктураДействийСДобавленнымиСтроками.Вставить("НоменклатураПриИзмененииПереопределяемый", НоменклатураПриИзмененииПереопределяемый);
	СтруктураДействийСДобавленнымиСтроками.Вставить("ПересчитатьКоличествоЕдиниц");
	СтруктураДействийСДобавленнымиСтроками.Вставить("ПроверитьЗаполнитьСклад", ПроверитьЗаполнитьСклад);
	СтруктураДействийСДобавленнымиСтроками.Вставить("ЗаполнитьПомещениеВСтрокеТЧ", Объект.Помещение);
	СтруктураДействийСДобавленнымиСтроками.Вставить("ЗаполнитьПризнакИспользованияПомещений", ЗаполнитьПризнакИспользованияПомещений);
	СтруктураДействийСДобавленнымиСтроками.Вставить("ЗаполнитьПризнакАдресногоХранения", ЗаполнитьПризнакАдресногоХранения);
	СтруктураДействийСДобавленнымиСтроками.Вставить("ПроверитьСериюРассчитатьСтатус", ПроверитьСериюРассчитатьСтатус);
	
	СтруктураДействийСИзмененнымиСтроками = Новый Структура();
	СтруктураДействийСИзмененнымиСтроками.Вставить("ПересчитатьКоличествоЕдиниц");
	
	ПараметрыОбработкиШтрихкодов = ШтрихкодированиеНоменклатурыКлиент.ПараметрыОбработкиШтрихкодов();
	
	ПараметрыОбработкиШтрихкодов.Штрихкоды = ДанныеШтрихкодов;
	ПараметрыОбработкиШтрихкодов.СтруктураДействийСДобавленнымиСтроками = СтруктураДействийСДобавленнымиСтроками;
	ПараметрыОбработкиШтрихкодов.СтруктураДействийСИзмененнымиСтроками = СтруктураДействийСИзмененнымиСтроками;
	ПараметрыОбработкиШтрихкодов.ПараметрыУказанияСерий = ПараметрыУказанияСерий;
	ПараметрыОбработкиШтрихкодов.ИзменятьКоличество = Истина;
	ПараметрыОбработкиШтрихкодов.ТолькоТовары = Истина;
	ПараметрыОбработкиШтрихкодов.ИмяТЧ = "Товары";
	
	ОбработатьШтрихкодыСервер(ПараметрыОбработкиШтрихкодов, КэшированныеЗначения);
	
	ШтрихкодированиеНоменклатурыКлиент.ОбработатьНеизвестныеШтрихкоды(ПараметрыОбработкиШтрихкодов,
		КэшированныеЗначения, ЭтотОбъект);
	
	Если ШтрихкодированиеНоменклатурыКлиент.НужноОткрытьФормуУказанияСерийПослеОбработкиШтрихкодов(ПараметрыОбработкиШтрихкодов) Тогда
		ТекущиеДанныеИдентификатор = ПараметрыОбработкиШтрихкодов.МассивСтрокССериями[0];
		
		ПодключитьОбработчикОжидания("ОткрытьПодборСерийПриСканированииШтрихкодаНоменклатуры", 0.1, Истина);
	КонецЕсли;
	
	Если ПараметрыОбработкиШтрихкодов.ТекущаяСтрока <> Неопределено Тогда
		Элементы.Товары.ТекущаяСтрока = ПараметрыОбработкиШтрихкодов.ТекущаяСтрока;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьШтрихкодыСервер(СтруктураПараметровДействия, КэшированныеЗначения)
	
	ТипыНоменклатуры = НоменклатураСервер.ДопустимыеТипыНоменклатурыДляВыбора(
		Перечисления.ХозяйственныеОперации.КонтрольКачестваТоваров);
	
	ЕстьРаботы = ТипыНоменклатуры.Найти(Перечисления.ТипыНоменклатуры.Работа) <> Неопределено;
	ЕстьУслуги = ТипыНоменклатуры.Найти(Перечисления.ТипыНоменклатуры.Услуга) <> Неопределено;
	
	СтруктураПараметровДействия.ТолькоТовары = Не (ЕстьРаботы Или ЕстьУслуги);
	СтруктураПараметровДействия.ТолькоТоварыИРабота = ЕстьРаботы И Не ЕстьУслуги;
	СтруктураПараметровДействия.ТолькоТоварыИУслуги = ЕстьУслуги И Не ЕстьРаботы;
	
	ШтрихкодированиеНоменклатурыСервер.ОбработатьШтрихкоды(ЭтотОбъект,
		Объект, СтруктураПараметровДействия, КэшированныеЗначения);
	
КонецПроцедуры

&НаКлиенте
Функция ЕстьСтрокиДляВыполненияКоманды(Поле)
	
	Если Объект.Товары.Количество() = 0 Тогда
		
		Текст = НСтр("ru='В документе не заполнен список ""Товары"". Поле %1 не может быть заполнено.'");
		ПоказатьПредупреждение(, СтрШаблон(Текст, Поле));
		Возврат Ложь;
		
	ИначеЕсли Элементы.Товары.ВыделенныеСтроки.Количество() = 0 Тогда
		
		Текст = НСтр("ru='В документе отсутствуют выделенные строки товаров. Выделите строки для заполнения поля %1.'");
		ПоказатьПредупреждение(, СтрШаблон(Текст, Поле));
		Возврат Ложь;
		
	КонецЕсли;
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ОчиститьСкладПомещениеЕслиИхНесколько()
	
	Если ЗначениеЗаполнено(Объект.Склад) Или ЗначениеЗаполнено(Объект.Помещение) Тогда
		Для Каждого СтрокаТовары Из Объект.Товары Цикл
			Если ЗначениеЗаполнено(Объект.Склад) И СтрокаТовары.Склад <> Объект.Склад Тогда
				Объект.Склад = Справочники.Склады.ПустаяСсылка();
			КонецЕсли;
			Если ЗначениеЗаполнено(Объект.Помещение) И СтрокаТовары.Помещение <> Объект.Помещение Тогда
				Объект.Помещение = Справочники.СкладскиеПомещения.ПустаяСсылка();
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОчиститьСкладПомещениеПоДаннымТабличнойЧастиДокумента()
	КонтрольКачества.ЗаполнитьОчиститьСкладПомещениеПоДаннымТабличнойЧастиДокумента(Объект);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКачествоПодтвержденоСервер(ВыбранноеЗначение)
	
	Для Каждого Идентификатор Из Элементы.Товары.ВыделенныеСтроки Цикл
		
		Объект.Товары.НайтиПоИдентификатору(Идентификатор).КачествоПодтверждено = ВыбранноеЗначение;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Подсистемы

// ИнтеграцияС1СДокументооборотом

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда,
		ЭтотОбъект, Объект);
	
КонецПроцедуры

// Конец ИнтеграцияС1СДокументооборотом

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтотОбъект, Команда);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура СвойстваВыполнитьОтложеннуюИнициализацию()
	УправлениеСвойствами.ЗаполнитьДополнительныеРеквизитыВФорме(ЭтотОбъект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти

#Область Серии

&НаКлиенте
Процедура ОткрытьПодборСерийПриСканированииШтрихкодаНоменклатуры()
	
	Если ТекущиеДанныеИдентификатор = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(ТекущиеДанныеИдентификатор);
	ОткрытьПодборСерий(,ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодборСерий(Текст = "", ТекущиеДанные = Неопределено)
	
	НуженСерверныйВызов = НоменклатураКлиент.ДляУказанияСерийНуженСерверныйВызов(
		ЭтотОбъект,
		ПараметрыУказанияСерий,
		Текст,
		ТекущиеДанные);
		
	Если НуженСерверныйВызов Тогда
		
		Если ТекущиеДанные = Неопределено Тогда
			ТекущиеДанныеИдентификатор = Элементы.Товары.ТекущиеДанные.ПолучитьИдентификатор();
		Иначе
			ТекущиеДанныеИдентификатор = ТекущиеДанные.ПолучитьИдентификатор();
		КонецЕсли;
		
		ПараметрыФормыУказанияСерий = ПараметрыФормыУказанияСерий(ТекущиеДанныеИдентификатор);
		
		ТекущиеПараметрыУказанияСерий = Новый Структура("ПараметрыФормыУказанияСерий", ПараметрыФормыУказанияСерий);
		
		ОписаниеОповещения = Новый ОписаниеОповещения(
			"ОткрытьПодборСерийЗавершение",
			ЭтотОбъект,
			ТекущиеПараметрыУказанияСерий);
		
		ОткрытьФорму(
			ПараметрыФормыУказанияСерий.ИмяФормы,
			ПараметрыФормыУказанияСерий,
			ЭтотОбъект,
			,
			,
			,
			ОписаниеОповещения,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодборСерийЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ЗначениеВозврата = Результат;
	Если ЗначениеВозврата <> Неопределено Тогда
		ОбработатьУказаниеСерийСервер(ДополнительныеПараметры.ПараметрыФормыУказанияСерий, КэшированныеЗначения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьУказаниеСерийСервер(ПараметрыФормыУказанияСерий, КэшированныеЗначения)
	
	ПроверитьСериюРассчитатьСтатус = Новый Структура("Склад, ПараметрыУказанияСерий", Объект.Склад, ПараметрыУказанияСерий);
	
	СтруктураДействий = Новый Структура();
	СтруктураДействий.Вставить("ПроверитьСериюРассчитатьСтатус", ПроверитьСериюРассчитатьСтатус);
	
	НоменклатураСервер.ОбработатьУказаниеСерий(
		Объект,
		ПараметрыУказанияСерий,
		ПараметрыФормыУказанияСерий,
		СтруктураДействий,
		КэшированныеЗначения);
	
КонецПроцедуры

&НаСервере
Функция ПараметрыФормыУказанияСерий(ТекущиеДанныеИдентификатор)
	
	Возврат НоменклатураСервер.ПараметрыФормыУказанияСерий(
		Объект,
		ПараметрыУказанияСерий,
		ТекущиеДанныеИдентификатор,
		ЭтотОбъект);
	
КонецФункции

#КонецОбласти

#Область ИзменениеРеквизитовДокумента

&НаСервере
Процедура ПричинаБлокировкиТовараПриИзмененииСервер()
	
	УстановитьВидимостьКолонкиКонтролируемаяПартия();
	Если Объект.ПричинаБлокировкиТовара = Справочники.ПричиныБлокировкиТоваров.ВходнойКонтрольКачестваТовара Тогда
		
		Объект.ПланироватьРазблокировкуТоваров = Истина;
		
	Иначе
		
		ПустаяПартия = Справочники.КонтролируемыеПартии.ПустаяСсылка();
		Для Каждого СтрокаТаблицы Из Объект.Товары Цикл
			СтрокаТаблицы.КонтролируемаяПартия = ПустаяПартия;
		КонецЦикла;
		
		Тексты = Новый Массив();
		Текст = ОбеспечениеВДокументахСервер.ВременнаяТаблицаГодыГрафикаПредприятия();
		Тексты.Добавить(Текст);
		
		Текст =
			"ВЫБРАТЬ
			|	ПричиныБлокировки.ПланироватьРазблокировкуТоваров КАК ПланироватьРазблокировкуТоваров,
			|	РасчетДаты.НайденнаяДата КАК ДатаПодтвержденияКачества
			|ИЗ
			|	Справочник.ПричиныБлокировкиТоваров КАК ПричиныБлокировки
			|		ЛЕВОЕ СОЕДИНЕНИЕ РасчетДаты ПО ИСТИНА
			|ГДЕ
			|	ПричиныБлокировки.Ссылка = &Ссылка";
		
		Подстановки = ОбеспечениеВДокументахСервер.ДобавитьКДатеПоКалендарюПредприятия(
			"&Дата",
			"ПричиныБлокировки.ДлительностьКонтроляКачества");
		
		Текст = СтрЗаменить(Текст, "РасчетДаты.НайденнаяДата", Подстановки.Поле);
		Текст = СтрЗаменить(Текст, "ЛЕВОЕ СОЕДИНЕНИЕ РасчетДаты ПО ИСТИНА", Подстановки.Соединения);
		
		Тексты.Добавить(Текст);
		
		Запрос = Новый Запрос();
		Запрос.Текст = СтрСоединить(Тексты, ОбщегоНазначения.РазделительПакетаЗапросов());
		Запрос.УстановитьПараметр("Дата", НачалоДня(?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДатаСеанса())));
		Запрос.УстановитьПараметр("Ссылка", Объект.ПричинаБлокировкиТовара);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Объект.ПланироватьРазблокировкуТоваров = Ложь;
		Объект.ДатаПодтвержденияКачества = '00010101';
		
		Если Выборка.Следующий() Тогда
			
			Объект.ПланироватьРазблокировкуТоваров = Выборка.ПланироватьРазблокировкуТоваров;
			Если Выборка.ПланироватьРазблокировкуТоваров Тогда
				Объект.ДатаПодтвержденияКачества = Выборка.ДатаПодтвержденияКачества;
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииСкладаСервер()
	
	УстановитьВидимостьСкладаИПомещения();
	
	// Очистка склада означает только, что он и помещения теперь указываются в таблице.
	Если ЗначениеЗаполнено(Объект.Склад) Тогда
		
		ПустоеПомещение = Справочники.СкладскиеПомещения.ПустаяСсылка();
		Объект.Помещение = ПустоеПомещение;
		
		ПроверитьЗаполнитьСклад = ПроверитьЗаполнитьСкладПараметрыДействия(Объект.Склад);
		ЗаполнитьПризнакИспользованияПомещений = Новый Структура("Дата", Объект.Дата);
		ЗаполнитьПризнакАдресногоХранения = Новый Структура("Дата", Объект.Дата);
		ПроверитьСериюРассчитатьСтатус = Новый Структура("Склад, ПараметрыУказанияСерий", Объект.Склад, ПараметрыУказанияСерий);
		
		СтруктураДействий = Новый Структура();
		СтруктураДействий.Вставить("ПроверитьЗаполнитьСклад", ПроверитьЗаполнитьСклад);
		СтруктураДействий.Вставить("ЗаполнитьПомещениеВСтрокеТЧ", Объект.Помещение);
		СтруктураДействий.Вставить("ЗаполнитьПризнакИспользованияПомещений", ЗаполнитьПризнакИспользованияПомещений);
		СтруктураДействий.Вставить("ЗаполнитьПризнакАдресногоХранения", ЗаполнитьПризнакАдресногоХранения);
		СтруктураДействий.Вставить("ПроверитьСериюРассчитатьСтатус", ПроверитьСериюРассчитатьСтатус);
		ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Объект.Товары, СтруктураДействий);
		ОчиститьУпаковкуДляСтрокБезАдресногоХранения();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииДатыСервер()
	
	ЗаполнитьПризнакИспользованияПомещений = Новый Структура("Дата", Объект.Дата);
	ЗаполнитьПризнакАдресногоХранения = Новый Структура("Дата", Объект.Дата);
	
	СтруктураДействий = Новый Структура();
	СтруктураДействий.Вставить("ЗаполнитьПризнакИспользованияПомещений", ЗаполнитьПризнакИспользованияПомещений);
	СтруктураДействий.Вставить("ЗаполнитьПризнакАдресногоХранения", ЗаполнитьПризнакАдресногоХранения);
	
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Объект.Товары, СтруктураДействий);
	
	ВидимостьПомещенияДоИзменения = Элементы.Помещение.Видимость;
	УстановитьВидимостьСкладаИПомещения();
	ОчиститьПомещение = ВидимостьПомещенияДоИзменения И Не Элементы.Помещение.Видимость;
	
	Если ОчиститьПомещение Тогда
		ПустоеПомещение = Справочники.СкладскиеПомещения.ПустаяСсылка();
		Объект.Помещение = ПустоеПомещение;
		Для Каждого Строка Из Объект.Товары Цикл
			Строка.Помещение = ПустоеПомещение;
		КонецЦикла;
		ОчиститьУпаковкуДляСтрокБезАдресногоХранения();
	КонецЕсли;
	
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий);
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииПомещенияСервер()
	
	// Очистка помещения означает только, что оно теперь указываются в таблице.
	Если ЗначениеЗаполнено(Объект.Помещение) Тогда
		Для Каждого Строка Из Объект.Товары Цикл
			Строка.Помещение = Объект.Помещение;
		КонецЦикла;
		СтруктураДействий = Новый Структура();
		ЗаполнитьПризнакАдресногоХранения = Новый Структура("Дата", Объект.Дата);
		СтруктураДействий.Вставить("ЗаполнитьПризнакАдресногоХранения", ЗаполнитьПризнакАдресногоХранения);
		ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Объект.Товары, СтруктураДействий);
		ОчиститьУпаковкуДляСтрокБезАдресногоХранения();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьУпаковкуДляСтрокБезАдресногоХранения()
	
	Для Каждого Строка Из Объект.Товары Цикл
		
		Если Не Строка.ИспользоватьАдресноеХранение Тогда
			Строка.Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
			Строка.Количество = Строка.КоличествоУпаковок;
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОчиститьУпаковкуДляСтрокБезАдресногоХраненияВСтроке(СтрокаТаблицы)
	
	Если Не СтрокаТаблицы.ИспользоватьАдресноеХранение Тогда
		СтрокаТаблицы.Упаковка = ПредопределенноеЗначение("Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка");
		СтрокаТаблицы.Количество = СтрокаТаблицы.КоличествоУпаковок;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьСкладаИПомещения()
	
	ИспользоватьСкладскиеПомещения = СкладыСервер.ИспользоватьСкладскиеПомещения(Объект.Склад, Объект.Дата)
		И ЗначениеЗаполнено(Объект.Склад);
	Элементы.Помещение.Видимость = ИспользоватьСкладскиеПомещения;
	Элементы.ТоварыСклад.Видимость = Не ЗначениеЗаполнено(Объект.Склад);
	Элементы.ТоварыПомещение.Видимость = Не ЗначениеЗаполнено(Объект.Склад)
		Или Не ЗначениеЗаполнено(Объект.Помещение) И ИспользоватьСкладскиеПомещения;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьДатаПодтвержденияКачестваНаКлиенте()
	Элементы.ДатаПодтвержденияКачества.Доступность = Объект.ПланироватьРазблокировкуТоваров;
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьДатаПодтвержденияКачестваНаСервере()
	Элементы.ДатаПодтвержденияКачества.Доступность = Объект.ПланироватьРазблокировкуТоваров;
КонецПроцедуры

#КонецОбласти


#Область Прочие

&НаСервере
Функция ИсследованияТоваровВключены()
	
	ИспользоватьИсследования = Ложь;
	Возврат ИспользоватьИсследования;
	
КонецФункции

#КонецОбласти

&НаКлиенте
Процедура ОповеститьОПроведенииДокумента(ПараметрыЗаписи)
	
	ПараметрОбработкиОповещения = ОбщегоНазначенияКлиент.СкопироватьРекурсивно(ПараметрыЗаписи);
	Если ТипЗнч(ВладелецФормы) = Тип("ФормаКлиентскогоПриложения") Тогда
		ИдентификаторФормыВладельца = ВладелецФормы.УникальныйИдентификатор;
	Иначе
		ИдентификаторФормыВладельца = Неопределено;
	КонецЕсли;
	КлючиДокументаОповещение = РаботаСЖурналамиДокументовКлиент.ПолучитьПараметрыКлючаПоДокументу(
		Объект.Ссылка, Объект.Дата, Неопределено);
	ПараметрОбработкиОповещения.Вставить("ИдентификаторФормыВладельца", ИдентификаторФормыВладельца);
	ПараметрОбработкиОповещения.Вставить("КлючиДокументаОповещение", КлючиДокументаОповещение);
	Оповестить("Запись_ЗаявкаНаКонтрольКачестваТоваров", ПараметрОбработкиОповещения, Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	// Управление видимостью.
	УстановитьУсловноеОформление();
	Элементы.ГруппаОснование.Видимость = ЗначениеЗаполнено(Объект.ДокументОснование);
	
	ТекущиеПараметрыУказанияСерий = НоменклатураСервер.ПараметрыУказанияСерий(
		Объект,
		Документы.ЗаявкаНаКонтрольКачестваТоваров);
	ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(ТекущиеПараметрыУказанияСерий);
	
	УстановитьВидимостьСкладаИПомещения();
	УстановитьДоступностьДатаПодтвержденияКачестваНаСервере();
	УстановитьВидимостьКолонкиКонтролируемаяПартия();
	ЗаполнитьСлужебныеРеквизитыПриЗаполненииТабличнойЧасти();
	
	УстановитьВидимостьЭлементовИсследованияКачестваТоваров();
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСлужебныеРеквизитыПриЗаполненииТабличнойЧасти()
	
	ЗаполнитьПризнакАртикул = Новый Структура("Номенклатура", "Артикул");
	ЗаполнитьПризнакТипНоменклатуры = Новый Структура("Номенклатура", "ТипНоменклатуры");
	ЗаполнитьПризнакТипИзмеряемойВеличины = Новый Структура("Номенклатура", "ТипИзмеряемойВеличины");
	ЗаполнитьПризнакХарактеристикиИспользуются = Новый Структура("Номенклатура", "ХарактеристикиИспользуются");
	ЗаполнитьПризнакИспользованияПомещений = Новый Структура("Дата", Объект.Дата);
	ЗаполнитьПризнакАдресногоХранения = Новый Структура("Дата", Объект.Дата);
	
	СтруктураДействий = Новый Структура();
	СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", ЗаполнитьПризнакАртикул);
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", ЗаполнитьПризнакТипНоменклатуры);
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипИзмеряемойВеличины", ЗаполнитьПризнакТипИзмеряемойВеличины);
	СтруктураДействий.Вставить("ЗаполнитьПризнакХарактеристикиИспользуются", ЗаполнитьПризнакХарактеристикиИспользуются);
	СтруктураДействий.Вставить("ЗаполнитьПризнакИспользованияПомещений", ЗаполнитьПризнакИспользованияПомещений);
	СтруктураДействий.Вставить("ЗаполнитьПризнакАдресногоХранения", ЗаполнитьПризнакАдресногоХранения);
	
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Объект.Товары, СтруктураДействий);
	
КонецПроцедуры


#КонецОбласти