#Область ПрограммныйИнтерфейс

#Область Формат_V1

Функция СоздатьБизнесЗаказНаЭмиссиюКодовМаркировки_V1(ТелоЗапросаJSON, ПараметрыСУЗ) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("РезультатОтправкиЗапроса", Неопределено);
	ВозвращаемоеЗначение.Вставить("Операция",                 Перечисления.ВидыОперацийИСМП.ЗаказНаЭмиссиюКодовМаркировки);
	ВозвращаемоеЗначение.Вставить("СтатусОбработки",          Неопределено);
	ВозвращаемоеЗначение.Вставить("ДанныеБизнесЗаказа",       Неопределено);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",              "");

	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type",   "application/json; charset=utf-8");
	ЗаголовокHTTP.Вставить("Accept",         "application/json");
	ЗаголовокHTTP.Вставить("clientToken",    ПараметрыСУЗ.Токен);
	
	URLЗапроса = "api/orders";
	РезультатЗапроса = ОбменДаннымиИСМПКлиентСервер.ОтправитьДанныеВСервис(URLЗапроса, ТелоЗапросаJSON, Неопределено, "POST", ПараметрыСУЗ, ЗаголовокHTTP);
	
	РезультатОтправкиЗапроса = ОбменДаннымиИСМПКлиентСервер.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON(РезультатЗапроса);
	
	ВозвращаемоеЗначение.РезультатОтправкиЗапроса = РезультатОтправкиЗапроса;
	
	Если РезультатОтправкиЗапроса.ОтветПолучен Тогда
		
		Если РезультатОтправкиЗапроса.КодСостояния = 200 Тогда
			
			ДанныеОбработки = ОбменДаннымиИСМПКлиентСервер.ТекстJSONВОбъект(РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON);
			
			Если ДанныеОбработки = Неопределено Тогда
				
				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
				
				ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
					URLЗапроса,
					РезультатОтправкиЗапроса);
				
			Иначе
				
				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаПринята;
				
				ПроверятьПосле = ТекущаяДатаСеанса() + Окр(ДанныеОбработки.expectedCompleteTimestamp / 1000, 0, РежимОкругления.Окр15как20);
				
				ДанныеБизнесЗаказа = Новый Структура;
				ДанныеБизнесЗаказа.Вставить("ИдентификаторЗаявки", ДанныеОбработки.orderId);
				ДанныеБизнесЗаказа.Вставить("ПроверятьПосле",      ПроверятьПосле);
				
				ВозвращаемоеЗначение.ДанныеБизнесЗаказа = ДанныеБизнесЗаказа;
				
			КонецЕсли;
			
			Возврат ВозвращаемоеЗначение;
			
		ИначеЕсли РезультатОтправкиЗапроса.КодСостояния = 400 Тогда
			
			ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена;
			
			ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
				URLЗапроса,
				РезультатОтправкиЗапроса);
			
		Иначе
			
			ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
			
			ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
				URLЗапроса,
				РезультатОтправкиЗапроса);
			
		КонецЕсли;
		
	Иначе
		
		ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
		
		ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
			URLЗапроса,
			РезультатОтправкиЗапроса);
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция СтатусПулаКодовМаркировкиИзБизнесЗаказа_V1(ПараметрыЗапроса, ПараметрыСУЗ) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("РезультатОтправкиЗапроса", Неопределено);
	ВозвращаемоеЗначение.Вставить("Операция",                 Перечисления.ВидыОперацийИСМП.ПолучениеСтатусаПулаКодовМаркировкиИзСУЗ);
	ВозвращаемоеЗначение.Вставить("СтатусОбработки",          Перечисления.СтатусыОбработкиСообщенийИСМП.ПустаяСсылка());
	ВозвращаемоеЗначение.Вставить("ДанныеПула",               Неопределено);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",              "");
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type",   "application/x-www-form-urlencoded;charset=UTF-8");
	ЗаголовокHTTP.Вставить("Accept",         "application/json");
	ЗаголовокHTTP.Вставить("Accept-Charset", "utf-8");
	ЗаголовокHTTP.Вставить("clientToken",    ПараметрыСУЗ.Токен);
	
	URLЗапроса = СтрШаблон(
		"api/poolStatus?orderId=%1&orderLineId=%2",
		КодироватьСтроку(ПараметрыЗапроса.ИдентификаторБизнесЗаказа, СпособКодированияСтроки.КодировкаURL),
		КодироватьСтроку(ПараметрыЗапроса.ИдентификаторСтрокиЗаказа, СпособКодированияСтроки.КодировкаURL));
	
	РезультатЗапроса = ОбщегоНазначенияИСМП.ПолучитьДанныеИзСервиса(URLЗапроса, Неопределено, ПараметрыСУЗ, ЗаголовокHTTP);
	
	РезультатОтправкиЗапроса = ОбменДаннымиИСМПКлиентСервер.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON(РезультатЗапроса);
	
	ВозвращаемоеЗначение.РезультатОтправкиЗапроса = РезультатОтправкиЗапроса;
	
	Если РезультатОтправкиЗапроса.ОтветПолучен Тогда
		
		Если РезультатОтправкиЗапроса.КодСостояния = 200 Тогда
			
			ДанныеОбработки = ОбменДаннымиИСМПКлиентСервер.ТекстJSONВОбъект(РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON);
			
			Если ДанныеОбработки = Неопределено Тогда
				
				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
				
				ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
					URLЗапроса,
					РезультатОтправкиЗапроса);
				
			Иначе
				
				Статус = ИнтерфейсСУЗСлужебный.СтатусПулаКодовМаркировки_V1(ДанныеОбработки.status);
				
				ДанныеПула = Новый Структура;
				ДанныеПула.Вставить("GTIN",       ДанныеОбработки.gtin);
				ДанныеПула.Вставить("Количество", ДанныеОбработки.quantity);
				ДанныеПула.Вставить("Остаток",    ДанныеОбработки.left);
				ДанныеПула.Вставить("Статус",     Статус);
				
				Если Статус = Перечисления.СтатусыПулаКодовМаркировкиСУЗ.Обрабатывается Тогда
					ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОбрабатывается;
				ИначеЕсли Статус = Перечисления.СтатусыПулаКодовМаркировкиСУЗ.Ошибка Тогда
					ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена;
				Иначе
					ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена;
				КонецЕсли;
				
				ВозвращаемоеЗначение.ДанныеПула = ДанныеПула;
				
			КонецЕсли;
			
		Иначе
			
			ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
			
			ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
				URLЗапроса,
				РезультатОтправкиЗапроса);
			
		КонецЕсли;
		
	Иначе
		
		ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
		
		ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
			URLЗапроса,
			РезультатОтправкиЗапроса);
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ЗапроситьКодыМаркировкиИзБизнесЗаказа_V1(ПараметрыЗапроса, КоличествоКодовМаркировки, ПараметрыСУЗ) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("РезультатОтправкиЗапроса", Неопределено);
	ВозвращаемоеЗначение.Вставить("Операция",                 Перечисления.ВидыОперацийИСМП.ПолучениеКодовМаркировкиИзСУЗ);
	ВозвращаемоеЗначение.Вставить("СтатусОбработки",          Неопределено);
	ВозвращаемоеЗначение.Вставить("ДанныеБлока",              Неопределено);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",              "");
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type",   "application/x-www-form-urlencoded;charset=UTF-8");
	ЗаголовокHTTP.Вставить("Accept",         "application/json");
	ЗаголовокHTTP.Вставить("Accept-Charset", "utf-8");
	ЗаголовокHTTP.Вставить("clientToken",    ПараметрыСУЗ.Токен);
	
	URLЗапроса = СтрШаблон(
		"api/codes?orderId=%1&orderLineId=%2&quantity=%3",
		КодироватьСтроку(ПараметрыЗапроса.ИдентификаторБизнесЗаказа, СпособКодированияСтроки.КодировкаURL),
		КодироватьСтроку(ПараметрыЗапроса.ИдентификаторСтрокиЗаказа, СпособКодированияСтроки.КодировкаURL),
		Формат(КоличествоКодовМаркировки, "ЧГ=0;"));
	
	РезультатЗапроса = ОбщегоНазначенияИСМП.ПолучитьДанныеИзСервиса(URLЗапроса, Неопределено, ПараметрыСУЗ, ЗаголовокHTTP);
	
	РезультатОтправкиЗапроса = ОбменДаннымиИСМПКлиентСервер.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON(РезультатЗапроса);
	
	ВозвращаемоеЗначение.РезультатОтправкиЗапроса = РезультатОтправкиЗапроса;
	
	Если РезультатОтправкиЗапроса.ОтветПолучен Тогда
		
		Если РезультатОтправкиЗапроса.КодСостояния = 200 Тогда
			
			// Ожидаемый результат запроса:
			// Массив Из Строка - Массив кодов маркировки
			ДанныеОбработки = ОбменДаннымиИСМПКлиентСервер.ТекстJSONВОбъект(РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON);
			Если ДанныеОбработки = Неопределено Тогда
				
				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
				
				ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
					URLЗапроса,
					РезультатОтправкиЗапроса);
				
			Иначе
				
				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена;
				
				ДанныеБлока = Новый Структура;
				ДанныеБлока.Вставить("КодыМаркировки",                    ДанныеОбработки);
				ДанныеБлока.Вставить("ИдентификаторПоследнегоБлокаКодов", 0);
				
				ВозвращаемоеЗначение.ДанныеБлока = ДанныеБлока;
				
			КонецЕсли;
			
		Иначе
			
			ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
			
			ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
				URLЗапроса,
				РезультатОтправкиЗапроса);
			
		КонецЕсли;
		
	Иначе
		
		ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
		
		ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
			URLЗапроса,
			РезультатОтправкиЗапроса);
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ПередатьОтчетОбИспользованииКодовМаркировкиБизнесЗаказа_V1(ТелоЗапроса, ПараметрыСУЗ) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("РезультатОтправкиЗапроса", Неопределено);
	ВозвращаемоеЗначение.Вставить("Операция",                 Перечисления.ВидыОперацийИСМП.ОтчетОбИспользованииКодовМаркировки);
	ВозвращаемоеЗначение.Вставить("СтатусОбработки",          Неопределено);
	ВозвращаемоеЗначение.Вставить("ИдентификаторЗаявки",      Неопределено);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",              "");
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type",   "application/json");
	ЗаголовокHTTP.Вставить("Accept",         "application/json");
	ЗаголовокHTTP.Вставить("Accept-Charset", "utf-8");
	ЗаголовокHTTP.Вставить("clientToken",    ПараметрыСУЗ.Токен);
	
	ТелоЗапросаJSON = ОбменДаннымиИСМПКлиентСервер.ОбъектВТекстJSON(ТелоЗапроса);
	
	URLЗапроса = "api/reports";
	РезультатЗапроса = ОбменДаннымиИСМПКлиентСервер.ОтправитьДанныеВСервис(
		URLЗапроса, ТелоЗапросаJSON, Неопределено, "POST",
		ПараметрыСУЗ, ЗаголовокHTTP);
	
	РезультатОтправкиЗапроса = ОбменДаннымиИСМПКлиентСервер.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON(РезультатЗапроса);
	
	ВозвращаемоеЗначение.РезультатОтправкиЗапроса = РезультатОтправкиЗапроса;
	
	Если РезультатОтправкиЗапроса.ОтветПолучен Тогда
		
		Если РезультатОтправкиЗапроса.КодСостояния = 200 Тогда
			
			ДанныеОбработки = ОбменДаннымиИСМПКлиентСервер.ТекстJSONВОбъект(РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON);
			
			Если ДанныеОбработки = Неопределено Тогда
				
				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
				
				ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
					URLЗапроса,
					РезультатОтправкиЗапроса);
				
			Иначе
				
				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаПринята;
				
				ВозвращаемоеЗначение.ИдентификаторЗаявки = ДанныеОбработки;
				
			КонецЕсли;
			
		ИначеЕсли РезультатОтправкиЗапроса.КодСостояния = 400 Тогда
			
			ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена;
			
			ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
				URLЗапроса,
				РезультатОтправкиЗапроса);
			
		Иначе
			
			ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
			
			ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
				URLЗапроса,
				РезультатОтправкиЗапроса);
			
		КонецЕсли;
		
	Иначе
		
		ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
		
		ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
			URLЗапроса,
			РезультатОтправкиЗапроса);
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ЗапроситьОтчетОбИспользовании_V1(Идентификатор, ПараметрыСУЗ) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("РезультатОтправкиЗапроса",    Неопределено);
	ВозвращаемоеЗначение.Вставить("Операция",                    Неопределено);
	ВозвращаемоеЗначение.Вставить("СтатусОбработки",             Неопределено);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                 "");
	ВозвращаемоеЗначение.Вставить("ДанныеОтчетаОбИспользовании", Неопределено);
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type",   "application/json; charset=utf-8");
	ЗаголовокHTTP.Вставить("Accept",         "application/json");
	ЗаголовокHTTP.Вставить("Accept-Charset", "utf-8");
	ЗаголовокHTTP.Вставить("clientToken",    ПараметрыСУЗ.Токен);
	
	URLЗапроса = СтрШаблон("api/usage?productionOrderId=%1", Идентификатор);
	
	РезультатЗапроса = ОбщегоНазначенияИСМП.ПолучитьДанныеИзСервиса(URLЗапроса, Неопределено, ПараметрыСУЗ, ЗаголовокHTTP);
	
	РезультатОтправкиЗапроса = ОбменДаннымиИСМПКлиентСервер.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON(РезультатЗапроса);
	
	ВозвращаемоеЗначение.РезультатОтправкиЗапроса = РезультатОтправкиЗапроса;
	
	Если РезультатОтправкиЗапроса.ОтветПолучен Тогда
		
		Если РезультатОтправкиЗапроса.КодСостояния = 200 Тогда
			
			ДанныеОбработки = ОбменДаннымиИСМПКлиентСервер.ТекстJSONВОбъект(РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON);
			
			Если ДанныеОбработки = Неопределено Тогда
				
				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
				
				ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
					URLЗапроса,
					РезультатОтправкиЗапроса);
				
			Иначе
				
				ДанныеОтчетаОбИспользовании = Новый ТаблицаЗначений();
				ДанныеОтчетаОбИспользовании.Колонки.Добавить("ИдентификаторЗаказа", Новый ОписаниеТипов("Строка"));
				ДанныеОтчетаОбИспользовании.Колонки.Добавить("ИдентификаторСтроки", Новый ОписаниеТипов("Строка"));
				ДанныеОтчетаОбИспользовании.Колонки.Добавить("КодМаркировки",       Новый ОписаниеТипов("Строка"));
				ДанныеОтчетаОбИспользовании.Колонки.Добавить("Статус",              Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыКодовМаркировкиСУЗ"));
				
				ВозвращаемоеЗначение.ДанныеОтчетаОбИспользовании = Неопределено;
				Для Каждого БизнесЗаказ Из ДанныеОбработки Цикл
					
					Для Каждого Элемент Из БизнесЗаказ.businessOrderReports Цикл
						
						Для Каждого ЭлементСтатуса Из Элемент.codeStatuses  Цикл
							
							СтрокаТЧ = ДанныеОтчетаОбИспользовании.Добавить();
							СтрокаТЧ.ИдентификаторЗаказа = Элемент.orderId;
							СтрокаТЧ.ИдентификаторСтроки = Элемент.orderLineId;
							СтрокаТЧ.КодМаркировки       = ЭлементСтатуса.sntin;
							СтрокаТЧ.Статус              = ИнтерфейсСУЗСлужебный.СтатусКодаМаркировки(ЭлементСтатуса.codeStatus);
							
						КонецЦикла;
						
					КонецЦикла;
					
				КонецЦикла;
				
				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена;
				
				ВозвращаемоеЗначение.ДанныеОтчетаОбИспользовании = ДанныеОтчетаОбИспользовании;
				
			КонецЕсли;
			
		Иначе
			
			ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
			
			ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
				URLЗапроса,
				РезультатОтправкиЗапроса);
			
		КонецЕсли;
		
	Иначе
		
		ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
		
		ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
			URLЗапроса,
			РезультатОтправкиЗапроса);
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ЗапроситьСтатусБизнесЗаказа_V1(Идентификатор, ПараметрыСУЗ) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("РезультатОтправкиЗапроса",    Неопределено);
	ВозвращаемоеЗначение.Вставить("Операция",                    Неопределено);
	ВозвращаемоеЗначение.Вставить("СтатусОбработки",             Неопределено);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                 "");
	ВозвращаемоеЗначение.Вставить("ПараметрыСтатуса",            Неопределено);
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type",   "application/json; charset=utf-8");
	ЗаголовокHTTP.Вставить("Accept",         "application/json");
	ЗаголовокHTTP.Вставить("Accept-Charset", "utf-8");
	ЗаголовокHTTP.Вставить("clientToken",    ПараметрыСУЗ.Токен);
	
	URLЗапроса = СтрШаблон(
		"api/orders?productionOrderId=%1",
		Идентификатор);
	РезультатЗапроса = ОбщегоНазначенияИСМП.ПолучитьДанныеИзСервиса(URLЗапроса, Неопределено, ПараметрыСУЗ, ЗаголовокHTTP);
	
	РезультатОтправкиЗапроса = ОбменДаннымиИСМПКлиентСервер.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON(РезультатЗапроса);
	
	ВозвращаемоеЗначение.РезультатОтправкиЗапроса = РезультатОтправкиЗапроса;
	
	Если РезультатОтправкиЗапроса.ОтветПолучен Тогда
		
		Если РезультатОтправкиЗапроса.КодСостояния = 200 Тогда
			
			ДанныеОбработки = ОбменДаннымиИСМПКлиентСервер.ТекстJSONВОбъект(РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON);
			
			Если ДанныеОбработки = Неопределено Тогда
				
				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
				
				ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
					URLЗапроса,
					РезультатОтправкиЗапроса);
				
			Иначе
				
//				ДанныеОтчетаОбИспользовании = Новый ТаблицаЗначений();
//				ДанныеОтчетаОбИспользовании.Колонки.Добавить("ИдентификаторЗаказа", Новый ОписаниеТипов("Строка"));
//				ДанныеОтчетаОбИспользовании.Колонки.Добавить("ИдентификаторСтроки", Новый ОписаниеТипов("Строка"));
//				ДанныеОтчетаОбИспользовании.Колонки.Добавить("КодМаркировки",       Новый ОписаниеТипов("Строка"));
//				ДанныеОтчетаОбИспользовании.Колонки.Добавить("Статус",              Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыКодовМаркировкиСУЗ"));
//
//				ВозвращаемоеЗначение.ДанныеОтчетаОбИспользовании = Неопределено;
//				Для Каждого БизнесЗаказ Из ДанныеОбработки Цикл
//
//					Для Каждого Элемент Из БизнесЗаказ.businessOrderReports Цикл
//
//						Для Каждого ЭлементСтатуса Из Элемент.codeStatuses  Цикл
//
//							СтрокаТЧ = ДанныеОтчетаОбИспользовании.Добавить();
//							СтрокаТЧ.ИдентификаторЗаказа = Элемент.orderId;
//							СтрокаТЧ.ИдентификаторСтроки = Элемент.orderLineId;
//							СтрокаТЧ.КодМаркировки       = ЭлементСтатуса.sntin;
//							СтрокаТЧ.Статус              = ИнтерфейсСУЗСлужебный.СтатусКодаМаркировки(ЭлементСтатуса.codeStatus);
//
//						КонецЦикла;
//
//					КонецЦикла;
//
//				КонецЦикла;
				
				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена;
				
				ВозвращаемоеЗначение.ПараметрыСтатуса = Неопределено;
				
			КонецЕсли;
			
		Иначе
			
			ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
			
			ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
				URLЗапроса,
				РезультатОтправкиЗапроса);
			
		КонецЕсли;
		
	Иначе
		
		ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
		
		ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
			URLЗапроса,
			РезультатОтправкиЗапроса);
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти

#Область Формат_V2

Функция СоздатьБизнесЗаказНаЭмиссиюКодовМаркировки_V2(ТелоЗапросаJSON, ВидПродукции, ПараметрыСУЗ, Подпись = Неопределено) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессии", Ложь);
	ВозвращаемоеЗначение.Вставить("РезультатОтправкиЗапроса",       Неопределено);
	ВозвращаемоеЗначение.Вставить("Операция",                       Перечисления.ВидыОперацийИСМП.ЗаказНаЭмиссиюКодовМаркировки);
	ВозвращаемоеЗначение.Вставить("СтатусОбработки",                Неопределено);
	ВозвращаемоеЗначение.Вставить("ДанныеБизнесЗаказа",             Неопределено);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                    "");
	ВозвращаемоеЗначение.Вставить("Статус",                         Перечисления.СтатусыОбработкиЗаказовНаЭмиссиюКодовМаркировкиИСМП.ПустаяСсылка());

	ТокенДоступа = ТокенДоступаПоПараметрамСУЗ(ПараметрыСУЗ);
	
	Если ТокенДоступа = Неопределено Тогда
		ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии = Истина;
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type", "application/json; charset=utf-8");
	ЗаголовокHTTP.Вставить("Accept",       "application/json");
	ЗаголовокHTTP.Вставить("clientToken",  ТокенДоступа);
	Если Подпись <> Неопределено Тогда
		ЗаголовокHTTP.Вставить(
			"X-Signature", ОбщегоНазначенияИСКлиентСервер.ДвоичныеДанныеBase64(Подпись));
	КонецЕсли;
	
	Если ПараметрыСУЗ.ФорматОбмена = Перечисления.ВерсииФорматаОбменаСУЗ.V3
		И ВидПродукции <> Перечисления.ВидыПродукцииИС.ПродукцияИзНатуральногоМеха Тогда
		URLЗапроса = СтрШаблон("api/v3/order?omsId=%1", ПараметрыСУЗ.Идентификатор);
	Иначе
		URLЗапроса = СтрШаблон(
			URLЗапроса("api/v2/extension/orders?omsId=%1", ВидПродукции),
			ПараметрыСУЗ.Идентификатор);
	КонецЕсли;

	РезультатЗапроса = ОбменДаннымиИСМПКлиентСервер.ОтправитьДанныеВСервис(URLЗапроса, ТелоЗапросаJSON, Неопределено, "POST", ПараметрыСУЗ, ЗаголовокHTTP);
	
	РезультатОтправкиЗапроса = ОбменДаннымиИСМПКлиентСервер.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON(РезультатЗапроса);
	
	ВозвращаемоеЗначение.РезультатОтправкиЗапроса = РезультатОтправкиЗапроса;
	
	Если РезультатОтправкиЗапроса.ОтветПолучен Тогда
		
		Если РезультатОтправкиЗапроса.КодСостояния = 200 Тогда
			
			// Структура - Ожидаемое результат запроса:
			//  * omsId - GUID - Идентификатор СУЗ
			//  * orderId - GUID - Идентификатор заявки
			//  * expectedCompletionTime - Строка - Время в миллисекундах
			ДанныеОбработки = ОбменДаннымиИСМПКлиентСервер.ТекстJSONВОбъект(РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON);
			Если ДанныеОбработки = Неопределено Тогда
				
				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
				
				ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
					URLЗапроса,
					РезультатОтправкиЗапроса);
				
			Иначе
				
				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаПринята;
				ВозвращаемоеЗначение.Статус          = Перечисления.СтатусыОбработкиЗаказовНаЭмиссиюКодовМаркировкиИСМП.СУЗСоздан;

				Если ДанныеОбработки.Свойство("expectedCompleteTimestamp") Тогда
					ОжидаемаяДатаЗавершенияОбработки = ДанныеОбработки.expectedCompleteTimestamp;
				ИначеЕсли ДанныеОбработки.Свойство("expectedCompletionTime") Тогда
					ОжидаемаяДатаЗавершенияОбработки = ДанныеОбработки.expectedCompletionTime;
				Иначе
					ОжидаемаяДатаЗавершенияОбработки = 10000;
				КонецЕсли;
				
				ПроверятьПосле = ТекущаяДатаСеанса() + Окр(ОжидаемаяДатаЗавершенияОбработки / 1000, 0, РежимОкругления.Окр15как20);
				
				ДанныеБизнесЗаказа = Новый Структура;
				ДанныеБизнесЗаказа.Вставить("ИдентификаторЗаявки", ДанныеОбработки.orderId);
				ДанныеБизнесЗаказа.Вставить("ПроверятьПосле",      ПроверятьПосле);
				
				ВозвращаемоеЗначение.ДанныеБизнесЗаказа = ДанныеБизнесЗаказа;
				
			КонецЕсли;
			
			Возврат ВозвращаемоеЗначение;
			
		ИначеЕсли РезультатОтправкиЗапроса.КодСостояния = 400 Тогда
			
			ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена;
			
			ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
				URLЗапроса,
				РезультатОтправкиЗапроса);
			
		Иначе
			
			ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
			
			ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
				URLЗапроса,
				РезультатОтправкиЗапроса);
			
		КонецЕсли;
		
	Иначе
		
		ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
			URLЗапроса,
			РезультатОтправкиЗапроса);
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ПередатьОтчетОСписанииКодовМаркировки_V2(ТелоЗапросаJSON, ВидПродукции, ПараметрыСУЗ, Подпись = Неопределено) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессии", Ложь);
	ВозвращаемоеЗначение.Вставить("РезультатОтправкиЗапроса",       Неопределено);
	ВозвращаемоеЗначение.Вставить("Операция",                       Перечисления.ВидыОперацийИСМП.СписаниеЭмитированныхКодовМаркировки);
	ВозвращаемоеЗначение.Вставить("СтатусОбработки",                Неопределено);
	ВозвращаемоеЗначение.Вставить("ИдентификаторЗаявки",            Неопределено);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                    "");
	
	ТокенДоступа = ТокенДоступаПоПараметрамСУЗ(ПараметрыСУЗ);
	
	Если ТокенДоступа = Неопределено Тогда
		ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии = Истина;
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type",   "application/json; charset=utf-8");
	ЗаголовокHTTP.Вставить("Accept",         "application/json");
	ЗаголовокHTTP.Вставить("Accept-Charset", "utf-8");
	ЗаголовокHTTP.Вставить("clientToken",    ТокенДоступа);
	Если ЗначениеЗаполнено(ПараметрыСУЗ.ИмяПользователя) Тогда
		ЗаголовокHTTP.Вставить("userName", ПараметрыСУЗ.ИмяПользователя);
	КонецЕсли;
	Если Подпись <> Неопределено Тогда
		ЗаголовокHTTP.Вставить(
			"X-Signature", ОбщегоНазначенияИСКлиентСервер.ДвоичныеДанныеBase64(Подпись));
	КонецЕсли;
	
	Если ПараметрыСУЗ.ФорматОбмена = Перечисления.ВерсииФорматаОбменаСУЗ.V3
		И ВидПродукции <> Перечисления.ВидыПродукцииИС.ПродукцияИзНатуральногоМеха Тогда
		URLЗапроса = СтрШаблон("api/v3/dropout?omsId=%1", ПараметрыСУЗ.Идентификатор);
	Иначе
		URLЗапроса = СтрШаблон(
			URLЗапроса("api/v2/extension/dropout?omsId=%1", ВидПродукции),
			ПараметрыСУЗ.Идентификатор);
	КонецЕсли;

	РезультатЗапроса = ОбменДаннымиИСМПКлиентСервер.ОтправитьДанныеВСервис(URLЗапроса, ТелоЗапросаJSON, Неопределено, "POST", ПараметрыСУЗ, ЗаголовокHTTP);
	
	РезультатОтправкиЗапроса = ОбменДаннымиИСМПКлиентСервер.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON(РезультатЗапроса);
	
	ВозвращаемоеЗначение.РезультатОтправкиЗапроса = РезультатОтправкиЗапроса;
	
	Если РезультатОтправкиЗапроса.ОтветПолучен Тогда
		
		Если РезультатОтправкиЗапроса.КодСостояния = 200 Тогда
			
			// Структура - Ожидаемое результат запроса:
			//  * omsId - GUID - Идентификатор СУЗ
			//  * reportId - GUID - Идентификатор отчета
			ДанныеОбработки = ОбменДаннымиИСМПКлиентСервер.ТекстJSONВОбъект(РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON);
			Если ДанныеОбработки = Неопределено Тогда
				
				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
				
				ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
					URLЗапроса,
					РезультатОтправкиЗапроса);
				
			Иначе
				
				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаПринята;
				ВозвращаемоеЗначение.ИдентификаторЗаявки = ДанныеОбработки.reportId;
				
			КонецЕсли;
			
		Иначе
			
			ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена;
			
			ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
				URLЗапроса,
				РезультатОтправкиЗапроса);
			
		КонецЕсли;
		
	Иначе
		
		ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
		
		ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
			URLЗапроса,
			РезультатОтправкиЗапроса);
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ПередатьОтчетОбИспользованииКодовМаркировки_V2(ТелоЗапросаJSON, ЭлементОчереди, ПараметрыСУЗ, Подпись = Неопределено) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессии", Ложь);
	ВозвращаемоеЗначение.Вставить("РезультатОтправкиЗапроса",       Неопределено);
	ВозвращаемоеЗначение.Вставить("Операция",                       ЭлементОчереди.Операция);
	ВозвращаемоеЗначение.Вставить("СтатусОбработки",                Неопределено);
	ВозвращаемоеЗначение.Вставить("ИдентификаторЗаявки",            Неопределено);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                    "");
	
	ТокенДоступа = ТокенДоступаПоПараметрамСУЗ(ПараметрыСУЗ);
	
	Если ТокенДоступа = Неопределено Тогда
		ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии = Истина;
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type",   "application/json; charset=utf-8");
	ЗаголовокHTTP.Вставить("Accept",         "application/json");
	ЗаголовокHTTP.Вставить("Accept-Charset", "utf-8");
	ЗаголовокHTTP.Вставить("clientToken",    ТокенДоступа);
	Если ЗначениеЗаполнено(ПараметрыСУЗ.ИмяПользователя) Тогда
		ЗаголовокHTTP.Вставить("userName", ПараметрыСУЗ.ИмяПользователя);
	КонецЕсли;
	Если Подпись <> Неопределено Тогда
		ЗаголовокHTTP.Вставить(
			"X-Signature", ОбщегоНазначенияИСКлиентСервер.ДвоичныеДанныеBase64(Подпись));
	КонецЕсли;
	
	Если ПараметрыСУЗ.ФорматОбмена = Перечисления.ВерсииФорматаОбменаСУЗ.V3 Тогда
		URLЗапроса = СтрШаблон("api/v3/utilisation?omsId=%1", ПараметрыСУЗ.Идентификатор);
	Иначе
		URLЗапроса = СтрШаблон(
			URLЗапроса_V2("api/v2/extension/utilisation?omsId=%1", ЭлементОчереди.ВидПродукции),
			ПараметрыСУЗ.Идентификатор);
	КонецЕсли;
	
	РезультатЗапроса = ОбменДаннымиИСМПКлиентСервер.ОтправитьДанныеВСервис(URLЗапроса, ТелоЗапросаJSON, Неопределено, "POST", ПараметрыСУЗ, ЗаголовокHTTP);
	
	РезультатОтправкиЗапроса = ОбменДаннымиИСМПКлиентСервер.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON(РезультатЗапроса);
	
	ВозвращаемоеЗначение.РезультатОтправкиЗапроса = РезультатОтправкиЗапроса;
	
	Если РезультатОтправкиЗапроса.ОтветПолучен Тогда
		
		Если РезультатОтправкиЗапроса.КодСостояния = 200 Тогда
			
			// Структура - Ожидаемое результат запроса:
			//  * omsId - GUID - Идентификатор СУЗ
			//  * reportId - GUID - Идентификатор отчета
			ДанныеОбработки = ОбменДаннымиИСМПКлиентСервер.ТекстJSONВОбъект(РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON);
			Если ДанныеОбработки = Неопределено Тогда
				
				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
				
				ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
					URLЗапроса,
					РезультатОтправкиЗапроса);
				
			Иначе
				
				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаПринята;
				
				ВозвращаемоеЗначение.ИдентификаторЗаявки = ДанныеОбработки.reportId;
				
			КонецЕсли;
			
		Иначе
			
			ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена;
			
			ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
				URLЗапроса,
				РезультатОтправкиЗапроса);
			
		КонецЕсли;
		
	Иначе
		
		ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
		
		ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
			URLЗапроса,
			РезультатОтправкиЗапроса);
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ПередатьОтчетОбАгрегацииКодовМаркировки_V2(ТелоЗапросаJSON, ЭлементОчереди, ПараметрыСУЗ, Подпись = Неопределено) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессии", Ложь);
	ВозвращаемоеЗначение.Вставить("РезультатОтправкиЗапроса",       Неопределено);
	ВозвращаемоеЗначение.Вставить("Операция",                       ЭлементОчереди.Операция);
	ВозвращаемоеЗначение.Вставить("СтатусОбработки",                Неопределено);
	ВозвращаемоеЗначение.Вставить("ИдентификаторЗаявки",            Неопределено);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                    "");
	
	ТокенДоступа = ТокенДоступаПоПараметрамСУЗ(ПараметрыСУЗ);
	
	Если ТокенДоступа = Неопределено Тогда
		ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии = Истина;
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type",   "application/json; charset=utf-8");
	ЗаголовокHTTP.Вставить("Accept",         "application/json");
	ЗаголовокHTTP.Вставить("Accept-Charset", "utf-8");
	ЗаголовокHTTP.Вставить("clientToken",    ТокенДоступа);
	Если ЗначениеЗаполнено(ПараметрыСУЗ.ИмяПользователя) Тогда
		ЗаголовокHTTP.Вставить("userName", ПараметрыСУЗ.ИмяПользователя);
	КонецЕсли;
	Если Подпись <> Неопределено Тогда
		ЗаголовокHTTP.Вставить(
			"X-Signature", ОбщегоНазначенияИСКлиентСервер.ДвоичныеДанныеBase64(Подпись));
	КонецЕсли;
	
	Если ПараметрыСУЗ.ФорматОбмена = Перечисления.ВерсииФорматаОбменаСУЗ.V3 Тогда
		URLЗапроса = СтрШаблон("api/v3/aggregation?omsId=%1", ПараметрыСУЗ.Идентификатор);
	Иначе
		URLЗапроса = СтрШаблон(
			URLЗапроса_V2("api/v2/extension/aggregation?omsId=%1", ЭлементОчереди.ВидПродукции),
			ПараметрыСУЗ.Идентификатор);
	КонецЕсли;
	
	РезультатЗапроса = ОбменДаннымиИСМПКлиентСервер.ОтправитьДанныеВСервис(URLЗапроса, ТелоЗапросаJSON, Неопределено, "POST", ПараметрыСУЗ, ЗаголовокHTTP);
	
	РезультатОтправкиЗапроса = ОбменДаннымиИСМПКлиентСервер.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON(РезультатЗапроса);
	
	ВозвращаемоеЗначение.РезультатОтправкиЗапроса = РезультатОтправкиЗапроса;
	
	Если РезультатОтправкиЗапроса.ОтветПолучен Тогда
		
		Если РезультатОтправкиЗапроса.КодСостояния = 200 Тогда
			
			// Структура - Ожидаемое результат запроса:
			//  * omsId - GUID - Идентификатор СУЗ
			//  * reportId - GUID - Идентификатор отчета
			ДанныеОбработки = ОбменДаннымиИСМПКлиентСервер.ТекстJSONВОбъект(РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON);
			Если ДанныеОбработки = Неопределено Тогда

				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;

				ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
					URLЗапроса,
					РезультатОтправкиЗапроса);

			Иначе

				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаПринята;

				ВозвращаемоеЗначение.ИдентификаторЗаявки = ДанныеОбработки.reportId;

			КонецЕсли;

		Иначе

			ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена;

			ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
				URLЗапроса,
				РезультатОтправкиЗапроса);

		КонецЕсли;

	Иначе

		ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;

		ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
			URLЗапроса,
			РезультатОтправкиЗапроса);

	КонецЕсли;

	Возврат ВозвращаемоеЗначение;

КонецФункции

Функция ПодтвердитьПоступлениеКИЗ_V3(ТелоЗапросаJSON, ВидПродукции, ПараметрыСУЗ, Подпись = Неопределено) Экспорт

	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессии", Ложь);
	ВозвращаемоеЗначение.Вставить("РезультатОтправкиЗапроса",       Неопределено);
	ВозвращаемоеЗначение.Вставить("Операция",                       Перечисления.ВидыОперацийИСМП.ПодтверждениеПоступленияКИЗ);
	ВозвращаемоеЗначение.Вставить("СтатусОбработки",                Неопределено);
	ВозвращаемоеЗначение.Вставить("ИдентификаторЗаявки",            Неопределено);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                    "");

	ТокенДоступа = ТокенДоступаПоПараметрамСУЗ(ПараметрыСУЗ);

	Если ТокенДоступа = Неопределено Тогда
		ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии = Истина;
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;

	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type", "application/json; charset=utf-8");
	ЗаголовокHTTP.Вставить("Accept",       "application/json");
	ЗаголовокHTTP.Вставить("clientToken",  ТокенДоступа);

	Если Подпись <> Неопределено Тогда
		ЗаголовокHTTP.Вставить(
			"X-Signature", ОбщегоНазначенияИСКлиентСервер.ДвоичныеДанныеBase64(Подпись));
	КонецЕсли;

	URLЗапроса = СтрШаблон(
		URLЗапроса("api/v2/extension/acceptance?omsId=%1", ВидПродукции),
		ПараметрыСУЗ.Идентификатор);

	РезультатЗапроса = ОбменДаннымиИСМПКлиентСервер.ОтправитьДанныеВСервис(URLЗапроса, ТелоЗапросаJSON, Неопределено, "POST", ПараметрыСУЗ, ЗаголовокHTTP);

	РезультатОтправкиЗапроса = ОбменДаннымиИСМПКлиентСервер.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON(РезультатЗапроса);

	ВозвращаемоеЗначение.РезультатОтправкиЗапроса = РезультатОтправкиЗапроса;

	Если РезультатОтправкиЗапроса.ОтветПолучен Тогда

		Если РезультатОтправкиЗапроса.КодСостояния = 200 Тогда

			// Структура - Ожидаемый результат запроса:
			//  * reportId - GUID - Идентификатор отчета
			ДанныеОбработки = ОбменДаннымиИСМПКлиентСервер.ТекстJSONВОбъект(РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON);
			Если ДанныеОбработки = Неопределено Тогда

				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
				
				ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
					URLЗапроса,
					РезультатОтправкиЗапроса);
				
			Иначе
				
				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаПринята;
				
				ВозвращаемоеЗначение.ИдентификаторЗаявки = ДанныеОбработки.reportId;
				
			КонецЕсли;
			
		Иначе
			
			ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена;
			
			ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
				URLЗапроса,
				РезультатОтправкиЗапроса);
			
		КонецЕсли;
		
	Иначе
		
		ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
		
		ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
			URLЗапроса,
			РезультатОтправкиЗапроса);
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ЗапроситьИдентификаторСоединения_V2(ТелоЗапросаJSON, ЭлементОчереди, ПараметрыСУЗ, Подпись = Неопределено) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессии", Ложь);
	ВозвращаемоеЗначение.Вставить("РезультатОтправкиЗапроса",       Неопределено);
	ВозвращаемоеЗначение.Вставить("Операция",                       ЭлементОчереди.Операция);
	ВозвращаемоеЗначение.Вставить("СтатусОбработки",                Неопределено);
	ВозвращаемоеЗначение.Вставить("ИдентификаторСоединения",        Неопределено);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                    "");
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type",   "application/json; charset=utf-8");
	ЗаголовокHTTP.Вставить("Accept",         "application/json");
	ЗаголовокHTTP.Вставить("Accept-Charset", "utf-8");
	Если Подпись <> Неопределено Тогда
		ЗаголовокHTTP.Вставить(
			"X-Signature", ОбщегоНазначенияИСКлиентСервер.ДвоичныеДанныеBase64(Подпись));
	КонецЕсли;
	
	ПараметрыURL = Новый Соответствие();
	ПараметрыURL.Вставить("omsId", ПараметрыСУЗ.Идентификатор);
	
	РежимРаботыСТестовымКонтуромИСМП = ПолучитьФункциональнуюОпцию("РежимРаботыСТестовымКонтуромИСМП");
	
	Если ПараметрыСУЗ.ФорматОбмена = Перечисления.ВерсииФорматаОбменаСУЗ.V3 Тогда
		URLЗапроса = СтрШаблон("api/v3/integration/connection?omsId=%1", ПараметрыСУЗ.Идентификатор);
	Иначе
		URLЗапроса = СтрШаблон(
			"api/v2/integration/connection?omsId=%1",
			ПараметрыСУЗ.Идентификатор);
	КонецЕсли;
	
	Если Не РежимРаботыСТестовымКонтуромИСМП
		И ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ИнтеграцияСЦРПТ") Тогда
		
		ДанныеБиблиотеки = Новый Структура;
		ДанныеБиблиотеки.Вставить("Идентификатор", "БГосИС");
		ДанныеБиблиотеки.Вставить("Версия",        ОбщегоНазначенияИС.ВерсияБиблиотеки());
		
		МодульИнтеграцияСЦРПТ = ОбщегоНазначения.ОбщийМодуль("ИнтеграцияСЦРПТ");
		РезультатБИП = МодульИнтеграцияСЦРПТ.ИдентификаторСоединения(ТелоЗапросаJSON, ЗаголовокHTTP, ПараметрыURL, ДанныеБиблиотеки);
		
		ЗаголовокHTTP.Вставить("X-RegistrationKey", НСтр("ru = '<данные скрыты>'"));
		
		Если РезультатБИП.ДанныеОтвета <> Неопределено Тогда
			
			// Эмуляция
			HTTPОтветЭмуляция = Новый Структура;
			HTTPОтветЭмуляция.Вставить("Заголовки",    Новый Соответствие());
			HTTPОтветЭмуляция.Вставить("КодСостояния", 200);
			HTTPОтветЭмуляция.Вставить("Тело",         ОбменДаннымиИСМПКлиентСервер.ОбъектВТекстJSON(РезультатБИП.ДанныеОтвета, Истина));
			
			РезультатЗапроса = ОбменДаннымиИСМПКлиентСервер.ОтправитьДанныеВСервис(URLЗапроса, ТелоЗапросаJSON, Неопределено, "POST", ПараметрыСУЗ, ЗаголовокHTTP, HTTPОтветЭмуляция);
			
			ВозвращаемоеЗначение.РезультатОтправкиЗапроса = ОбменДаннымиИСМПКлиентСервер.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON(РезультатЗапроса);
			// Эмуляция
			
			// Структура - Ожидаемое результат запроса:
			//  * status - Строка - Статус
			//  * omsConnection - Строка - Идентификатор соединения
			ВозвращаемоеЗначение.СтатусОбработки = ИнтерфейсСУЗСлужебный.СтатусОбработкиЗапросаНаПолучениеИдентификатораСоединения(РезультатБИП.ДанныеОтвета["status"]);
			
			Если ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена Тогда
				ВозвращаемоеЗначение.ИдентификаторСоединения = РезультатБИП.ДанныеОтвета["omsConnection"];
			Иначе
				ВозвращаемоеЗначение.ТекстОшибки = РезультатБИП.ДанныеОтвета["rejectionReason"];
			КонецЕсли;
			
		Иначе
			
			Тело = СтрШаблон(
				НСтр("ru = 'Код ошибки: %1
				           |Текст ошибки: %2'"),
				РезультатБИП.КодОшибки,
				РезультатБИП.СообщениеОбОшибке);
			
			// Эмуляция
			HTTPОтветЭмуляция = Новый Структура;
			HTTPОтветЭмуляция.Вставить("Заголовки",    Новый Соответствие());
			HTTPОтветЭмуляция.Вставить("КодСостояния", 500);
			HTTPОтветЭмуляция.Вставить("Тело",         Тело);
			
			РезультатЗапроса = ОбменДаннымиИСМПКлиентСервер.ОтправитьДанныеВСервис(URLЗапроса, ТелоЗапросаJSON, Неопределено, "POST", ПараметрыСУЗ, ЗаголовокHTTP, HTTPОтветЭмуляция);
			
			ВозвращаемоеЗначение.РезультатОтправкиЗапроса = ОбменДаннымиИСМПКлиентСервер.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON(РезультатЗапроса);
			// Эмуляция
			
			ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
			
			Если РезультатБИП.КодОшибки = "НеверныйФорматЗапроса"
				Или РезультатБИП.КодОшибки = "НеверныйЛогинИлиПароль"
				Или РезультатБИП.КодОшибки = "ПревышеноКоличествоПопыток"
				Или РезультатБИП.КодОшибки = "ОшибкаПодключения"
				Или РезультатБИП.КодОшибки = "ОшибкаСервиса" Тогда
				
				ВозвращаемоеЗначение.ТекстОшибки = СтрШаблон(
					НСтр("ru='Запрос на получение идентификатора соединения не может быть обработан сервисом интернет-поддержки.
						     |Текст ошибки: %1.'"),
					РезультатБИП.СообщениеОбОшибке);
				
			Иначе
				
				ВозвращаемоеЗначение.ТекстОшибки = СтрШаблон(
					НСтр("ru='Запрос на получение идентификатора соединения не выполнен.
						     |Текст ошибки: %1.'"),
					РезультатБИП.СообщениеОбОшибке);	
				
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли РежимРаботыСТестовымКонтуромИСМП Тогда
		
		ЗаголовокHTTP.Вставить("X-RegistrationKey", "4344d884-7f21-456c-981e-cd68e92391e8");
		
		РезультатЗапроса = ОбменДаннымиИСМПКлиентСервер.ОтправитьДанныеВСервис(URLЗапроса, ТелоЗапросаJSON, Неопределено, "POST", ПараметрыСУЗ, ЗаголовокHTTP);
		
		РезультатОтправкиЗапроса = ОбменДаннымиИСМПКлиентСервер.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON(РезультатЗапроса);
		
		ВозвращаемоеЗначение.РезультатОтправкиЗапроса = РезультатОтправкиЗапроса;
		
		Если РезультатОтправкиЗапроса.ОтветПолучен Тогда
			
			Если РезультатОтправкиЗапроса.КодСостояния = 200 Тогда
				
				// Структура - Ожидаемое результат запроса:
				//  * status - Строка - Статус
				//  * omsConnection - Строка - Идентификатор соединения
				ДанныеОбработки = ОбменДаннымиИСМПКлиентСервер.ТекстJSONВОбъект(РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON);
				Если ДанныеОбработки = Неопределено Тогда
					
					ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
					
					ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
						URLЗапроса,
						РезультатОтправкиЗапроса);
					
				Иначе
					
					ВозвращаемоеЗначение.СтатусОбработки = ИнтерфейсСУЗСлужебный.СтатусОбработкиЗапросаНаПолучениеИдентификатораСоединения(ДанныеОбработки.status);
					
					Если ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена Тогда
						ВозвращаемоеЗначение.ИдентификаторСоединения = ДанныеОбработки.omsConnection;
					Иначе
						ВозвращаемоеЗначение.ТекстОшибки = ДанныеОбработки.rejectionReason;
					КонецЕсли;
					
				КонецЕсли;
				
			Иначе
				
				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена;
				
				ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
					URLЗапроса,
					РезультатОтправкиЗапроса);
				
			КонецЕсли;
			
		Иначе
			
			ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
			
			ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
				URLЗапроса,
				РезультатОтправкиЗапроса);
			
		КонецЕсли;
		
	Иначе
		
		ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
		
		ВозвращаемоеЗначение.ТекстОшибки = НСтр("ru = 'Идентификатор соединения может быть получен только через ЛК СУЗ'");
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ЗапроситьМестаОсуществленияДеятельности(ВидПродукции, ПараметрыСУЗ, ТелоЗапросаJSON) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессии", Ложь);
	ВозвращаемоеЗначение.Вставить("РезультатОтправкиЗапроса",       Неопределено);
	ВозвращаемоеЗначение.Вставить("Операция",                       Перечисления.ВидыОперацийИСМП.ЗапросМестОсуществленияДеятельности);
	ВозвращаемоеЗначение.Вставить("СтатусОбработки",                Неопределено);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                    "");

	ТокенДоступа = ТокенДоступаПоПараметрамСУЗ(ПараметрыСУЗ);

	Если ТокенДоступа = Неопределено Тогда
		ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии = Истина;
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;

	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type",   "application/json");
	ЗаголовокHTTP.Вставить("Accept",         "application/json");
	ЗаголовокHTTP.Вставить("Accept-Charset", "utf-8");
	ЗаголовокHTTP.Вставить("clientToken",    ТокенДоступа);
	
	Если ПараметрыСУЗ.ФорматОбмена = Перечисления.ВерсииФорматаОбменаСУЗ.V3
		И ВидПродукции <> Перечисления.ВидыПродукцииИС.ПродукцияИзНатуральногоМеха Тогда
		URLЗапроса = СтрШаблон("api/v3/mod?omsId=%1&productGroup=%2",
			ПараметрыСУЗ.Идентификатор,
			ВидПродукцииСУЗ_V3(ВидПродукции));
	Иначе
		URLЗапроса = СтрШаблон(
			URLЗапроса("api/v2/extension/mod?omsId=%1", ВидПродукции),
			ПараметрыСУЗ.Идентификатор);
	КонецЕсли;

	РезультатЗапроса = ОбменДаннымиИСМПКлиентСервер.ОтправитьДанныеВСервис(URLЗапроса, ТелоЗапросаJSON, Неопределено, "GET", ПараметрыСУЗ, ЗаголовокHTTP);

	РезультатОтправкиЗапроса = ОбменДаннымиИСМПКлиентСервер.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON(РезультатЗапроса);

	ВозвращаемоеЗначение.РезультатОтправкиЗапроса = РезультатОтправкиЗапроса;

	Если РезультатОтправкиЗапроса.ОтветПолучен Тогда

		Если РезультатОтправкиЗапроса.КодСостояния = 200 Тогда

			ДанныеОбработки = ОбменДаннымиИСМПКлиентСервер.ТекстJSONВОбъект(РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON);
			Если ДанныеОбработки = Неопределено Тогда

				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;

				ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
					URLЗапроса,
					РезультатОтправкиЗапроса);

			Иначе

				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена;

			КонецЕсли;

		Иначе

			ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена;
			ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
				URLЗапроса,
				РезультатОтправкиЗапроса);
			
		КонецЕсли;
		
	Иначе
		
		ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
		
		ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
			URLЗапроса,
			РезультатОтправкиЗапроса);
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ЗакрытьПодзаказПоGTIN_V2(ПараметрыЗакрытия, ВидПродукции, ПараметрыСУЗ, ТелоЗапросаJSON, Подпись) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессии", Ложь);
	ВозвращаемоеЗначение.Вставить("РезультатОтправкиЗапроса",       Неопределено);
	ВозвращаемоеЗначение.Вставить("Операция",                       Перечисления.ВидыОперацийИСМП.ЗакрытиеПодзаказаНаЭмиссиюКодовМаркировкиСУЗ);
	ВозвращаемоеЗначение.Вставить("СтатусОбработки",                Неопределено);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                    "");
	ВозвращаемоеЗначение.Вставить("ИдентификаторЗаявки",            Неопределено);

	ТокенДоступа = ТокенДоступаПоПараметрамСУЗ(ПараметрыСУЗ);
	
	Если ТокенДоступа = Неопределено Тогда
		ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии = Истина;
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Accept",         "application/json");
	ЗаголовокHTTP.Вставить("Accept-Charset", "utf-8");
	ЗаголовокHTTP.Вставить("clientToken",    ТокенДоступа);
	Если Подпись <> Неопределено Тогда
		ЗаголовокHTTP.Вставить(
			"X-Signature", ОбщегоНазначенияИСКлиентСервер.ДвоичныеДанныеBase64(Подпись));
	КонецЕсли;
	
	Если ПараметрыСУЗ.ФорматОбмена = Перечисления.ВерсииФорматаОбменаСУЗ.V3 Тогда
		
		ЗаголовокHTTP.Вставить("Content-Type", "application/json; charset=utf-8");
		
		URLЗапроса = СтрШаблон("api/v3/order/close?omsId=%1", ПараметрыСУЗ.Идентификатор);
		
	Иначе
		
		ЗаголовокHTTP.Вставить("Content-Type", "x-www-form-urlencoded;charset=UTF-8");
		
		Если ПараметрыЗакрытия.Свойство("GTIN") Тогда
			URLЗапроса = СтрШаблон(
				URLЗапроса_V2("api/v2/extension/buffer/close?orderId=%1&gtin=%2&omsId=%3&lastBlockId=%4", ВидПродукции),
				ПараметрыЗакрытия.ИдентификаторБизнесЗаказа,
				ПараметрыЗакрытия.GTIN,
				ПараметрыСУЗ.Идентификатор,
				ПараметрыЗакрытия.ИдентификаторПоследнегоБлокаКодов);
		Иначе
			URLЗапроса = СтрШаблон(
				URLЗапроса_V2("api/v2/extension/buffer/close?orderId=%1&omsId=%2", ВидПродукции),
				ПараметрыЗакрытия.ИдентификаторБизнесЗаказа,
				ПараметрыСУЗ.Идентификатор);
		КонецЕсли;
		
	КонецЕсли;

	РезультатЗапроса = ОбменДаннымиИСМПКлиентСервер.ОтправитьДанныеВСервис(URLЗапроса, ТелоЗапросаJSON, Неопределено, "POST", ПараметрыСУЗ, ЗаголовокHTTP);
	
	РезультатОтправкиЗапроса = ОбменДаннымиИСМПКлиентСервер.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON(РезультатЗапроса);
	
	ВозвращаемоеЗначение.РезультатОтправкиЗапроса = РезультатОтправкиЗапроса;
	
	КодыОшибокЗаказЗакрытИлиОтсутствует = Новый Массив;
	КодыОшибокЗаказЗакрытИлиОтсутствует.Добавить(3010);
	КодыОшибокЗаказЗакрытИлиОтсутствует.Добавить(3360);

	Если РезультатОтправкиЗапроса.ОтветПолучен Тогда
		
		Если РезультатОтправкиЗапроса.КодСостояния = 200 Тогда
			
			// Структура - Ожидаемое результат запроса:
			//  * omsId - GUID - Идентификатор СУЗ
			ДанныеОбработки = ОбменДаннымиИСМПКлиентСервер.ТекстJSONВОбъект(РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON);
			Если ДанныеОбработки = Неопределено Тогда
				
				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
				ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
					URLЗапроса,
					РезультатОтправкиЗапроса);
				
			Иначе
				
				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена;
				
			КонецЕсли;
			
		Иначе
			
			КодыОшибокЗаказЗакрытИлиОтсутствует = Новый Массив;
			КодыОшибокЗаказЗакрытИлиОтсутствует.Добавить(3010);
			КодыОшибокЗаказЗакрытИлиОтсутствует.Добавить(3360);

			ЗаказЗакрытРанееИлиНеНайден = Ложь;
			Если РезультатОтправкиЗапроса.КодСостояния = 400 Тогда
				ДанныеОбработки = ОбменДаннымиИСМПКлиентСервер.ТекстJSONВОбъект(РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON);
				Если ДанныеОбработки <> Неопределено
					И ДанныеОбработки.Свойство("globalErrors") Тогда
					Для Каждого СтрокаОшибка Из ДанныеОбработки.globalErrors Цикл
						Если СтрокаОшибка.Свойство("errorCode")
							И КодыОшибокЗаказЗакрытИлиОтсутствует.Найти(СтрокаОшибка.errorCode) <> Неопределено Тогда
							ЗаказЗакрытРанееИлиНеНайден = Истина;
							Прервать;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;

			Если ЗаказЗакрытРанееИлиНеНайден Тогда
				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена;
			Иначе
				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена;
				ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
					URLЗапроса,
					РезультатОтправкиЗапроса);
			КонецЕсли;

		КонецЕсли;

	Иначе

		ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;

		ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
			URLЗапроса,
			РезультатОтправкиЗапроса);

	КонецЕсли;

	Возврат ВозвращаемоеЗначение;

КонецФункции

Функция ЗакрытьЗаказНаЭмиссию_V3(ПараметрыЗакрытия, ВидПродукции, ПараметрыСУЗ, ТелоЗапросаJSON) Экспорт

	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессии", Ложь);
	ВозвращаемоеЗначение.Вставить("РезультатОтправкиЗапроса",       Неопределено);
	ВозвращаемоеЗначение.Вставить("Операция",                       Перечисления.ВидыОперацийИСМП.ЗакрытиеЗаказаНаЭмиссиюСУЗ);
	ВозвращаемоеЗначение.Вставить("СтатусОбработки",                Неопределено);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                    "");
	ВозвращаемоеЗначение.Вставить("ИдентификаторЗаявки",            Неопределено);

	ТокенДоступа = ТокенДоступаПоПараметрамСУЗ(ПараметрыСУЗ);

	Если ТокенДоступа = Неопределено Тогда
		ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии = Истина;
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;

	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type",   "application/json");
	ЗаголовокHTTP.Вставить("Accept",         "application/json");
	ЗаголовокHTTP.Вставить("Accept-Charset", "utf-8");
	ЗаголовокHTTP.Вставить("clientToken",    ТокенДоступа);

	URLЗапроса = СтрШаблон(
		URLЗапроса("api/v2/extension/orders/close?omsId=%1", ВидПродукции),
		ПараметрыСУЗ.Идентификатор);

	РезультатЗапроса = ОбменДаннымиИСМПКлиентСервер.ОтправитьДанныеВСервис(URLЗапроса, ТелоЗапросаJSON, Неопределено, "POST", ПараметрыСУЗ, ЗаголовокHTTP);

	РезультатОтправкиЗапроса = ОбменДаннымиИСМПКлиентСервер.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON(РезультатЗапроса);

	ВозвращаемоеЗначение.РезультатОтправкиЗапроса = РезультатОтправкиЗапроса;

	Если РезультатОтправкиЗапроса.ОтветПолучен Тогда

		Если РезультатОтправкиЗапроса.КодСостояния = 200 Тогда

			// Структура - Ожидаемое результат запроса:
			//  * omsId - GUID - Идентификатор СУЗ
			ДанныеОбработки = ОбменДаннымиИСМПКлиентСервер.ТекстJSONВОбъект(РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON);
			Если ДанныеОбработки = Неопределено Тогда

				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;

				ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
					URLЗапроса,
					РезультатОтправкиЗапроса);

			Иначе

				ВозвращаемоеЗначение.ИдентификаторЗаявки = ДанныеОбработки.reportId;
				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаПринята;

			КонецЕсли;

		Иначе

			КодыОшибокЗаказЗакрытИлиОтсутствует = Новый Массив;
			КодыОшибокЗаказЗакрытИлиОтсутствует.Добавить(3010);
			КодыОшибокЗаказЗакрытИлиОтсутствует.Добавить(3360);

			ЗаказЗакрытРанееИлиНеНайден = Ложь;
			Если РезультатОтправкиЗапроса.КодСостояния = 400 Тогда
				ДанныеОбработки = ОбменДаннымиИСМПКлиентСервер.ТекстJSONВОбъект(РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON);
				Если ДанныеОбработки.Свойство("errorCode")
					И КодыОшибокЗаказЗакрытИлиОтсутствует.Найти(ДанныеОбработки.errorCode) <> Неопределено Тогда
					ЗаказЗакрытРанееИлиНеНайден = Истина;
				КонецЕсли;
			КонецЕсли;

			Если ЗаказЗакрытРанееИлиНеНайден Тогда
				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена;
			Иначе
				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена;
				ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
					URLЗапроса,
					РезультатОтправкиЗапроса);
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
		
		ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
			URLЗапроса,
			РезультатОтправкиЗапроса);
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ЗапроситьКодыМаркировкиИзБизнесЗаказа_V2(ПараметрыЗапроса, КоличествоКодовМаркировки, ИдентификаторБлокаКодов, ЭлементОчереди, ПараметрыСУЗ) Экспорт
	
	ВидПродукции = ЭлементОчереди.ВидПродукции;
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессии", Ложь);
	ВозвращаемоеЗначение.Вставить("РезультатОтправкиЗапроса",       Неопределено);
	ВозвращаемоеЗначение.Вставить("Операция",                       ЭлементОчереди.Операция);
	ВозвращаемоеЗначение.Вставить("СтатусОбработки",                Неопределено);
	ВозвращаемоеЗначение.Вставить("ДанныеБлока",                    Неопределено);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                    "");
	
	ТокенДоступа = ТокенДоступаПоПараметрамСУЗ(ПараметрыСУЗ);
	
	Если ТокенДоступа = Неопределено Тогда
		ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии = Истина;
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type",   "application/x-www-form-urlencoded;charset=UTF-8");
	ЗаголовокHTTP.Вставить("Accept",         "application/json");
	ЗаголовокHTTP.Вставить("Accept-Charset", "utf-8");
	ЗаголовокHTTP.Вставить("clientToken",    ТокенДоступа);
	
	ПараметрыURL = Новый Массив;
	ПараметрыURL.Добавить(СтрШаблон("omsId=%1",   ПараметрыСУЗ.Идентификатор));
	ПараметрыURL.Добавить(СтрШаблон("orderId=%1", ПараметрыЗапроса.ИдентификаторБизнесЗаказа));

	Если ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ПовторноеПолучениеКодовМаркировкиИзСУЗ Тогда

		ПараметрыURL.Добавить(СтрШаблон("gtin=%1",    ПараметрыЗапроса.GTIN));
		ПараметрыURL.Добавить(СтрШаблон("blockId=%1", ИдентификаторБлокаКодов));
		
		Если ПараметрыСУЗ.ФорматОбмена = Перечисления.ВерсииФорматаОбменаСУЗ.V3
			И ВидПродукции <> Перечисления.ВидыПродукцииИС.ПродукцияИзНатуральногоМеха Тогда
			URLЗапроса = СтрШаблон("api/v3/order/codes/retry%1", ИнтерфейсИСМП.ПараметрыЗапроса(ПараметрыURL));
		Иначе
			URLЗапроса = СтрШаблон(
				URLЗапроса("api/v2/extension/codes/retry%1", ВидПродукции),
				ИнтерфейсИСМП.ПараметрыЗапроса(ПараметрыURL));
		КонецЕсли;
	Иначе
		
		Если ВидПродукции = Перечисления.ВидыПродукцииИС.ПродукцияИзНатуральногоМеха Тогда
			ЗаголовокHTTP.Вставить("Content-Type", "application/json");
			Если ЗначениеЗаполнено(ИдентификаторБлокаКодов) Тогда
				ПараметрыURL.Добавить(СтрШаблон("since=%1", Формат(ИдентификаторБлокаКодов, "ЧГ=0;")));
			КонецЕсли;
			URLЗапроса = СтрШаблон(
				URLЗапроса("api/v2/extension/codes%1", ВидПродукции),
				ИнтерфейсИСМП.ПараметрыЗапроса(ПараметрыURL));
		Иначе
			ПараметрыURL.Добавить(СтрШаблон("gtin=%1",     ПараметрыЗапроса.GTIN));
			ПараметрыURL.Добавить(СтрШаблон("quantity=%1", Формат(КоличествоКодовМаркировки, "ЧГ=0;")));
			Если ЗначениеЗаполнено(ИдентификаторБлокаКодов) Тогда
				ПараметрыURL.Добавить(СтрШаблон("lastBlockId=%1", ИдентификаторБлокаКодов));
			КонецЕсли;
			Если ПараметрыСУЗ.ФорматОбмена = Перечисления.ВерсииФорматаОбменаСУЗ.V3 Тогда
				URLЗапроса = СтрШаблон("api/v3/codes%1", ИнтерфейсИСМП.ПараметрыЗапроса(ПараметрыURL));
			Иначе
				URLЗапроса = СтрШаблон(
					URLЗапроса("api/v2/extension/codes%1", ВидПродукции),
					ИнтерфейсИСМП.ПараметрыЗапроса(ПараметрыURL));
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	РезультатЗапроса = ОбщегоНазначенияИСМП.ПолучитьДанныеИзСервиса(URLЗапроса, Неопределено, ПараметрыСУЗ, ЗаголовокHTTP);
	
	РезультатОтправкиЗапроса = ОбменДаннымиИСМПКлиентСервер.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON(РезультатЗапроса);
	
	ВозвращаемоеЗначение.РезультатОтправкиЗапроса = РезультатОтправкиЗапроса;
	
	Если РезультатОтправкиЗапроса.ОтветПолучен Тогда
		
		Если РезультатОтправкиЗапроса.КодСостояния = 200 Тогда
			
			// Структура - Ожидаемое результат запроса:
			//  * omsId - GUID - Идентификатор СУЗ
			//  * codes - Массиз Из Строка - Полученные коды маркировки
			//  * blockId - Строка - Идентификатор пакета кодов маркировки
			ДанныеОбработки = ОбменДаннымиИСМПКлиентСервер.ТекстJSONВОбъект(РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON);
			Если ДанныеОбработки = Неопределено Тогда
				
				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
				
				ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
					URLЗапроса,
					РезультатОтправкиЗапроса);
				
			Иначе
				
				ДанныеБлока = Новый Структура;
				ДанныеБлока.Вставить("КодыМаркировки",                    Новый Массив());
				ДанныеБлока.Вставить("ИдентификаторПоследнегоБлокаКодов", Неопределено);
				ДанныеБлока.Вставить("ПараметрыКодовМаркировки",          Новый Соответствие());

				Если ВидПродукции = Перечисления.ВидыПродукцииИС.ПродукцияИзНатуральногоМеха Тогда

					ДанныеБлока.ИдентификаторПоследнегоБлокаКодов = ДанныеОбработки.since;

					Для Каждого СтрокаСведений Из ДанныеОбработки.items Цикл
						Для Каждого ЭлементЗаявки Из СтрокаСведений.products Цикл
							Для Каждого СтрокаКода Из ЭлементЗаявки.codes Цикл

								ПараметрыКодаМаркировки = Новый Структура();
								ПараметрыКодаМаркировки.Вставить("GTIN",               "");
								ПараметрыКодаМаркировки.Вставить("SGTIN",              Неопределено);
								ПараметрыКодаМаркировки.Вставить("ДатаЭмиссии",        ПрочитатьДатуJSON(СтрокаСведений.emitDateTime, ФорматДатыJSON.ISO));
								ПараметрыКодаМаркировки.Вставить("RFIDTID",            СтрокаКода.tid);
								ПараметрыКодаМаркировки.Вставить("ВидКИЗ",             ИнтерфейсСУЗСлужебный.ВидКИЗ(ЭлементЗаявки.identificationType));
								ПараметрыКодаМаркировки.Вставить("РазмерКИЗ",          ИнтерфейсСУЗСлужебный.РазмерКИЗ(ЭлементЗаявки.sizeType));
								ПараметрыКодаМаркировки.Вставить("СпособВводаВОборот", ИнтерфейсСУЗСлужебный.СпособВыпускаВОборот(ЭлементЗаявки.releaseMethodType));
								ПараметрыКодаМаркировки.Вставить("КодТНВЭД",           ЭлементЗаявки.tnvedCode);
								Если СтрокаКода.Свойство("gtin",  ПараметрыКодаМаркировки.GTIN) Тогда
									СтрокаКода.Свойство("serial", ПараметрыКодаМаркировки.SGTIN);
								Иначе
									ПараметрыКодаМаркировки.GTIN = "";
								КонецЕсли;

								ДанныеБлока.КодыМаркировки.Добавить(СтрокаКода.number);
								ДанныеБлока.ПараметрыКодовМаркировки.Вставить(СтрокаКода.number, ПараметрыКодаМаркировки);

							КонецЦикла;
						КонецЦикла;
					КонецЦикла;
				Иначе
					ДанныеБлока.КодыМаркировки                    = ДанныеОбработки.codes;
					ДанныеБлока.ИдентификаторПоследнегоБлокаКодов = ДанныеОбработки.blockId;
				КонецЕсли;
				
				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена;
				
				ВозвращаемоеЗначение.ДанныеБлока = ДанныеБлока;
				
			КонецЕсли;
			
		Иначе
			
			ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
				URLЗапроса,
				РезультатОтправкиЗапроса);
			
			Если СтрНайти(ВозвращаемоеЗначение.ТекстОшибки, "Billing response didn't received in time. Close request sent") Тогда
				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОбрабатывается;
			ИначеЕсли Не ЗначениеЗаполнено(СокрЛП(ВозвращаемоеЗначение.ТекстОшибки)) Тогда
				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОбрабатывается;
			Иначе
				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
		
		ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
			URLЗапроса,
			РезультатОтправкиЗапроса);
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ЗапроситьСписокИдентификаторовПакетовБизнесЗаказа_V2(ПараметрыЗапроса, ВидПродукции, ПараметрыСУЗ) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессии", Ложь);
	ВозвращаемоеЗначение.Вставить("РезультатОтправкиЗапроса",       Неопределено);
	ВозвращаемоеЗначение.Вставить("Операция",                       Перечисления.ВидыОперацийИСМП.ПолучениеКодовМаркировкиИзСУЗ);
	ВозвращаемоеЗначение.Вставить("СтатусОбработки",                Неопределено);
	ВозвращаемоеЗначение.Вставить("ДанныеБлоков",                   Неопределено);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                    "");
	
	ТокенДоступа = ТокенДоступаПоПараметрамСУЗ(ПараметрыСУЗ);
	
	Если ТокенДоступа = Неопределено Тогда
		ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии = Истина;
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type",   "application/x-www-form-urlencoded;charset=UTF-8");
	ЗаголовокHTTP.Вставить("Accept",         "application/json");
	ЗаголовокHTTP.Вставить("Accept-Charset", "utf-8");
	ЗаголовокHTTP.Вставить("clientToken",    ТокенДоступа);
	
	ПараметрыURL = Новый Массив;
	ПараметрыURL.Добавить(СтрШаблон("omsId=%1",    ПараметрыСУЗ.Идентификатор));
	ПараметрыURL.Добавить(СтрШаблон("orderId=%1",  ПараметрыЗапроса.ИдентификаторБизнесЗаказа));
	ПараметрыURL.Добавить(СтрШаблон("gtin=%1",     ПараметрыЗапроса.GTIN));
	
	Если ПараметрыСУЗ.ФорматОбмена = Перечисления.ВерсииФорматаОбменаСУЗ.V3 Тогда
		URLЗапроса = СтрШаблон("api/v3/order/codes/blocks?%1", СтрСоединить(ПараметрыURL, "&"));
	Иначе
		URLЗапроса = СтрШаблон(
			URLЗапроса_V2("api/v2/extension/codes/blocks?%1", ВидПродукции),
			СтрСоединить(ПараметрыURL, "&"));
	КонецЕсли;
	
	РезультатЗапроса = ОбщегоНазначенияИСМП.ПолучитьДанныеИзСервиса(URLЗапроса, Неопределено, ПараметрыСУЗ, ЗаголовокHTTP);
	
	РезультатОтправкиЗапроса = ОбменДаннымиИСМПКлиентСервер.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON(РезультатЗапроса);
	
	ВозвращаемоеЗначение.РезультатОтправкиЗапроса = РезультатОтправкиЗапроса;
	
	Если РезультатОтправкиЗапроса.ОтветПолучен Тогда
		
		Если РезультатОтправкиЗапроса.КодСостояния = 200 Тогда
			
			// Структура - Ожидаемое результат запроса:
			//  * omsId - GUID - Идентификатор СУЗ
			//  * codes - Массиз Из Строка - Полученные коды маркировки
			//  * blockId - Строка - Идентификатор пакета кодов маркировки
			ДанныеОбработки = ОбменДаннымиИСМПКлиентСервер.ТекстJSONВОбъект(РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON);
			Если ДанныеОбработки = Неопределено Тогда
				
				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
				
				ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
					URLЗапроса,
					РезультатОтправкиЗапроса);
				
			Иначе
				
				БлокиКодов = Новый Массив;
				
				Если ДанныеОбработки.Свойство("blocks") Тогда
					Для Каждого СтрокаБлока Из ДанныеОбработки.blocks Цикл
						
						БлокКодов = Новый Структура();
						БлокКодов.Вставить("ИдентификаторБлока", СтрокаБлока.blockId);
						БлокКодов.Вставить("Количество",         СтрокаБлока.quantity);
						БлокКодов.Вставить("ДатаСоздания",       ОбщегоНазначенияИСКлиентСервер.ДатаИзСтрокиUNIX(СтрокаБлока.blockDateTime));
						
						БлокиКодов.Добавить(БлокКодов);
						
					КонецЦикла;
				КонецЕсли;
				
				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена;
				
				ВозвращаемоеЗначение.ДанныеБлоков = БлокиКодов;
				
			КонецЕсли;
			
		Иначе
			
			ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
				URLЗапроса,
				РезультатОтправкиЗапроса);
			
			Если СтрНайти(ВозвращаемоеЗначение.ТекстОшибки, "Billing response didn't received in time. Close request sent") Тогда
				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОбрабатывается;
			ИначеЕсли Не ЗначениеЗаполнено(СокрЛП(ВозвращаемоеЗначение.ТекстОшибки)) Тогда
				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОбрабатывается;
			Иначе
				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
		
		ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
			URLЗапроса,
			РезультатОтправкиЗапроса);
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция СтатусПулаКодовМаркировкиИзБизнесЗаказа_V2(ПараметрыЗапроса, ВидПродукции, ПараметрыСУЗ) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессии", Ложь);
	ВозвращаемоеЗначение.Вставить("РезультатОтправкиЗапроса",       Неопределено);
	ВозвращаемоеЗначение.Вставить("Операция",                       Перечисления.ВидыОперацийИСМП.ПолучениеСтатусаПулаКодовМаркировкиИзСУЗ);
	ВозвращаемоеЗначение.Вставить("СтатусОбработки",                Перечисления.СтатусыОбработкиСообщенийИСМП.ПустаяСсылка());
	ВозвращаемоеЗначение.Вставить("ДанныеПула",                     Неопределено);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                    "");
	
	ТокенДоступа = ТокенДоступаПоПараметрамСУЗ(ПараметрыСУЗ);
	
	Если ТокенДоступа = Неопределено Тогда
		ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии = Истина;
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type",   "application/x-www-form-urlencoded;charset=UTF-8");
	ЗаголовокHTTP.Вставить("Accept",         "application/json");
	ЗаголовокHTTP.Вставить("Accept-Charset", "utf-8");
	ЗаголовокHTTP.Вставить("clientToken",    ТокенДоступа);
	
	Если ПараметрыСУЗ.ФорматОбмена = Перечисления.ВерсииФорматаОбменаСУЗ.V3 Тогда
		URLЗапроса = СтрШаблон("api/v3/order/status?omsId=%1&orderId=%2&gtin=%3",
			ПараметрыСУЗ.Идентификатор,
			ПараметрыЗапроса.ИдентификаторБизнесЗаказа,
			ПараметрыЗапроса.GTIN);
	Иначе
		URLЗапроса = СтрШаблон(
			URLЗапроса_V2("api/v2/extension/buffer/status?omsId=%1&orderId=%2&gtin=%3", ВидПродукции),
			ПараметрыСУЗ.Идентификатор,
			ПараметрыЗапроса.ИдентификаторБизнесЗаказа,
			ПараметрыЗапроса.GTIN);
	КонецЕсли;
	
	РезультатЗапроса = ОбщегоНазначенияИСМП.ПолучитьДанныеИзСервиса(URLЗапроса, Неопределено, ПараметрыСУЗ, ЗаголовокHTTP);
	
	РезультатОтправкиЗапроса = ОбменДаннымиИСМПКлиентСервер.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON(РезультатЗапроса);
	
	ВозвращаемоеЗначение.РезультатОтправкиЗапроса = РезультатОтправкиЗапроса;
	
	Если РезультатОтправкиЗапроса.ОтветПолучен Тогда
		
		Если РезультатОтправкиЗапроса.КодСостояния = 200 Тогда
			
			// Структура - Ожидаемое результат запроса:
			//  * availableCodes - Число - Общее количество доступных кодов маркировки для товара в буфере и пулах регистратора
			//  * bufferStatus - Строка - Статус буфера
			//  * gtin - Строка - GTIN
			//  * leftInBuffer - Число - Количество неиспользованных кодов маркировки (локальный буфер)
			//  * omsId - Строка - Уникальный идентификатор СУЗ
			//  * orderId - Строка - Уникальный идентификатор заказа на эмиссию кодов маркировки
			//  * poolInfos - Массив Из Структура - Массив пулов, созданных для буфера:
			//     ** isRegistrarReady - Булево - Готовность РЭ
			//     ** lastRegistrarErrorTimestamp - Число - Метка времени, последней наблюдавшейся ошибки РЭ
			//     ** leftInRegistrar - Число - Оставшееся количество КМ в пуле
			//     ** quantity - Число - Заказанное количество КМ в пуле
			//     ** registrarErrorCount - Число - Количество ошибок РЭ
			//     ** registrarId - Строка - Идентификатор РЭ (номер)
			//     ** rejectionReason - Строка - Причина отказа
			//     ** status - Строка - Статус пула КМ
			//  * poolsExhausted - Булево - Пулы кодов маркировки в регистраторах исчерпаны
			//  * rejectionReason - Строка - Причина отклонения буфера СУЗ-ом
			//  * totalCodes - Число - Заказанное количество кодов маркировки в заказе
			//  * totalPassed - Число - Суммарное количество кодов маркировки полученных из буфера
			//  * unavailableCodes - Строка - Идентификатор пакета кодов маркировки
			ДанныеОбработки = ОбменДаннымиИСМПКлиентСервер.ТекстJSONВОбъект(РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON);
			Если ТипЗнч(ДанныеОбработки) = Тип("Массив") Тогда
				Если ДанныеОбработки.Количество() = 0 Тогда
					ДанныеОбработки = Неопределено;
				Иначе
					ДанныеОбработки = ДанныеОбработки[0];
				КонецЕсли;
			КонецЕсли;
			
			Если ДанныеОбработки = Неопределено Тогда
				
				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
				
				ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
					URLЗапроса,
					РезультатОтправкиЗапроса);
				
			Иначе
				
				Статус = ИнтерфейсСУЗСлужебный.СтатусПулаКодовМаркировки_V2(ДанныеОбработки.bufferStatus);
				
				ДанныеПула = Новый Структура;
				ДанныеПула.Вставить("GTIN",       ДанныеОбработки.gtin);
				ДанныеПула.Вставить("Количество", ДанныеОбработки.totalCodes);
				ДанныеПула.Вставить("Остаток",    ДанныеОбработки.leftInBuffer);
				ДанныеПула.Вставить("Статус",     Статус);
				
				Если Статус = Перечисления.СтатусыПулаКодовМаркировкиСУЗ.Отклонен Тогда
					
					ВозвращаемоеЗначение.ТекстОшибки = ДанныеОбработки.rejectionReason;
					
				ИначеЕсли Статус = Перечисления.СтатусыПулаКодовМаркировкиСУЗ.Ошибка Тогда
					
					Ошибки = Новый Массив;
					Ошибки.Добавить(ДанныеОбработки.rejectionReason);
					
					Для Каждого ЭлементДанных Из ДанныеОбработки.poolInfos Цикл
						Если Не ЗначениеЗаполнено(ЭлементДанных.rejectionReason) Тогда
							Продолжить;
						КонецЕсли;
						Ошибки.Добавить(
							СтрШаблон(НСтр("ru = 'Регистратор %1: %2'"),
							ЭлементДанных.registrarId, ЭлементДанных.rejectionReason));
					КонецЦикла;
					
					ВозвращаемоеЗначение.ТекстОшибки = СтрСоединить(Ошибки, Символы.ПС);
					
				КонецЕсли;
				
				Если Статус = Перечисления.СтатусыПулаКодовМаркировкиСУЗ.Обрабатывается Тогда
					ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОбрабатывается;
				ИначеЕсли Статус = Перечисления.СтатусыПулаКодовМаркировкиСУЗ.Ошибка
					Или Статус = Перечисления.СтатусыПулаКодовМаркировкиСУЗ.Отклонен Тогда
					ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена;
				Иначе
					ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена;
				КонецЕсли;
				
				ВозвращаемоеЗначение.ДанныеПула = ДанныеПула;
				
			КонецЕсли;
			
		Иначе
			
			ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
			
			ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
				URLЗапроса,
				РезультатОтправкиЗапроса);
			
		КонецЕсли;
		
	Иначе
		
		ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
		
		ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
			URLЗапроса,
			РезультатОтправкиЗапроса);
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ПроверитьДоступностьСУЗ_V2(ВидПродукции, ПараметрыСУЗ) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессии", Ложь);
	ВозвращаемоеЗначение.Вставить("РезультатОтправкиЗапроса",       Неопределено);
	ВозвращаемоеЗначение.Вставить("Доступен",                       Ложь);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                    "");
	
	ТокенДоступа = ТокенДоступаПоПараметрамСУЗ(ПараметрыСУЗ);
	
	Если ТокенДоступа = Неопределено Тогда
		ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии = Истина;
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	КодыОшибокОбновленияКлючаСессии = Новый Массив;
	
	Если ЗначениеЗаполнено(ПараметрыСУЗ.ИдентификаторСоединения) Тогда
		КодыОшибокОбновленияКлючаСессии.Добавить(1100);
	КонецЕсли;
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type", "application/x-www-form-urlencoded;charset=UTF-8");
	ЗаголовокHTTP.Вставить("Accept",       "application/json");
	ЗаголовокHTTP.Вставить("clientToken",  ТокенДоступа);
	
	Если ПараметрыСУЗ.ФорматОбмена = Перечисления.ВерсииФорматаОбменаСУЗ.V3 Тогда
		URLЗапроса = СтрШаблон("api/v3/ping?omsId=%1", ПараметрыСУЗ.Идентификатор);
	Иначе
		Если ВидПродукции = Неопределено Тогда
			ВидПродукции = Перечисления.ВидыПродукцииИС.Обувь;
			Для Каждого ПодключенныйВидПродукции Из ОбщегоНазначенияИСМПКлиентСерверПовтИсп.ВидыПродукцииОбязательнойМаркировки(Неопределено) Цикл
				Если ПоддерживаетсяФорматОбменаПоВидуПродукции(ПараметрыСУЗ.ФорматОбмена, ПодключенныйВидПродукции) Тогда
					ВидПродукции = ПодключенныйВидПродукции;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Если ВидПродукции = Перечисления.ВидыПродукцииИС.ПродукцияИзНатуральногоМеха Тогда
			ЗаголовокHTTP.Вставить("Content-Type", "application/json");
			URLЗапроса = СтрШаблон(
				URLЗапроса_V2("api/v3/extension/ping?omsId=%1", ВидПродукции),
				ПараметрыСУЗ.Идентификатор);
		Иначе
			URLЗапроса = СтрШаблон(
				URLЗапроса_V2("api/v2/extension/ping?omsId=%1", ВидПродукции),
				ПараметрыСУЗ.Идентификатор);
		КонецЕсли;
	КонецЕсли;

	РезультатЗапроса = ОбщегоНазначенияИСМП.ПолучитьДанныеИзСервиса(URLЗапроса, Неопределено, ПараметрыСУЗ, ЗаголовокHTTP);
	
	РезультатОтправкиЗапроса = ОбменДаннымиИСМПКлиентСервер.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON(РезультатЗапроса);
	
	ВозвращаемоеЗначение.РезультатОтправкиЗапроса = РезультатОтправкиЗапроса;
	
	Если РезультатОтправкиЗапроса.ОтветПолучен Тогда
		
		Если РезультатОтправкиЗапроса.КодСостояния = 200 Тогда
			
			// Структура - Ожидаемое результат запроса:
			//  * omsId - GUID - Идентификатор СУЗ
			ДанныеОбработки = ОбменДаннымиИСМПКлиентСервер.ТекстJSONВОбъект(РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON);
			Если ДанныеОбработки = Неопределено Тогда
				
				ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
					URLЗапроса,
					РезультатОтправкиЗапроса);
				
			Иначе
				
				ВозвращаемоеЗначение.Доступен = Истина;
				
			КонецЕсли;
			
			Возврат ВозвращаемоеЗначение;
			
		ИначеЕсли РезультатОтправкиЗапроса.КодСостояния = 400 Тогда
			
			ДанныеОбработки = ОбменДаннымиИСМПКлиентСервер.ТекстJSONВОбъект(РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON);
			
			Если ДанныеОбработки <> Неопределено Тогда
				Если ДанныеОбработки.Свойство("globalErrors") Тогда
					Для Каждого СтрокаОшибка Из ДанныеОбработки.globalErrors Цикл
						Если СтрокаОшибка.Свойство("errorCode")
							И КодыОшибокОбновленияКлючаСессии.Найти(СтрокаОшибка.errorCode) <> Неопределено Тогда
							ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии = Истина;
							Прервать;
						КонецЕсли;
					КонецЦикла;
				ИначеЕсли ДанныеОбработки.Свойство("errorCode")
					И КодыОшибокОбновленияКлючаСессии.Найти(ДанныеОбработки.errorCode) <> Неопределено Тогда
					ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии = Истина;
				КонецЕсли;
			КонецЕсли;
			
			ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
				URLЗапроса,
				РезультатОтправкиЗапроса);
			
			Если ПараметрыСУЗ.ФорматОбмена <> Перечисления.ВерсииФорматаОбменаСУЗ.V3
				И Не ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии
				И СтрНайти(ТекстОшибки, "недоступна для УОТ") > 0 Тогда
					ВозвращаемоеЗначение.Доступен = Истина;
					ВозвращаемоеЗначение.РезультатОтправкиЗапроса.КодСостояния = 200;
					ТекстОшибки = "";
			КонецЕсли;
			
			ВозвращаемоеЗначение.ТекстОшибки = ТекстОшибки;
			
		Иначе
			
			ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
				URLЗапроса,
				РезультатОтправкиЗапроса);
			
		КонецЕсли;
		
	Иначе
		
		ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
			URLЗапроса,
			РезультатОтправкиЗапроса);
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция СтатусЗаказаПоИдентификатору(ВидПродукции, ПараметрыСУЗ, ИдентификаторБизнесЗаказа) Экспорт

	ВозвращаемоеЗначение = СтатусыБизнесЗаказов_V2(ВидПродукции, ПараметрыСУЗ, ИдентификаторБизнесЗаказа);
	ВозвращаемоеЗначение.Вставить("Операция", Перечисления.ВидыОперацийИСМП.ПолучениеСтатусаПулаКодовМаркировкиИзСУЗ);
	ВозвращаемоеЗначение.Вставить("Статус",   Перечисления.СтатусыОбработкиЗаказовНаЭмиссиюКодовМаркировкиИСМП.ПустаяСсылка());

	Если ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии Тогда
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;

	Если ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена Тогда
		Для Каждого СтрокаЗаказа Из ВозвращаемоеЗначение.Список Цикл
			Если СтрокаЗаказа.ИдентификаторЗаявки <> ИдентификаторБизнесЗаказа Тогда
				Продолжить;
			КонецЕсли;
			ВозвращаемоеЗначение.Статус      = СтрокаЗаказа.Статус;
			ВозвращаемоеЗначение.ТекстОшибки = СтрокаЗаказа.ТекстОшибки;
			Если ВозвращаемоеЗначение.Статус = Перечисления.СтатусыОбработкиЗаказовНаЭмиссиюКодовМаркировкиИСМП.Ошибка Тогда
				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена;
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка Тогда
		ВозвращаемоеЗначение.Статус = Перечисления.СтатусыОбработкиЗаказовНаЭмиссиюКодовМаркировкиИСМП.Ошибка;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ВозвращаемоеЗначение.Статус) Тогда
		Если Не ЗначениеЗаполнено(ВозвращаемоеЗначение.ТекстОшибки) Тогда
			ВозвращаемоеЗначение.ТекстОшибки = СтрШаблон(
					НСтр("ru = 'Заказ %1 не найден в ГИС МТ.'"),
					ИдентификаторБизнесЗаказа);
		КонецЕсли;
		Если ВозвращаемоеЗначение.РезультатОтправкиЗапроса.ОтветПолучен Тогда
			ДанныеОбработки = ОбменДаннымиИСМПКлиентСервер.ТекстJSONВОбъект(ВозвращаемоеЗначение.РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON);
			Если ДанныеОбработки <> Неопределено
				И ДанныеОбработки.Свойство("errorCode")
				И ДанныеОбработки.errorCode = 3540 Тогда
				ВозвращаемоеЗначение.КодСостояния = 404;
			КонецЕсли;
		КонецЕсли;
		ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
	КонецЕсли;

	Возврат ВозвращаемоеЗначение;

КонецФункции

Функция СтатусыБизнесЗаказов_V2(ВидПродукции, ПараметрыСУЗ, ИдентификаторЗаказа = Неопределено) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессии", Ложь);
	ВозвращаемоеЗначение.Вставить("РезультатОтправкиЗапроса",       Неопределено);
	ВозвращаемоеЗначение.Вставить("СтатусОбработки",                Неопределено);
	ВозвращаемоеЗначение.Вставить("Список",                         Неопределено);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                    "");
	ВозвращаемоеЗначение.Вставить("КодСостояния",                   Неопределено);

	ТокенДоступа = ТокенДоступаПоПараметрамСУЗ(ПараметрыСУЗ);
	
	Если ТокенДоступа = Неопределено Тогда
		ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии = Истина;
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type", "application/x-www-form-urlencoded;charset=UTF-8");
	ЗаголовокHTTP.Вставить("Accept",       "application/json");
	ЗаголовокHTTP.Вставить("clientToken",  ТокенДоступа);
	
	ПараметрыURL = Новый Массив;
	ПараметрыURL.Добавить(СтрШаблон("omsId=%1", ПараметрыСУЗ.Идентификатор));
	Если ЗначениеЗаполнено(ИдентификаторЗаказа) Тогда
		ПараметрыURL.Добавить(СтрШаблон("orderId=%1", ИдентификаторЗаказа));
	КонецЕсли;

	Если ВидПродукции = Перечисления.ВидыПродукцииИС.ПродукцияИзНатуральногоМеха
		Или ПараметрыСУЗ.ФорматОбмена = Перечисления.ВерсииФорматаОбменаСУЗ.V3 Тогда
		ЗаголовокHTTP.Вставить("Content-Type", "application/json");
	КонецЕсли;

	Если ПараметрыСУЗ.ФорматОбмена = Перечисления.ВерсииФорматаОбменаСУЗ.V3
		И ВидПродукции <> Перечисления.ВидыПродукцииИС.ПродукцияИзНатуральногоМеха Тогда
		URLЗапроса = СтрШаблон("api/v3/order/list%1", ИнтерфейсИСМП.ПараметрыЗапроса(ПараметрыURL));
	Иначе
		URLЗапроса = СтрШаблон(
			URLЗапроса("api/v2/extension/orders%1", ВидПродукции),
			ИнтерфейсИСМП.ПараметрыЗапроса(ПараметрыURL));
	КонецЕсли;

	РезультатЗапроса = ОбщегоНазначенияИСМП.ПолучитьДанныеИзСервиса(URLЗапроса, Неопределено, ПараметрыСУЗ, ЗаголовокHTTP);
	
	РезультатОтправкиЗапроса = ОбменДаннымиИСМПКлиентСервер.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON(РезультатЗапроса);
	
	ВозвращаемоеЗначение.РезультатОтправкиЗапроса = РезультатОтправкиЗапроса;
	
	Если РезультатОтправкиЗапроса.ОтветПолучен Тогда
		
		ВозвращаемоеЗначение.КодСостояния = РезультатОтправкиЗапроса.КодСостояния;

		Если РезультатОтправкиЗапроса.КодСостояния = 200 Тогда
			
			// Структура - Ожидаемое результат запроса:
			//  * omsId - GUID - Идентификатор СУЗ
			//  * orderInfos - Массив Из Структура - Идентификатор отчета:
			//    ** orderId - Строка - Идентификатор заказа на эмиссию
			//    ** orderStatus - Строка - Статус
			//    ** buffers - Массив Из Структура - Массив информации о статусе буферов:
			//       *** isRegistrarReady - Булево - Готовность РЭ
			//       *** lastRegistrarErrorTimestamp - Число - Метка времени, последней наблюдавшейся ошибки РЭ
			//       *** leftInRegistrar - Число - Оставшееся количество КМ в пуле
			//       *** quantity - Число - Заказанное количество КМ в пуле
			//       *** registrarErrorCount - Число - Количество ошибок РЭ
			//       *** registrarId - Строка - Идентификатор РЭ (номер)
			//       *** rejectionReason - Строка - Причина отказа
			//       *** status - Строка - Статус пула КМ
			//    ** createdTimestamp - Число - Время создания заказа
			//    ** declineReason - Строка - Причина отклонения заказа
			ДанныеОбработки = ОбменДаннымиИСМПКлиентСервер.ТекстJSONВОбъект(РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON);
			Если ДанныеОбработки = Неопределено Тогда
				
				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
				
				ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
					URLЗапроса,
					РезультатОтправкиЗапроса);
				
			Иначе
				
				Список = Новый Массив;
				
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеОбработки, "orderInfos") Тогда
					Для Каждого ЭлементДанных Из ДанныеОбработки.orderInfos Цикл
						
						Статус = ИнтерфейсСУЗСлужебный.СтатусБизнесЗаказа(ЭлементДанных.orderStatus);
						
						ДанныеПоЗаказуНаЭмиссию = Новый Структура;
						ДанныеПоЗаказуНаЭмиссию.Вставить("ИдентификаторЗаявки", ЭлементДанных.orderId);
						ДанныеПоЗаказуНаЭмиссию.Вставить("Статус",              Статус);
						Если Статус = Перечисления.СтатусыОбработкиЗаказовНаЭмиссиюКодовМаркировкиИСМП.Ошибка Тогда
							Если ЭлементДанных.Свойство("declineReason") Тогда
								ДанныеПоЗаказуНаЭмиссию.Вставить("ТекстОшибки", ЭлементДанных.declineReason);
							ИначеЕсли ЭлементДанных.Свойство("description") Тогда
								ДанныеПоЗаказуНаЭмиссию.Вставить("ТекстОшибки", ЭлементДанных.description);
							Иначе
								ДанныеПоЗаказуНаЭмиссию.Вставить("ТекстОшибки", НСтр("ru = 'Описание ошибки отсутствует.'"));
							КонецЕсли;
						Иначе
							ДанныеПоЗаказуНаЭмиссию.Вставить("ТекстОшибки", "");
						КонецЕсли;
						
						Список.Добавить(ДанныеПоЗаказуНаЭмиссию);
						
					КонецЦикла;
				КонецЕсли;
				
				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена;
				ВозвращаемоеЗначение.Список          = Список;
				
			КонецЕсли;
			
			Возврат ВозвращаемоеЗначение;
			
		Иначе
			
			ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
			
			ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
				URLЗапроса,
				РезультатОтправкиЗапроса);
			
		КонецЕсли;
		
	Иначе
		
		ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
		
		ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
			URLЗапроса,
			РезультатОтправкиЗапроса);
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция РезультатОбработкиОтчетаПоДаннымКвитанции(ИдентификаторОтчета, ВидПродукции, ИдентификаторСобытия, ПараметрыСУЗ) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессии", Ложь);
	ВозвращаемоеЗначение.Вставить("РезультатОтправкиЗапроса",       Неопределено);
	ВозвращаемоеЗначение.Вставить("Операция",                       Перечисления.ВидыОперацийИСМП.ПолучениеРезультатаОбработкиДокумента);
	ВозвращаемоеЗначение.Вставить("СтатусОбработки",                Неопределено);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                    "");
	ВозвращаемоеЗначение.Вставить("КодыСОшибками",                  Новый Массив);
	ВозвращаемоеЗначение.Вставить("КодОшибки",                      "");
	
	ТокенДоступа = ТокенДоступаПоПараметрамСУЗ(ПараметрыСУЗ);
	
	Если ТокенДоступа = Неопределено Тогда
		ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии = Истина;
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type", "application/json; charset=utf-8");
	ЗаголовокHTTP.Вставить("Accept",       "application/json");
	ЗаголовокHTTP.Вставить("clientToken",  ТокенДоступа);
	
	Если ПараметрыСУЗ.ФорматОбмена = Перечисления.ВерсииФорматаОбменаСУЗ.V3 Тогда
		URLЗапроса = СтрШаблон("api/v3/receipts/document?omsId=%1&resultDocId=%2&docId=%3",
			ПараметрыСУЗ.Идентификатор,
			ИдентификаторОтчета,
			ИдентификаторСобытия);
	Иначе
		URLЗапроса = СтрШаблон(
			URLЗапроса_V2("api/v2/extension/receipts/document?omsId=%1&resultDocId=%2&docId=%3", ВидПродукции),
			ПараметрыСУЗ.Идентификатор,
			ИдентификаторОтчета,
			ИдентификаторСобытия);
	КонецЕсли;
	
	РезультатЗапроса = ОбщегоНазначенияИСМП.ПолучитьДанныеИзСервиса(URLЗапроса, Неопределено, ПараметрыСУЗ, ЗаголовокHTTP);
	
	РезультатОтправкиЗапроса = ОбменДаннымиИСМПКлиентСервер.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON(РезультатЗапроса);
	
	ВозвращаемоеЗначение.РезультатОтправкиЗапроса = РезультатОтправкиЗапроса;
	
	Если РезультатОтправкиЗапроса.ОтветПолучен Тогда
		
		Если РезультатОтправкиЗапроса.КодСостояния = 200 Тогда
			
			// Структура - Ожидаемое результат запроса:
			//  * content - Структура
			//  ** docType - Тип документа.
			//  ** errorReason - Причина ошибки при неудачной операции
			//  ** result - Результат обработки/получения документа. Перечень допустимых значений (См. пункт 11.3.3)
			ДанныеОбработки = ОбменДаннымиИСМПКлиентСервер.ТекстJSONВОбъект(РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON);
			Если ДанныеОбработки = Неопределено Тогда
				
				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
				
				ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
					URLЗапроса,
					РезультатОтправкиЗапроса);
				
			Иначе
				
				СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОбрабатывается;
				ТекстыОшибок  = Новый Соответствие;
				КодыСОшибками = Новый Массив;
				
				СодержимоеДокумента = ОбменДаннымиИСМПКлиентСервер.ТекстJSONВОбъект(ДанныеОбработки["content"], Истина);
				
				Если СодержимоеДокумента <> Неопределено
					И СодержимоеДокумента["cisList"] <> Неопределено
					И ТипЗнч(СодержимоеДокумента["cisList"]) = Тип("Массив") Тогда
					
					СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена;

					Если ВидПродукции = Перечисления.ВидыПродукцииИС.Табак Тогда
						ПараметрыНормализации = РазборКодаМаркировкиИССлужебныйКлиентСервер.ПараметрыНормализацииКодаМаркировки();
						ПараметрыНормализации.ВключатьМРЦ = Ложь;
					КонецЕсли;

					Для Каждого СтрокаКодаМаркировки Из СодержимоеДокумента["cisList"] Цикл
						
						КодМаркировки = СтрокаКодаМаркировки["cis"];
						КодОшибки     = СтрокаКодаМаркировки["code"];
						ТекстОшибки   = СтрокаКодаМаркировки["description"];
						
						ПредставлениеОшибки = СокрЛП(СтрШаблон("%1: %2", КодОшибки, ТекстОшибки));
						Если ЗначениеЗаполнено(ТекстОшибки) И КодОшибки <> 0 Тогда
							КодыМаркировкиПоВидуТекстаОшибки = ТекстыОшибок[ПредставлениеОшибки];
							Если КодыМаркировкиПоВидуТекстаОшибки = Неопределено Тогда
								КодыМаркировкиПоВидуТекстаОшибки = Новый Массив;
							КонецЕсли;
							
							ДанныеРазбора = РазборКодаМаркировкиИССлужебный.РазобратьКодМаркировки(КодМаркировки, ВидПродукции);
							Если ДанныеРазбора <> Неопределено Тогда
								
								КодыМаркировкиПоВидуТекстаОшибки.Добавить(ДанныеРазбора.НормализованныйКодМаркировки);
								
								Если ВидПродукции = Перечисления.ВидыПродукцииИС.Табак Тогда
									
									НормализованныйКодМаркировкиБезМРЦ = РазборКодаМаркировкиИССлужебныйКлиентСервер.НормализоватьКодМаркировки(
										ДанныеРазбора, ВидПродукции, ПараметрыНормализации);
									Если ДанныеРазбора.НормализованныйКодМаркировки <> НормализованныйКодМаркировкиБезМРЦ Тогда
										КодыСОшибками.Добавить(НормализованныйКодМаркировкиБезМРЦ);
									КонецЕсли;
									
								КонецЕсли;
								
							Иначе
								НормализованныйКодМаркировки = СтрЗаменить(КодМаркировки, Символ(29), "<GS>");
								КодыМаркировкиПоВидуТекстаОшибки.Добавить(НормализованныйКодМаркировки);
							КонецЕсли;
							
							ТекстыОшибок[ПредставлениеОшибки] = КодыМаркировкиПоВидуТекстаОшибки;
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЕсли;
				
				ВозвращаемоеЗначение.СтатусОбработки = СтатусОбработки;
				
				Если ТекстыОшибок.Количество() Тогда
					ТекстОшибки = Новый Массив;
					Для Каждого КлючИЗначение Из ТекстыОшибок Цикл
						ТекстОшибки.Добавить(КлючИЗначение.Ключ + " " + СтрСоединить(КлючИЗначение.Значение, ", "));
						Если КлючИЗначение.Значение <> Неопределено Тогда
							ОбщегоНазначенияКлиентСервер.ДополнитьМассив(КодыСОшибками, КлючИЗначение.Значение);
						КонецЕсли;
					КонецЦикла;
					ВозвращаемоеЗначение.ТекстОшибки = СтрСоединить(ТекстОшибки, Символы.ПС);
					ВозвращаемоеЗначение.КодыСОшибками = КодыСОшибками;
				КонецЕсли;
				
			КонецЕсли;
			
			Возврат ВозвращаемоеЗначение;
			
		ИначеЕсли РезультатОтправкиЗапроса.КодСостояния = 400 Тогда
			
			ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена;
			
			ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
				URLЗапроса,
				РезультатОтправкиЗапроса);
				
			ДанныеJSON = ОбменДаннымиИСМПКлиентСервер.ТекстJSONВОбъект(РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON);
			Если ДанныеJSON <> Неопределено
				И ТипЗнч(ДанныеJSON) = Тип("Структура")
				И ДанныеJSON.Свойство("globalErrors")
				И ТипЗнч(ДанныеJSON.globalErrors) = Тип("Массив") Тогда
				
				Для Каждого СтрокаОшибки Из ДанныеJSON.globalErrors Цикл 
					Если ТипЗнч(СтрокаОшибки) = Тип("Структура") Тогда
						СтрокаОшибки.Свойство("errorCode", ВозвращаемоеЗначение.КодОшибки);
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
			КонецЕсли;
			
		Иначе
			
			ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
			
			ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
				URLЗапроса,
				РезультатОтправкиЗапроса);
			
		КонецЕсли;
		
	Иначе
		
		ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
			URLЗапроса,
			РезультатОтправкиЗапроса);
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция СтатусКвитанцииДокумента_V2(ИдентификаторОтчета, ВидПродукции, ПараметрыСУЗ) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессии", Ложь);
	ВозвращаемоеЗначение.Вставить("РезультатОтправкиЗапроса",       Неопределено);
	ВозвращаемоеЗначение.Вставить("Операция",                       Перечисления.ВидыОперацийИСМП.ПолучениеРезультатаОбработкиДокумента);
	ВозвращаемоеЗначение.Вставить("СтатусОбработки",                Неопределено);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                    "");
	ВозвращаемоеЗначение.Вставить("ИдентификаторСобытия",           "");
	ВозвращаемоеЗначение.Вставить("КодОшибки",                      "");
	
	ТокенДоступа = ТокенДоступаПоПараметрамСУЗ(ПараметрыСУЗ);
	
	Если ТокенДоступа = Неопределено Тогда
		ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии = Истина;
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type", "application/json; charset=utf-8");
	ЗаголовокHTTP.Вставить("Accept",       "application/json");
	ЗаголовокHTTP.Вставить("clientToken",  ТокенДоступа);
	
	Если ПараметрыСУЗ.ФорматОбмена = Перечисления.ВерсииФорматаОбменаСУЗ.V3 Тогда
		URLЗапроса = СтрШаблон("api/v3/receipts/receipt?omsId=%1&resultDocId=%2",
			ПараметрыСУЗ.Идентификатор,
			ИдентификаторОтчета);
	Иначе
		URLЗапроса = СтрШаблон(
			URLЗапроса_V2("api/v2/extension/receipts/receipt?omsId=%1&resultDocId=%2", ВидПродукции),
			ПараметрыСУЗ.Идентификатор,
			ИдентификаторОтчета);
	КонецЕсли;
	
	РезультатЗапроса = ОбщегоНазначенияИСМП.ПолучитьДанныеИзСервиса(URLЗапроса, Неопределено, ПараметрыСУЗ, ЗаголовокHTTP);
	
	РезультатОтправкиЗапроса = ОбменДаннымиИСМПКлиентСервер.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON(РезультатЗапроса);
	
	ВозвращаемоеЗначение.РезультатОтправкиЗапроса = РезультатОтправкиЗапроса;
	
	Если РезультатОтправкиЗапроса.ОтветПолучен Тогда
		
		Если РезультатОтправкиЗапроса.КодСостояния = 200 Тогда
			
			// Структура - Ожидаемое результат запроса:
			//  * results - массив результатов
			//  ** state - Статус обработки квитанции.
			//  ** description - описание обработки квитанции.
			//  ** operations - массив - Список событий по документу в рамках транзакции.
			//  ** result - Результат обработки/получения документа. Перечень допустимых значений (См. пункт 11.3.3).
			//  *** operationType - Тип события - ожидаемый конечный тип события RNMS_GIS_PROCESSED.
			//  *** docId - Идентификатор связанного с квитанцией документа (документа, сформированного для события) - для запрос результата обработки по кодам.
			ДанныеОбработки = ОбменДаннымиИСМПКлиентСервер.ТекстJSONВОбъект(РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON);
			Если ДанныеОбработки = Неопределено Тогда
				
				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
				
				ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
					URLЗапроса,
					РезультатОтправкиЗапроса);
				
			Иначе
				
				СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОбрабатывается;
				
				Для Каждого ДанныеКвитанции Из ДанныеОбработки["results"] Цикл
					
					СтатусОбработки = ИнтерфейсСУЗСлужебный.РезультатОбработкиОтчетаСУЗ(ДанныеКвитанции["state"]);
					Если СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка
						Или СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОбработанаЧастично Тогда	
						
						СобытияПоДокументуВРамкахТранзакции = ДанныеКвитанции["operations"];
						Для Каждого Событие Из СобытияПоДокументуВРамкахТранзакции Цикл
							Если Событие["operationType"] <> "RNMS_GIS_PROCESSED" Тогда
								Продолжить;
							КонецЕсли;
							ВозвращаемоеЗначение.ИдентификаторСобытия = Событие["docId"];
						КонецЦикла;
						ВозвращаемоеЗначение.ТекстОшибки = ДанныеКвитанции["description"];
						
					КонецЕсли;
					
				КонецЦикла;
				
				ВозвращаемоеЗначение.СтатусОбработки = СтатусОбработки;
				
			КонецЕсли;
			
			Возврат ВозвращаемоеЗначение;
			
		ИначеЕсли РезультатОтправкиЗапроса.КодСостояния = 400 Тогда
			
			ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена;
			
			ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
				URLЗапроса,
				РезультатОтправкиЗапроса);
				
			ДанныеJSON = ОбменДаннымиИСМПКлиентСервер.ТекстJSONВОбъект(РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON);
			Если ДанныеJSON <> Неопределено
				И ТипЗнч(ДанныеJSON) = Тип("Структура")
				И ДанныеJSON.Свойство("globalErrors")
				И ТипЗнч(ДанныеJSON.globalErrors) = Тип("Массив") Тогда
				
				Для Каждого СтрокаОшибки Из ДанныеJSON.globalErrors Цикл 
					Если ТипЗнч(СтрокаОшибки) = Тип("Структура") Тогда
						СтрокаОшибки.Свойство("errorCode", ВозвращаемоеЗначение.КодОшибки);
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
			КонецЕсли;
			
		Иначе
			
			ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
			
			ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
				URLЗапроса,
				РезультатОтправкиЗапроса);
			
		КонецЕсли;
		
	Иначе
		
		ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
			URLЗапроса,
			РезультатОтправкиЗапроса);
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция СтатусОбработкиОтчета_V2(ИдентификаторОтчета, ВидПродукции, ПараметрыСУЗ, ВидОперации) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессии", Ложь);
	ВозвращаемоеЗначение.Вставить("РезультатОтправкиЗапроса",       Неопределено);
	ВозвращаемоеЗначение.Вставить("Операция",                       Перечисления.ВидыОперацийИСМП.ПолучениеРезультатаОбработкиДокумента);
	ВозвращаемоеЗначение.Вставить("СтатусОбработки",                Неопределено);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                    "");
	
	ТокенДоступа = ТокенДоступаПоПараметрамСУЗ(ПараметрыСУЗ);
	
	Если ТокенДоступа = Неопределено Тогда
		ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии = Истина;
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type", "application/json; charset=utf-8");
	ЗаголовокHTTP.Вставить("Accept",       "application/json");
	ЗаголовокHTTP.Вставить("clientToken",  ТокенДоступа);
	
	Если ПараметрыСУЗ.ФорматОбмена = Перечисления.ВерсииФорматаОбменаСУЗ.V3
		И ВидПродукции <> Перечисления.ВидыПродукцииИС.ПродукцияИзНатуральногоМеха Тогда
		URLЗапроса = СтрШаблон("api/v3/report/info?omsId=%1&reportId=%2",
			ПараметрыСУЗ.Идентификатор,
			ИдентификаторОтчета);
	Иначе
		Если ВидПродукции = Перечисления.ВидыПродукцииИС.ПродукцияИзНатуральногоМеха Тогда
			URLЗапроса = СтрШаблон(
				URLЗапроса("api/v2/extension/reports?omsId=%1&reportId=%2", ВидПродукции),
				ПараметрыСУЗ.Идентификатор,
				ИдентификаторОтчета);
		Иначе
			URLЗапроса = СтрШаблон(
				URLЗапроса("api/v2/extension/report/info?omsId=%1&reportId=%2", ВидПродукции),
				ПараметрыСУЗ.Идентификатор,
				ИдентификаторОтчета);
		КонецЕсли;
	КонецЕсли;

	РезультатЗапроса = ОбщегоНазначенияИСМП.ПолучитьДанныеИзСервиса(URLЗапроса, Неопределено, ПараметрыСУЗ, ЗаголовокHTTP);
	
	РезультатОтправкиЗапроса = ОбменДаннымиИСМПКлиентСервер.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON(РезультатЗапроса);
	
	ВозвращаемоеЗначение.РезультатОтправкиЗапроса = РезультатОтправкиЗапроса;
	
	Если РезультатОтправкиЗапроса.ОтветПолучен Тогда
		
		Если РезультатОтправкиЗапроса.КодСостояния = 200 Тогда
			
			// Структура - Ожидаемое результат запроса:
			//  * omsId - GUID - Идентификатор СУЗ
			//  * reportId - GUID - Идентификатор отчета
			//  * reportStatus - Строка - Статус
			//  * errorReason - Строка - Причина отклонения отчета - заполняется, если reportStatus = REJECTED
			// Для ТГ Продукция из натурального меха
			//  * status - Строка - Статус
			//  * errorReason - Строка - Причина отклонения отчета - заполняется, если reportStatus = CHECKED_NOT_OK
			ДанныеОбработки = ОбменДаннымиИСМПКлиентСервер.ТекстJSONВОбъект(РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON);
			Если ДанныеОбработки = Неопределено Тогда
				
				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
				
				ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
					URLЗапроса,
					РезультатОтправкиЗапроса);
				
			Иначе
				
				Если ВидПродукции = Перечисления.ВидыПродукцииИС.ПродукцияИзНатуральногоМеха Тогда
					Статус = ИнтерфейсСУЗСлужебный.СтатусОбработкиОтчета(ДанныеОбработки.status);
				ИначеЕсли ВидОперации = Перечисления.ВидыОперацийИСМП.ОтчетОВерификацииНанесенныхКМ Тогда
					Статус = ИнтерфейсСУЗСлужебный.СтатусОбработкиОтчетаОНанесении(ДанныеОбработки.reportStatus);
				Иначе
					Статус = ИнтерфейсСУЗСлужебный.СтатусОбработкиОтчета(ДанныеОбработки.reportStatus);
				КонецЕсли;
				
				Если Статус = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена Тогда
					Если ДанныеОбработки.Свойство("errorReason") Тогда
						ВозвращаемоеЗначение.ТекстОшибки = ДанныеОбработки.errorReason;
					ИначеЕсли ДанныеОбработки.Свойство("description") Тогда
						ВозвращаемоеЗначение.ТекстОшибки = ДанныеОбработки.description;
					Иначе
						ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
							URLЗапроса,
							РезультатОтправкиЗапроса);
					КонецЕсли;
				КонецЕсли;
				
				ВозвращаемоеЗначение.СтатусОбработки = Статус;
				
			КонецЕсли;
			
			Возврат ВозвращаемоеЗначение;
			
		Иначе
			
			ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
			
			ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
				URLЗапроса,
				РезультатОтправкиЗапроса);
			
		КонецЕсли;
		
	Иначе
		
		ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
		
		ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
			URLЗапроса,
			РезультатОтправкиЗапроса);
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ЗапроситьСписокПродукции_V2(ПараметрыЗапроса, ВидПродукции, ПараметрыСУЗ) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессии", Ложь);
	ВозвращаемоеЗначение.Вставить("РезультатОтправкиЗапроса",       Неопределено);
	ВозвращаемоеЗначение.Вставить("СтатусОбработки",                Неопределено);
	ВозвращаемоеЗначение.Вставить("СписокПродукции",                Неопределено);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                    "");
	
	ТокенДоступа = ТокенДоступаПоПараметрамСУЗ(ПараметрыСУЗ);
	
	Если ТокенДоступа = Неопределено Тогда
		ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии = Истина;
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type", "application/json; charset=utf-8");
	ЗаголовокHTTP.Вставить("Accept",       "application/json");
	ЗаголовокHTTP.Вставить("clientToken",  ТокенДоступа);
	
	URLЗапроса = СтрШаблон(
		URLЗапроса_V2("api/v2/extension/product/info?omsId=%1", ВидПродукции),
		ПараметрыСУЗ.Идентификатор);
	
	РезультатЗапроса = ОбщегоНазначенияИСМП.ПолучитьДанныеИзСервиса(URLЗапроса, Неопределено, ПараметрыСУЗ, ЗаголовокHTTP);
	
	РезультатОтправкиЗапроса = ОбменДаннымиИСМПКлиентСервер.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON(РезультатЗапроса);
	
	ВозвращаемоеЗначение.РезультатОтправкиЗапроса = РезультатОтправкиЗапроса;
	
	Если РезультатОтправкиЗапроса.ОтветПолучен Тогда
		
		Если РезультатОтправкиЗапроса.КодСостояния = 200 Тогда
			
			// Структура - Ожидаемое результат запроса:
			//  * omsId - GUID - Идентификатор СУЗ
			//  * products - Массив Из Структура:
			//    ** gtin - Строка - GTIN
			//    ** name - Строка - Наименование продукции
			//    ** productAttributes - Структура - Свойства продукции
			ДанныеОбработки = ОбменДаннымиИСМПКлиентСервер.ТекстJSONВОбъект(РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON);
			Если ДанныеОбработки = Неопределено Тогда
				
				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
				
				ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
					URLЗапроса,
					РезультатОтправкиЗапроса);
				
			Иначе
				
				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена;
				
				СписокПродукции = Новый Массив;
				Для Каждого ЭлементДанных Из ДанныеОбработки.products Цикл
					
					ДанныеПродукции = Новый Структура;
					ДанныеПродукции.Вставить("GTIN",         ЭлементДанных.gtin);
					ДанныеПродукции.Вставить("Наименование", ЭлементДанных.name);
					ДанныеПродукции.Вставить("Свойства",     ЭлементДанных.productAttributes);
					
					СписокПродукции.Добавить(ДанныеПродукции);
					
				КонецЦикла;
				
				ВозвращаемоеЗначение.СписокПродукции = СписокПродукции;
				
			КонецЕсли;
			
			Возврат ВозвращаемоеЗначение;
			
		Иначе
			
			ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
			
			ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
				URLЗапроса,
				РезультатОтправкиЗапроса);
			
		КонецЕсли;
		
	Иначе
		
		ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
		
		ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
			URLЗапроса,
			РезультатОтправкиЗапроса);
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ЗапроситьТокен_V2(ПараметрыЗапроса, ВидПродукции, ПараметрыСУЗ) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессии", Ложь);
	ВозвращаемоеЗначение.Вставить("РезультатОтправкиЗапроса",       Неопределено);
	ВозвращаемоеЗначение.Вставить("СтатусОбработки",                Неопределено);
	ВозвращаемоеЗначение.Вставить("Токен",                          Неопределено);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                    "");
	
	ТокенДоступа = ТокенДоступаПоПараметрамСУЗ(ПараметрыСУЗ);
	
	Если ТокенДоступа = Неопределено Тогда
		ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии = Истина;
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type", "application/json; charset=utf-8");
	ЗаголовокHTTP.Вставить("Accept",       "application/json");
	ЗаголовокHTTP.Вставить("clientToken",  ТокенДоступа);
	
	Если ПараметрыСУЗ.ФорматОбмена = Перечисления.ВерсииФорматаОбменаСУЗ.V3 Тогда
		URLЗапроса = СтрШаблон("api/v3/token?omsId=%1&username=%2&password=%3",
			ПараметрыСУЗ.Идентификатор,
			ПараметрыЗапроса.ИмяПользователя,
			ПараметрыЗапроса.Пароль);
	Иначе
		URLЗапроса = СтрШаблон(
			URLЗапроса_V2("api/v2/extension/token?omsId=%1&username=%2&password=%3", ВидПродукции),
			ПараметрыСУЗ.Идентификатор,
			ПараметрыЗапроса.ИмяПользователя,
			ПараметрыЗапроса.Пароль);
	КонецЕсли;
	
	РезультатЗапроса = ОбщегоНазначенияИСМП.ПолучитьДанныеИзСервиса(URLЗапроса, Неопределено, ПараметрыСУЗ, ЗаголовокHTTP);
	
	РезультатОтправкиЗапроса = ОбменДаннымиИСМПКлиентСервер.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON(РезультатЗапроса);
	
	ВозвращаемоеЗначение.РезультатОтправкиЗапроса = РезультатОтправкиЗапроса;
	
	Если РезультатОтправкиЗапроса.ОтветПолучен Тогда
		
		Если РезультатОтправкиЗапроса.КодСостояния = 200 Тогда
			
			// Структура - Ожидаемое результат запроса:
			//  * omsId - GUID - Идентификатор СУЗ
			//  * token - Строка - Токен
			ДанныеОбработки = ОбменДаннымиИСМПКлиентСервер.ТекстJSONВОбъект(РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON);
			Если ДанныеОбработки = Неопределено Тогда
				
				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
				
				ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
					URLЗапроса,
					РезультатОтправкиЗапроса);
				
			Иначе
				
				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена;
				
				ВозвращаемоеЗначение.Токен = ДанныеОбработки.token;
				
			КонецЕсли;
			
			Возврат ВозвращаемоеЗначение;
			
		Иначе
			
			ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
			
			ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
				URLЗапроса,
				РезультатОтправкиЗапроса);
			
		КонецЕсли;
		
	Иначе
		
		ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
		
		ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
			URLЗапроса,
			РезультатОтправкиЗапроса);
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция СписокСервисПровайдеров_V2(ВидПродукции, ПараметрыСУЗ) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессии", Ложь);
	ВозвращаемоеЗначение.Вставить("РезультатОтправкиЗапроса",       Неопределено);
	ВозвращаемоеЗначение.Вставить("СтатусОбработки",                Неопределено);
	ВозвращаемоеЗначение.Вставить("Список",                         Неопределено);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                    "");
	
	ТокенДоступа = ТокенДоступаПоПараметрамСУЗ(ПараметрыСУЗ);
	
	Если ТокенДоступа = Неопределено Тогда
		ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии = Истина;
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type", "application/x-www-form-urlencoded;charset=UTF-8");
	ЗаголовокHTTP.Вставить("Accept",       "application/json");
	ЗаголовокHTTP.Вставить("clientToken",  ТокенДоступа);
	
	Если ПараметрыСУЗ.ФорматОбмена = Перечисления.ВерсииФорматаОбменаСУЗ.V3 Тогда
		URLЗапроса = СтрШаблон("api/v3/providers?omsId=%1", ПараметрыСУЗ.Идентификатор);
	Иначе
		URLЗапроса = СтрШаблон(
			URLЗапроса_V2("api/v2/extension/providers?omsId=%1", ВидПродукции),
			ПараметрыСУЗ.Идентификатор);
	КонецЕсли;
	
	РезультатЗапроса = ОбщегоНазначенияИСМП.ПолучитьДанныеИзСервиса(URLЗапроса, Неопределено, ПараметрыСУЗ, ЗаголовокHTTP);
	
	РезультатОтправкиЗапроса = ОбменДаннымиИСМПКлиентСервер.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON(РезультатЗапроса);
	
	ВозвращаемоеЗначение.РезультатОтправкиЗапроса = РезультатОтправкиЗапроса;
	
	Если РезультатОтправкиЗапроса.ОтветПолучен Тогда
		
		Если РезультатОтправкиЗапроса.КодСостояния = 200 Тогда
			
			ДанныеОбработки = ОбменДаннымиИСМПКлиентСервер.ТекстJSONВОбъект(РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON);
			Если ДанныеОбработки = Неопределено Тогда
				
				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
				
				ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
					URLЗапроса,
					РезультатОтправкиЗапроса);
				
			Иначе
				
				Список = Новый Массив;
				
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеОбработки, "providers") Тогда
					Для Каждого ЭлементДанных Из ДанныеОбработки.providers Цикл
						
						Данные = Новый Структура;
						Данные.Вставить("Идентификатор", ЭлементДанных.serviceProviderId);
						Данные.Вставить("Наименование",  ЭлементДанных.Name);
						Данные.Вставить("ИНН",           ЭлементДанных.taxIdentificationNumber);
						Данные.Вставить("Страна",
							УправлениеКонтактнойИнформацией.СтранаМираПоКодуИлиНаименованию(ЭлементДанных.country));
						Данные.Вставить("ВидСервисПровайдера",
							ИнтерфейсСУЗСлужебный.СпособИзготовленияКодовМаркировки(ЭлементДанных.role));
						Данные.Вставить("ВидыПродукции", Новый Массив);
						
						Для Каждого ЭлементВидаПродукции Из ЭлементДанных.productGroups Цикл
							Если ЭлементВидаПродукции = "pharma" Тогда
								Продолжить;
							КонецЕсли;
							Данные.ВидыПродукции.Добавить(ИнтерфейсИСМПОбщегоНазначения.ТоварнаяГруппа(ЭлементВидаПродукции));
						КонецЦикла;
						
						Список.Добавить(Данные);
						
					КонецЦикла;
				КонецЕсли;
				
				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена;
				ВозвращаемоеЗначение.Список          = Список;
				
			КонецЕсли;
			
			Возврат ВозвращаемоеЗначение;
			
		Иначе
			
			ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
			
			ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
				URLЗапроса,
				РезультатОтправкиЗапроса);
			
		КонецЕсли;
		
	Иначе
		
		ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
		
		ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
			URLЗапроса,
			РезультатОтправкиЗапроса);
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ИнтервалПолученияСтатусаОбработкиОтчетаСУЗ() Экспорт

	ВремяОжиданияСледующегоЗапроса = 60;
	Возврат ВремяОжиданияСледующегоЗапроса;

КонецФункции

#КонецОбласти

#Область Формат_V3

Функция ПоддерживаетсяФорматОбменаПоВидуПродукции(ФорматОбмена, ВидПродукции) Экспорт
	
	Возврат ФорматОбмена = Перечисления.ВерсииФорматаОбменаСУЗ.V3;
	
КонецФункции

Процедура ТелоЗапросаЗаказНаЭмиссиюКодовМаркировки(ТелоЗапроса, ВидПродукции) Экспорт
	
	Поля = Новый Структура;
	
	Поля.Вставить("ПолеАтрибутов",     "attributes");
	Поля.Вставить("ПолеВидаПродукции", "productGroup");
	Поля.Вставить("ПоляШапки",         Новый Структура);
	Поля.Вставить("ПоляУдаляемые",     Новый Структура);
	
	Поля.ПоляШапки.Вставить("serviceproviderId");
	Поля.ПоляШапки.Вставить("products", Новый Структура);
	
	Поля.ПоляШапки.products.Вставить("gtin");
	Поля.ПоляШапки.products.Вставить("quantity");
	Поля.ПоляШапки.products.Вставить("serialNumberType");
	Поля.ПоляШапки.products.Вставить("serialNumbers");
	Поля.ПоляШапки.products.Вставить("templateId");
	Поля.ПоляШапки.products.Вставить("cisType");
	
	Поля.ПоляУдаляемые.Вставить("remainsAvailable");
	
	КонвертироватьТелоЗапросаФормат_V3(ТелоЗапроса, ВидПродукции, Поля);
	
КонецПроцедуры

Процедура ТелоЗапросаОтчетОВерификацииНанесенныхКМ(ТелоЗапроса, ВидПродукции) Экспорт
	
	Поля = Новый Структура;
	
	Поля.Вставить("ПолеАтрибутов",     "attributes");
	Поля.Вставить("ПолеВидаПродукции", "productGroup");
	Поля.Вставить("ПоляШапки",         Новый Структура);
	Поля.Вставить("ПоляДаты",          Новый Структура);
	Поля.Вставить("ПоляУдаляемые",     Новый Структура);
	
	Поля.ПоляШапки.Вставить("sntins");
	
	Поля.ПоляДаты.Вставить("productionDate");
	Поля.ПоляДаты.Вставить("expirationDate");
	Поля.ПоляДаты.Вставить("expDate");
	Поля.ПоляДаты.Вставить("expDate72");
	
	Поля.ПоляУдаляемые.Вставить("usageType");
	Поля.ПоляУдаляемые.Вставить("cisType");
	
	КонвертироватьТелоЗапросаФормат_V3(ТелоЗапроса, ВидПродукции, Поля);
	
КонецПроцедуры

Процедура ТелоЗапросаАгрегация(ТелоЗапроса, ВидПродукции) Экспорт
	
	Поля = Новый Структура;
	
	Поля.Вставить("ПолеАтрибутов",     "attributes");
	Поля.Вставить("ПолеВидаПродукции", "productGroup");
	Поля.Вставить("ПоляШапки",         Новый Структура);
	
	Поля.ПоляШапки.Вставить("participantId");
	Поля.ПоляШапки.Вставить("aggregationUnits");
	
	КонвертироватьТелоЗапросаФормат_V3(ТелоЗапроса, ВидПродукции, Поля);
	
КонецПроцедуры

Процедура ТелоЗапросаСписаниеЭмитированныхКодовМаркировки(ТелоЗапроса, ВидПродукции) Экспорт
	
	Поля = Новый Структура;
	
	Поля.Вставить("ПолеАтрибутов",     "attributes");
	Поля.Вставить("ПолеВидаПродукции", "productGroup");
	Поля.Вставить("ПоляШапки",         Новый Структура);
	
	Поля.ПоляШапки.Вставить("dropoutReason");
	Поля.ПоляШапки.Вставить("sntins");
	
	КонвертироватьТелоЗапросаФормат_V3(ТелоЗапроса, ВидПродукции, Поля);
	
КонецПроцедуры

#КонецОбласти

Процедура ТелоЗапросаПоФорматуОбмена(ТелоЗапроса, ФорматОбмена, Операция, ВидПродукции) Экспорт
	
	Если ФорматОбмена = Перечисления.ВерсииФорматаОбменаСУЗ.V3
		И ВидПродукции <> Перечисления.ВидыПродукцииИС.ПродукцияИзНатуральногоМеха Тогда
		Если Операция = Перечисления.ВидыОперацийИСМП.ЗаказНаЭмиссиюКодовМаркировки Тогда
			ТелоЗапросаЗаказНаЭмиссиюКодовМаркировки(ТелоЗапроса, ВидПродукции);
		ИначеЕсли Операция = Перечисления.ВидыОперацийИСМП.ОтчетОВерификацииНанесенныхКМ Тогда
			ТелоЗапросаОтчетОВерификацииНанесенныхКМ(ТелоЗапроса, ВидПродукции);
		ИначеЕсли Операция = Перечисления.ВидыОперацийИСМП.Агрегация Тогда
			ТелоЗапросаАгрегация(ТелоЗапроса, ВидПродукции);
		ИначеЕсли Операция = Перечисления.ВидыОперацийИСМП.СписаниеЭмитированныхКодовМаркировки Тогда
			ТелоЗапросаСписаниеЭмитированныхКодовМаркировки(ТелоЗапроса, ВидПродукции);
		КонецЕсли;
	КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТокенДоступаПоПараметрамСУЗ(ПараметрыСУЗ)
	
	Если ЗначениеЗаполнено(ПараметрыСУЗ.ИдентификаторСоединения) Тогда
		ТокенДоступа = ИнтерфейсАвторизацииИСМПСлужебный.ПроверитьОбновитьКлючСессии(
			ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ПараметрыЗапросаКлючаСессииСУЗ(ПараметрыСУЗ));
	Иначе
		ТокенДоступа = ПараметрыСУЗ.Токен;
	КонецЕсли;
	
	Возврат ТокенДоступа;
	
КонецФункции

Функция URLЗапроса(URLЗапроса, ВидПродукции)

	НовыйURLЗапроса = URLЗапроса;
	Если ВидПродукции = Перечисления.ВидыПродукцииИС.ПродукцияИзНатуральногоМеха Тогда
		НовыйURLЗапроса = СтрЗаменить(НовыйURLЗапроса, "api/v2/extension/", "api/v3/extension/");
	КонецЕсли;

	Возврат URLЗапроса_V2(НовыйURLЗапроса, ВидПродукции);

КонецФункции

Функция URLЗапроса_V2(URLЗапроса, ВидПродукцииИС)
	
	Возврат СтрЗаменить(URLЗапроса, "extension", ВидПродукцииСУЗ(ВидПродукцииИС));
	
КонецФункции

Функция ВидПродукцииСУЗ(ВидПродукцииИС)
	
	Если ВидПродукцииИС = Перечисления.ВидыПродукцииИС.Табак Тогда
		ВидПродукции = "tobacco";
	ИначеЕсли ВидПродукцииИС = Перечисления.ВидыПродукцииИС.Шины Тогда
		ВидПродукции = "tires";
	ИначеЕсли ВидПродукцииИС = Перечисления.ВидыПродукцииИС.Духи Тогда
		ВидПродукции = "perfum";
	ИначеЕсли ВидПродукцииИС = Перечисления.ВидыПродукцииИС.Фотоаппараты Тогда
		ВидПродукции = "photo";
	ИначеЕсли ВидПродукцииИС = Перечисления.ВидыПродукцииИС.МолочнаяПродукцияПодконтрольнаяВЕТИС
			Или ВидПродукцииИС = Перечисления.ВидыПродукцииИС.МолочнаяПродукцияБезВЕТИС Тогда
		ВидПродукции = "milk";
	ИначеЕсли ВидПродукцииИС = Перечисления.ВидыПродукцииИС.Велосипеды Тогда
		ВидПродукции = "bicycle";
	ИначеЕсли ВидПродукцииИС = Перечисления.ВидыПродукцииИС.КреслаКоляски
		Или ВидПродукцииИС = Перечисления.ВидыПродукцииИС.ТехническиеСредстваРеабилитации
		Или ВидПродукцииИС = Перечисления.ВидыПродукцииИС.МедицинскиеИзделия
		Или ВидПродукцииИС = Перечисления.ВидыПродукцииИС.МедицинскиеИзделия20 Тогда
		ВидПродукции = "wheelchairs";
	ИначеЕсли ВидПродукцииИС = Перечисления.ВидыПродукцииИС.ЛегкаяПромышленность
		Или ВидПродукцииИС = Перечисления.ВидыПродукцииИС.ЛегкаяПромышленность2025
		Или ВидПродукцииИС = Перечисления.ВидыПродукцииИС.ЛегкаяПромышленность2026 Тогда
		ВидПродукции = "lp";
	ИначеЕсли ВидПродукцииИС = Перечисления.ВидыПродукцииИС.Обувь Тогда
		ВидПродукции = "shoes";
	ИначеЕсли ВидПродукцииИС = Перечисления.ВидыПродукцииИС.АльтернативныйТабак Тогда
		ВидПродукции = "otp";
	ИначеЕсли ВидПродукцииИС = Перечисления.ВидыПродукцииИС.УпакованнаяВода Тогда
		ВидПродукции = "water";
	ИначеЕсли ВидПродукцииИС = Перечисления.ВидыПродукцииИС.Пиво
		Или ВидПродукцииИС = Перечисления.ВидыПродукцииИС.ПивоВПотребительскихУпаковках Тогда
		ВидПродукции = "beer";
	ИначеЕсли ВидПродукцииИС = Перечисления.ВидыПродукцииИС.НикотиносодержащаяПродукция Тогда
		ВидПродукции = "ncp";
	ИначеЕсли ВидПродукцииИС = Перечисления.ВидыПродукцииИС.БАДы
		Или ВидПродукцииИС = Перечисления.ВидыПродукцииИС.БАДы2025
		Или ВидПродукцииИС = Перечисления.ВидыПродукцииИС.СпортивноеПитание Тогда
		ВидПродукции = "bio";
	ИначеЕсли ВидПродукцииИС = Перечисления.ВидыПродукцииИС.Антисептики
		Или ВидПродукцииИС = Перечисления.ВидыПродукцииИС.ДезинфицирующиеСредства Тогда
		ВидПродукции = "antiseptic";
	ИначеЕсли ВидПродукцииИС = Перечисления.ВидыПродукцииИС.МорепродуктыПодконтрольныеВЕТИС Тогда
		ВидПродукции = "seafood";
	ИначеЕсли ВидПродукцииИС = Перечисления.ВидыПродукцииИС.ПродукцияИзНатуральногоМеха Тогда
		ВидПродукции = "furs";
	ИначеЕсли ВидПродукцииИС = Перечисления.ВидыПродукцииИС.СоковаяПродукция
		Или ВидПродукцииИС = Перечисления.ВидыПродукцииИС.БезалкогольныеНапитки
		Или ВидПродукцииИС = Перечисления.ВидыПродукцииИС.НапиткиССодержаниемМолокаКакаоПрочие Тогда
		ВидПродукции = "softdrinks";
	ИначеЕсли ВидПродукцииИС = Перечисления.ВидыПродукцииИС.БезалкогольноеПиво Тогда
		ВидПродукции = "nabeer";
	Иначе
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Неизвестный вид продукции: %1'"),
			ВидПродукцииИС);
	КонецЕсли;
	
	Возврат ВидПродукции;
	
КонецФункции

#Область Формат_V3

Процедура КонвертироватьТелоЗапросаФормат_V3(ТелоЗапроса, ВидПродукции, Поля)
	
	АтрибутыШапки     = Неопределено;
	ЕстьПоляДаты      = Поля.Свойство("ПоляДаты");
	ЕстьПоляУдаляемые = Поля.Свойство("ПоляУдаляемые");
	
	Для Каждого Элемент Из ТелоЗапроса Цикл
		Если Элемент.Ключ = Поля.ПолеАтрибутов Тогда
			Продолжить;
		КонецЕсли;
		Если Не Поля.ПоляШапки.Свойство(Элемент.Ключ) Тогда
			Если АтрибутыШапки = Неопределено Тогда
				ТелоЗапроса.Вставить(Поля.ПолеАтрибутов, Новый Структура);
				АтрибутыШапки = ТелоЗапроса[Поля.ПолеАтрибутов];
			КонецЕсли;
			Если ЕстьПоляДаты И Поля.ПоляДаты.Свойство(Элемент.Ключ) Тогда
				АтрибутыШапки.Вставить(Элемент.Ключ, ДатаВФормате_V3(Элемент.Значение));
			ИначеЕсли Не (ЕстьПоляУдаляемые И Поля.ПоляУдаляемые.Свойство(Элемент.Ключ)) Тогда
				АтрибутыШапки.Вставить(Элемент.Ключ, Элемент.Значение);
			КонецЕсли;
			ТелоЗапроса.Удалить(Элемент.Ключ);
		ИначеЕсли ТипЗнч(Поля.ПоляШапки[Элемент.Ключ]) = Тип("Структура") Тогда
			ПоляСтроки = Поля.ПоляШапки[Элемент.Ключ];
			Для Каждого Строка Из ТелоЗапроса[Элемент.Ключ] Цикл
				АтрибутыСтроки = Неопределено;
				Для Каждого ЭлементСтроки Из Строка Цикл
					Если ЭлементСтроки.Ключ = Поля.ПолеАтрибутов Тогда
						Продолжить;
					КонецЕсли;
					Если Не ПоляСтроки.Свойство(ЭлементСтроки.Ключ) Тогда
						Если АтрибутыСтроки = Неопределено Тогда
							Строка.Вставить(Поля.ПолеАтрибутов, Новый Структура);
							АтрибутыСтроки = Строка[Поля.ПолеАтрибутов];
						КонецЕсли;
						Строка[Поля.ПолеАтрибутов].Вставить(ЭлементСтроки.Ключ, ЭлементСтроки.Значение);
						Строка.Удалить(ЭлементСтроки.Ключ);
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	ТелоЗапроса.Вставить(Поля.ПолеВидаПродукции, ВидПродукцииСУЗ_V3(ВидПродукции));
	
КонецПроцедуры

Функция ДатаВФормате_V3(Дата)
	
	Если СтрДлина(Дата) = 10 И Сред(Дата, 3, 1) = "." И Сред(Дата, 6, 1) = "." Тогда
		Возврат СтрШаблон("%1-%2-%3",
					Сред(Дата, 7, 4),
					Сред(Дата, 4, 2),
					Сред(Дата, 1, 2));
	ИначеЕсли СтрДлина(Дата) = 6 Тогда
		Возврат СтрШаблон("20%1-%2-%3",
					Сред(Дата, 1, 2),
					Сред(Дата, 3, 2),
					Сред(Дата, 5, 2));
	ИначеЕсли СтрДлина(Дата) = 10 И СтрНайти(Дата, ".") = 0 Тогда
		Возврат СтрШаблон("20%1-%2-%3T%4:%5",
					Сред(Дата, 1, 2),
					Сред(Дата, 3, 2),
					Сред(Дата, 5, 2),
					Сред(Дата, 7, 2),
					Сред(Дата, 9, 2));
	Иначе
		Возврат Дата;
	КонецЕсли;
	
КонецФункции

Функция ВидПродукцииСУЗ_V3(ВидПродукцииИС)
	
	Если ВидПродукцииИС = Перечисления.ВидыПродукцииИС.Табак Тогда
		ВидПродукции = "tobacco";
	ИначеЕсли ВидПродукцииИС = Перечисления.ВидыПродукцииИС.Шины Тогда
		ВидПродукции = "tires";
	ИначеЕсли ВидПродукцииИС = Перечисления.ВидыПродукцииИС.Духи Тогда
		ВидПродукции = "perfumery";
	ИначеЕсли ВидПродукцииИС = Перечисления.ВидыПродукцииИС.Фотоаппараты Тогда
		ВидПродукции = "electronics";
	ИначеЕсли ВидПродукцииИС = Перечисления.ВидыПродукцииИС.МолочнаяПродукцияПодконтрольнаяВЕТИС
			Или ВидПродукцииИС = Перечисления.ВидыПродукцииИС.МолочнаяПродукцияБезВЕТИС Тогда
		ВидПродукции = "milk";
	ИначеЕсли ВидПродукцииИС = Перечисления.ВидыПродукцииИС.Велосипеды Тогда
		ВидПродукции = "bicycle";
	ИначеЕсли ВидПродукцииИС = Перечисления.ВидыПродукцииИС.КреслаКоляски
		Или ВидПродукцииИС = Перечисления.ВидыПродукцииИС.ТехническиеСредстваРеабилитации
		Или ВидПродукцииИС = Перечисления.ВидыПродукцииИС.МедицинскиеИзделия
		Или ВидПродукцииИС = Перечисления.ВидыПродукцииИС.МедицинскиеИзделия20 Тогда
		ВидПродукции = "wheelchairs";
	ИначеЕсли ВидПродукцииИС = Перечисления.ВидыПродукцииИС.ЛегкаяПромышленность
		Или ВидПродукцииИС = Перечисления.ВидыПродукцииИС.ЛегкаяПромышленность2025
		Или ВидПродукцииИС = Перечисления.ВидыПродукцииИС.ЛегкаяПромышленность2026 Тогда
		ВидПродукции = "lp";
	ИначеЕсли ВидПродукцииИС = Перечисления.ВидыПродукцииИС.Обувь Тогда
		ВидПродукции = "shoes";
	ИначеЕсли ВидПродукцииИС = Перечисления.ВидыПродукцииИС.АльтернативныйТабак Тогда
		ВидПродукции = "otp";
	ИначеЕсли ВидПродукцииИС = Перечисления.ВидыПродукцииИС.УпакованнаяВода Тогда
		ВидПродукции = "water";
	ИначеЕсли ВидПродукцииИС = Перечисления.ВидыПродукцииИС.Пиво
		Или ВидПродукцииИС = Перечисления.ВидыПродукцииИС.ПивоВПотребительскихУпаковках Тогда
		ВидПродукции = "beer";
	ИначеЕсли ВидПродукцииИС = Перечисления.ВидыПродукцииИС.НикотиносодержащаяПродукция Тогда
		ВидПродукции = "ncp";
	ИначеЕсли ВидПродукцииИС = Перечисления.ВидыПродукцииИС.БАДы
		Или ВидПродукцииИС = Перечисления.ВидыПродукцииИС.БАДы2025
		Или ВидПродукцииИС = Перечисления.ВидыПродукцииИС.СпортивноеПитание Тогда
		ВидПродукции = "bio";
	ИначеЕсли ВидПродукцииИС = Перечисления.ВидыПродукцииИС.Антисептики
		Или ВидПродукцииИС = Перечисления.ВидыПродукцииИС.ДезинфицирующиеСредства Тогда
		ВидПродукции = "antiseptic";
	ИначеЕсли ВидПродукцииИС = Перечисления.ВидыПродукцииИС.МорепродуктыПодконтрольныеВЕТИС Тогда
		ВидПродукции = "seafood";
	ИначеЕсли ВидПродукцииИС = Перечисления.ВидыПродукцииИС.ПродукцияИзНатуральногоМеха Тогда
		ВидПродукции = "furs";
	ИначеЕсли ВидПродукцииИС = Перечисления.ВидыПродукцииИС.СоковаяПродукция
		Или ВидПродукцииИС = Перечисления.ВидыПродукцииИС.БезалкогольныеНапитки
		Или ВидПродукцииИС = Перечисления.ВидыПродукцииИС.НапиткиССодержаниемМолокаКакаоПрочие Тогда
		ВидПродукции = "softdrinks";
	ИначеЕсли ВидПродукцииИС = Перечисления.ВидыПродукцииИС.БезалкогольноеПиво Тогда
		ВидПродукции = "nabeer";
	ИначеЕсли ВидПродукцииИС = Перечисления.ВидыПродукцииИС.КормаДляЖивотныхПодконтрольныеВЕТИС
		Или ВидПродукцииИС = Перечисления.ВидыПродукцииИС.КормаДляЖивотныхБезВЕТИС
		Или ВидПродукцииИС = Перечисления.ВидыПродукцииИС.КормаДляЖивотныхВлажныеПодконтрольныеВЕТИС
		Или ВидПродукцииИС = Перечисления.ВидыПродукцииИС.КормаДляЖивотныхВлажныеБезВЕТИС Тогда
		ВидПродукции = "petfood";
	ИначеЕсли ВидПродукцииИС = Перечисления.ВидыПродукцииИС.МясоПодконтрольноеВЕТИС Тогда
		ВидПродукции = "meat";
	ИначеЕсли ВидПродукцииИС = Перечисления.ВидыПродукцииИС.ВетеринарныеПрепараты Тогда
		ВидПродукции = "vetpharma";
	ИначеЕсли ВидПродукцииИС = Перечисления.ВидыПродукцииИС.ИгрыИИгрушкиДляДетей Тогда
		ВидПродукции = "toys";
	ИначеЕсли ВидПродукцииИС = Перечисления.ВидыПродукцииИС.РадиоэлектроннаяПродукция
		Или ВидПродукцииИС = Перечисления.ВидыПродукцииИС.ТелефоныИНоутбуки
		Или ВидПродукцииИС = Перечисления.ВидыПродукцииИС.ПечатныеПлаты Тогда
		ВидПродукции = "radio";
	ИначеЕсли ВидПродукцииИС = Перечисления.ВидыПродукцииИС.ТитановаяМеталлопродукция Тогда
		ВидПродукции = "titan";
	ИначеЕсли ВидПродукцииИС = Перечисления.ВидыПродукцииИС.КонсервированнаяПродукцияПодконтрольнаяВЕТИС
		Или ВидПродукцииИС = Перечисления.ВидыПродукцииИС.КонсервированнаяПродукцияБезВЕТИС Тогда
		ВидПродукции = "conserve";
	ИначеЕсли ВидПродукцииИС = Перечисления.ВидыПродукцииИС.РастительныеМасла Тогда
		ВидПродукции = "vegetableoil";
	ИначеЕсли ВидПродукцииИС = Перечисления.ВидыПродукцииИС.ОптоволокноИОптоволоконнаяПродукция Тогда
		ВидПродукции = "opticfiber";
	ИначеЕсли ВидПродукцииИС = Перечисления.ВидыПродукцииИС.ПарфюмерныеИКосметическиеСредстваИБытоваяХимия
		Или ВидПродукцииИС = Перечисления.ВидыПродукцииИС.ТоварыЛичнойГигиены
		Или ВидПродукцииИС = Перечисления.ВидыПродукцииИС.БритвыИЛезвия Тогда
		ВидПродукции = "chemistry";
	ИначеЕсли ВидПродукцииИС = Перечисления.ВидыПродукцииИС.ПечатнаяПродукция Тогда
		Возврат ПечатнаяПродукцияИмяТоварнойГруппы();
	ИначеЕсли ВидПродукцииИС = Перечисления.ВидыПродукцииИС.СтроительныеМатериалы Тогда
		Возврат СтроительныеМатериалыИмяТоварнойГруппы();
	ИначеЕсли ВидПродукцииИС = Перечисления.ВидыПродукцииИС.ОтопительныеПриборы Тогда
		Возврат ОтопительныеПриборыИмяТоварнойГруппы();
	ИначеЕсли ВидПродукцииИС = Перечисления.ВидыПродукцииИС.Бакалея
		Или ВидПродукцииИС = Перечисления.ВидыПродукцииИС.РастворимыеЗавариваемыеНапитки Тогда
		Возврат БакалеяИмяТоварнойГруппы();
	ИначеЕсли ВидПродукцииИС = Перечисления.ВидыПродукцииИС.АлкогольнаяПродукцияДо9Процентов Тогда
		Возврат АлкогольнаяПродукцияДо9ПроцентовИмяТоварнойГруппы();
	ИначеЕсли ВидПродукцииИС = Перечисления.ВидыПродукцииИС.ПиротехническиеИзделияИСредстваПожарнойБезопасности Тогда
		Возврат ПиротехническиеИзделияИСредстваПожарнойБезопасностиИмяТоварнойГруппы();
	ИначеЕсли ВидПродукцииИС = Перечисления.ВидыПродукцииИС.КабельнаяПродукция Тогда
		Возврат КабельнаяПродукцияИмяТоварнойГруппы();
	ИначеЕсли ВидПродукцииИС = Перечисления.ВидыПродукцииИС.МоторныеМасла Тогда
		Возврат МоторныеМаслаИмяТоварнойГруппы();
	ИначеЕсли ВидПродукцииИС = Перечисления.ВидыПродукцииИС.АвтозапчастиИКомплектующиеТранспортныхСредств Тогда
		Возврат АвтозапчастиИКомплектующиеТранспортныхСредствИмяТоварнойГруппы();
	ИначеЕсли ВидПродукцииИС = Перечисления.ВидыПродукцииИС.ПолимерныеТрубы Тогда
		ВидПродукции = "polymer";
	ИначеЕсли ВидПродукцииИС = Перечисления.ВидыПродукцииИС.СладостиИКондитерскиеИзделия Тогда
		ВидПродукции = "sweets";
	ИначеЕсли ВидПродукцииИС = Перечисления.ВидыПродукцииИС.ТоварыИзНатуральногоМеха Тогда
		Возврат ТоварыИзНатуральногоМехаИмяТоварнойГруппы();
	Иначе
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Неизвестный вид продукции: %1'"),
			ВидПродукцииИС);
	КонецЕсли;
	
	Возврат ВидПродукции;
	
КонецФункции

#КонецОбласти

#Область НовыеТоварныеГруппыВнедрение

#Область ИмяТоварнойГруппы

Функция ПечатнаяПродукцияИмяТоварнойГруппы()
	Возврат "books";
КонецФункции

Функция СтроительныеМатериалыИмяТоварнойГруппы()
	Возврат "construction";
КонецФункции

Функция ОтопительныеПриборыИмяТоварнойГруппы()
	Возврат "heater";
КонецФункции

Функция БакалеяИмяТоварнойГруппы()
	Возврат "grocery";
КонецФункции

Функция АлкогольнаяПродукцияДо9ПроцентовИмяТоварнойГруппы()
	Возврат "";
КонецФункции

Функция ПиротехническиеИзделияИСредстваПожарнойБезопасностиИмяТоварнойГруппы()
	Возврат "fire";
КонецФункции

Функция КабельнаяПродукцияИмяТоварнойГруппы()
	Возврат "cableraw";
КонецФункции

Функция МоторныеМаслаИмяТоварнойГруппы()
	Возврат "autofluids";
КонецФункции

Функция АвтозапчастиИКомплектующиеТранспортныхСредствИмяТоварнойГруппы()
	Возврат "carparts";
КонецФункции

Функция ТоварыИзНатуральногоМехаИмяТоварнойГруппы()
	Возврат "furslp";
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти
