
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Дата = ТекущаяДатаСеанса();
	
	УправлениеЭлементамиФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВывестиСводку();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "Запись_РеализацияТоваровУслуг" 
		Или ИмяСобытия = "Запись_ПроизводствоТоваровЗаСмену"
		Или ИмяСобытия = "Запись_ПеремещениеТоваров" 
		Или ИмяСобытия = "Запись_РегистрТоварныеОграничения"
		Или ИмяСобытия = "Запись_РасходныйОрдерНаТовары" 
		Или ИмяСобытия = "Запись_ТоварныеЗапасы" Тогда

		ВывестиСводку();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВозможностиСкладаДатаПриИзменении(Элемент)
	ВозможностиСклада = AMS_ВызовСервера.ПолучитьВозможностиСклада(ВозможностиСкладаДата);
КонецПроцедуры

&НаКлиенте
Процедура ТипПродукцииПриИзменении(Элемент)
	ЗаполнитьНазначениеПродукцииСписокВыбора();
	ВывестиСводку();
КонецПроцедуры

&НаКлиенте
Процедура НазначениеПродукцииПриИзменении(Элемент)
	ВывестиСводку();
КонецПроцедуры

&НаКлиенте
Процедура ВозможностиСкладаПриИзменении(Элемент)
	УстановитьВозможностиСклада();
КонецПроцедуры

&НаКлиенте
Процедура ЦехПриИзменении(Элемент)
	ВывестиСводку();
КонецПроцедуры

&НаКлиенте
Процедура ТабВыбор(Элемент, Область, СтандартнаяОбработка)
	Если СтрНайти(Область.Текст, "+/-") > 0 Тогда
		Если СтрНайти(Область.Текст, "Номенклатура") > 0 Тогда
			Таб.Область("C4:C11").Видимость = Не Таб.Область("C4:C11").Видимость;
			Видимость1 = Таб.Область("C4:C11").Видимость;

		ИначеЕсли СтрНайти(Область.Текст, "Резерв") > 0 Тогда
			Таб.Область("C23:C28").Видимость = Не Таб.Область("C23:C28").Видимость;
			Видимость2 = Таб.Область("C23:C28").Видимость;
		
		ИначеЕсли СтрНайти(Область.Текст, "План цехов") > 0 Тогда
			Таб.Область("C35:C40").Видимость = Не Таб.Область("C35:C40").Видимость;
			Видимость3 = Таб.Область("C35:C40").Видимость;
		
		ИначеЕсли СтрНайти(Область.Текст, "Ожидаемые") > 0 Тогда
			Таб.Область("C44:C63").Видимость = Не Таб.Область("C44:C63").Видимость;
			Видимость4 = Таб.Область("C44:C63").Видимость;
			
		ИначеЕсли СтрНайти(Область.Текст, "План / Факт") > 0 Тогда
			Таб.Область("C66:C71").Видимость = Не Таб.Область("C66:C71").Видимость;
			Видимость5 = Таб.Область("C66:C71").Видимость;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТабОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	СтандартнаяОбработка = Ложь;
	ОбработкаРасшифровки(Элемент.ТекущаяОбласть.Имя, Расшифровка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОбновить(Команда)
	ВывестиСводку();
КонецПроцедуры

&НаКлиенте
Процедура ЭкспортВEXCEL(Команда)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Заголовок          = "Выберите каталог для сохранения СВОДКИ";
	Диалог.Фильтр             = "Файлы Excel (*.xlsx;*.xls)|*.xlsx;*.xls|";
	Диалог.МножественныйВыбор = Ложь;

	Если Диалог.Выбрать() Тогда
		Состояние("Создание файла EXCEL.");

		ИмяФайла = Диалог.ПолноеИмяФайла;

		ВыгрузитьСводку(ИмяФайла);

		Состояние();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Отчёт_ПроизводствоПродукции(Команда)
	Парам = Новый Структура;
	Парам.Вставить("КлючНазначенияИспользования", "ПроизводствоПродукции");
	ОткрытьФорму("Отчет.AMS_ПроизводствоПродукции.Форма", Парам);
КонецПроцедуры

&НаКлиенте
Процедура Отчёт_ДвижениеТоваров(Команда)
	Парам = Новый Структура;
	Парам.Вставить("КлючНазначенияИспользования", "Сводка номенклатуры");
	ОткрытьФорму("Отчет.AMS_ДвижениеТоваров.Форма", Парам, ЭтотОбъект, "ДвижениеТоваров="
		+ ОбщегоНазначенияКлиент.ДатаСеанса());
КонецПроцедуры

&НаКлиенте
Процедура РасчетТоварныхЗапасов(Команда)
	ОткрытьФорму("Обработка.AMS_Сводка.Форма.ФормаТоварныеЗапасы");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВывестиСводку()
	УстановитьПривилегированныйРежим(Истина);

	НомерСтроки = 0;

	Таб.Очистить();
	Таб.ФиксацияСверху=6;
	Таб.ФиксацияСлева=3;

	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("МакетТовары");

	ОбластьШапка               = Макет.ПолучитьОбласть("Шапка");
	ОбластьИтоги               = Макет.ПолучитьОбласть("Итоги");
	ОбластьТипПродукции        = Макет.ПолучитьОбласть("ТипПродукции");
	ОбластьНазначениеПродукции = Макет.ПолучитьОбласть("НазначениеПродукции");
	ОбластьПодвал              = Макет.ПолучитьОбласть("Подвал");
	ОбластьДетали              = Макет.ПолучитьОбласть("Детали");
	ОбластьСтрока              = ОбластьДетали.Область("Строка");
 	ОбластьПроизв1             = ОбластьДетали.Область("Производство1"); // Колонка ПланХ1	и ФактХ1
	ОбластьПроизв2             = ОбластьДетали.Область("Производство2"); // Колонка ПланХ2	и ФактХ2

	Парам = ПодготовитьПараметрыСводки();
	
	Рез = ПолучитьДанныеСводки(Парам);
	
	ОбластьШапка.Параметры.Заполнить(Парам);
	Таб.Вывести(ОбластьШапка);

	ВыбИтог = Рез.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыбИтог.Следующий();

	ОбластьИтоги.Параметры.Заполнить(ВыбИтог);
	Таб.Вывести(ОбластьИтоги);
	
	Таб.НачатьАвтогруппировкуСтрок();
	
	ВыбТип = ВыбИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыбТип.Следующий() Цикл
		ОбластьТипПродукции.Параметры.ТипПродукции = ВыбТип.ТипПродукции;
		Таб.Вывести(ОбластьТипПродукции, 1, "ТипПродукции", Истина);

		ВыбНазначение = ВыбТип.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыбНазначение.Следующий() Цикл
			ОбластьНазначениеПродукции.Параметры.НазначениеПродукции = ВыбНазначение.НазначениеПродукции;
			Таб.Вывести(ОбластьНазначениеПродукции, 2, "НазначениеПродукции", Истина);

			ВыбТовар = ВыбНазначение.Выбрать();
			Пока ВыбТовар.Следующий() Цикл
				НомерСтроки = НомерСтроки + 1;
				
				ОбластьДетали.Параметры.Заполнить(ВыбТовар);
				ОбластьДетали.Параметры.НомерСтроки = НомерСтроки;

				ОбластьСтрока.ЦветФона = ЦветаСтиля.ЦветФонаПоля;
				
				Если ВыбТовар.MIN_1 > 0 Тогда
					ОбластьСтрока.ЦветФона = WebЦвета.ТусклоРозовый;
					
				ИначеЕсли ВыбТовар.MAX <> 0 И ВыбТовар.СвободноИтог > ВыбТовар.MAX Тогда
					ОбластьСтрока.ЦветФона = WebЦвета.СинийСПороховымОттенком;
				КонецЕсли;

				Если ВыбТовар.План1 - ВыбТовар.Факт1 > 5 Или ВыбТовар.Факт1 - ВыбТовар.План1 > 5 Тогда
					ОбластьПроизв1.ЦветФона = WebЦвета.Хаки;
				КонецЕсли;

				Если ВыбТовар.План2 - ВыбТовар.Факт2 > 5 Или ВыбТовар.Факт2 - ВыбТовар.План2 > 5 Тогда
					ОбластьПроизв2.ЦветФона = WebЦвета.Хаки;
				КонецЕсли;
				Таб.Вывести(ОбластьДетали, 4, "Товар", Истина);
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

	Таб.ЗакончитьАвтогруппировкуСтрок();
	
	Таб.Вывести(ОбластьПодвал);

	Таб.Область("C4:C11").Видимость = Видимость1;
	Таб.Область("C23:C28").Видимость = Видимость2;
	Таб.Область("C35:C40").Видимость = Видимость3;
	Таб.Область("C44:C63").Видимость = Видимость4; 
	Таб.Область("C66:C71").Видимость = Видимость5; 
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеСводки(Парам) 
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТипПродукции",                  Парам.ТипПродукции);
	Запрос.УстановитьПараметр("СкладПродукции",                Парам.СкладПродукции);
	Запрос.УстановитьПараметр("НазначениеПродукции",           Парам.НазначениеПродукции);
	Запрос.УстановитьПараметр("ВидНоменклатуры",               Парам.ВидНоменклатуры);
	Запрос.УстановитьПараметр("ВидНоменклатурыПродукцияЦеха3", Парам.ВидНоменклатурыПродукцияЦеха3);
	Запрос.УстановитьПараметр("СписокЦехов",                   Парам.СписокЦехов);
	
	Запрос.УстановитьПараметр("Год",    Парам.Год);
	Запрос.УстановитьПараметр("Дата",   Парам.Дата);
	Запрос.УстановитьПараметр("Дата1",  Парам.Дата1);
	Запрос.УстановитьПараметр("Дата2",  Парам.Дата2);
	Запрос.УстановитьПараметр("Дата3",  Парам.Дата3);
	Запрос.УстановитьПараметр("Дата4",  Парам.Дата4);
	Запрос.УстановитьПараметр("Дата5",  Парам.Дата5);
	Запрос.УстановитьПараметр("Дата6",  Парам.Дата6);
	Запрос.УстановитьПараметр("Дата7",  Парам.Дата7);
	Запрос.УстановитьПараметр("Дата8",  Парам.Дата8);
	Запрос.УстановитьПараметр("Дата9",  Парам.Дата9);
	Запрос.УстановитьПараметр("Дата10", Парам.Дата10);
	Запрос.УстановитьПараметр("Дата11", Парам.Дата11);
	Запрос.УстановитьПараметр("Дата12", Парам.Дата12);
	Запрос.УстановитьПараметр("Дата13", Парам.Дата13);
	Запрос.УстановитьПараметр("Дата14", Парам.Дата14);
	Запрос.УстановитьПараметр("Дата15", Парам.Дата15);
	Запрос.УстановитьПараметр("Дата16", Парам.Дата16);
	Запрос.УстановитьПараметр("Дата17", Парам.Дата17);
	Запрос.УстановитьПараметр("Дата18", Парам.Дата18);
	Запрос.УстановитьПараметр("Дата19", Парам.Дата19);
	Запрос.УстановитьПараметр("Дата20", Парам.Дата20);
	Запрос.УстановитьПараметр("Дата21", Парам.Дата21);
	Запрос.УстановитьПараметр("Дата22", Парам.Дата22); 
	Запрос.УстановитьПараметр("НачПро", Парам.НачПро);
	Запрос.УстановитьПараметр("КонПро", Парам.КонПро);

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ном.Артикул КАК Артикул,
	|	т.Номенклатура КАК Номенклатура,
	|	ном.КоэффициентЕдиницыДляОтчетов КАК Кфц,
	|	упак.Числитель / ном.КоэффициентЕдиницыДляОтчетов КАК КоличествоНаПалете,
	|	д.Родитель КАК ТипПродукции,
	|	д.Родитель.Наименование КАК ТипНаименование,
	|	д.Ссылка КАК НазначениеПродукции,
	|	д.Наименование КАК НазначениеНаименование,
	|	ном.ВидНоменклатуры КАК ВидНоменклатуры,
	|	т.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ Прод
	|ИЗ
	|	Справочник.AMS_Продукция КАК д
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.AMS_Продукция.Товары КАК т
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК ном
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК упак
	|				ПО (ном.НаборУпаковок = упак.Владелец
	|						ИЛИ ном.Ссылка = упак.Владелец)
	|					И ном._Упаковка = упак.Родитель
	|			ПО т.Номенклатура = ном.Ссылка
	|		ПО д.Ссылка = т.Ссылка
	|ГДЕ
	|	НЕ д.ЭтоГруппа
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТовОгр.Номенклатура КАК Номенклатура,
	|	ТовОгр.МинимальноеКоличествоЗапаса / Прод.Кфц КАК MIN,
	|	ТовОгр.МаксимальноеКоличествоЗапаса / Прод.Кфц КАК MAX
	|ПОМЕСТИТЬ ТовОрг
	|ИЗ
	|	РегистрСведений.ТоварныеОграничения КАК ТовОгр
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Прод КАК Прод
	|		ПО ТовОгр.Номенклатура = Прод.Номенклатура
	|			И (ТовОгр.Склад = &СкладПродукции)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Прод.Артикул КАК Артикул,
	|	Прод.Номенклатура КАК Номенклатура,
	|	Прод.Кфц КАК Кфц,
	|	Прод.КоличествоНаПалете КАК КоличествоНаПалете,
	|	ЕСТЬNULL(ТовОрг.MIN, 0) КАК MIN,
	|	ЕСТЬNULL(ТовОрг.MAX, 0) КАК MAX,
	|	Прод.ТипПродукции КАК ТипПродукции,
	|	Прод.ТипНаименование КАК ТипНаименование,
	|	Прод.НазначениеПродукции КАК НазначениеПродукции,
	|	Прод.НазначениеНаименование КАК НазначениеНаименование,
	|	Прод.ВидНоменклатуры КАК ВидНоменклатуры,
	|	Прод.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ Тов
	|ИЗ
	|	Прод КАК Прод
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТовОрг КАК ТовОрг
	|		ПО Прод.Номенклатура = ТовОрг.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.КоличествоПлан КАК КоличествоПлан,
	|	т.КоличествоФакт КАК КоличествоФакт,
	|	д.Ссылка КАК Док,
	|	д.Дата КАК Дата,
	|	д.Смена КАК Смена
	|ПОМЕСТИТЬ Цеха
	|ИЗ
	|	Документ.AMS_ПроизводствоЗаСмену КАК д
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.AMS_ПроизводствоЗаСмену.Продукция КАК т
	|		ПО д.Ссылка = т.Ссылка
	|ГДЕ
	|	д.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата7, ДЕНЬ)
	|	И НЕ д.Статус = ЗНАЧЕНИЕ(Перечисление._СтатусыПроизводства.Проект)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА т.ДокументОтгрузки ССЫЛКА Документ.ЗаказКлиента
	|			ТОГДА т.ДокументОтгрузки.ДатаОтгрузки
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(т.ДокументОтгрузки.Дата, ДЕНЬ)
	|	КОНЕЦ КАК Дата,
	|	т.ДокументОтгрузки КАК ДокументОтгрузки,
	|	т.Номенклатура КАК Номенклатура,
	|	(т.КОтгрузкеОстаток + т.ВРезервеОстаток) / т.Номенклатура.КоэффициентЕдиницыДляОтчетов КАК Количество,
	|	ТИПЗНАЧЕНИЯ(т.ДокументОтгрузки) = ТИП(Документ.ЗаказКлиента) КАК ЭтоЗаказКлиента
	|ПОМЕСТИТЬ КОтгр
	|ИЗ
	|	РегистрНакопления.ТоварыКОтгрузке.Остатки(, Склад = &СкладПродукции) КАК т
	|ГДЕ
	|	(ТИПЗНАЧЕНИЯ(т.ДокументОтгрузки) = ТИП(Документ.ЗаказКлиента)
	|			ИЛИ ТИПЗНАЧЕНИЯ(т.ДокументОтгрузки) = ТИП(Документ.РеализацияТоваровУслуг))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Ссылка.ДатаОтгрузки КАК Дата,
	|	т.Ссылка КАК Док,
	|	т.Номенклатура КАК Номенклатура,
	|	т.Количество / т.Номенклатура.КоэффициентЕдиницыДляОтчетов КАК Количество
	|ПОМЕСТИТЬ Ож
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК т
	|ГДЕ
	|	т.Ссылка.Проведен
	|	И т.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.КОбеспечению)
	|	И т.Ссылка.Склад = &СкладПродукции
	|	И т.Ссылка.ДатаОтгрузки >= ДАТАВРЕМЯ(2025, 8, 1)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	т.Ссылка.Дата,
	|	т.Ссылка,
	|	т.Номенклатура,
	|	т.Количество / т.Номенклатура.КоэффициентЕдиницыДляОтчетов
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК т
	|ГДЕ
	|	НЕ т.Ссылка.Проведен
	|	И НЕ т.Ссылка.ПометкаУдаления
	|	И т.Ссылка.Склад = &СкладПродукции
	|	
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.ВНаличииОстаток / Ном.КоэффициентЕдиницыДляОтчетов КАК ОстЦехУ
	|ПОМЕСТИТЬ ОстЦехУтро
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	|			КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, ДЕНЬ, -1), ДЕНЬ),
	|			Склад В (&СписокЦехов)
	|				И Номенклатура В
	|					(ВЫБРАТЬ
	|						т.Номенклатура КАК Номенклатура
	|					ИЗ
	|						тов КАК т)) КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|		ПО т.Номенклатура = Ном.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.ВНаличииОстаток / Ном.КоэффициентЕдиницыДляОтчетов КАК ОстЦех
	|ПОМЕСТИТЬ ОстЦехВечер
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	|			КОНЕЦПЕРИОДА(&Дата, ДЕНЬ),
	|			Склад В (&СписокЦехов)
	|				И Номенклатура В
	|					(ВЫБРАТЬ
	|						т.Номенклатура КАК Номенклатура
	|					ИЗ
	|						тов КАК т)) КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|		ПО т.Номенклатура = Ном.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.ВНаличииОстаток / Ном.КоэффициентЕдиницыДляОтчетов КАК ОстСклУ
	|ПОМЕСТИТЬ ОстСкл
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	|			КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, ДЕНЬ, -1), ДЕНЬ),
	|			Склад = &СкладПродукции
	|				И Номенклатура В
	|					(ВЫБРАТЬ
	|						т.Номенклатура КАК Номенклатура
	|					ИЗ
	|						тов КАК т)) КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|		ПО т.Номенклатура = Ном.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОтгр.Номенклатура КАК Номенклатура,
	|	СУММА(КОтгр.Количество) КАК Просрочено
	|ПОМЕСТИТЬ КОтг_1
	|ИЗ
	|	КОтгр КАК КОтгр
	|ГДЕ
	|	КОтгр.Дата < &Дата
	|	И НЕ КОтгр.ЭтоЗаказКлиента
	|
	|СГРУППИРОВАТЬ ПО
	|	КОтгр.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОтгр.Номенклатура КАК Номенклатура,
	|	СУММА(КОтгр.Количество) КАК КОтгрузке
	|ПОМЕСТИТЬ КОтг0
	|ИЗ
	|	КОтгр КАК КОтгр
	|ГДЕ
	|	КОтгр.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	|	И НЕ КОтгр.ЭтоЗаказКлиента
	|
	|СГРУППИРОВАТЬ ПО
	|	КОтгр.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОтгр.Номенклатура КАК Номенклатура,
	|	СУММА(КОтгр.Количество) КАК КОтгрузке1
	|ПОМЕСТИТЬ КОтг1
	|ИЗ
	|	КОтгр КАК КОтгр
	|ГДЕ
	|	КОтгр.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата1, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата1, ДЕНЬ)
	|СГРУППИРОВАТЬ ПО
	|	КОтгр.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОтгр.Номенклатура КАК Номенклатура,
	|	СУММА(КОтгр.Количество) КАК КОтгрузке2
	|ПОМЕСТИТЬ КОтг2
	|ИЗ
	|	КОтгр КАК КОтгр
	|ГДЕ
	|	КОтгр.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата2, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ)
	|СГРУППИРОВАТЬ ПО
	|	КОтгр.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОтгр.Номенклатура КАК Номенклатура,
	|	СУММА(КОтгр.Количество) КАК КОтгрузке3
	|ПОМЕСТИТЬ КОтг3
	|ИЗ
	|	КОтгр КАК КОтгр
	|ГДЕ
	|	КОтгр.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата3, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата3, ДЕНЬ)
	|СГРУППИРОВАТЬ ПО
	|	КОтгр.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОтгр.Номенклатура КАК Номенклатура,
	|	СУММА(КОтгр.Количество) КАК КОтгрузке4
	|ПОМЕСТИТЬ КОтг4
	|ИЗ
	|	КОтгр КАК КОтгр
	|ГДЕ
	|	КОтгр.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата4, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата4, ДЕНЬ)
	|СГРУППИРОВАТЬ ПО
	|	КОтгр.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОтгр.Номенклатура КАК Номенклатура,
	|	СУММА(КОтгр.Количество) КАК КОтгрузке5
	|ПОМЕСТИТЬ КОтг5
	|ИЗ
	|	КОтгр КАК КОтгр
	|ГДЕ
	|	КОтгр.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата5, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата5, ДЕНЬ)
	|СГРУППИРОВАТЬ ПО
	|	КОтгр.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОтгр.Номенклатура КАК Номенклатура,
	|	СУММА(КОтгр.Количество) КАК КОтгрузке6
	|ПОМЕСТИТЬ КОтг6
	|ИЗ
	|	КОтгр КАК КОтгр
	|ГДЕ
	|	КОтгр.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата6, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата6, ДЕНЬ)
	|СГРУППИРОВАТЬ ПО
	|	КОтгр.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОтгр.Номенклатура КАК Номенклатура,
	|	СУММА(КОтгр.Количество) КАК КОтгрузке7
	|ПОМЕСТИТЬ КОтг7
	|ИЗ
	|	КОтгр КАК КОтгр
	|ГДЕ
	|	КОтгр.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата7, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата7, ДЕНЬ)
	|СГРУППИРОВАТЬ ПО
	|	КОтгр.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОтгр.Номенклатура КАК Номенклатура,
	|	СУММА(КОтгр.Количество) КАК КОтгрузке7_
	|ПОМЕСТИТЬ КОтг7_
	|ИЗ
	|	КОтгр КАК КОтгр
	|ГДЕ
	|	КОтгр.Дата >= НАЧАЛОПЕРИОДА(&Дата8, ДЕНЬ)
	|СГРУППИРОВАТЬ ПО
	|	КОтгр.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОтгр.Номенклатура КАК Номенклатура,
	|	СУММА(КОтгр.Количество) КАК КОтгрузке8
	|ПОМЕСТИТЬ КОтгИтог
	|ИЗ
	|	КОтгр КАК КОтгр
	|ГДЕ
	|	КОтгр.Дата > КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	|СГРУППИРОВАТЬ ПО
	|	КОтгр.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Цеха.Номенклатура КАК Номенклатура,
	|	СУММА(Цеха.КоличествоПлан) КАК План1,
	|	СУММА(Цеха.КоличествоФакт) КАК Факт1
	|ПОМЕСТИТЬ ЦехУ
	|ИЗ
	|	Цеха КАК Цеха
	|ГДЕ
	|	Цеха.Смена = ЗНАЧЕНИЕ(Перечисление._ПроизводственныеСмены.Дневная)
	|	И Цеха.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	|СГРУППИРОВАТЬ ПО
	|	Цеха.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Цеха.Номенклатура КАК Номенклатура,
	|	СУММА(Цеха.КоличествоПлан) КАК План2,
	|	СУММА(Цеха.КоличествоФакт) КАК Факт2
	|ПОМЕСТИТЬ ЦехВ
	|ИЗ
	|	Цеха КАК Цеха
	|ГДЕ
	|	Цеха.Смена = ЗНАЧЕНИЕ(Перечисление._ПроизводственныеСмены.Вечерняя)
	|	И Цеха.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	|СГРУППИРОВАТЬ ПО
	|	Цеха.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Цеха.Номенклатура КАК Номенклатура,
	|	СУММА(Цеха.КоличествоПлан) КАК ПланЦех1_1
	|ПОМЕСТИТЬ Цех1У
	|ИЗ
	|	Цеха КАК Цеха
	|ГДЕ
	|	Цеха.Смена = ЗНАЧЕНИЕ(Перечисление._ПроизводственныеСмены.Дневная)
	|	И Цеха.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата1, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата1, ДЕНЬ)
	|СГРУППИРОВАТЬ ПО
	|	Цеха.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Цеха.Номенклатура КАК Номенклатура,
	|	СУММА(Цеха.КоличествоПлан) КАК ПланЦех1_2
	|ПОМЕСТИТЬ Цех1В
	|ИЗ
	|	Цеха КАК Цеха
	|ГДЕ
	|	Цеха.Смена = ЗНАЧЕНИЕ(Перечисление._ПроизводственныеСмены.Вечерняя)
	|	И Цеха.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата1, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата1, ДЕНЬ)
	|СГРУППИРОВАТЬ ПО
	|	Цеха.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Цеха.Номенклатура КАК Номенклатура,
	|	СУММА(Цеха.КоличествоПлан) КАК ПланЦех2
	|ПОМЕСТИТЬ Цех2
	|ИЗ
	|	Цеха КАК Цеха
	|ГДЕ
	|	Цеха.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата2, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ)
	|СГРУППИРОВАТЬ ПО
	|	Цеха.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Цеха.Номенклатура КАК Номенклатура,
	|	СУММА(Цеха.КоличествоПлан) КАК ПланЦех3
	|ПОМЕСТИТЬ Цех3
	|ИЗ
	|	Цеха КАК Цеха
	|ГДЕ
	|	Цеха.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата3, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата3, ДЕНЬ)
	|СГРУППИРОВАТЬ ПО
	|	Цеха.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Цеха.Номенклатура КАК Номенклатура,
	|	СУММА(Цеха.КоличествоПлан) КАК ПланЦех4
	|ПОМЕСТИТЬ Цех4
	|ИЗ
	|	Цеха КАК Цеха
	|ГДЕ
	|	Цеха.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата4, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата4, ДЕНЬ)
	|СГРУППИРОВАТЬ ПО
	|	Цеха.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Цеха.Номенклатура КАК Номенклатура,
	|	СУММА(Цеха.КоличествоПлан) КАК ПланЦех5
	|ПОМЕСТИТЬ Цех5
	|ИЗ
	|	Цеха КАК Цеха
	|ГДЕ
	|	Цеха.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата5, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата5, ДЕНЬ)
	|СГРУППИРОВАТЬ ПО
	|	Цеха.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Цеха.Номенклатура КАК Номенклатура,
	|	СУММА(Цеха.КоличествоПлан) КАК ПланЦех6
	|ПОМЕСТИТЬ Цех6
	|ИЗ
	|	Цеха КАК Цеха
	|ГДЕ
	|	Цеха.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата6, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата6, ДЕНЬ)
	|СГРУППИРОВАТЬ ПО
	|	Цеха.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Цеха.Номенклатура КАК Номенклатура,
	|	СУММА(Цеха.КоличествоПлан) КАК ПланЦех7
	|ПОМЕСТИТЬ Цех7
	|ИЗ
	|	Цеха КАК Цеха
	|ГДЕ
	|	Цеха.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата7, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата7, ДЕНЬ)
	|СГРУППИРОВАТЬ ПО
	|	Цеха.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Цеха.Номенклатура КАК Номенклатура,
	|	СУММА(Цеха.КоличествоПлан) КАК ПланЦех
	|ПОМЕСТИТЬ ЦехИтог
	|ИЗ
	|	Цеха КАК Цеха
	|ГДЕ
	|	Цеха.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата1, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата7, ДЕНЬ)
	|СГРУППИРОВАТЬ ПО
	|	Цеха.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	СУММА(т.ВНаличииПриход / т.Номенклатура.КоэффициентЕдиницыДляОтчетов) КАК Приход,
	|	СУММА(т.ВНаличииРасход / т.Номенклатура.КоэффициентЕдиницыДляОтчетов) КАК Расход
	|ПОМЕСТИТЬ Движ
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Обороты(НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ), КОНЕЦПЕРИОДА(&Дата, ДЕНЬ),,
	|		Склад = &СкладПродукции) КАК т
	|СГРУППИРОВАТЬ ПО
	|	т.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ож.Номенклатура КАК Номенклатура,
	|	СУММА(Ож.Количество) КАК КолОж1
	|ПОМЕСТИТЬ Ож1
	|ИЗ
	|	Ож КАК Ож
	|ГДЕ
	|	Ож.Дата <= КОНЕЦПЕРИОДА(&Дата1, ДЕНЬ)
	|СГРУППИРОВАТЬ ПО
	|	Ож.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ож.Номенклатура КАК Номенклатура,
	|	СУММА(Ож.Количество) КАК КолОж2
	|ПОМЕСТИТЬ Ож2
	|ИЗ
	|	Ож КАК Ож
	|ГДЕ
	|	Ож.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата2, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ)
	|СГРУППИРОВАТЬ ПО
	|	Ож.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ож.Номенклатура КАК Номенклатура,
	|	СУММА(Ож.Количество) КАК КолОж3
	|ПОМЕСТИТЬ Ож3
	|ИЗ
	|	Ож КАК Ож
	|ГДЕ
	|	Ож.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата3, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата3, ДЕНЬ)
	|СГРУППИРОВАТЬ ПО
	|	Ож.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ож.Номенклатура КАК Номенклатура,
	|	СУММА(Ож.Количество) КАК КолОж4
	|ПОМЕСТИТЬ Ож4
	|ИЗ
	|	Ож КАК Ож
	|ГДЕ
	|	Ож.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата4, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата4, ДЕНЬ)
	|СГРУППИРОВАТЬ ПО
	|	Ож.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ож.Номенклатура КАК Номенклатура,
	|	СУММА(Ож.Количество) КАК КолОж5
	|ПОМЕСТИТЬ Ож5
	|ИЗ
	|	Ож КАК Ож
	|ГДЕ
	|	Ож.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата5, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата5, ДЕНЬ)
	|СГРУППИРОВАТЬ ПО
	|	Ож.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ож.Номенклатура КАК Номенклатура,
	|	СУММА(Ож.Количество) КАК КолОж6
	|ПОМЕСТИТЬ Ож6
	|ИЗ
	|	Ож КАК Ож
	|ГДЕ
	|	Ож.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата6, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата6, ДЕНЬ)
	|СГРУППИРОВАТЬ ПО
	|	Ож.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ож.Номенклатура КАК Номенклатура,
	|	СУММА(Ож.Количество) КАК КолОж7
	|ПОМЕСТИТЬ Ож7
	|ИЗ
	|	Ож КАК Ож
	|ГДЕ
	|	Ож.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата7, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата7, ДЕНЬ)
	|СГРУППИРОВАТЬ ПО
	|	Ож.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ож.Номенклатура КАК Номенклатура,
	|	СУММА(Ож.Количество) КАК КолОж8
	|ПОМЕСТИТЬ Ож8
	|ИЗ
	|	Ож КАК Ож
	|ГДЕ
	|	Ож.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата8, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата8, ДЕНЬ)
	|СГРУППИРОВАТЬ ПО
	|	Ож.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ож.Номенклатура КАК Номенклатура,
	|	СУММА(Ож.Количество) КАК КолОж9
	|ПОМЕСТИТЬ Ож9
	|ИЗ
	|	Ож КАК Ож
	|ГДЕ
	|	Ож.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата9, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата9, ДЕНЬ)
	|СГРУППИРОВАТЬ ПО
	|	Ож.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ож.Номенклатура КАК Номенклатура,
	|	СУММА(Ож.Количество) КАК КолОж10
	|ПОМЕСТИТЬ Ож10
	|ИЗ
	|	Ож КАК Ож
	|ГДЕ
	|	Ож.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата10, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата10, ДЕНЬ)
	|СГРУППИРОВАТЬ ПО
	|	Ож.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ож.Номенклатура КАК Номенклатура,
	|	СУММА(Ож.Количество) КАК КолОж11
	|ПОМЕСТИТЬ Ож11
	|ИЗ
	|	Ож КАК Ож
	|ГДЕ
	|	Ож.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата11, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата11, ДЕНЬ)
	|СГРУППИРОВАТЬ ПО
	|	Ож.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ож.Номенклатура КАК Номенклатура,
	|	СУММА(Ож.Количество) КАК КолОж12
	|ПОМЕСТИТЬ Ож12
	|ИЗ
	|	Ож КАК Ож
	|ГДЕ
	|	Ож.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата12, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата12, ДЕНЬ)
	|СГРУППИРОВАТЬ ПО
	|	Ож.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ож.Номенклатура КАК Номенклатура,
	|	СУММА(Ож.Количество) КАК КолОж13
	|ПОМЕСТИТЬ Ож13
	|ИЗ
	|	Ож КАК Ож
	|ГДЕ
	|	Ож.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата13, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата13, ДЕНЬ)
	|СГРУППИРОВАТЬ ПО
	|	Ож.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ож.Номенклатура КАК Номенклатура,
	|	СУММА(Ож.Количество) КАК КолОж14
	|ПОМЕСТИТЬ Ож14
	|ИЗ
	|	Ож КАК Ож
	|ГДЕ
	|	Ож.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата14, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата14, ДЕНЬ)
	|СГРУППИРОВАТЬ ПО
	|	Ож.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ож.Номенклатура КАК Номенклатура,
	|	СУММА(Ож.Количество) КАК КолОж15
	|ПОМЕСТИТЬ Ож15
	|ИЗ
	|	Ож КАК Ож
	|ГДЕ
	|	Ож.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата15, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата15, ДЕНЬ)
	|СГРУППИРОВАТЬ ПО
	|	Ож.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ож.Номенклатура КАК Номенклатура,
	|	СУММА(Ож.Количество) КАК КолОж16
	|ПОМЕСТИТЬ Ож16
	|ИЗ
	|	Ож КАК Ож
	|ГДЕ
	|	Ож.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата16, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата16, ДЕНЬ)
	|СГРУППИРОВАТЬ ПО
	|	Ож.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ож.Номенклатура КАК Номенклатура,
	|	СУММА(Ож.Количество) КАК КолОж17
	|ПОМЕСТИТЬ Ож17
	|ИЗ
	|	Ож КАК Ож
	|ГДЕ
	|	Ож.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата17, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата17, ДЕНЬ)
	|СГРУППИРОВАТЬ ПО
	|	Ож.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ож.Номенклатура КАК Номенклатура,
	|	СУММА(Ож.Количество) КАК КолОж18
	|ПОМЕСТИТЬ Ож18
	|ИЗ
	|	Ож КАК Ож
	|ГДЕ
	|	Ож.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата18, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата18, ДЕНЬ)
	|СГРУППИРОВАТЬ ПО
	|	Ож.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ож.Номенклатура КАК Номенклатура,
	|	СУММА(Ож.Количество) КАК КолОж19
	|ПОМЕСТИТЬ Ож19
	|ИЗ
	|	Ож КАК Ож
	|ГДЕ
	|	Ож.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата19, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата19, ДЕНЬ)
	|СГРУППИРОВАТЬ ПО
	|	Ож.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ож.Номенклатура КАК Номенклатура,
	|	СУММА(Ож.Количество) КАК КолОж20
	|ПОМЕСТИТЬ Ож20
	|ИЗ
	|	Ож КАК Ож
	|ГДЕ
	|	Ож.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата20, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата20, ДЕНЬ)
	|СГРУППИРОВАТЬ ПО
	|	Ож.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ож.Номенклатура КАК Номенклатура,
	|	СУММА(Ож.Количество) КАК КолОж21
	|ПОМЕСТИТЬ Ож21
	|ИЗ
	|	Ож КАК Ож
	|ГДЕ
	|	Ож.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата21, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата21, ДЕНЬ)
	|СГРУППИРОВАТЬ ПО
	|	Ож.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ож.Номенклатура КАК Номенклатура,
	|	СУММА(Ож.Количество) КАК КолОж21_
	|ПОМЕСТИТЬ Ож21_
	|ИЗ
	|	Ож КАК Ож
	|ГДЕ
	|	Ож.Дата >= НАЧАЛОПЕРИОДА(&Дата22, ДЕНЬ)
	|СГРУППИРОВАТЬ ПО
	|	Ож.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ож.Номенклатура КАК Номенклатура,
	|	СУММА(Ож.Количество) КАК КолОж
	|ПОМЕСТИТЬ ОжИтог
	|ИЗ
	|	Ож КАК Ож
	|СГРУППИРОВАТЬ ПО
	|	Ож.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.Количество" + Парам.Нед1 + " КАК Про1,
	|	т.Количество" + Парам.Нед2 + " КАК Про2,
	|	т.Количество" + Парам.Нед3 + " КАК Про3,
	|	т.Количество" + Парам.Нед4 + " КАК Про4,
	|	т.Количество" + Парам.Нед5 + " КАК Про5,
	|	т.Количество" + Парам.Нед6 + " КАК Про6,
	|	ЕСТЬNULL(т.Количество" + Парам.Нед1 + ", 0)
	|	+ ЕСТЬNULL(т.Количество" + Парам.Нед2 + ", 0)
	|	+ ЕСТЬNULL(т.Количество" + Парам.Нед3 + ", 0)
	|	+ ЕСТЬNULL(т.Количество" + Парам.Нед4 + ", 0)
	|	+ ЕСТЬNULL(т.Количество" + Парам.Нед5 + ", 0)
	|	+ ЕСТЬNULL(т.Количество" + Парам.Нед6 + ", 0) КАК Про,";
	
	Если Парам.ТекНеделя >= Парам.Нед1 Тогда
		ТекстЗапроса = ТекстЗапроса + "
	|	ЕСТЬNULL(т.Количество" + Парам.Нед1 + ", 0)";
	КонецЕсли;
	
	Если Парам.ТекНеделя >= Парам.Нед2 Тогда
		ТекстЗапроса = ТекстЗапроса + "
	|	+ ЕСТЬNULL(т.Количество" + Парам.Нед2 + ", 0)";
	КонецЕсли;
	
	Если Парам.ТекНеделя >= Парам.Нед3 Тогда
		ТекстЗапроса = ТекстЗапроса + "
	|	+ ЕСТЬNULL(т.Количество" + Парам.Нед3 + ", 0)";
	КонецЕсли;
	
	Если Парам.ТекНеделя >= Парам.Нед4 Тогда
		ТекстЗапроса = ТекстЗапроса + "
	|	+ ЕСТЬNULL(т.Количество" + Парам.Нед4 + ", 0)";
	КонецЕсли;
	
	Если Парам.ТекНеделя >= Парам.Нед5 Тогда
		ТекстЗапроса = ТекстЗапроса + "
	|	+ ЕСТЬNULL(т.Количество" + Парам.Нед5 + ", 0)";
	КонецЕсли;
	
	Если Парам.ТекНеделя >= Парам.Нед6 Тогда
		ТекстЗапроса = ТекстЗапроса + "
	|	+ ЕСТЬNULL(т.Количество" + Парам.Нед6 + ", 0)";
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + " КАК ПроПлан
	|ПОМЕСТИТЬ ПроизПлан
	|ИЗ
	|	Документ.AMS_ПланПроизводства.Товары КАК т
	|ГДЕ
	|	т.Ссылка.Год = &Год
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	СУММА(т.КоличествоУпаковок) КАК Факт
	|ПОМЕСТИТЬ ПроизФакт
	|ИЗ
	|	Документ.ПрочееОприходованиеТоваров КАК д
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПрочееОприходованиеТоваров.Товары КАК т
	|		ПО д.Ссылка = т.Ссылка
	|ГДЕ
	|	д._ОперацияПроизводства = ЗНАЧЕНИЕ(Перечисление.AMS_ОперацииПроизводства.ПроизводствоПродукции)
	|	И д.Дата МЕЖДУ &НачПро И &КонПро
	|
	|СГРУППИРОВАТЬ ПО
	|	т.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Тов.Артикул КАК Артикул,
	|	Тов.Номенклатура КАК Номенклатура,
	|	Тов.Кфц КАК Кфц,
	|	Тов.КоличествоНаПалете КАК КоличествоНаПалете,
	|	Тов.MIN КАК MIN,
	|	Тов.MAX КАК MAX,
	|	ОстЦехУтро.ОстЦехУ КАК ОстЦехУ,
	|	ОстСкл.ОстСклУ КАК ОстСклУ,
	|	КОтг_1.Просрочено КАК Просрочено,
	|	ЕСТЬNULL(ОстЦехУтро.ОстЦехУ, 0) + ЕСТЬNULL(ОстСкл.ОстСклУ, 0) - ЕСТЬNULL(Движ.Расход, 0) - ЕСТЬNULL(КОтг0.КОтгрузке, 0) КАК Свободно,
	|	ЕСТЬNULL(ЦехУ.План1, 0) КАК План1,
	|	ЕСТЬNULL(ЦехУ.Факт1, 0) КАК Факт1,
	|	ЕСТЬNULL(ЦехВ.План2, 0) КАК План2,
	|	ЕСТЬNULL(ЦехВ.Факт2, 0) КАК Факт2,
	|	ОстЦехВечер.ОстЦех КАК ОстЦех,
	|	Движ.Приход КАК Приход,
	|	Движ.Расход КАК Расход,
	|	КОтг0.КОтгрузке КАК КОтгрузке,
	|	ЕСТЬNULL(ОстСкл.ОстСклУ, 0) + ЕСТЬNULL(Движ.Приход, 0) - ЕСТЬNULL(Движ.Расход, 0) КАК ОстСкл,
	|	КОтг1.КОтгрузке1 КАК КОтгрузке1,
	|	КОтг2.КОтгрузке2 КАК КОтгрузке2,
	|	КОтг3.КОтгрузке3 КАК КОтгрузке3,
	|	КОтг4.КОтгрузке4 КАК КОтгрузке4,
	|	КОтг5.КОтгрузке5 КАК КОтгрузке5,
	|	КОтг6.КОтгрузке6 КАК КОтгрузке6,
	|	КОтг7.КОтгрузке7 КАК КОтгрузке7,
	|	КОтг7_.КОтгрузке7_ КАК КОтгрузке7_,
	|	КОтгИтог.КОтгрузке8 КАК КОтгрузке8,
	|	ЕСТЬNULL(ОстЦехВечер.ОстЦех, 0) + ЕСТЬNULL(ОстСкл.ОстСклУ, 0) + ЕСТЬNULL(Движ.Приход, 0) - ЕСТЬNULL(Движ.Расход, 0) - ЕСТЬNULL(КОтг0.КОтгрузке, 0) - ЕСТЬNULL(КОтгИтог.КОтгрузке8, 0) КАК СвободноИтог,
	|	ЕСТЬNULL(ОстЦехВечер.ОстЦех, 0) + ЕСТЬNULL(ОстСкл.ОстСклУ, 0) + ЕСТЬNULL(Движ.Приход, 0) - ЕСТЬNULL(Движ.Расход, 0) - ЕСТЬNULL(КОтг0.КОтгрузке, 0) - ЕСТЬNULL(КОтгИтог.КОтгрузке8, 0) + ЕСТЬNULL(ЦехУ.План1, 0) + ЕСТЬNULL(ЦехВ.План2, 0) - ЕСТЬNULL(ЦехУ.Факт1, 0) - ЕСТЬNULL(ЦехВ.Факт2, 0) КАК СвободноПлан,	
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОстЦехВечер.ОстЦех, 0) + ЕСТЬNULL(ОстСкл.ОстСклУ, 0) + ЕСТЬNULL(Движ.Приход, 0) - ЕСТЬNULL(Движ.Расход, 0) - ЕСТЬNULL(КОтг0.КОтгрузке, 0) - ЕСТЬNULL(КОтгИтог.КОтгрузке8, 0) < ЕСТЬNULL(Тов.MIN, 0)
	|			ТОГДА ЕСТЬNULL(Тов.MIN, 0) - (ЕСТЬNULL(ОстЦехВечер.ОстЦех, 0) + ЕСТЬNULL(ОстСкл.ОстСклУ, 0) + ЕСТЬNULL(Движ.Приход, 0) - ЕСТЬNULL(Движ.Расход, 0) - ЕСТЬNULL(КОтг0.КОтгрузке, 0) - ЕСТЬNULL(КОтгИтог.КОтгрузке8, 0))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК MIN_1,
	|	Цех1У.ПланЦех1_1 КАК ПланЦех1_1,
	|	Цех1В.ПланЦех1_2 КАК ПланЦех1_2,
	|	Цех2.ПланЦех2 КАК ПланЦех2,
	|	Цех3.ПланЦех3 КАК ПланЦех3,
	|	Цех4.ПланЦех4 КАК ПланЦех4,
	|	Цех5.ПланЦех5 КАК ПланЦех5,
	|	Цех6.ПланЦех6 КАК ПланЦех6,
	|	Цех7.ПланЦех7 КАК ПланЦех7,
	|	ЦехИтог.ПланЦех КАК ПланЦех,
	|	Ож1.КолОж1 КАК КолОж1,
	|	Ож2.КолОж2 КАК КолОж2,
	|	Ож3.КолОж3 КАК КолОж3,
	|	Ож4.КолОж4 КАК КолОж4,
	|	Ож5.КолОж5 КАК КолОж5,
	|	Ож6.КолОж6 КАК КолОж6,
	|	Ож7.КолОж7 КАК КолОж7,
	|	Ож8.КолОж8 КАК КолОж8,
	|	Ож9.КолОж9 КАК КолОж9,
	|	Ож10.КолОж10 КАК КолОж10,
	|	Ож11.КолОж11 КАК КолОж11,
	|	Ож12.КолОж12 КАК КолОж12,
	|	Ож13.КолОж13 КАК КолОж13,
	|	Ож14.КолОж14 КАК КолОж14,
	|	Ож15.КолОж15 КАК КолОж15,
	|	Ож16.КолОж16 КАК КолОж16,
	|	Ож17.КолОж17 КАК КолОж17,
	|	Ож18.КолОж18 КАК КолОж18,
	|	Ож19.КолОж19 КАК КолОж19,
	|	Ож20.КолОж20 КАК КолОж20,
	|	Ож21.КолОж21 КАК КолОж21,
	|	Ож21_.КолОж21_ КАК КолОж21_,
	|	ОжИтог.КолОж КАК КолОж,
	|	ПроизПлан.Про КАК Про,
	|	ПроизПлан.Про1 КАК Про1,
	|	ПроизПлан.Про2 КАК Про2,
	|	ПроизПлан.Про3 КАК Про3,
	|	ПроизПлан.Про4 КАК Про4,
	|	ПроизПлан.Про5 КАК Про5,
	|	ПроизПлан.Про6 КАК Про6,
	|	ПроизПлан.ПроПлан КАК ПроПлан,
	|	ПроизФакт.Факт КАК Факт,
	|	ВЫБОР
	|		КОГДА ПроизПлан.ПроПлан = 0
	|			ТОГДА 0
	|		ИНАЧЕ 100 * ПроизФакт.Факт / ПроизПлан.ПроПлан
	|	КОНЕЦ КАК Процент,
	|	Тов.ТипПродукции КАК ТипПродукции,
	|	Тов.ТипНаименование КАК ТипНаименование,
	|	Тов.НазначениеПродукции КАК НазначениеПродукции,
	|	Тов.НазначениеНаименование КАК НазначениеНаименование,
	|	Тов.ВидНоменклатуры КАК ВидНоменклатуры,
	|	Тов.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Тов КАК Тов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстЦехУтро КАК ОстЦехУтро
	|		ПО Тов.Номенклатура = ОстЦехУтро.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстЦехВечер КАК ОстЦехВечер
	|		ПО Тов.Номенклатура = ОстЦехВечер.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстСкл КАК ОстСкл
	|		ПО Тов.Номенклатура = ОстСкл.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ КОтг_1 КАК КОтг_1
	|		ПО Тов.Номенклатура = КОтг_1.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ КОтг0 КАК КОтг0
	|		ПО Тов.Номенклатура = КОтг0.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ КОтг1 КАК КОтг1
	|		ПО Тов.Номенклатура = КОтг1.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ КОтг2 КАК КОтг2
	|		ПО Тов.Номенклатура = КОтг2.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ КОтг3 КАК КОтг3
	|		ПО Тов.Номенклатура = КОтг3.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ КОтг4 КАК КОтг4
	|		ПО Тов.Номенклатура = КОтг4.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ КОтг5 КАК КОтг5
	|		ПО Тов.Номенклатура = КОтг5.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ КОтг6 КАК КОтг6
	|		ПО Тов.Номенклатура = КОтг6.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ КОтг7 КАК КОтг7
	|		ПО Тов.Номенклатура = КОтг7.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ КОтг7_ КАК КОтг7_
	|		ПО Тов.Номенклатура = КОтг7_.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ КОтгИтог КАК КОтгИтог
	|		ПО Тов.Номенклатура = КОтгИтог.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЦехУ КАК ЦехУ
	|		ПО Тов.Номенклатура = ЦехУ.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЦехВ КАК ЦехВ
	|		ПО Тов.Номенклатура = ЦехВ.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Цех1У КАК Цех1У
	|		ПО Тов.Номенклатура = Цех1У.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Цех1В КАК Цех1В
	|		ПО Тов.Номенклатура = Цех1В.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Цех2 КАК Цех2
	|		ПО Тов.Номенклатура = Цех2.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Цех3 КАК Цех3
	|		ПО Тов.Номенклатура = Цех3.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Цех4 КАК Цех4
	|		ПО Тов.Номенклатура = Цех4.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Цех5 КАК Цех5
	|		ПО Тов.Номенклатура = Цех5.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Цех6 КАК Цех6
	|		ПО Тов.Номенклатура = Цех6.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Цех7 КАК Цех7
	|		ПО Тов.Номенклатура = Цех7.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЦехИтог КАК ЦехИтог
	|		ПО Тов.Номенклатура = ЦехИтог.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Движ КАК Движ
	|		ПО Тов.Номенклатура = Движ.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Ож1 КАК Ож1
	|		ПО Тов.Номенклатура = Ож1.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Ож2 КАК Ож2
	|		ПО Тов.Номенклатура = Ож2.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Ож3 КАК Ож3
	|		ПО Тов.Номенклатура = Ож3.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Ож4 КАК Ож4
	|		ПО Тов.Номенклатура = Ож4.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Ож5 КАК Ож5
	|		ПО Тов.Номенклатура = Ож5.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Ож6 КАК Ож6
	|		ПО Тов.Номенклатура = Ож6.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Ож7 КАК Ож7
	|		ПО Тов.Номенклатура = Ож7.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Ож8 КАК Ож8
	|		ПО Тов.Номенклатура = Ож8.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Ож9 КАК Ож9
	|		ПО Тов.Номенклатура = Ож9.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Ож10 КАК Ож10
	|		ПО Тов.Номенклатура = Ож10.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Ож11 КАК Ож11
	|		ПО Тов.Номенклатура = Ож11.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Ож12 КАК Ож12
	|		ПО Тов.Номенклатура = Ож12.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Ож13 КАК Ож13
	|		ПО Тов.Номенклатура = Ож13.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Ож14 КАК Ож14
	|		ПО Тов.Номенклатура = Ож14.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Ож15 КАК Ож15
	|		ПО Тов.Номенклатура = Ож15.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Ож16 КАК Ож16
	|		ПО Тов.Номенклатура = Ож16.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Ож17 КАК Ож17
	|		ПО Тов.Номенклатура = Ож17.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Ож18 КАК Ож18
	|		ПО Тов.Номенклатура = Ож18.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Ож19 КАК Ож19
	|		ПО Тов.Номенклатура = Ож19.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Ож20 КАК Ож20
	|		ПО Тов.Номенклатура = Ож20.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Ож21 КАК Ож21
	|		ПО Тов.Номенклатура = Ож21.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Ож21_ КАК Ож21_
	|		ПО Тов.Номенклатура = Ож21_.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОжИтог КАК ОжИтог
	|		ПО Тов.Номенклатура = ОжИтог.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПроизПлан КАК ПроизПлан
	|		ПО Тов.Номенклатура = ПроизПлан.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПроизФакт КАК ПроизФакт
	|		ПО Тов.Номенклатура = ПроизФакт.Номенклатура";

	Отбор = "";
	Если ЗначениеЗаполнено(Парам.ТипПродукции) Тогда
		Отбор = Отбор + "
	|	Тов.ТипПродукции = &ТипПродукции";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Парам.НазначениеПродукции) Тогда
		Отбор = Отбор + "
	|	" + ?(ПустаяСтрока(Отбор), "", "И ") + "Тов.НазначениеПродукции = &НазначениеПродукции";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Парам.ВидНоменклатуры) Тогда
		Отбор = Отбор + "
	|	" + ?(ПустаяСтрока(Отбор), "", "И ") + "Тов.ВидНоменклатуры В (&ВидНоменклатуры)";
	КонецЕсли;
	
	Если Не ПустаяСтрока(Отбор) Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|ГДЕ";
		ТекстЗапроса = ТекстЗапроса + Отбор;
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + "
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТипНаименование,
	|	НазначениеНаименование,
	|	НомерСтроки
	|ИТОГИ
	|	СУММА(ОстЦехУ),
	|	СУММА(ОстСклУ),
	|	СУММА(Просрочено),
	|	СУММА(Свободно),
	|	СУММА(План1),
	|	СУММА(Факт1),
	|	СУММА(План2),
	|	СУММА(Факт2),
	|	СУММА(ОстЦех),
	|	СУММА(Приход),
	|	СУММА(Расход),
	|	СУММА(КОтгрузке),
	|	СУММА(ОстСкл),
	|	СУММА(КОтгрузке1),
	|	СУММА(КОтгрузке2),
	|	СУММА(КОтгрузке3),
	|	СУММА(КОтгрузке4),
	|	СУММА(КОтгрузке5),
	|	СУММА(КОтгрузке6),
	|	СУММА(КОтгрузке7),
	|	СУММА(КОтгрузке7_),
	|	СУММА(КОтгрузке8),
	|	СУММА(СвободноИтог),
	|	СУММА(СвободноПлан),
	|	СУММА(ПланЦех1_1),
	|	СУММА(ПланЦех1_2),
	|	СУММА(ПланЦех2),
	|	СУММА(ПланЦех3),
	|	СУММА(ПланЦех4),
	|	СУММА(ПланЦех5),
	|	СУММА(ПланЦех6),
	|	СУММА(ПланЦех7),
	|	СУММА(ПланЦех),
	|	СУММА(КолОж1),
	|	СУММА(КолОж2),
	|	СУММА(КолОж3),
	|	СУММА(КолОж4),
	|	СУММА(КолОж5),
	|	СУММА(КолОж6),
	|	СУММА(КолОж7),
	|	СУММА(КолОж8),
	|	СУММА(КолОж9),
	|	СУММА(КолОж10),
	|	СУММА(КолОж11),
	|	СУММА(КолОж12),
	|	СУММА(КолОж13),
	|	СУММА(КолОж14),
	|	СУММА(КолОж15),
	|	СУММА(КолОж16),
	|	СУММА(КолОж17),
	|	СУММА(КолОж18),
	|	СУММА(КолОж19),
	|	СУММА(КолОж20),
	|	СУММА(КолОж21),
	|	СУММА(КолОж21_),
	|	СУММА(КолОж),
	|	СУММА(Про),
	|	СУММА(Про1),
	|	СУММА(Про2),
	|	СУММА(Про3),
	|	СУММА(Про4),
	|	СУММА(Про5),
	|	СУММА(Про6),
	|	СУММА(ПроПлан),
	|	СУММА(Факт),
	|	ВЫБОР
	|		КОГДА СУММА(ПроизПлан.ПроПлан) = 0
	|			ТОГДА 0
	|		ИНАЧЕ 100 * СУММА(ПроизФакт.Факт) / СУММА(ПроизПлан.ПроПлан)
	|	КОНЕЦ КАК Процент
	|ПО
	|	ОБЩИЕ,
	|	ТипПродукции,
	|	НазначениеПродукции";

	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить();
КонецФункции

&НаСервере
Функция ПодготовитьПараметрыСводки()
	НачМесяц = НачалоМесяца(Дата);

	СписокЦехов = Новый Массив();
	СписокЦехов.Добавить(AMS_ВызовСервера.Цех1());
	СписокЦехов.Добавить(AMS_ВызовСервера.Цех2());
	СписокЦехов.Добавить(AMS_ВызовСервера.Цех3());
	
	Если Цех = 1 Тогда
		ВидНоменклатуры = AMS_ВызовСервера.ВидыНоменклатурыЦеха1();
	ИначеЕсли Цех = 2 Тогда
		ВидНоменклатуры = AMS_ВызовСервера.ВидыНоменклатурыЦеха2();
	ИначеЕсли Цех = 3 Тогда
		ВидНоменклатуры = AMS_ВызовСервера.ВидыНоменклатурыЦеха3();
	Иначе
		ВидНоменклатуры = Неопределено;
	КонецЕсли;
	
	Парам = Новый Структура;
	Парам.Вставить("Дата",                Дата);
	Парам.Вставить("ТипПродукции",        ТипПродукции);
	Парам.Вставить("НазначениеПродукции", НазначениеПродукции);
	Парам.Вставить("ВидНоменклатуры",     ВидНоменклатуры);
	
	Парам.Вставить("СкладПродукции", AMS_ВызовСервера.СкладПродукции());
	Парам.Вставить("ВидНоменклатурыПродукцияЦеха3", AMS_ВызовСервера.ВидыНоменклатурыЦеха3());
	Парам.Вставить("СписокЦехов", СписокЦехов); 
	
	Парам.Вставить("Год", Год(Дата));
	Парам.Вставить("Дата1", мср.ПолучитьРабочийДень(1, Дата));
	Парам.Вставить("Дата2", мср.ПолучитьРабочийДень(2, Дата));
	Парам.Вставить("Дата3", мср.ПолучитьРабочийДень(3, Дата));
	Парам.Вставить("Дата4", мср.ПолучитьРабочийДень(4, Дата));
	Парам.Вставить("Дата5", мср.ПолучитьРабочийДень(5, Дата));
	Парам.Вставить("Дата6", мср.ПолучитьРабочийДень(6, Дата));
	Парам.Вставить("Дата7", мср.ПолучитьРабочийДень(7, Дата));
	Парам.Вставить("Дата8", мср.ПолучитьРабочийДень(8, Дата));
	Парам.Вставить("Дата7_",Формат(Парам.Дата8, "ДФ=dd.MM.yy") + " и далее");
	Парам.Вставить("Дата9", мср.ПолучитьРабочийДень(9, Дата));
	Парам.Вставить("Дата10", мср.ПолучитьРабочийДень(10, Дата));
	Парам.Вставить("Дата11", мср.ПолучитьРабочийДень(11, Дата));
	Парам.Вставить("Дата12", мср.ПолучитьРабочийДень(12, Дата));
	Парам.Вставить("Дата13", мср.ПолучитьРабочийДень(13, Дата));
	Парам.Вставить("Дата14", мср.ПолучитьРабочийДень(14, Дата));
	Парам.Вставить("Дата15", мср.ПолучитьРабочийДень(15, Дата));
	Парам.Вставить("Дата16", мср.ПолучитьРабочийДень(16, Дата));
	Парам.Вставить("Дата17", мср.ПолучитьРабочийДень(17, Дата));
	Парам.Вставить("Дата18", мср.ПолучитьРабочийДень(18, Дата));
	Парам.Вставить("Дата19", мср.ПолучитьРабочийДень(19, Дата));
	Парам.Вставить("Дата20", мср.ПолучитьРабочийДень(20, Дата));
	Парам.Вставить("Дата21", мср.ПолучитьРабочийДень(21, Дата));
	Парам.Вставить("Дата22", мср.ПолучитьРабочийДень(22, Дата));
	Парам.Вставить("Дата21_", Формат(Парам.Дата22, "ДФ=dd.MM.yy") + " и далее");
	Парам.Вставить("ТекНеделя", НеделяГода(Дата));
	Парам.Вставить("Нед1", НеделяГода(НачМесяц));
	Парам.Вставить("Нед2", НеделяГода(НачМесяц + 1 * 604800));
	Парам.Вставить("Нед3", НеделяГода(НачМесяц + 2 * 604800));
	Парам.Вставить("Нед4", НеделяГода(НачМесяц + 3 * 604800));
	Парам.Вставить("Нед5", НеделяГода(НачМесяц + 4 * 604800));
	Парам.Вставить("Нед6", НеделяГода(НачМесяц + 5 * 604800));
	Парам.Вставить("НачПро", НачалоНедели(НачМесяц));
	Парам.Вставить("КонПро", КонецНедели(НачМесяц + 5*604800));
	
	Парам.Вставить("Неделя1", "    " + Парам.Нед1 + "   " + Символы.ПС
		+ Формат(НачалоНедели(НачМесяц), "ДФ=dd.MM") + "-" + Формат(КонецНедели(НачМесяц), "ДФ=dd.MM"));
		
	Парам.Вставить("Неделя2", "    " + Парам.Нед2 + "   " + Символы.ПС
		+ Формат(НачалоНедели(НачМесяц + 604800), "ДФ=dd.MM") + "-" + Формат(КонецНедели(НачМесяц + 604800), "ДФ=dd.MM"));
		
	Парам.Вставить("Неделя3", "    " + Парам.Нед3 + "   " + Символы.ПС
		+ Формат(НачалоНедели(НачМесяц + 2*604800), "ДФ=dd.MM") + "-" + Формат(КонецНедели(НачМесяц + 2*604800), "ДФ=dd.MM"));
		
	Парам.Вставить("Неделя4", "    " + Парам.Нед4 + "   " + Символы.ПС
		+ Формат(НачалоНедели(НачМесяц + 3*604800), "ДФ=dd.MM") + "-" + Формат(КонецНедели(НачМесяц + 3*604800), "ДФ=dd.MM"));
		
	Парам.Вставить("Неделя5", "    " + Парам.Нед5 + "   " + Символы.ПС
		+ Формат(НачалоНедели(НачМесяц + 4*604800), "ДФ=dd.MM") + "-" + Формат(КонецНедели(НачМесяц + 4*604800), "ДФ=dd.MM"));

	Парам.Вставить("Неделя6", "    " + Парам.Нед6 + "   " + Символы.ПС
		+ Формат(НачалоНедели(НачМесяц + 5*604800), "ДФ=dd.MM") + "-" + Формат(КонецНедели(НачМесяц + 5*604800), "ДФ=dd.MM"));

	Если ДобавитьМесяц(Парам.Дата22, 12) = Неопределено Тогда
		Текст = "Календарь ""Производственный календарь"" не заполнен. Обратитесь к администратору.";
		ОбщегоНазначения.СообщитьПользователю(Текст);
	КонецЕсли; 
	
	Возврат Парам;
КонецФункции

&НаКлиенте
Процедура ОбработкаРасшифровки(ИмяОбласти, Номенклатура)
	Парам = ПодготовитьПараметрыСводки();
	
	Период = Новый СтандартныйПериод;
	Период.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
	
	СкладПродукции = AMS_ВызовСервера.СкладПродукции();

	ИмяКолонки   = Прав(ИмяОбласти, СтрДлина(ИмяОбласти) - СтрНайти(ИмяОбласти, "C"));
	НомерКолонки = Число(ИмяКолонки);
	ЛеваяЧасть   = Лев(ИмяОбласти, СтрДлина(ИмяОбласти) - СтрДлина(ИмяКолонки));

	Если НомерКолонки > 3 И Не ПолучитьЗначениеЯчейки(ЛеваяЧасть + НомерКолонки) > 0 Тогда 
		Возврат;
	КонецЕсли;
	
	Если НомерКолонки < 8 Тогда
		ПоказатьЗначение( , Номенклатура);

	ИначеЕсли НомерКолонки = 8 Тогда //Остатки продукции на складе
		ПоказатьДвижениеТоваров(Номенклатура, СкладПродукции, КонецДня(Парам.Дата - 86400));

	ИначеЕсли НомерКолонки = 9 Тогда //Остатки продукции в цехе
		ЦехНоменклатуры = AMS_ВызовСервера.ПолучитьЦехНоменклатуры(Номенклатура);
		
		ПоказатьДвижениеТоваров(Номенклатура, ЦехНоменклатуры, КонецДня(Парам.Дата - 86400));

	ИначеЕсли НомерКолонки = 10 Тогда //Просрочена отгрузка
		Шапка = "Просрочена отгрузка: " + Номенклатура;
		
		Период.ДатаНачала    = Парам.Дата - 2592000;
		Период.ДатаОкончания = КонецДня(Парам.Дата - 86400);

		Парам = Новый Структура;
		Парам.Вставить("Период",       Период);
		Парам.Вставить("Номенклатура", Номенклатура);
		Парам.Вставить("Склад",        СкладПродукции);
		Парам.Вставить("Резерв",       Истина);
		Парам.Вставить("БезЗаказов",   Истина); //показать только реализации
		Парам.Вставить("Заголовок",    Шапка);
	
		ОткрытьФорму(AMS_Клиент.ПолучитьПолноеИмяФормы(ИмяФормы, "ФормаКОтгрузке"), Парам, ЭтотОбъект, Шапка);
	
	ИначеЕсли НомерКолонки = 11 Тогда
		ПоказатьСвободныйОстатокНаУтро(ЛеваяЧасть);
		
	ИначеЕсли НомерКолонки = 12 Тогда // Приход на склад
		ПоказатьПриходНаСклад(Номенклатура, СкладПродукции);
		
	ИначеЕсли НомерКолонки = 13 Тогда //Расход на складе
		Период = Новый СтандартныйПериод;
		Период.Вариант = ВариантСтандартногоПериода.Сегодня;

		ПользовательскиеНастройки = Новый Структура;
		ПользовательскиеНастройки.Вставить("Период", Период);

		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура", Номенклатура);
		Отбор.Вставить("Склад", СкладПродукции);

		Парам = Новый Структура;
		Парам.Вставить("КлючНазначенияИспользования", "СкладПродукции");
		Парам.Вставить("СформироватьПриОткрытии", Истина);
		Парам.Вставить("ВидимостьКомандВариантовОтчетов", Ложь);
		Парам.Вставить("Отбор", Отбор);
		Парам.Вставить("ПользовательскиеНастройки", ПолучитьИзВременногоХранилища(
			AMS_ВызовСервера.ПолучитьАдресПользовательскиеНастройки("AMS_ДвижениеТоваров", ПользовательскиеНастройки,
			"ДвижениеТоваров")));
		
	ОткрытьФорму("Отчет.AMS_ДвижениеТоваров.Форма", Парам, ЭтотОбъект, Строка(Период) + Номенклатура + СкладПродукции);

	ИначеЕсли НомерКолонки = 14 Тогда //Оформлено к отгрузке
		Шапка = "К отгрузке: " + Номенклатура;

		Период.ДатаНачала    = НачалоДня(Парам.Дата);
		Период.ДатаОкончания = КонецДня(Парам.Дата);

		Парам = Новый Структура;
		Парам.Вставить("Период",       Период);
		Парам.Вставить("Номенклатура", Номенклатура);
		Парам.Вставить("Склад",        СкладПродукции);
		Парам.Вставить("Резерв",       Истина);
		Парам.Вставить("БезЗаказов",   Истина); //показать только реализации
		Парам.Вставить("Заголовок",    Шапка);
	
		ОткрытьФорму(AMS_Клиент.ПолучитьПолноеИмяФормы(ИмяФормы, "ФормаКОтгрузке"), Парам, ЭтотОбъект, Шапка);
	
	ИначеЕсли НомерКолонки = 15 Тогда
		ПоказатьСвободныйОстатокНаВечер(ЛеваяЧасть);
		
	ИначеЕсли НомерКолонки = 16 Или НомерКолонки = 17 Тогда
		Период.ДатаНачала    = НачалоДня(Дата);
		Период.ДатаОкончания = КонецДня(Дата);
		Смена = ПредопределенноеЗначение("Перечисление._ПроизводственныеСмены.Дневная");
		
		ПоказатьДокументыПроизводства(Номенклатура, Смена, Период);
		
	ИначеЕсли НомерКолонки = 18 Или НомерКолонки = 19 Тогда
		Период.ДатаНачала    = НачалоДня(Дата);
		Период.ДатаОкончания = КонецДня(Дата);
		Смена = ПредопределенноеЗначение("Перечисление._ПроизводственныеСмены.Вечерняя");
		
		ПоказатьДокументыПроизводства(Номенклатура, Смена, Период);
		
	ИначеЕсли НомерКолонки = 20 Тогда //Текущий остаток в цехе
		ЦехНоменклатуры = AMS_ВызовСервера.ПолучитьЦехНоменклатуры(Номенклатура);
		
		ПоказатьДвижениеТоваров(Номенклатура, ЦехНоменклатуры, КонецДня(Дата)); 

	ИначеЕсли НомерКолонки >= 21 И НомерКолонки <= 29 Тогда
		Если НомерКолонки = 21 Тогда
			Период.ДатаНачала    = НачалоДня(Парам.Дата1);
			Период.ДатаОкончания = КонецДня(Парам.Дата1);
		ИначеЕсли НомерКолонки = 22 Тогда
			Период.ДатаНачала    = НачалоДня(Парам.Дата2);
			Период.ДатаОкончания = КонецДня(Парам.Дата2);
		ИначеЕсли НомерКолонки = 23 Тогда
			Период.ДатаНачала    = НачалоДня(Парам.Дата3);
			Период.ДатаОкончания = КонецДня(Парам.Дата3);
		ИначеЕсли НомерКолонки = 24 Тогда
			Период.ДатаНачала    = НачалоДня(Парам.Дата4);
			Период.ДатаОкончания = КонецДня(Парам.Дата4);
		ИначеЕсли НомерКолонки = 25 Тогда
			Период.ДатаНачала    = НачалоДня(Парам.Дата5);
			Период.ДатаОкончания = КонецДня(Парам.Дата5);
		ИначеЕсли НомерКолонки = 26 Тогда
			Период.ДатаНачала    = НачалоДня(Парам.Дата6);
			Период.ДатаОкончания = КонецДня(Парам.Дата6);
		ИначеЕсли НомерКолонки = 27 Тогда
			Период.ДатаНачала    = НачалоДня(Парам.Дата7);
			Период.ДатаОкончания = КонецДня(Парам.Дата7);
		ИначеЕсли НомерКолонки = 28 Тогда
			Период.ДатаНачала    = НачалоДня(Парам.Дата8);
			Период.ДатаОкончания = ДобавитьМесяц(КонецДня(Парам.Дата8), 60);
		ИначеЕсли НомерКолонки = 29 Тогда
			Период.ДатаНачала    = НачалоДня(Парам.Дата1);
			Период.ДатаОкончания = ДобавитьМесяц(КонецДня(Парам.Дата8), 60);
		КонецЕсли;
			
		Шапка = "Резерв: " + Номенклатура;
		
		Парам = Новый Структура;
		Парам.Вставить("Период",       Период);
		Парам.Вставить("Номенклатура", Номенклатура);
		Парам.Вставить("Склад",        СкладПродукции);
		Парам.Вставить("Резерв",       Истина);
		Парам.Вставить("БезЗаказов",   Ложь); //показать заказы и реализации
		Парам.Вставить("Заголовок",    Шапка);
	
		ОткрытьФорму(AMS_Клиент.ПолучитьПолноеИмяФормы(ИмяФормы, "ФормаКОтгрузке"), Парам, ЭтотОбъект, Шапка + НомерКолонки);
		
	ИначеЕсли НомерКолонки = 30 Тогда
		ПоказатьСвободныйОстатокИтог(ЛеваяЧасть);
		
	ИначеЕсли НомерКолонки = 31 Тогда
		ПоказатьСвободныйОстатокИтогПлюсПлан(ЛеваяЧасть);
		
	ИначеЕсли НомерКолонки = 32 Тогда
		ПоказатьНеобходимоПроизвести(ЛеваяЧасть);
		
	ИначеЕсли НомерКолонки >= 33 И НомерКолонки <= 41 Тогда
		Смена = Неопределено;
		
		Если НомерКолонки = 33 Тогда
			Период.ДатаНачала    = НачалоДня(Парам.Дата1);
			Период.ДатаОкончания = КонецДня(Парам.Дата1);
			Смена = ПредопределенноеЗначение("Перечисление._ПроизводственныеСмены.Дневная");
		ИначеЕсли НомерКолонки = 34 Тогда
			Период.ДатаНачала    = НачалоДня(Парам.Дата1);
			Период.ДатаОкончания = КонецДня(Парам.Дата1);
			Смена = ПредопределенноеЗначение("Перечисление._ПроизводственныеСмены.Вечерняя");
		ИначеЕсли НомерКолонки = 35 Тогда
			Период.ДатаНачала    = НачалоДня(Парам.Дата2);
			Период.ДатаОкончания = КонецДня(Парам.Дата2);
		ИначеЕсли НомерКолонки = 36 Тогда
			Период.ДатаНачала    = НачалоДня(Парам.Дата3);
			Период.ДатаОкончания = КонецДня(Парам.Дата3);
		ИначеЕсли НомерКолонки = 37 Тогда
			Период.ДатаНачала    = НачалоДня(Парам.Дата4);
			Период.ДатаОкончания = КонецДня(Парам.Дата4);
		ИначеЕсли НомерКолонки = 38 Тогда
			Период.ДатаНачала    = НачалоДня(Парам.Дата5);
			Период.ДатаОкончания = КонецДня(Парам.Дата5);
		ИначеЕсли НомерКолонки = 39 Тогда
			Период.ДатаНачала    = НачалоДня(Парам.Дата6);
			Период.ДатаОкончания = КонецДня(Парам.Дата6);
		ИначеЕсли НомерКолонки = 40 Тогда
			Период.ДатаНачала    = НачалоДня(Парам.Дата7);
			Период.ДатаОкончания = КонецДня(Парам.Дата7);
		ИначеЕсли НомерКолонки = 41 Тогда
			Период.ДатаНачала    = НачалоДня(Парам.Дата1);
			Период.ДатаОкончания = КонецДня(Парам.Дата7);
		КонецЕсли;
	
		ПоказатьДокументыПроизводства(Номенклатура, Смена, Период);
		
	ИначеЕсли НомерКолонки >= 42 И НомерКолонки <= 64 Тогда
		Если НомерКолонки = 42 Тогда
			Период.ДатаНачала    = НачалоДня(ДобавитьМесяц(Парам.Дата1, -12));
			Период.ДатаОкончания = КонецДня(Парам.Дата1);
		ИначеЕсли НомерКолонки = 43 Тогда
			Период.ДатаНачала    = НачалоДня(Парам.Дата2);
			Период.ДатаОкончания = КонецДня(Парам.Дата2);
		ИначеЕсли НомерКолонки = 44 Тогда
			Период.ДатаНачала    = НачалоДня(Парам.Дата3);
			Период.ДатаОкончания = КонецДня(Парам.Дата3);
 		ИначеЕсли НомерКолонки = 45 Тогда
			Период.ДатаНачала    = НачалоДня(Парам.Дата4);
			Период.ДатаОкончания = КонецДня(Парам.Дата4);
		ИначеЕсли НомерКолонки = 46 Тогда
			Период.ДатаНачала    = НачалоДня(Парам.Дата5);
			Период.ДатаОкончания = КонецДня(Парам.Дата5);
		ИначеЕсли НомерКолонки = 47 Тогда
			Период.ДатаНачала    = НачалоДня(Парам.Дата6);
			Период.ДатаОкончания = КонецДня(Парам.Дата6);
		ИначеЕсли НомерКолонки = 48 Тогда
			Период.ДатаНачала    = НачалоДня(Парам.Дата7);
			Период.ДатаОкончания = КонецДня(Парам.Дата7);
		ИначеЕсли НомерКолонки = 49 Тогда
			Период.ДатаНачала    = НачалоДня(Парам.Дата8);
			Период.ДатаОкончания = КонецДня(Парам.Дата8);
		ИначеЕсли НомерКолонки = 50 Тогда
			Период.ДатаНачала    = НачалоДня(Парам.Дата9);
			Период.ДатаОкончания = КонецДня(Парам.Дата9);
		ИначеЕсли НомерКолонки = 51 Тогда
			Период.ДатаНачала    = НачалоДня(Парам.Дата10);
			Период.ДатаОкончания = КонецДня(Парам.Дата10);
		ИначеЕсли НомерКолонки = 52 Тогда
			Период.ДатаНачала    = НачалоДня(Парам.Дата11);
			Период.ДатаОкончания = КонецДня(Парам.Дата11);
		ИначеЕсли НомерКолонки = 53 Тогда
			Период.ДатаНачала    = НачалоДня(Парам.Дата12);
			Период.ДатаОкончания = КонецДня(Парам.Дата12);
		ИначеЕсли НомерКолонки = 54 Тогда
			Период.ДатаНачала    = НачалоДня(Парам.Дата13);
			Период.ДатаОкончания = КонецДня(Парам.Дата13);
		ИначеЕсли НомерКолонки = 55 Тогда
			Период.ДатаНачала    = НачалоДня(Парам.Дата14);
			Период.ДатаОкончания = КонецДня(Парам.Дата14);
		ИначеЕсли НомерКолонки = 56 Тогда
			Период.ДатаНачала    = НачалоДня(Парам.Дата15);
			Период.ДатаОкончания = КонецДня(Парам.Дата15);
		ИначеЕсли НомерКолонки = 57 Тогда
			Период.ДатаНачала    = НачалоДня(Парам.Дата16);
			Период.ДатаОкончания = КонецДня(Парам.Дата16);
		ИначеЕсли НомерКолонки = 58 Тогда
			Период.ДатаНачала    = НачалоДня(Парам.Дата17);
			Период.ДатаОкончания = КонецДня(Парам.Дата17);
		ИначеЕсли НомерКолонки = 59 Тогда
			Период.ДатаНачала    = НачалоДня(Парам.Дата18);
			Период.ДатаОкончания = КонецДня(Парам.Дата18);
		ИначеЕсли НомерКолонки = 60 Тогда
			Период.ДатаНачала    = НачалоДня(Парам.Дата19);
			Период.ДатаОкончания = КонецДня(Парам.Дата19);
		ИначеЕсли НомерКолонки = 61 Тогда
			Период.ДатаНачала    = НачалоДня(Парам.Дата20);
			Период.ДатаОкончания = КонецДня(Парам.Дата20);
		ИначеЕсли НомерКолонки = 62 Тогда
			Период.ДатаНачала    = НачалоДня(Парам.Дата21);
			Период.ДатаОкончания = КонецДня(Парам.Дата21);
		ИначеЕсли НомерКолонки = 63 Тогда
			Период.ДатаНачала    = НачалоДня(Парам.Дата22);
			Период.ДатаОкончания = КонецДня(ДобавитьМесяц(Парам.Дата1, 12));
		ИначеЕсли НомерКолонки = 64 Тогда
			Период.ДатаНачала    = НачалоДня(ДобавитьМесяц(Парам.Дата1, -12));
			Период.ДатаОкончания = КонецДня(ДобавитьМесяц(Парам.Дата1, 12));
		КонецЕсли;
		
		Шапка = "Ожидаемые продажи: " + Номенклатура;

		Парам = Новый Структура;
		Парам.Вставить("Период",       Период);
		Парам.Вставить("Номенклатура", Номенклатура);
		Парам.Вставить("Склад",        СкладПродукции);
		Парам.Вставить("Резерв",       Ложь);
		Парам.Вставить("Заголовок",    Шапка);

		ОткрытьФорму(AMS_Клиент.ПолучитьПолноеИмяФормы(ИмяФормы, "ФормаКОтгрузке"), Парам, ЭтотОбъект, Шапка + НомерКолонки);

	ИначеЕсли НомерКолонки >= 65 И НомерКолонки <= 71 Тогда
		ПланПроизводства = ПолучитьПланПроизводства(Дата, Номенклатура);
		Если ЗначениеЗаполнено(ПланПроизводства) Тогда 
			ПоказатьЗначение(, ПланПроизводства);
		КонецЕсли;

	ИначеЕсли НомерКолонки = 72 Тогда
		Период.ДатаНачала    = Парам.НачПро;
		Период.ДатаОкончания = Парам.КонПро;
		ПоказатьДокументыПроизводства(Номенклатура, Неопределено, Период);

	ИначеЕсли НомерКолонки = 73 Тогда
		ПоказатьПроцентВыполнения(ЛеваяЧасть, Парам);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДвижениеТоваров(Номенклатура, Склад, ДатаОкончания)
	Период = Новый СтандартныйПериод;
	Период.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
	Период.ДатаНачала    = Дата - 2592000;
	Период.ДатаОкончания = ДатаОкончания;

	ПользовательскиеНастройки = Новый Структура;
	ПользовательскиеНастройки.Вставить("Период", Период);

	Отбор = Новый Структура;
	Отбор.Вставить("Номенклатура", Номенклатура);
	Отбор.Вставить("Склад", Склад);

	Парам = Новый Структура;
	Парам.Вставить("КлючНазначенияИспользования", "ТоварыВЦехе");
	Парам.Вставить("СформироватьПриОткрытии", Истина);
	Парам.Вставить("ВидимостьКомандВариантовОтчетов", Ложь);
	Парам.Вставить("Отбор", Отбор);
	Парам.Вставить("ПользовательскиеНастройки", ПолучитьИзВременногоХранилища(
		AMS_ВызовСервера.ПолучитьАдресПользовательскиеНастройки("AMS_ДвижениеТоваров", ПользовательскиеНастройки,
		"ДвижениеТоваров")));
		
	ОткрытьФорму("Отчет.AMS_ДвижениеТоваров.Форма", Парам, ЭтотОбъект, Строка(Период) + Номенклатура + Склад);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСвободныйОстатокНаУтро(ЛеваяЧасть)
	Остаток = 0;

	ОстатокСклад = ПолучитьЗначениеЯчейки(ЛеваяЧасть + 8); 
	ОстатокЦех   = ПолучитьЗначениеЯчейки(ЛеваяЧасть + 9);
	Расход       = ПолучитьЗначениеЯчейки(ЛеваяЧасть + 13); 
	КОтгрузке    = ПолучитьЗначениеЯчейки(ЛеваяЧасть + 14); 

	Массив = Новый Массив;
	
	Остаток = Остаток + ОстатокСклад;
	Стр = ПолучитьСтруктурыОтчета();
	Стр.Наименование = "Остаток на складе (8)";
	Стр.Приход       = ОстатокСклад;
	Стр.Остаток      = Остаток;
	Массив.Добавить(Стр);

	Остаток = Остаток + ОстатокЦех;
	Стр = ПолучитьСтруктурыОтчета();
	Стр.Наименование = "Остаток в цехе (9)";
	Стр.Приход       = ОстатокЦех;
	Стр.Остаток      = Остаток;
	Массив.Добавить(Стр);

	Остаток = Остаток - Расход;
	Стр = ПолучитьСтруктурыОтчета();
	Стр.Наименование = "Расход (13)";
	Стр.Расход       = Расход;
	Стр.Остаток      = Остаток;
	Массив.Добавить(Стр);

	Остаток = Остаток - КОтгрузке;
	Стр = ПолучитьСтруктурыОтчета();
	Стр.Наименование = "Оформлено к отгрузке (14)";
	Стр.Расход       = КОтгрузке;
	Стр.Остаток      = Остаток;
	Массив.Добавить(Стр);

	Стр = ПолучитьСтруктурыОтчета();
	Стр.Наименование = "Итого остаток";
	Стр.Остаток      = Остаток;
	Массив.Добавить(Стр);

	Шапка = "Свободный остаток на утро: " + ПолучитьТекстЯчейки(ЛеваяЧасть + 3);
	
	Парам = Новый Структура("Заголовок, Массив", Шапка, Массив);

	ОткрытьФорму(AMS_Клиент.ПолучитьПолноеИмяФормы(ИмяФормы, "ФормаСвободныйОстаток"), Парам, ЭтотОбъект, Шапка);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСвободныйОстатокНаВечер(ЛеваяЧасть)
	Остаток = 0;

	ОстатокСклад = ПолучитьЗначениеЯчейки(ЛеваяЧасть + 8); 
	Приход       = ПолучитьЗначениеЯчейки(ЛеваяЧасть + 12); 
	Расход       = ПолучитьЗначениеЯчейки(ЛеваяЧасть + 13); 

	Массив = Новый Массив;
	
	Остаток = Остаток + ОстатокСклад;
	Стр = ПолучитьСтруктурыОтчета();
	Стр.Наименование = "Остаток на складе (8)";
	Стр.Приход       = ОстатокСклад;
	Стр.Остаток      = Остаток;
	Массив.Добавить(Стр);

	Остаток = Остаток + Приход;
	Стр = ПолучитьСтруктурыОтчета();
	Стр.Наименование = "Приход (12)";
	Стр.Приход       = Приход;
	Стр.Остаток      = Остаток;
	Массив.Добавить(Стр);

	Остаток = Остаток - Расход;
	Стр = ПолучитьСтруктурыОтчета();
	Стр.Наименование = "Расход (13)";
	Стр.Расход       = Расход;
	Стр.Остаток      = Остаток;
	Массив.Добавить(Стр);

	Стр = ПолучитьСтруктурыОтчета();
	Стр.Наименование = "Итого остаток (15)";
	Стр.Остаток      = Остаток;
	Массив.Добавить(Стр);

	Шапка = "Свободный остаток на вечер: " + ПолучитьТекстЯчейки(ЛеваяЧасть + 3);

	Парам = Новый Структура("Заголовок, Массив", Шапка, Массив);

	ОткрытьФорму(AMS_Клиент.ПолучитьПолноеИмяФормы(ИмяФормы, "ФормаСвободныйОстаток"), Парам, ЭтотОбъект, Шапка);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДокументыПроизводства(Номенклатура, Смена, Период)
	Отбор = Новый Структура;
	Отбор.Вставить("ПериодОтчета", Период);
	Отбор.Вставить("Номенклатура", Номенклатура);
	Если Не Смена = Неопределено Тогда
		Отбор.Вставить("Смена", Смена);
	КонецЕсли;

	Парам = Новый Структура;
	Парам.Вставить("КлючНазначенияИспользования", "ДокументыПроизводства");
	Парам.Вставить("СформироватьПриОткрытии", Истина);
	Парам.Вставить("ВидимостьКомандВариантовОтчетов", Ложь);
	Парам.Вставить("Отбор", Отбор);

	ОткрытьФорму("Отчет.AMS_СводкаДокументыПроизводства.Форма", Парам, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПриходНаСклад(Номенклатура, СкладПродукции)
	Период = Новый СтандартныйПериод;
	Период.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
	Период.ДатаНачала    = НачалоДня(Дата);
	Период.ДатаОкончания = КонецДня(Дата);

	Отбор = Новый Структура;
	Отбор.Вставить("Номенклатура", Номенклатура);
	Отбор.Вставить("Период", Период);
	Отбор.Вставить("СкладПродукции", СкладПродукции);

	Парам = Новый Структура;
	Парам.Вставить("КлючНазначенияИспользования", "Приход");
	Парам.Вставить("СформироватьПриОткрытии", Истина);
	Парам.Вставить("ВидимостьКомандВариантовОтчетов", Ложь);
	Парам.Вставить("Отбор", Отбор);

	ОткрытьФорму("Отчет.AMS_СводкаПриход.Форма", Парам, ЭтотОбъект, Номенклатура);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСвободныйОстатокИтог(ЛеваяЧасть)
	Остаток = 0;

	ОстатокСклад = ПолучитьЗначениеЯчейки(ЛеваяЧасть + 8); 
	ОстатокЦех   = ПолучитьЗначениеЯчейки(ЛеваяЧасть + 9); 
	Приход       = ПолучитьЗначениеЯчейки(ЛеваяЧасть + 12); 
	Расход       = ПолучитьЗначениеЯчейки(ЛеваяЧасть + 13); 
	КОтгрузке    = ПолучитьЗначениеЯчейки(ЛеваяЧасть + 14); 
	Резерв       = ПолучитьЗначениеЯчейки(ЛеваяЧасть + 29); 

	Массив = Новый Массив;
	
	Остаток = Остаток + ОстатокСклад;
	Стр = ПолучитьСтруктурыОтчета();
	Стр.Наименование = "Остаток на складе (8)";
	Стр.Приход       = ОстатокСклад;
	Стр.Остаток      = Остаток;
	Массив.Добавить(Стр);

	Остаток = Остаток + ОстатокЦех;
	Стр = ПолучитьСтруктурыОтчета();
	Стр.Наименование = "Остаток в цехе (9)";
	Стр.Приход       = ОстатокЦех;
	Стр.Остаток      = Остаток;
	Массив.Добавить(Стр);

	Остаток = Остаток + Приход;
	Стр = ПолучитьСтруктурыОтчета();
	Стр.Наименование = "Приход (12)";
	Стр.Приход       = Приход;
	Стр.Остаток      = Остаток;
	Массив.Добавить(Стр);

	Остаток = Остаток - Расход;
	Стр = ПолучитьСтруктурыОтчета();
	Стр.Наименование = "Расход (13)";
	Стр.Расход       = Расход;
	Стр.Остаток      = Остаток;
	Массив.Добавить(Стр);

	Остаток = Остаток - КОтгрузке;
	Стр = ПолучитьСтруктурыОтчета();
	Стр.Наименование = "К отгрузке (14)";
	Стр.Расход       = КОтгрузке;
	Стр.Остаток      = Остаток;
	Массив.Добавить(Стр);

	Остаток = Остаток - Резерв;
	Стр = ПолучитьСтруктурыОтчета();
	Стр.Наименование = "Резерв (29)";
	Стр.Расход       = Резерв;
	Стр.Остаток      = Остаток;
	Массив.Добавить(Стр);

	Стр = ПолучитьСтруктурыОтчета();
	Стр.Наименование = "Итого остаток (30)";
	Стр.Остаток      = Остаток;
	Массив.Добавить(Стр);
	
	Шапка = "Свободный остаток с учетом резерва: " + ПолучитьТекстЯчейки(ЛеваяЧасть + 3);
	
	Парам = Новый Структура("Заголовок, Массив", Шапка, Массив);

	ОткрытьФорму(AMS_Клиент.ПолучитьПолноеИмяФормы(ИмяФормы, "ФормаСвободныйОстаток"), Парам, ЭтотОбъект, Шапка);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСвободныйОстатокИтогПлюсПлан(ЛеваяЧасть)
	Остаток = 0;

	СвободныйОстаток = ПолучитьЗначениеЯчейки(ЛеваяЧасть + 30); 
	План1            = ПолучитьЗначениеЯчейки(ЛеваяЧасть + 16); 
	Факт1            = ПолучитьЗначениеЯчейки(ЛеваяЧасть + 17); 
	План2            = ПолучитьЗначениеЯчейки(ЛеваяЧасть + 18); 
	Факт2            = ПолучитьЗначениеЯчейки(ЛеваяЧасть + 19); 

	Массив = Новый Массив;
	
	Остаток = Остаток + СвободныйОстаток;
	Стр = ПолучитьСтруктурыОтчета();
	Стр.Наименование = "Свободный остаток (30)";
	Стр.Приход       = СвободныйОстаток;
	Стр.Остаток      = Остаток;
	Массив.Добавить(Стр);

	Остаток = Остаток + План1;
	Стр = ПолучитьСтруктурыОтчета();
	Стр.Наименование = "План 1-я смена (16)";
	Стр.Приход       = План1;
	Стр.Остаток      = Остаток;
	Массив.Добавить(Стр);

	Остаток = Остаток - Факт1;
	Стр = ПолучитьСтруктурыОтчета();
	Стр.Наименование = "Факт 1-я смена (17)";
	Стр.Расход       = Факт1;
	Стр.Остаток      = Остаток;
	Массив.Добавить(Стр);

	Остаток = Остаток + План2;
	Стр = ПолучитьСтруктурыОтчета();
	Стр.Наименование = "План 2-я смена (18)";
	Стр.Приход       = План2;
	Стр.Остаток      = Остаток;
	Массив.Добавить(Стр);

	Остаток = Остаток - Факт2;
	Стр = ПолучитьСтруктурыОтчета();
	Стр.Наименование = "Факт 2-я смена (16)";
	Стр.Расход       = Факт2;
	Стр.Остаток      = Остаток;
	Массив.Добавить(Стр);

	Стр = ПолучитьСтруктурыОтчета();
	Стр.Наименование = "Итого остаток + план (31)";
	Стр.Остаток      = Остаток;
	Массив.Добавить(Стр);

	Шапка = "Свободный остаток + план производства: " + ПолучитьТекстЯчейки(ЛеваяЧасть + 3);
	
	Парам = Новый Структура("Заголовок, Массив", Шапка, Массив);

	ОткрытьФорму(AMS_Клиент.ПолучитьПолноеИмяФормы(ИмяФормы, "ФормаСвободныйОстаток"), Парам, ЭтотОбъект, Шапка);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьНеобходимоПроизвести(ЛеваяЧасть)
	МинЗапас = ПолучитьЗначениеЯчейки(ЛеваяЧасть + 6);
	Свободно = ПолучитьЗначениеЯчейки(ЛеваяЧасть + 30); 
	
	Если Свободно < МинЗапас Тогда 

		Массив = Новый Массив;
		
		Стр = ПолучитьСтруктурыОтчета();
		Стр.Наименование = "Установленный минимальный запас (6)";
		Стр.Приход       = МинЗапас;
		Стр.Остаток      = МинЗапас;
		Массив.Добавить(Стр);

		Стр = ПолучитьСтруктурыОтчета();
		Стр.Наименование = "Свободный остаток (30)";
		Стр.Расход       = Свободно;
		Стр.Остаток      = МинЗапас - Свободно;
		Массив.Добавить(Стр);

		Стр = ПолучитьСтруктурыОтчета();
		Стр.Наименование = "Необходимо произвести (31)";
		Стр.Остаток      = МинЗапас - Свободно;
		Массив.Добавить(Стр);

		Шапка = "Необходимо произвести: " + ПолучитьТекстЯчейки(ЛеваяЧасть + 3);
	
		Парам = Новый Структура("Заголовок, Массив", Шапка, Массив);

		ОткрытьФорму(AMS_Клиент.ПолучитьПолноеИмяФормы(ИмяФормы, "ФормаСвободныйОстаток"), Парам, ЭтотОбъект, Шапка);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПланПроизводства(Дата, Номенклатура)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	д.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.AMS_ПланПроизводства КАК д
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.AMS_ПланПроизводства.Товары КАК т
	|		ПО д.Ссылка = т.Ссылка
	|ГДЕ
	|	д.Год = &Год
	|	И т.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Год", Год(Дата));
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Рез = Запрос.Выполнить();
	Выб = Рез.Выбрать();
	Выб.Следующий();
	
	Возврат Выб.Ссылка;
КонецФункции

&НаКлиенте
Процедура ПоказатьПроцентВыполнения(ЛеваяЧасть, Парам)
	Массив = Новый Массив;
	
	План = 0;
	Если Парам.Нед1 <= Парам.ТекНеделя Тогда 
		Про1 = ПолучитьЗначениеЯчейки(ЛеваяЧасть + 66);
		План = План + Про1;
		
		Стр = ПолучитьСтруктурыОтчета();
		Стр.Наименование = "План производства за неделю №" + Парам.Нед1 + " (66)";
		Стр.Приход = Про1;
		Массив.Добавить(Стр);
	КонецЕсли;

	Если Парам.Нед2 <= Парам.ТекНеделя Тогда 
		Про2 = ПолучитьЗначениеЯчейки(ЛеваяЧасть + 67);
		План = План + Про2;
		
		Стр = ПолучитьСтруктурыОтчета();
		Стр.Наименование = "План производства за неделю №" + Парам.Нед2 + " (67)";
		Стр.Приход = Про2;
		Массив.Добавить(Стр);
	КонецЕсли;

	Если Парам.Нед3 <= Парам.ТекНеделя Тогда 
		Про3 = ПолучитьЗначениеЯчейки(ЛеваяЧасть + 68);
		План = План + Про3;
		
		Стр = ПолучитьСтруктурыОтчета();
		Стр.Наименование = "План производства за неделю №" + Парам.Нед3 + " (68)";
		Стр.Приход = Про3;
		Массив.Добавить(Стр);
	КонецЕсли;

	Если Парам.Нед4 <= Парам.ТекНеделя Тогда 
		Про4 = ПолучитьЗначениеЯчейки(ЛеваяЧасть + 69);
		План = План + Про4;
		
		Стр = ПолучитьСтруктурыОтчета();
		Стр.Наименование = "План производства за неделю №" + Парам.Нед4 + " (69)";
		Стр.Приход = Про4;
		Массив.Добавить(Стр);
	КонецЕсли;

	Если Парам.Нед5 <= Парам.ТекНеделя Тогда 
		Про5 = ПолучитьЗначениеЯчейки(ЛеваяЧасть + 70);
		План = План + Про5;
		
		Стр = ПолучитьСтруктурыОтчета();
		Стр.Наименование = "План производства за неделю №" + Парам.Нед5 + " (70)";
		Стр.Приход = Про5;
		Массив.Добавить(Стр);
	КонецЕсли;

	Если Парам.Нед5 <= Парам.ТекНеделя Тогда 
		Про5 = ПолучитьЗначениеЯчейки(ЛеваяЧасть + 71);
		План = План + Про5;
		
		Стр = ПолучитьСтруктурыОтчета();
		Стр.Наименование = "План производства за неделю №" + Парам.Нед5 + " (71)";
		Стр.Приход = Про5;
		Массив.Добавить(Стр);
	КонецЕсли;
	
	Факт = ПолучитьЗначениеЯчейки(ЛеваяЧасть + 72); 
	Стр = ПолучитьСтруктурыОтчета();
	Стр.Наименование = "Фактически произведено (72)";
	Стр.Расход = Факт;
	Массив.Добавить(Стр);

	Стр = ПолучитьСтруктурыОтчета();
	Стр.Наименование = "Итого процент выполнения (73)";
	Стр.Приход = План;
	Стр.Расход = Факт;
	Стр.Остаток = ПолучитьЗначениеЯчейки(ЛеваяЧасть + 73);
	Массив.Добавить(Стр);
		
	Шапка = "Процент выполнения: " + ПолучитьТекстЯчейки(ЛеваяЧасть + 3);

	Парам = Новый Структура("Заголовок, Массив", Шапка, Массив);

	ОткрытьФорму(AMS_Клиент.ПолучитьПолноеИмяФормы(ИмяФормы, "ФормаСвободныйОстаток"), Парам, ЭтотОбъект, Шапка);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтруктурыОтчета()
	//@skip-check structure-consructor-too-many-keys
	Возврат Новый Структура("Наименование, Приход, Расход, Остаток");
КонецФункции

&НаСервере
Функция ПолучитьТекстЯчейки(Имя)
	Возврат Таб.ПолучитьОбласть(Имя).ТекущаяОбласть.Текст;
КонецФункции

&НаСервере
Функция ПолучитьЗначениеЯчейки(Имя)
	Текст = Таб.ПолучитьОбласть(Имя).ТекущаяОбласть.Текст;
	Возврат ?(ПустаяСтрока(Текст), 0, Число(Текст));
КонецФункции

&НаКлиенте
Процедура ВыгрузитьСводку(ИмяФайла)
	Таб.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.XLSX);

	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.Visible       = Ложь;
		Excel.DisplayAlerts = Ложь;
		Книга = Excel.WorkBooks.Open(ИмяФайла);
	Исключение
		Текст = "Проблемы с подключением к Excel. " + ОписаниеОшибки();
		ОбщегоНазначенияКлиент.СообщитьПользователю(Текст);
		Возврат;
	КонецПопытки;

	ExcelЛист = Книга.WorkSheets(1);

	Попытка
		ExcelЛист.SaveAs(ИмяФайла);
	Исключение
		Текст =  "Файл не сохранён! " + ОписаниеОшибки();
		ОбщегоНазначенияКлиент.СообщитьПользователю(Текст);
	КонецПопытки;

	Книга.Close();
	Excel.Quit();
КонецПроцедуры

&НаСервере
Процедура УстановитьВозможностиСклада()
	УстановитьПривилегированныйРежим(Истина);

	МенеджерЗаписи = РегистрыСведений._ВозможностиСклада.СоздатьМенеджерЗаписи();

	МенеджерЗаписи.Дата = ВозможностиСкладаДата;

	МенеджерЗаписи.Прочитать();

	Если ВозможностиСклада = 0 Тогда
		Если МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.Удалить();
		КонецЕсли;

	Иначе
		МенеджерЗаписи.Дата       = ВозможностиСкладаДата;
		МенеджерЗаписи.Количество = ВозможностиСклада;
		МенеджерЗаписи.Записать();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УправлениеЭлементамиФормы()
	Если Пользователи.РолиДоступны("_Цех1") Тогда
		Цех = 1;
	ИначеЕсли Пользователи.РолиДоступны("_Цех2") Тогда
		Цех = 2;
	ИначеЕсли Пользователи.РолиДоступны("_Цех3") Тогда
		Цех = 3;
	КонецЕсли;

	Элементы.Цех.СписокВыбора.НайтиПоЗначению(Цех);
	
	Элементы.РасчетТоварныхЗапасов.Видимость = Пользователи.РолиДоступны("AMS_Аналитик");
	
	Элементы.ВозможностиСклада.Доступность = Пользователи.РолиДоступны("_Директор, _СтаршийМенеджер");

	ВозможностиСкладаДата = мср.ПолучитьРабочийДень(1, Дата);
	ВозможностиСклада     = AMS_ВызовСервера.ПолучитьВозможностиСклада(ВозможностиСкладаДата);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	д.Ссылка КАК Ссылка,
	|	д.Наименование КАК Наименование
	|ИЗ
	|	Справочник.AMS_Продукция КАК д
	|ГДЕ
	|	д.ЭтоГруппа
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	
	Элементы.ТипПродукции.СписокВыбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));;
	
	ЗаполнитьНазначениеПродукцииСписокВыбора();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНазначениеПродукцииСписокВыбора()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Родитель", ТипПродукции);
	
	ЗапросТекст = 	
	"ВЫБРАТЬ
	|	д.Ссылка КАК Ссылка,
	|	д.Наименование КАК Наименование
	|ИЗ
	|	Справочник.AMS_Продукция КАК д
	|ГДЕ
	|	Не д.ЭтоГруппа";
	
	Если ЗначениеЗаполнено(ТипПродукции) Тогда
		ЗапросТекст = ЗапросТекст + "
	|	И д.Родитель = &Родитель";
	КонецЕсли;
	
	ЗапросТекст = ЗапросТекст + "
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	
	Запрос.Текст = ЗапросТекст;	

	Элементы.НазначениеПродукции.СписокВыбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
КонецПроцедуры

#КонецОбласти
