#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Номер) Тогда
		УстановитьНовыйНомер();
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Автор) И ЭтоНовый() Тогда
		Автор = Пользователи.ТекущийПользователь();
	КонецЕсли;
КонецПроцедуры	

Процедура ОбработкаПроведения(Отказ, Режим)
	Движения._ОплатаРейсов.Записывать = Истина;

	Движения._ОплатаРейсов.Загрузить(ПолучитьДвиженияОплатыРейсов());
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДвиженияОплатыРейсов()

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Ссылка КАК Ссылка,
	|	т.Дата КАК Период,
	|	т.Организация КАК Организация,
	|	т.Партнер КАК Партнер
	|ПОМЕСТИТЬ ТУ
	|ИЗ
	|	Документ._ТранспортныеУслуги КАК т
	|ГДЕ
	|	т.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТУ.Период КАК Период,
	|	ТУ.Организация КАК Организация,
	|	ТУ_Рейсы.Ссылка КАК Ссылка,
	|	ТУ_Рейсы.Метка КАК Метка,
	|	ТУ_Рейсы.ЛогистическийЛист КАК ЛогистическийЛист,
	|	ТУ_Рейсы.ТранспортноеСредство КАК ТранспортноеСредство,
	|	ТУ_Рейсы.Водитель КАК Водитель,
	|	ТУ_Рейсы.СтоимостьДоставки КАК СтоимостьДоставки
	|ПОМЕСТИТЬ Рейсы
	|ИЗ
	|	ТУ КАК ТУ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ._ТранспортныеУслуги.Рейсы КАК ТУ_Рейсы
	|		ПО ТУ.Ссылка = ТУ_Рейсы.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Рейсы.Период КАК Период,
	|	Рейсы.Организация КАК Организация,
	|	ЕСТЬNULL(Распоряж.ОрганизацияЗаказа, Рейсы.Организация) КАК ОрганизацияЗаказа,
	|	Рейсы.ЛогистическийЛист КАК ЛогистическийЛист,
	|	Рейсы.ТранспортноеСредство КАК ТранспортноеСредство,
	|	Рейсы.ТранспортноеСредство._Перевозчик КАК Партнер,
	|	Рейсы.Водитель КАК Водитель,
	|	Распоряж.Распоряжение КАК ЗаказКлиента,
	|	Распоряж.ПредставлениеРаспоряжения КАК ПредставлениеРаспоряжения,
	|	Распоряж.ЦенаДоставки КАК Стоимость,
	|	Распоряж.Вес КАК Вес,
	|	Рейсы.Метка КАК Метка,
	|	Распоряж.СтоимостьЧека КАК СтоимостьЧека,
	|	Распоряж.СуммаШтрафа КАК СуммаШтрафа,
	|	Распоряж.СуммаПретензии КАК СуммаПретензии,
	|	Распоряж.ПунктДоговора КАК ПунктДоговора,
	|	Распоряж.СодержаниеПретензии КАК СодержаниеПретензии
	|ИЗ
	|	Рейсы КАК Рейсы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений._РейсыРаспоряжения КАК Распоряж
	|		ПО Рейсы.ЛогистическийЛист = Распоряж.Регистратор
	|			И Рейсы.ТранспортноеСредство = Распоряж.ТранспортноеСредство";

	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

#КонецОбласти

#КонецЕсли