
#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Партнер = Параметры.Партнер;
	Дата    = Параметры.Дата;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ОбработкаОкончанияПомещения = Новый ОписаниеОповещения("ОбработчикОкончанияПомещения", ЭтотОбъект);
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов();
	ПараметрыДиалога.Фильтр = "Excel файлы(*.xls;*.xlsx)|*.xls;*.xlsx";
	ПараметрыДиалога.Заголовок ="Выбирите файл Отчета";
	ПараметрыДиалога.МножественныйВыбор = Ложь;
	
	НачатьПомещениеФайлаНаСервер(ОбработкаОкончанияПомещения, , , , ПараметрыДиалога, УникальныйИдентификатор);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	ПеренестиТоварыВДокумент();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработчикОкончанияПомещения(ОписаниеПомещенногоФайла, ДополнительныеПараметры = Неопределено) Экспорт
	Если Не ОписаниеПомещенногоФайла = Неопределено Тогда
		ИмяФайла = ОписаниеПомещенногоФайла.СсылкаНаФайл.Имя;
		
		ПрочитатьИзВХНаСервере(ОписаниеПомещенногоФайла.Адрес);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПрочитатьИзВХНаСервере(АдресВХ)
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xlsx");
	
	ДанныеФайла = ПолучитьИзВременногоХранилища(АдресВХ);
	
	ДанныеФайла.Записать(ИмяВременногоФайла);
	
	СпособЧтения = СпособЧтенияЗначенийТабличногоДокумента.Текст;
	
	Попытка
		ТабДок.Прочитать(ИмяВременногоФайла, СпособЧтения);
	
	Исключение
		ТекстОшибки = НСтр("ru = 'Не удалось прочитать файл из временного хранилища по причине: %Причина%'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Причина%", ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;
	
	ИмяПартнера = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Партнер, "Наименование");
	
	Если СтрНайти(ИмяПартнера, "Валберис") > 0 Тогда
		ПрочитатьФайлВалберис();
		
	ИначеЕсли СтрНайти(ИмяПартнера, "Интернет Решения") > 0 Тогда
		ПрочитатьФайлОзон();
	КонецЕсли;
	
	УдалитьФайлы(ИмяВременногоФайла);
КонецПроцедуры

&НаСервере
Процедура ПрочитатьФайлВалберис()
	ЛистДТ = ТабДок.ПолучитьОбласть("Sheet1");
	
	Товары.Очистить();
	Табл = Товары.Выгрузить();
	
	Для НомерСтроки = 2 По ЛистДТ.ВысотаТаблицы Цикл
		Попытка
			ТипДокумента = ВРег(СокрЛП(ЛистДТ.Область(НомерСтроки, 11, НомерСтроки, 11).Текст));
			
			Если ТипДокумента = "ПРОДАЖА" Или ТипДокумента = "ВОЗВРАТ" Тогда
				Стр = Табл.Добавить();
				
				Стр.НомерСтроки  = Число(ЛистДТ.Область(НомерСтроки, 1, НомерСтроки, 1).Текст);
				Стр.Артикул      = ЛистДТ.Область(НомерСтроки, 6, НомерСтроки, 6).Текст;
				Стр.Наименование = ЛистДТ.Область(НомерСтроки, 7, НомерСтроки, 7).Текст;
				Стр.Цена         = Число(ЛистДТ.Область(НомерСтроки, 16, НомерСтроки, 16).Текст);
				Стр.Количество   = Число(ЛистДТ.Область(НомерСтроки, 14, НомерСтроки, 14).Текст);
				
				Если ТипДокумента = "ВОЗВРАТ" Тогда
					Стр.Количество = -Стр.Количество;
				КонецЕсли;
			КонецЕсли; 
		Исключение
			//@skip-check bsl-legacy-check-static-feature-access
			ОбщегоНазначения.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла;
	
	ЗагрузитьТовары(Табл);
КонецПроцедуры

&НаСервере
Процедура ПрочитатьФайлОзон()
	ЛистДТ = ТабДок.ПолучитьОбласть("Отчет_о_реализации");
	
	Товары.Очистить();
	Табл = Товары.Выгрузить();
	
	Для НомерСтроки = 16 По ЛистДТ.ВысотаТаблицы Цикл
		Попытка
			Номер = ЛистДТ.Область(НомерСтроки, 1, НомерСтроки, 1).Текст;
			Если ПустаяСтрока(Номер) Или Число(Номер) = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Наименование = ЛистДТ.Область(НомерСтроки, 2, НомерСтроки, 2).Текст;
			Артикул      = ЛистДТ.Область(НомерСтроки, 3, НомерСтроки, 3).Текст;
			Реализовано  = Число(ЛистДТ.Область(НомерСтроки, 6, НомерСтроки, 6).Текст);
			Выплаты      = Число(ЛистДТ.Область(НомерСтроки, 7, НомерСтроки, 7).Текст);
			Количество   = Число(ЛистДТ.Область(НомерСтроки, 9, НомерСтроки, 9).Текст);
			
			ВозвращеноТекст = ЛистДТ.Область(НомерСтроки, 18, НомерСтроки, 18).Текст;
			
			Если ПустаяСтрока(ВозвращеноТекст) Тогда
				Возвращено = 0;
			Иначе
				Возвращено = Число(ВозвращеноТекст);
			КонецЕсли;
			
			Цена = (Реализовано + Выплаты) / Количество;
			
			Стр = Табл.Добавить();
			
			Стр.НомерСтроки  = Число(Номер);
			Стр.Артикул      = Артикул;
			Стр.Наименование = Наименование;
			Стр.Количество   = Количество;
			Стр.Цена         = Цена;
			
			Если Возвращено > 0 Тогда
				Стр = Табл.Добавить();
				
				Стр.НомерСтроки  = Число(Номер);
				Стр.Артикул      = Артикул;
				Стр.Наименование = Наименование;
				Стр.Количество   = -Возвращено;
				Стр.Цена         = Цена;
			КонецЕсли;
		Исключение
			//@skip-check bsl-legacy-check-static-feature-access
			ОбщегоНазначения.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла;
	
	ЗагрузитьТовары(Табл);
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьТовары(Табл)
 	МПКТ = Справочники.Партнеры.НайтиПоКоду("01-01002228");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Табл", Табл);
	Запрос.УстановитьПараметр("МПКТ", МПКТ);
	Запрос.УстановитьПараметр("ВидЦены", AMS_ВызовСервера.ВидЦеныМаркетплейс());
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Табл.НомерСтроки КАК НомерСтроки,
	|	ВЫРАЗИТЬ(Табл.Артикул КАК СТРОКА(20)) КАК Артикул,
	|	ВЫРАЗИТЬ(Табл.Наименование КАК СТРОКА(300)) КАК Наименование,
	|	Табл.Количество КАК Количество,
	|	Табл.Цена КАК ЦенаПродажи
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	&Табл КАК Табл
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.НомерСтроки КАК НомерСтроки,
	|	вт.Артикул КАК Артикул,
	|	вт.Наименование КАК Наименование,
	|	Ном.Ссылка КАК Номенклатура,
	|	вт.Количество КАК Количество,
	|	вт.ЦенаПродажи КАК ЦенаПродажи
	|ПОМЕСТИТЬ тов
	|ИЗ
	|	вт КАК вт
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|		ПО вт.Артикул = Ном.Артикул
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Номенклатура.Артикул КАК Артикул,
	|	т.Номенклатура КАК Номенклатура,
	|	МИНИМУМ(т.Сумма / т.Количество) КАК Цена
	|ПОМЕСТИТЬ ЦенаМПКГ
	|ИЗ
	|	Документ.ПередачаТоваровХранителю КАК д
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю.Товары КАК т
	|		ПО д.Ссылка = т.Ссылка
	|ГДЕ
	|	д.Партнер = &МПКТ
	|
	|СГРУППИРОВАТЬ ПО
	|	т.Номенклатура,
	|	т.Номенклатура.Артикул
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	тов.Номенклатура КАК Номенклатура,
	|	Цен.ВидЦены КАК ВидЦены,
	|	Цен.Цена КАК Цена
	|ПОМЕСТИТЬ ЦенаМаркетПлейс
	|ИЗ
	|	тов КАК тов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Дата, ВидЦены = &ВидЦены) КАК Цен
	|		ПО тов.Номенклатура = Цен.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тов.НомерСтроки КАК НомерСтроки,
	|	тов.Артикул КАК Артикул,
	|	тов.Наименование КАК Наименование,
	|	тов.Номенклатура КАК Номенклатура,
	|	тов.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА ЦенаМПКГ.Цена ЕСТЬ NULL
	|			ТОГДА ЦенаМаркетПлейс.ВидЦены
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВидЦены,
	|	ЕСТЬNULL(ЦенаМПКГ.Цена, ЦенаМаркетПлейс.Цена) КАК Цена,
	|	тов.ЦенаПродажи КАК ЦенаПродажи
	|ИЗ
	|	тов КАК тов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЦенаМПКГ КАК ЦенаМПКГ
	|		ПО тов.Номенклатура = ЦенаМПКГ.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЦенаМаркетПлейс КАК ЦенаМаркетПлейс
	|		ПО тов.Номенклатура = ЦенаМаркетПлейс.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Товары.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиТоварыВДокумент()
	Отказ = Ложь;
	
	// Снятие модифицированности, т.к. перед закрытием признак проверяется.
	Модифицированность = Ложь;

	Данные = ПолучитьМассивСтрок(Отказ);
	
	Если Не Отказ Тогда
		Закрыть(Данные);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивСтрок(Отказ)
	Табл = РеквизитФормыВЗначение("Товары");
	
	МассивСтрок = Новый Массив;
	
	НомерСтроки = 0;
	Для Каждого Стр Из Табл Цикл
		НомерСтроки = НомерСтроки + 1;
		
		Если Стр.Количество = 0 Тогда
			ОбщегоНазначения.СообщитьПользователю("В строке № " + НомерСтроки + " не заполнено количество.",,,,Отказ);
		КонецЕсли;
		
		Если Стр.Цена = 0 Тогда
			ОбщегоНазначения.СообщитьПользователю("В строке № " + НомерСтроки + " не заполнена цена.",,,,Отказ);
		КонецЕсли;
		
		Если Стр.ЦенаПродажи = 0 Тогда
			ОбщегоНазначения.СообщитьПользователю("В строке № " + НомерСтроки + " не заполнена цена продажи.",,,,Отказ);
		КонецЕсли;
		
		МассивСтрок.Добавить(ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Стр));
	КонецЦикла;

	Возврат МассивСтрок;
КонецФункции


#КонецОбласти
