#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НастройкаФормы();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Не ТекущийОбъект.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз Тогда
		Если ПустаяСтрока(ТекущийОбъект.АдресДоставки) Тогда
			ОбщегоНазначения.СообщитьПользователю("Поле ""Адрес доставки"" не заполнено", , , , Отказ);
		КонецЕсли;

		Если ТекущийОбъект.ВремяДоставкиС = Дата(1, 1, 1) Тогда
			ОбщегоНазначения.СообщитьПользователю("Поле ""Время доставки С"" не заполнено", , , , Отказ);
		КонецЕсли;
	КонецЕсли;

	Если ТекущийОбъект.Реализации.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Нет документов реализации для объединения", , , , Отказ);
	ИначеЕсли ТекущийОбъект.Реализации.Количество() = 1 Тогда
		ОбщегоНазначения.СообщитьПользователю("Указан только один документ реализации", , , , Отказ);
	КонецЕсли;

	Если Не Отказ Тогда
		Реализации = ТекущийОбъект.Реализации;
		ТекущийОбъект.СуммаДокумента = Реализации.Итог("СуммаДокумента");
		ТекущийОбъект.AMS_Вес           = Реализации.Итог("Вес");
		ТекущийОбъект.AMS_Объем         = Реализации.Итог("Объем");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Запись_ОбъединеннаяЗагрузка", ПараметрыЗаписи, Объект.Ссылка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ОчиститьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ПартнерНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;

	Парам = Новый Структура;
	Парам.Вставить("Дата", Объект.Дата);
	Парам.Вставить("ОбъединеннаяЗагрузка", Объект.Ссылка);

	ОткрытьФорму("Документ.AMS_ОбъединеннаяЗагрузка.Форма.ФормаВыбораКлиента", Парам, , , , ,
		Новый ОписаниеОповещения("ОткрытьФормуВыбораКлиентаЗавершение", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРеализации

&НаКлиенте
Процедура РеализацииПослеУдаления(Элемент)
	ЗаполнитьПалетыРасчет();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Добавить(Команда)
	Парам = Новый Структура;
	Парам.Вставить("Дата", Объект.Дата);
	Парам.Вставить("Партнер", Объект.Партнер);
	Парам.Вставить("СпособДоставки", Объект.СпособДоставки);
	Парам.Вставить("ВремяДоставкиС", Объект.ВремяДоставкиС);
	Парам.Вставить("АдресДоставки", Объект.АдресДоставки);
	Парам.Вставить("МассивРеализаций", ПолучитьМассивРеализаций());

	ОткрытьФорму("Документ.AMS_ОбъединеннаяЗагрузка.Форма.ФормаВыбораРеализации", Парам, , , , ,
		Новый ОписаниеОповещения("ОткрытьФормуВыбораРеализацииЗавершение", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастройкаФормы()
	// Если документ включён в логистический лист, то его изменения запретить
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Распоряжение", Объект.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.AMS_ЛогистическийЛист.Распоряжения КАК т
	|ГДЕ
	|	т.Распоряжение = &Распоряжение";
	ЕстьТранспортДоставки = Не Запрос.Выполнить().Пустой();

	ТолькоПросмотр = ЕстьТранспортДоставки;

	Элементы.ГруппаКнопки.Видимость = Не ЕстьТранспортДоставки;
	
	// Расчет итогов
	Сумма        = 0;
	Палеты       = 0;
	ПалетыРасчет = 0;
	Вес          = 0;
	Объем        = 0;

	Табл = Объект.Реализации;
	Для Каждого Стр Из Табл Цикл
		Док = Стр.Реализация;

		ДанныеДок = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Док, "СуммаДокумента,AMS_КоличествоПалет,AMS_Вес,AMS_Объем");

		Сумма  = Сумма + ДанныеДок.СуммаДокумента;
		Палеты = Палеты + ДанныеДок.AMS_КоличествоПалет;
		Вес    = Вес + ДанныеДок.AMS_Вес;
		Объем  = Объем + ДанныеДок.AMS_Объем;

		Если ЗначениеЗаполнено(Док) Тогда
			Стр.ПалетыРасчет = AMS_Сервер.ПолучитьВесОбъемТоваров(мср.ПолучитьРеализацияТовары(Док)).КоличествоПалет;
		КонецЕсли;

		ПалетыРасчет = ПалетыРасчет + Стр.ПалетыРасчет;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОчиститьДокумент()
	Объект.Партнер          = ПредопределенноеЗначение("Справочник.Партнеры.ПустаяСсылка");
	Объект.СпособДоставки   = ПредопределенноеЗначение("Перечисление.СпособыДоставки.ПустаяСсылка");
	Объект.ЗонаДоставки     = Неопределено;
	Объект.АдресДоставки    = "";
	Объект.ВремяДоставкиС   = Дата(1, 1, 1);
	Объект.ВремяДоставкиПо  = Дата(1, 1, 1);
	Объект.АдресДоставки    = "";
	Объект.УсловияОтгрузки  = "";
	Объект.ОсобыеУсловияПеревозкиОписание = "";
	Объект.СуммаДокумента   = 0;
	Объект.AMS_КоличествоПалет = 0;
	Объект.AMS_Вес             = 0;
	Объект.AMS_Объем           = 0;

	Объект.Реализации.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораКлиентаЗавершение(ВыбранныйЭлемент, СписокПараметров) Экспорт
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Объект.Реализации.Очистить();

	ЗаполнитьЗначенияСвойств(Объект, ВыбранныйЭлемент);

	ЗаполнитьДокумент();

	Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокумент()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Запрос.УстановитьПараметр("Партнер", Объект.Партнер);
	Запрос.УстановитьПараметр("СпособДоставки", Объект.СпособДоставки);
	Запрос.УстановитьПараметр("СпособПередачиТоваров", Объект.СпособПередачиТоваров);
	Запрос.УстановитьПараметр("Обрешетка", Объект.Обрешетка);
	Запрос.УстановитьПараметр("ВремяДоставкиС", Объект.ВремяДоставкиС);
	Запрос.УстановитьПараметр("АдресДоставки", Объект.АдресДоставки);

	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	д.Ссылка КАК Реализация,
	|	д.AMS_КоличествоПалет КАК КоличествоПалет,
	|	д.AMS_Вес КАК Вес,
	|	д.AMS_Объем КАК Объем,
	|	д.СуммаДокумента КАК СуммаДокумента,
	|	д.ВремяДоставкиПо КАК ВремяДоставкиПо,
	|	д.AMS_УсловияОтгрузки КАК УсловияОтгрузки,
	|	д.ОсобыеУсловияПеревозкиОписание КАК ОсобыеУсловияПеревозкиОписание
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК д
	|ГДЕ
	|	д.Проведен
	|	И д.AMS_СтатусРеализации = ЗНАЧЕНИЕ(Перечисление.AMS_СтатусыРеализаций.КОтгрузке)
	|	И д.Партнер = &Партнер
	|	И д.СпособДоставки = &СпособДоставки
	|	И д.ВремяДоставкиС = &ВремяДоставкиС
	|	И д.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	|	И ВЫБОР
	|		КОГДА д.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу)
	|			ТОГДА д.АдресДоставкиПеревозчика = &АдресДоставки
	|		ИНАЧЕ д.АдресДоставки = &АдресДоставки
	|	КОНЕЦ
	|	И д.AMS_СпособПередачиТоваров = &СпособПередачиТоваров
	|	И д.AMS_Обрешетка = &Обрешетка
	|
	|УПОРЯДОЧИТЬ ПО
	|	д.Номер";

	Рез = Запрос.Выполнить();

	Если Рез.Пустой() Тогда
		Возврат;
	КонецЕсли;

	Выб = Рез.Выбрать();

	УсловияОтгрузки = "";
	ВремяДоставкиПо = '00010101000000';
	ОсобыеУсловияПеревозкиОписание = "";

	Реализации = Объект.Реализации;
	Реализации.Очистить();

	Пока Выб.Следующий() Цикл
		Стр = Реализации.Добавить();

		ЗаполнитьЗначенияСвойств(Стр, Выб);

		Если Не УсловияОтгрузки = Выб.УсловияОтгрузки Тогда
			УсловияОтгрузки = УсловияОтгрузки + Выб.УсловияОтгрузки + ", ";
		КонецЕсли;

		Если Не ОсобыеУсловияПеревозкиОписание = Выб.ОсобыеУсловияПеревозкиОписание Тогда
			ОсобыеУсловияПеревозкиОписание = ОсобыеУсловияПеревозкиОписание + Выб.ОсобыеУсловияПеревозкиОписание + ", ";
		КонецЕсли;

		Если ВремяДоставкиПо < Выб.ВремяДоставкиПо Тогда
			ВремяДоставкиПо = Выб.ВремяДоставкиПо;
		КонецЕсли;
	КонецЦикла;

	Объект.ВремяДоставкиПо = ВремяДоставкиПо;
	Объект.УсловияОтгрузки = Лев(УсловияОтгрузки, СтрДлина(УсловияОтгрузки) - 2);
	Объект.ОсобыеУсловияПеревозкиОписание = Лев(ОсобыеУсловияПеревозкиОписание, СтрДлина(ОсобыеУсловияПеревозкиОписание)
		- 2);

	ЗаполнитьПалетыРасчет();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораРеализацииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Табл = Объект.Реализации;

	Стр = Табл.Добавить();

	ЗаполнитьЗначенияСвойств(Стр, Результат);

	Если Объект.ВремяДоставкиПо < Результат.ВремяДоставкиПо Тогда
		Объект.ВремяДоставкиПо = Результат.ВремяДоставкиПо;
	КонецЕсли
	;

	Если Не Объект.Обрешетка = Результат.Обрешетка Тогда
		Объект.Обрешетка = Результат.Обрешетка;
	КонецЕсли
	;

	Если Не Объект.СпособПередачиТоваров = Результат.СпособПередачиТоваров Тогда
		Объект.Обрешетка = Результат.Обрешетка;
	КонецЕсли
	;

	Если Не Объект.УсловияОтгрузки = Результат.УсловияОтгрузки Тогда
		Объект.УсловияОтгрузки = ?(ПустаяСтрока(Объект.УсловияОтгрузки), Результат.УсловияОтгрузки,
			Объект.УсловияОтгрузки + ", " + Результат.УсловияОтгрузки);
	КонецЕсли;

	Если Не Объект.ОсобыеУсловияПеревозкиОписание = Результат.ОсобыеУсловияПеревозкиОписание Тогда
		Объект.ОсобыеУсловияПеревозкиОписание = ?(ПустаяСтрока(Объект.ОсобыеУсловияПеревозкиОписание),
			Результат.ОсобыеУсловияПеревозкиОписание, Объект.ОсобыеУсловияПеревозкиОписание + ", "
			+ Результат.ОсобыеУсловияПеревозкиОписание);
	КонецЕсли;

	Объект.СуммаДокумента = Табл.Итог("СуммаДокумента");
	Объект.AMS_КоличествоПалет = Табл.Итог("КоличествоПалет");
	Объект.AMS_Вес = Табл.Итог("Вес");
	Объект.AMS_Объем = Табл.Итог("Объем");

	Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивРеализаций()
	Возврат Объект.Реализации.Выгрузить().ВыгрузитьКолонку("Реализация");
КонецФункции

&НаСервере
Процедура ЗаполнитьПалетыРасчет()
	ПалетыРасчет    = 0;
	Табл = Объект.Реализации;
	Для Каждого Стр Из Табл Цикл
		Док = Стр.Реализация;
		Если ЗначениеЗаполнено(Док) Тогда
			Стр.ПалетыРасчет = AMS_Сервер.ПолучитьВесОбъемТоваров(мср.ПолучитьРеализацияТовары(Док)).КоличествоПалет;
			ПалетыРасчет = ПалетыРасчет + Стр.ПалетыРасчет;
		Иначе
			Стр.ПалетыРасчет = 0;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти