
 #Область ОбработчикиСобытийФормы
 
 &НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЭтоГрупповойШаблон(Объект.Шаблон) Тогда
		Элементы.СписокТерминалов.Видимость = Истина;
		Элементы.СписокТерминаловКоманднаяПанель.Видимость = Истина;
		Элементы.ТСД.Видимость = Ложь;
		
		Если ЗначениеЗаполнено(Объект.ТСД) Тогда
			Объект.ТСД = Неопределено;
		КонецЕсли;
	Иначе
		Элементы.СписокТерминалов.Видимость = Ложь;
		Элементы.СписокТерминаловКоманднаяПанель.Видимость = Ложь;
		Элементы.ТСД.Видимость = Истина;	
	КонецЕсли;	
	
КонецПроцедуры 

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// убрать записи с пустыми терминалами
	Проверять = Истина;
	Пока Проверять Цикл
		ПустыеТСД = Объект.СписокТерминалов.НайтиСтроки(Новый Структура("ТСД", ПредопределенноеЗначение("ПланОбмена.ДатаМобайл_СписокТСД.ПустаяСсылка")));
		Проверять = (Не ПустыеТСД.Количество() = 0);
		
		Для каждого стрТСД Из ПустыеТСД Цикл
			Объект.СписокТерминалов.Удалить(стрТСД);	
		КонецЦикла;
	КонецЦикла;
	
	Если УжеЕсть(Объект.Ссылка,Объект.ИсходныйДокумент) Тогда
		Если Не ПараметрыЗаписи.Свойство("ВопросЗадан") Тогда
			Отказ = Истина;
			Оповещение = Новый ОписаниеОповещения("ПоказатьВопросЗавершение", ЭтаФорма, ПараметрыЗаписи);
			ТекстВопроса = "Для документа " + Объект.ИсходныйДокумент + " уже создан документ ТСД. Продолжить?";
			ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Нет,, КодВозвратаДиалога.Нет);
		КонецЕсли;
	КонецЕсли;
	
	Если ПомеченНаУдаление(Объект.ИсходныйДокумент) Тогда
		Если Не ПараметрыЗаписи.Свойство("ВопросЗаданУдаление") Тогда
			Отказ = Истина;
			Оповещение = Новый ОписаниеОповещения("ПоказатьВопросУдалениеЗавершение", ЭтаФорма, ПараметрыЗаписи);
			ТекстВопроса = "Документ " + Объект.ИсходныйДокумент + " помечен на удаление. Продолжить?";
			ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Нет,, КодВозвратаДиалога.Нет);
		КонецЕсли;
	КонецЕсли;
	
	// Запрос в ЦРПТ приёмка
	Попытка
		ПроверкаКлючаИЗапросВСервис();	
	Исключение
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция УжеЕсть(лСсылка, лИсходныйДокумент)
	
	Если лИсходныйДокумент <> Неопределено Тогда
		Если Не лИсходныйДокумент.Пустая() Тогда
			Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
			|	ДатаМобайл_ДокументыТСД.Ссылка
			|ИЗ
			|	Справочник.ДатаМобайл_ДокументыТСД КАК ДатаМобайл_ДокументыТСД
			|ГДЕ
			|	ДатаМобайл_ДокументыТСД.ИсходныйДокумент = &ИсходныйДокумент
			|	И ДатаМобайл_ДокументыТСД.Ссылка <> &Ссылка");
			Запрос.УстановитьПараметр("Ссылка", лСсылка);
			Запрос.УстановитьПараметр("ИсходныйДокумент", лИсходныйДокумент);
			Рез = Запрос.Выполнить().Выбрать();
			Если Рез.Следующий() Тогда
				Возврат Истина;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПомеченНаУдаление(лИсходныйДокумент)
	
	Если лИсходныйДокумент <> Неопределено Тогда
		Если Не лИсходныйДокумент.Пустая() Тогда
			Если лИсходныйДокумент.ПометкаУдаления Тогда
				Возврат Истина;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьВопросЗавершение(Результат, ПараметрыЗаписи) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПараметрыЗаписи.Вставить("ВопросЗадан", Истина);
		
		Если Записать(ПараметрыЗаписи) Тогда
			Закрыть();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВопросУдалениеЗавершение(Результат, ПараметрыЗаписи) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПараметрыЗаписи.Вставить("ВопросЗаданУдаление", Истина);
		
		Если Записать(ПараметрыЗаписи) Тогда
			Закрыть();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаКлючаИЗапросВСервис()
	
	СсылкаНаДокВСервис 	= Объект.ИсходныйДокумент;
	Шаблон 				= Объект.Шаблон;
	ЭтоТабак 			= Ложь;
	
	Если СсылкаНаДокВСервис.Пустая() Или Не ПроверитьТребуетсяВыгрузкаМарок(Объект.ИсходныйДокумент, Объект.Шаблон) Или Не ТребуетсяЗапросВЦРПТ(Шаблон) Тогда
		Возврат;	
	КонецЕсли; 
	
	ВидМаркируемойПродукцииДокументаМассив 	= ДатаМобайл_Маркировка.ПолучитьВидПродукцииИСДокумента(СсылкаНаДокВСервис, Шаблон.ИмяТабличнойЧастиПодбор);
	ВидМаркируемойПродукцииДокумента 		= ВидМаркируемойПродукцииДокументаМассив[0];
	
	Если ВидМаркируемойПродукцииДокумента = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Организация = ПолучитьОрганизациюПоДокументу(СсылкаНаДокВСервис);
	
	Если ТребуетсяОбновлениеКлючаСессии(Организация, ЭтоТабак, ВидМаркируемойПродукцииДокумента) Тогда
		
		Модуль_ИнтерфейсАвторизацииИСМПКлиент = ДатаМобайл_ОбщийМодульКлиент.ОбщийМодуль("ИнтерфейсАвторизацииИСМПКлиент");
		Попытка
			Модуль_ИнтерфейсМОТПКлиентСервер = ?(ЭтоТабак, ДатаМобайл_ОбщийМодульКлиент.ОбщийМодуль("ИнтерфейсМОТПКлиентСервер"), ДатаМобайл_ОбщийМодульКлиент.ОбщийМодуль("ИнтерфейсИСМПКлиентСервер"));
		Исключение   
			Модуль_ИнтерфейсМОТПКлиентСервер = ?(ЭтоТабак, ДатаМобайл_ОбщийМодульКлиент.ОбщийМодуль("ОбщегоНазначенияИСМПКлиентСервер"), ДатаМобайл_ОбщийМодульКлиент.ОбщийМодуль("ОбщегоНазначенияИСМПКлиентСервер"));
		КонецПопытки;	
		Модуль_ОбщегоНазначенияИСМПКлиентСервер = ДатаМобайл_ОбщийМодульКлиент.ОбщийМодуль("ОбщегоНазначенияИСМПКлиентСервер");
		
		Попытка
			Модуль_ИнтерфейсАвторизацииИСМПКлиент.ЗапроситьКлючСессии(Модуль_ИнтерфейсМОТПКлиентСервер.ПараметрыЗапросаКлючаСессии(Организация));
		Исключение
			Модуль_ИнтерфейсАвторизацииИСМПКлиент.ЗапроситьКлючСессии(Модуль_ОбщегоНазначенияИСМПКлиентСервер.ПараметрыЗапросаКлючаСессии(Организация));
		КонецПопытки;
	
		ДатаМобайл_ОбщийМодульКлиент.СообщитьПользователю("Не получилось обновить ключ сессии. Проверьте настройки подключения к ИС.");
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОрганизациюПоДокументу(СсылкаНаДокВСервис)
	
	Организация = Неопределено;
	
	Попытка
		Организация = СсылкаНаДокВСервис.Организация;	
	Исключение
	КонецПопытки;
	
	Возврат Организация;
	
КонецФункции

&НаСервере
Функция ТребуетсяОбновлениеКлючаСессии(Организация, ЭтоТабак, ВидМаркируемойПродукцииДокумента)
	
	ТребуетсяОбновлениеКлючаСессии = Истина;
	
	Модуль_ИнтерфейсАвторизацииИСМПВызовСервера = ДатаМобайл_ОбщийМодуль.ОбщийМодуль("ИнтерфейсАвторизацииИСМПВызовСервера");
	
	Попытка
		Модуль_ИнтерфейсИСМПКлиентСервер = ДатаМобайл_ОбщийМодуль.ОбщийМодуль("ИнтерфейсИСМПКлиентСервер");
		Модуль_ИнтерфейсМОТПКлиентСервер = ДатаМобайл_ОбщийМодуль.ОбщийМодуль("ИнтерфейсМОТПКлиентСервер"); 
	Исключение   
		Модуль_ИнтерфейсИСМПКлиентСервер = ДатаМобайл_ОбщийМодуль.ОбщийМодуль("ОбщегоНазначенияИСМПКлиентСервер");
		Модуль_ИнтерфейсМОТПКлиентСервер = ДатаМобайл_ОбщийМодуль.ОбщийМодуль("ОбщегоНазначенияИСМПКлиентСервер");
	КонецПопытки;	
	
	Модуль_ОбщегоНазначенияИСМПКлиентСервер = ДатаМобайл_ОбщийМодуль.ОбщийМодуль("ОбщегоНазначенияИСМПКлиентСервер");
	
	Если Модуль_ИнтерфейсАвторизацииИСМПВызовСервера = Неопределено Тогда
		ДатаМобайл_ОбщийМодуль.СообщитьПользователю("Конфигурация 1С не поддерживает работу с Маркировкой");
		Возврат ТребуетсяОбновлениеКлючаСессии;
	КонецЕсли;
	
	//Табак
	Если ДатаМобайл_Маркировка.ЭтоТабакПоВидыПродукцииИС(ВидМаркируемойПродукцииДокумента) Тогда
		ЭтоТабак = Истина;
		Попытка
			ТребуетсяОбновлениеКлючаСессии = Модуль_ИнтерфейсАвторизацииИСМПВызовСервера.ТребуетсяОбновлениеКлючаСессии(
			Модуль_ИнтерфейсМОТПКлиентСервер.ПараметрыЗапросаКлючаСессии(Организация));
		Исключение
			ТребуетсяОбновлениеКлючаСессии = Модуль_ИнтерфейсАвторизацииИСМПВызовСервера.ТребуетсяОбновлениеКлючаСессии(
			Модуль_ОбщегоНазначенияИСМПКлиентСервер.ПараметрыЗапросаКлючаСессии(Организация));
		КонецПопытки;
	Иначе
		Попытка
			ТребуетсяОбновлениеКлючаСессии = Модуль_ИнтерфейсАвторизацииИСМПВызовСервера.ТребуетсяОбновлениеКлючаСессии(
			Модуль_ИнтерфейсИСМПКлиентСервер.ПараметрыЗапросаКлючаСессии(Организация));
		Исключение
			ТребуетсяОбновлениеКлючаСессии = Модуль_ИнтерфейсАвторизацииИСМПВызовСервера.ТребуетсяОбновлениеКлючаСессии(
			Модуль_ОбщегоНазначенияИСМПКлиентСервер.ПараметрыЗапросаКлючаСессии(Организация));
		КонецПопытки;
	КонецЕсли;
	
	Возврат ТребуетсяОбновлениеКлючаСессии;
	
КонецФункции

&НаСервере
Функция ТребуетсяЗапросВЦРПТ(Шаблон)
	
	Если Шаблон.МаркировкаЗапросВЦРПТ И Шаблон.ИспользоватьМаркировку Тогда
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПроверитьТребуетсяВыгрузкаМарок(ИсходныйДокумент, Шаблон)
	
	ВидДокумента = Шаблон.ВидДокумента;
	
	Если ВидДокумента = "ПриобретениеТоваровУслуг" 
		Или ВидДокумента = "ПриемкаТоваровИСМП" 
		Или ВидДокумента = "ЗаказНаЭмиссиюКодовМаркировкиСУЗ" Тогда
		
		Возврат Истина;
		
	ИначеЕсли ВидДокумента = "ВозвратТоваровОтКлиента"	Тогда
		
		МаркиУказаныПоставщиком = Ложь;
		
		Если ИсходныйДокумент.ШтрихкодыУпаковок.Количество() > 0 Тогда
			МаркиУказаныПоставщиком = Истина;
		КонецЕсли;
		
		Если МаркиУказаныПоставщиком Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;	
		
	ИначеЕсли ВидДокумента = "УведомлениеОПриемкеМДЛП" Тогда
		ПрямойАкцепт = Ложь;
		Попытка 
			Если ИсходныйДокумент.СхемаАкцептования = Перечисления.СхемыАкцептованияМДЛП.ПрямойПорядок Тогда
				ПрямойАкцепт = Истина;
			КонецЕсли;
		Исключение
		КонецПопытки;
		
		Если ПрямойАкцепт Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	ИначеЕсли ВидДокумента = "ПриходныйОрдерНаТовары" Тогда
		ВыгружатьМарки = Ложь;
		
		Попытка
			Если ИсходныйДокумент.ШтрихкодыУпаковок.Количество() > 0 Тогда
				ВыгружатьМарки = Истина;
			КонецЕсли;
		Исключение КонецПопытки;
		Возврат ВыгружатьМарки;	
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции // ()

&НаСервереБезКонтекста
Функция ЭтоГрупповойШаблон(лШаблон)
	Возврат лШаблон.ГрупповаяРабота;
КонецФункции

#КонецОбласти