#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Дата                 = Параметры.Дата;
	ОбъединеннаяЗагрузка = Параметры.ОбъединеннаяЗагрузка;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьСписокПартнеров();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПартнеры

&НаКлиенте
Процедура ПартнерыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ЗакрытьФорму(Партнеры[ВыбраннаяСтрока]);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	ЗакрытьФорму(Элементы.Партнеры.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСписокПартнеров()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Ссылка", ОбъединеннаяЗагрузка);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Реализация КАК Реализация
	|ПОМЕСТИТЬ выкл
	|ИЗ
	|	Документ.AMS_ОбъединеннаяЗагрузка.Реализации КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.AMS_ОбъединеннаяЗагрузка КАК д
	|		ПО т.Ссылка = д.Ссылка
	|ГДЕ
	|	НЕ д.ПометкаУдаления
	|	И д.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	|	И НЕ д.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	т.Ссылка КАК Ссылка,
	|	т.Дата КАК Дата,
	|	т.Номер КАК Номер,
	|	т.ЗонаДоставки КАК ЗонаДоставки,
	|	ВЫБОР
	|		КОГДА т.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу)
	|			ТОГДА т.АдресДоставкиПеревозчика
	|		ИНАЧЕ т.АдресДоставки
	|	КОНЕЦ КАК АдресДоставки,
	|	т.Партнер КАК Партнер,
	|	т.СпособДоставки КАК СпособДоставки,
	|	т.AMS_СпособПередачиТоваров КАК СпособПередачиТоваров,
	|	т.AMS_Обрешетка КАК Обрешетка,
	|	т.ВремяДоставкиС КАК ВремяДоставкиС,
	|	т.СуммаДокумента КАК СуммаДокумента,
	|	т.AMS_КоличествоПалет КАК AMS_КоличествоПалет,
	|	т.AMS_Вес КАК AMS_Вес,
	|	т.AMS_Объем КАК AMS_Объем
	|ПОМЕСТИТЬ док
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК т
	|ГДЕ
	|	т.Проведен
	|	И т.AMS_СтатусРеализации = ЗНАЧЕНИЕ(Перечисление.AMS_СтатусыРеализаций.КОтгрузке)
	|	И НЕ т.Ссылка В
	|		(ВЫБРАТЬ
	|			т.Реализация КАК Реализация
	|		ИЗ
	|			выкл КАК т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	док.Партнер КАК Партнер,
	|	док.СпособДоставки КАК СпособДоставки,
	|	док.СпособПередачиТоваров КАК СпособПередачиТоваров,
	|	док.ЗонаДоставки КАК ЗонаДоставки,
	|	док.Обрешетка КАК Обрешетка,
	|	док.АдресДоставки КАК АдресДоставки,
	|	док.ВремяДоставкиС КАК ВремяДоставкиС,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ док.Ссылка) КАК КоличествоДокументов
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	док КАК док
	|ГДЕ
	|	док.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	|СГРУППИРОВАТЬ ПО
	|	док.Партнер,
	|	док.СпособДоставки,
	|	док.ЗонаДоставки,
	|	док.АдресДоставки,
	|	док.ВремяДоставкиС,
	|	док.СпособПередачиТоваров,
	|	док.Обрешетка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	вт.Партнер КАК Партнер,
	|	вт.СпособДоставки КАК СпособДоставки,
	|	ВЫБОР
	|		КОГДА вт.СпособПередачиТоваров = 0
	|			ТОГДА ""Палетами""
	|		ИНАЧЕ ""Коробками""
	|	КОНЕЦ КАК СпособПередачиТоваров,
	|	вт.Обрешетка КАК Обрешетка,
	|	вт.ЗонаДоставки КАК ЗонаДоставки,
	|	вт.АдресДоставки КАК АдресДоставки,
	|	вт.ВремяДоставкиС КАК ВремяДоставкиС
	|ИЗ
	|	вт КАК вт
	|ГДЕ
	|	вт.КоличествоДокументов > 1";
	Рез = Запрос.Выполнить();
	Выб = Рез.Выбрать();

	НомерСтроки = 0;
	Пока Выб.Следующий() Цикл
		НомерСтроки = НомерСтроки + 1;
		Стр = Партнеры.Добавить();
		ЗаполнитьЗначенияСвойств(Стр, Выб);
		Стр.НомерСтроки = НомерСтроки;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(ВыбраннаяСтрока)
	Данные = Новый Структура;
	Данные.Вставить("Партнер", ВыбраннаяСтрока.Партнер);
	Данные.Вставить("СпособДоставки", ВыбраннаяСтрока.СпособДоставки);
	Данные.Вставить("СпособПередачиТоваров", ?(ВыбраннаяСтрока.СпособПередачиТоваров = "Палетами", 0, 1));
	Данные.Вставить("Обрешетка", ВыбраннаяСтрока.Обрешетка);
	Данные.Вставить("ЗонаДоставки", ВыбраннаяСтрока.ЗонаДоставки);
	Данные.Вставить("АдресДоставки", ВыбраннаяСтрока.АдресДоставки);
	Данные.Вставить("ВремяДоставкиС", ВыбраннаяСтрока.ВремяДоставкиС);

	Закрыть(Данные);
КонецПроцедуры

#КонецОбласти