#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользуетсяСервисСверкиРасчетов = Истина;
	ОтображатьСверку                 = Истина;
	
	АдресРезультатаСверки     = Параметры.АдресРезультатаСверки;
	АдресСтраницРазделов      = Параметры.СтраницыРаздела;
	ДанныеДляСверкиДеклараций = Параметры.ДанныеДляСверкиДеклараций;
	
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Результат сверки сервисом 1С:Сверка 2.0 (%1)'"), Параметры.ПредставлениеОтчета);
	
	СервисСверкиРасчетовСверкаДекларацийНДС.НастроитьОтображениеРазделов(ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#Область Раздел8

&НаСервере
Процедура ТекстРасхожденияРаздел8НажатиеНаСервере()
	СервисСверкиРасчетовСверкаДекларацийНДС.ОткрытьДокументыСРасхождениями(ЭтотОбъект,, "Раздел8");
КонецПроцедуры


&НаКлиенте
Процедура ТекстРасхожденияРаздел8Нажатие(Элемент)
	ТекстРасхожденияРаздел8НажатиеНаСервере();
КонецПроцедуры


&НаСервере
Процедура ТекстНеОтраженоРаздел8НажатиеНаСервере()
	СервисСверкиРасчетовСверкаДекларацийНДС.ОткрытьДокументыБезРасхождений(ЭтотОбъект, "ТаблицаНетУКонтрагентаРаздел8", ,"Раздел8");
КонецПроцедуры


&НаКлиенте
Процедура ТекстНеОтраженоРаздел8Нажатие(Элемент)
	ТекстНеОтраженоРаздел8НажатиеНаСервере();
КонецПроцедуры


&НаСервере
Процедура ТекстНеСверялисьРаздел8НажатиеНаСервере()
	СервисСверкиРасчетовСверкаДекларацийНДС.ОткрытьДокументыБезРасхождений(ЭтотОбъект, "ТаблицаНеСверилиРаздел8", ,"Раздел8");
КонецПроцедуры


&НаКлиенте
Процедура ТекстНеСверялисьРаздел8Нажатие(Элемент)
	ТекстНеСверялисьРаздел8НажатиеНаСервере();
КонецПроцедуры


&НаСервере
Процедура ТекстБезРасхожденийРаздел8НажатиеНаСервере()
	СервисСверкиРасчетовСверкаДекларацийНДС.ОткрытьДокументыБезРасхождений(ЭтотОбъект, "ТаблицаСверилиБезОшибокРаздел8", ,"Раздел8");
КонецПроцедуры


&НаКлиенте
Процедура ТекстБезРасхожденийРаздел8Нажатие(Элемент)
	ТекстБезРасхожденийРаздел8НажатиеНаСервере();
КонецПроцедуры
#КонецОбласти

#Область Раздел8Прил1

&НаСервере
Процедура ТекстРасхожденияРаздел8_Прил1НажатиеНаСервере()
	СервисСверкиРасчетовСверкаДекларацийНДС.ОткрытьДокументыСРасхождениями(ЭтотОбъект,, "Раздел8_Прил1");
КонецПроцедуры

&НаКлиенте
Процедура ТекстРасхожденияРаздел8_Прил1Нажатие(Элемент)
	ТекстРасхожденияРаздел8_Прил1НажатиеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТекстНеОтраженоРаздел8_Прил1НажатиеНаСервере()
	СервисСверкиРасчетовСверкаДекларацийНДС.ОткрытьДокументыБезРасхождений(ЭтотОбъект, "ТаблицаНетУКонтрагентаРаздел8_Прил1", ,"Раздел8_Прил1");
КонецПроцедуры

&НаКлиенте
Процедура ТекстНеОтраженоРаздел8_Прил1Нажатие(Элемент)
	ТекстНеОтраженоРаздел8_Прил1НажатиеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТекстНеСверялисьРаздел8_Прил1НажатиеНаСервере()
	СервисСверкиРасчетовСверкаДекларацийНДС.ОткрытьДокументыБезРасхождений(ЭтотОбъект, "ТаблицаНеСверилиРаздел8_Прил1", ,"Раздел8_Прил1");
КонецПроцедуры

&НаКлиенте
Процедура ТекстНеСверялисьРаздел8_Прил1Нажатие(Элемент)
	ТекстНеСверялисьРаздел8_Прил1НажатиеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТекстБезРасхожденийРаздел8_Прил1НажатиеНаСервере()
	СервисСверкиРасчетовСверкаДекларацийНДС.ОткрытьДокументыБезРасхождений(ЭтотОбъект, "ТаблицаСверилиБезОшибокРаздел8_Прил1", ,"Раздел8_Прил1");
КонецПроцедуры

&НаКлиенте
Процедура ТекстБезРасхожденийРаздел8_Прил1Нажатие(Элемент)
	ТекстБезРасхожденийРаздел8_Прил1НажатиеНаСервере();
КонецПроцедуры

#КонецОбласти

#Область Раздел9

&НаСервере
Процедура ТекстРасхожденияРаздел9НажатиеНаСервере()
	СервисСверкиРасчетовСверкаДекларацийНДС.ОткрытьДокументыСРасхождениями(ЭтотОбъект,, "Раздел9");
КонецПроцедуры

&НаКлиенте
Процедура ТекстРасхожденияРаздел9Нажатие(Элемент)
	ТекстРасхожденияРаздел9НажатиеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТекстНеОтраженоРаздел9НажатиеНаСервере()
	СервисСверкиРасчетовСверкаДекларацийНДС.ОткрытьДокументыБезРасхождений(ЭтотОбъект, "ТаблицаНетУКонтрагентаРаздел9", ,"Раздел9");
КонецПроцедуры

&НаКлиенте
Процедура ТекстНеОтраженоРаздел9Нажатие(Элемент)
	ТекстНеОтраженоРаздел9НажатиеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТекстНетВОрганизацииРаздел9НажатиеНаСервере()
	СервисСверкиРасчетовСверкаДекларацийНДС.ОткрытьДокументыБезРасхождений(ЭтотОбъект, "ТаблицаНетВОрганизацииРаздел9", ,"Раздел9");
КонецПроцедуры

&НаКлиенте
Процедура ТекстНетВОрганизацииРаздел9Нажатие(Элемент)
	ТекстНетВОрганизацииРаздел9НажатиеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТекстНеСверялисьРаздел9НажатиеНаСервере()
	СервисСверкиРасчетовСверкаДекларацийНДС.ОткрытьДокументыБезРасхождений(ЭтотОбъект, "ТаблицаНеСверилиРаздел9", ,"Раздел9");
КонецПроцедуры

&НаКлиенте
Процедура ТекстНеСверялисьРаздел9Нажатие(Элемент)
	ТекстНеСверялисьРаздел9НажатиеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТекстБезРасхожденийРаздел9НажатиеНаСервере()
	СервисСверкиРасчетовСверкаДекларацийНДС.ОткрытьДокументыБезРасхождений(ЭтотОбъект, "ТаблицаСверилиБезОшибокРаздел9", ,"Раздел9");
КонецПроцедуры

&НаКлиенте
Процедура ТекстБезРасхожденийРаздел9Нажатие(Элемент)
	ТекстБезРасхожденийРаздел9НажатиеНаСервере();
КонецПроцедуры

#КонецОбласти

#Область Раздел9Прил1

&НаСервере
Процедура ТекстРасхожденияРаздел9_Прил1НажатиеНаСервере()
	СервисСверкиРасчетовСверкаДекларацийНДС.ОткрытьДокументыСРасхождениями(ЭтотОбъект,, "Раздел9_Прил1");
КонецПроцедуры

&НаКлиенте
Процедура ТекстРасхожденияРаздел9_Прил1Нажатие(Элемент)
	ТекстРасхожденияРаздел9_Прил1НажатиеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТекстНеСверялисьРаздел9_Прил1НажатиеНаСервере()
	СервисСверкиРасчетовСверкаДекларацийНДС.ОткрытьДокументыБезРасхождений(ЭтотОбъект, "ТаблицаНеСверилиРаздел9_Прил1", ,"Раздел9_Прил1");
КонецПроцедуры

&НаКлиенте
Процедура ТекстНеСверялисьРаздел9_Прил1Нажатие(Элемент)
	ТекстНеСверялисьРаздел9_Прил1НажатиеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТекстНеОтраженоРаздел9_Прил1НажатиеНаСервере()
	СервисСверкиРасчетовСверкаДекларацийНДС.ОткрытьДокументыБезРасхождений(ЭтотОбъект, "ТаблицаНетУКонтрагентаРаздел9_Прил1", ,"Раздел9_Прил1");
КонецПроцедуры

&НаКлиенте
Процедура ТекстНеОтраженоРаздел9_Прил1Нажатие(Элемент)
	ТекстНеОтраженоРаздел9_Прил1НажатиеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТекстБезРасхожденийРаздел9_Прил1НажатиеНаСервере()
	СервисСверкиРасчетовСверкаДекларацийНДС.ОткрытьДокументыБезРасхождений(ЭтотОбъект, "ТаблицаСверилиБезОшибокРаздел9_Прил1", ,"Раздел9_Прил1");
КонецПроцедуры

&НаКлиенте
Процедура ТекстБезРасхожденийРаздел9_Прил1Нажатие(Элемент)
	ТекстБезРасхожденийРаздел9_Прил1НажатиеНаСервере();
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ИзменитьВидимостьСверки(Команда)
	
	СервисСверкиРасчетовСверкаДекларацийНДСКлиент.ИзменитьВидимостьСверки(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьПанельСверки(Команда)
	
	СервисСверкиРасчетовСверкаДекларацийНДСКлиент.ЗакрытьПанельСверки(ЭтотОбъект);

КонецПроцедуры

#КонецОбласти