#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
 	СтандартнаяОбработка = Ложь;
 	
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	
 	ПараметрыЗапроса = Новый Структура();
 	
	ЭлементыПараметрыДанных = НастройкиОтчета.ПараметрыДанных.Элементы;
    
    ПериодОтчета = ЭлементыПараметрыДанных.Найти("ПериодОтчета").Значение;
    Если ПериодОтчета = Неопределено Тогда
    	ВызватьИсключение НСтр("ru = 'Не задан период отчёта!'");
    Иначе
    	НачалоПериода = ПериодОтчета.ДатаНачала;
    	Если НачалоПериода = Дата(1,1,1) Тогда
    		ВызватьИсключение НСтр("ru = 'Не задано начало периода отчёта!'");
    	Иначе
			ПараметрыЗапроса.Вставить("НачалоПериода", НачалоПериода);
    	КонецЕсли;
    	
    	КонецПериода = ПериодОтчета.ДатаОкончания;
    	Если КонецПериода = Дата(1,1,1) Тогда
    		ВызватьИсключение НСтр("ru = 'Не задано окончание периода отчёта!'");
    	Иначе
			ПараметрыЗапроса.Вставить("КонецПериода", КонецПериода);
    	КонецЕсли;
    КонецЕсли;
 
    ЗначениеAX = ЭлементыПараметрыДанных.Найти("AX").Значение;
    Если ЗначениеAX = 0 Тогда
    	ВызватьИсключение НСтр("ru = 'Не задано значение ""AX""!'");
    Иначе
		ПараметрыЗапроса.Вставить("AX", ЗначениеAX);
    КонецЕсли;
	
    ЗначениеAY = ЭлементыПараметрыДанных.Найти("AY").Значение;
    Если ЗначениеAY = 0 Тогда
    	ВызватьИсключение НСтр("ru = 'Не задано значение ""AY, BX, CX""!'");
    Иначе
		ПараметрыЗапроса.Вставить("AY", ЗначениеAY);
    КонецЕсли;
	
    ЗначениеAZ = ЭлементыПараметрыДанных.Найти("AZ").Значение;
    Если ЗначениеAZ = 0 Тогда
    	ВызватьИсключение НСтр("ru = 'Не задано значение ""AZ, BY, BZ, CY""!'");
    Иначе
		ПараметрыЗапроса.Вставить("AZ", ЗначениеAZ);
    КонецЕсли;

    ЗначениеCZ = ЭлементыПараметрыДанных.Найти("CZ").Значение;
    Если ЗначениеCZ = 0 Тогда
    	ВызватьИсключение НСтр("ru = 'Не задано значение ""CZ""!'");
    Иначе
		ПараметрыЗапроса.Вставить("CZ", ЗначениеCZ);
    КонецЕсли;
	
	Товары = AMS_Сервер.ПолучитьДанныеДляРасчетаТоварныхЗапасов(ПараметрыЗапроса);
	
	ВнешниеНаборыДанных = Новый Структура("Товары", Товары);

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
КонецПроцедуры

#КонецОбласти

#КонецЕсли
