
#Область ОбработкаСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	// Элементы.Список - основной реквизит с динамическим списком
	Элементы.Список.РежимВыбора = Параметры.РежимВыбора;
	
	// Обход автоматического сохранения пользовательских настроек для разных режимов
	Если Параметры.РежимВыбора И Не ЗначениеЗаполнено(Параметры.КлючПользовательскихНастроек) Тогда
		
		Параметры.КлючПользовательскихНастроек = "РежимВыбора";
		Список.АвтоматическоеСохранениеПользовательскихНастроек = Ложь;
		
	КонецЕсли;
	
	Если ДатаМобайл_ОбщийМодуль.СтарыйРежимСовместимости() Тогда
		
		Список.ТекстЗапроса = ПланыОбмена.ДатаМобайл_СписокТСД.ТекстЗапросаСпискаСтарыйРежимСовместимости();
		Список.ОсновнаяТаблица = "ПланОбмена.ДатаМобайл_СписокТСД";
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)

	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если Не ТекущиеДанные = Неопределено Тогда
		Оповестить("ДатаМобайл_ВыборТСД", ТекущиеДанные.Код);	
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти
