
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Парам = Новый Структура;
	
	Парам.Вставить("Отбор"                          , Новый Структура("Документ",ПараметрКоманды));
	Парам.Вставить("КлючВарианта"                   , "ИсторияРеализации");
	Парам.Вставить("КлючНазначенияИспользования"    , "ИсторияРеализации");
	Парам.Вставить("СформироватьПриОткрытии"        , Истина);
	Парам.Вставить("ВидимостьКомандВариантовОтчетов", Ложь);
	
	ОткрытьФорму("Отчет.AMS_ИсторияРеализации.Форма", Парам, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры

#КонецОбласти