#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьУсловноеОформление();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Отчет_ДавальческоеПроизводство(Команда)
	ОткрытьФорму("Отчет.AMS_ДавальческоеПроизводство.Форма", , ЭтотОбъект, "ДавальческоеПроизводство"
		+ ОбщегоНазначенияКлиент.ДатаСеанса());
КонецПроцедуры

&НаКлиенте
Процедура Отчет_НоменклатураВПереработке(Команда)
	ОткрытьФорму("Отчет.AMS_НоменклатураВПереработке.Форма", , ЭтотОбъект, "ВПереработке"
		+ ОбщегоНазначенияКлиент.ДатаСеанса());
КонецПроцедуры

&НаКлиенте
Процедура Отчет_ПриобретениеПередачаПреформ(Команда)
	Отбор = Новый Структура("СкладКомпании", AMS_ВызовСервера.СкладКомпании());
	
	Парам = Новый Структура();
	Парам.Вставить("Отбор", Отбор);
	
	ОткрытьФорму("Отчет.AMS_ПередачаПреформ.Форма",
				Парам,
				ЭтотОбъект,
				"ПередачаПреформ" + ОбщегоНазначенияКлиент.ДатаСеанса());
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	УсловноеОформление.Элементы.Очистить();

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДокПриемаИзПереработки.Имя);

	ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;

	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДокПриемаИзПереработки.НомерВходящегоДокумента");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;

	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДокПриемаИзПереработки.ДатаВходящегоДокумента");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветВажного);

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДокПоступленияИзПереработки.Имя);

	ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;

	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДокПоступленияИзПереработки.НомерВходящегоДокумента");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;

	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДокПоступленияИзПереработки.ДатаВходящегоДокумента");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветВажного);
КонецПроцедуры

//&НаСервере
//Функция ПолучитьАдресПользовательскиеНастройки()
//	КомпоновщикНастроек = Отчеты._ПреформыПриход.Создать().КомпоновщикНастроек;
//	Настройки = КомпоновщикНастроек.Настройки;
//	ЭлементНастройки = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Преформы"));
//	ЭлементНастройки.Значение = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор("1924b28a-4822-11dd-a518-000423b8c4ce"));
//	ЭлементНастройки.Использование = Истина;
//	
//	Если ЗначениеЗаполнено(ЭлементНастройки.ИдентификаторПользовательскойНастройки) Тогда
//		ПользовательскийПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ЭлементНастройки.ИдентификаторПользовательскойНастройки);
//		Если ТипЗнч(ПользовательскийПараметр) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда 
//			ПользовательскийПараметр.Значение = ЭлементНастройки.Значение; 
//		КонецЕсли; 
//	КонецЕсли;
//	
//	Возврат ПоместитьВоВременноеХранилище(КомпоновщикНастроек.ПользовательскиеНастройки,Новый УникальныйИдентификатор());
//КонецФункции

#КонецОбласти