&НаКлиенте
Перем ВключенаГрупповаяРабота;

&НаСервереБезКонтекста
Функция ПолучитьПустыеСсылки(лШаблон)
	Ответ=Новый Структура("Старый,Новый,Создавать");
	Ответ.Старый=Документы[лШаблон.ВидДокумента].Пустаяссылка();
	Ответ.Новый=Ответ.Старый;
	Если СокрЛП(лШаблон.ВидДокументаНового)<>"" тогда
		Ответ.Новый=Документы[лШаблон.ВидДокументаНового].Пустаяссылка();
		Ответ.Создавать=Истина;
	Иначе	
		Ответ.Создавать=Ложь;
	КонецЕсли;	
	Возврат Ответ;
КонецФункции	

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	
	Элементы.ИсходныйДокумент.ТолькоПросмотр=Объект.Шаблон.Пустая(); 
	ВключенаГрупповаяРабота = РеквизитГрупповаяРабота(Объект.Шаблон);
	ИзменитьВидимостьВкладокПодборРазмещение();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.ИсходныйДокумент=Неопределено тогда
		Если Не Объект.Шаблон.Пустая() тогда
			Объект.ИсходныйДокумент=Документы[Объект.Шаблон.ВидДокумента].Пустаяссылка();
		КонецЕсли;	
	КонецЕсли;	
	Если СокрЛП(Объект.Шаблон.ВидДокументаНового)="" тогда//старая схема
		Элементы.НовыйДокумент.ТолькоПросмотр=Истина;
	Иначе	
		Элементы.НовыйДокумент.ТолькоПросмотр=Ложь;
		Если Объект.НовыйДокумент=Неопределено тогда
			Если Не Объект.Шаблон.Пустая() тогда
				Объект.НовыйДокумент=Документы[Объект.Шаблон.ВидДокументаНового].Пустаяссылка();
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;
	
	ОграничениеТипаРеквизита();
КонецПроцедуры

&НаКлиенте
Процедура ШаблонПриИзменении(Элемент) 
	
	Если Не Объект.Шаблон.Пустая() тогда
		ПустыеСсылки=ПолучитьПустыеСсылки(Объект.Шаблон);
		Если ТипЗнч(Объект.ИсходныйДокумент)<>ТипЗнч(ПустыеСсылки.Старый) тогда
			Объект.ИсходныйДокумент=ПустыеСсылки.Старый;
			Элементы.ИсходныйДокумент.ВыбиратьТип=Ложь;
		КонецЕсли;	
		Если ТипЗнч(Объект.НовыйДокумент)<>ТипЗнч(ПустыеСсылки.Новый) тогда
			Объект.НовыйДокумент=ПустыеСсылки.Новый;
			Элементы.НовыйДокумент.ВыбиратьТип=Ложь;
		КонецЕсли;	
		Элементы.НовыйДокумент.ТолькоПросмотр=Не ПустыеСсылки.Создавать;
	Иначе	
		Объект.ИсходныйДокумент=Неопределено;
		Объект.НовыйДокумент=Неопределено;
		Элементы.ИсходныйДокумент.ВыбиратьТип=Истина;
		Элементы.НовыйДокумент.ВыбиратьТип=Истина;
		Элементы.НовыйДокумент.ТолькоПросмотр=Ложь;
	КонецЕсли;	
	Элементы.ИсходныйДокумент.ТолькоПросмотр=Объект.Шаблон.Пустая(); 
	
	ВключенаГрупповаяРабота = РеквизитГрупповаяРабота(Объект.Шаблон);
	ИзменитьВидимостьВкладокПодборРазмещение();
	ОграничениеТипаРеквизита();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция УжеЕсть(лСсылка,лИсходныйДокумент)
	Если лИсходныйДокумент<>Неопределено тогда
		Если не лИсходныйДокумент.Пустая() тогда
			Запрос=Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
			|	ДатаМобайл_ДокументыТСД.Ссылка
			|ИЗ
			|	Справочник.ДатаМобайл_ДокументыТСД_ЕГАИС КАК ДатаМобайл_ДокументыТСД
			|ГДЕ
			|	ДатаМобайл_ДокументыТСД.ИсходныйДокумент = &ИсходныйДокумент
			|	И ДатаМобайл_ДокументыТСД.Ссылка <> &Ссылка");
			Запрос.УстановитьПараметр("Ссылка",лСсылка);
			Запрос.УстановитьПараметр("ИсходныйДокумент",лИсходныйДокумент);
			Рез=Запрос.Выполнить().Выбрать();
			Если Рез.Следующий() тогда
				Возврат Истина;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
	Возврат Ложь;
КонецФункции

&НаКлиенте  
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если УжеЕсть(Объект.Ссылка,Объект.ИсходныйДокумент) тогда
		Если Не ПараметрыЗаписи.Свойство("ВопросЗадан") Тогда
			Отказ = Истина;
			Оповещение = Новый ОписаниеОповещения("ПоказатьВопросЗавершение", ЭтаФорма, ПараметрыЗаписи);
			ТекстВопроса = "Для документа "+Объект.ИсходныйДокумент+" уже создан документ ТСД. Продолжить?";
			ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Нет,, КодВозвратаДиалога.Нет);
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВопросЗавершение(Результат, ПараметрыЗаписи) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПараметрыЗаписи.Вставить("ВопросЗадан", Истина);
		
		Если Записать(ПараметрыЗаписи) Тогда
			Закрыть();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#Область ВкладкиПодборРазмещениеГрупповаяРабота

//механизм переключения видимости вкладок.
&НаСервереБезКонтекста
Функция РеквизитГрупповаяРабота(Шаблон)
	
	Возврат Шаблон.ГрупповаяРабота;
	
КонецФункции

&НаКлиенте
Процедура ИзменитьВидимостьВкладокПодборРазмещение()   
	
	Если ЗначениеЗаполнено(Объект.ДатаЗавершения) Тогда
		ВключенаГрупповаяРабота = Ложь;
	КонецЕсли;	
	
	//Элементы.ГрПодбор.Видимость = НЕ ВключенаГрупповаяРабота;
	Элементы.ГрПодборГрупповаяРабота.Видимость = ВключенаГрупповаяРабота; 
	
	УстановитьОтборыСписковСтрокГрупповойРаботы(ВключенаГрупповаяРабота);	              	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборыСписковСтрокГрупповойРаботы(ВключенаГрупповаяРабота)
	
	Если ВключенаГрупповаяРабота Тогда
		СписокСтрокПодбораГрупповаяРабота.Параметры.УстановитьЗначениеПараметра("ДокументТСД", Объект.Ссылка);
	Иначе
		СписокСтрокПодбораГрупповаяРабота.Параметры.УстановитьЗначениеПараметра("ДокументТСД", Справочники.ДатаМобайл_ДокументыТСД.ПустаяСсылка());
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ОграничениеТипаРеквизита()
	
	ВидДокумента = Объект.Шаблон.ВидДокумента;
	ВидДокументаНового = Объект.Шаблон.ВидДокументаНового;
	
	Если ЗначениеЗаполнено(ВидДокумента) Тогда
		Массив = Новый Массив(); 
		Массив.Добавить(Тип("ДокументСсылка." + ВидДокумента)); 
		НашеОписание = Новый ОписаниеТипов(Массив);
		
		Элементы.ИсходныйДокумент.ОграничениеТипа = НашеОписание;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВидДокументаНового) Тогда
		Массив = Новый Массив(); 
		Массив.Добавить(Тип("ДокументСсылка." + ВидДокументаНового)); 
		НашеОписание = Новый ОписаниеТипов(Массив);
		
		Элементы.НовыйДокумент.ОграничениеТипа = НашеОписание;
	КонецЕсли;

КонецПроцедуры