#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;

	УстановитьУсловноеОформление();

	ЗаполнитьТаблицуПодбора(Параметры.Продукция, Параметры.Товары, Параметры.Дата, Параметры.Склад);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	Если Модифицированность Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект), НСтр(
			"ru = 'Данные были изменены. Перенести изменения в документ?'"), РежимДиалогаВопрос.ДаНет);

	Иначе
		ПеренестиТоварыВДокумент();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренестиВДокументВыполнить()
	ПеренестиТоварыВДокумент();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	УсловноеОформление.Элементы.Очистить();

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыКоличество.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Товары.ОстатокНаСкладе");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветФонаКнопки);
	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность", ЦветаСтиля.ЦветФонаКнопки);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуПодбора(Продукция, Расход, Дата, Склад)
	УстановитьПривилегированныйРежим(Истина);

	Табл = Новый ТаблицаЗначений;
	Табл.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Табл.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));

	Для Каждого Стр Из Товары Цикл
		НовСтр = Расход.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Стр);
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Продукция", Продукция);
	Запрос.УстановитьПараметр("Расход", Табл);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Склад", Склад);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК д
	|		ПО т.Ссылка = д.Ссылка
	|ГДЕ
	|	д.Владелец = &Продукция
	|	И НЕ д.ПометкаУдаления
	|	И д.Основной
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тов.Номенклатура КАК Номенклатура,
	|	тов.Количество КАК Количество
	|ПОМЕСТИТЬ Расход
	|ИЗ
	|	&Расход КАК тов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(НаСкладе.ВНаличииОстаток, 0) КАК ОстатокНаСкладе,
	|	ЕСТЬNULL(Расход.Количество, 0) КАК Количество
	|ИЗ
	|	Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(&Дата, Склад = &Склад) КАК НаСкладе
	|		ПО Товары.Номенклатура = НаСкладе.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Расход КАК Расход
	|		ПО Товары.Номенклатура = Расход.Номенклатура";

	Товары.Загрузить(Запрос.Выполнить().Выгрузить());

	Элементы.ТоварыОстатокНаСкладе.Заголовок = "Остаток на " + Дата;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Модифицированность = Ложь;
		ПеренестиТоварыВДокумент();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиТоварыВДокумент()
	// Снятие модифицированности, т.к. перед закрытием признак проверяется.
	Модифицированность = Ложь;

	Отказ = Ложь;

	Данные = ПолучитьДанныеПодбора(Отказ);

	Если Не Отказ Тогда
		Закрыть(Данные);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеПодбора(Отказ)
	МассивСтрок = Новый Массив;

	Для Каждого Стр Из Товары Цикл
		Если Стр.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;

		Если Стр.Количество > Стр.ОстатокНаСкладе Тогда
			ОбщегоНазначения.СообщитьПользователю("Передать номенклатуру """ + Стр.Номенклатура
				+ """ нельзя больше, чем имеется на складе.", , , , Отказ);
		КонецЕсли;

		Стр = Новый Структура("Номенклатура,КоличествоУпаковок,Количество", Стр.Номенклатура, Стр.Количество,
			Стр.Количество);
		МассивСтрок.Добавить(Стр);
	КонецЦикла;

	Возврат МассивСтрок;
КонецФункции

#КонецОбласти