
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Автор) Тогда 
		Объект.Автор = Пользователи.ТекущийПользователь();
	КонецЕсли;

	Если Объект.Год = 0 Тогда 
		Объект.Год = 2025;
	КонецЕсли;

	НастройкаФормы();
КонецПроцедуры

&НаСервере
Процедура НастройкаФормы()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НЕДЕЛЯ(т.ДатаГрафика) КАК НомерНедели,
		|	СТРОКА(ДЕНЬ(НАЧАЛОПЕРИОДА(т.ДатаГрафика, НЕДЕЛЯ))) + ""."" + СТРОКА(МЕСЯЦ(НАЧАЛОПЕРИОДА(т.ДатаГрафика, НЕДЕЛЯ))) + ""-"" + СТРОКА(ДЕНЬ(НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(т.ДатаГрафика, НЕДЕЛЯ), ДЕНЬ))) + ""."" + СТРОКА(МЕСЯЦ(НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(т.ДатаГрафика, НЕДЕЛЯ), ДЕНЬ))) КАК ИмяНедели
		|ИЗ
		|	РегистрСведений.КалендарныеГрафики КАК т
		|ГДЕ
		|	т.Календарь = &Календарь
		|	И т.Год = &Год";
	
	Запрос.УстановитьПараметр("Год", Объект.Год);
	Запрос.УстановитьПараметр("Календарь", Справочники.Календари.НайтиПоНаименованию("Календарь без выходных"));
	
	Рез = Запрос.Выполнить();
	Выб = Рез.Выбрать();
	
	НомВыб = 0;
	Пока Выб.Следующий() Цикл
		НомВыб = НомВыб + 1;
		Элементы["ТоварыКоличество" + НомВыб].Заголовок = "       " + Строка(Выб.НомерНедели) + "    " + Символы.ПС + Выб.ИмяНедели;
		Элементы["ТоварыКоличество" + НомВыб].Ширина = 4;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ГодПриИзменении(Элемент)
	НастройкаФормы();
КонецПроцедуры

