
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда 
		Возврат;
	КонецЕсли;
	
	АдресДанных = Неопределено;
	Если Параметры.Свойство("АдресДанных",АдресДанных) Тогда
		Данные  = ПолучитьИзВременногоХранилища(АдресДанных);
		Партнер = Данные.Партнер;
		Ссылка  = Данные.Ссылка;
	КонецЕсли;
	
	ПоказатьДокументы();
	
	ЗаполнитьТаблицуТовары(Данные);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПоказатьПодбор();
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Оповестить("Запись_РеализацияТоваровУслуг");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРеализации

&НаКлиенте
Процедура РеализацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПоказатьЗначение(,Элемент.ТекущиеДанные.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура РеализацииФлагПриИзменении(Элемент)
	Модифицированность = Истина;
	
	Стр = ТекущийЭлемент.ТекущиеДанные;
	
	ПоказатьДанныеВыбора(Стр.Ссылка,Стр.Флаг);	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	ПеренестиТоварыВДокумент();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПоказатьДокументы()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекДата",КонецДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("Партнер",Партнер);
	Запрос.УстановитьПараметр("Ссылка" ,Ссылка);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛОЖЬ КАК Флаг,
	|	т.Дата,
	|	т.Номер,
	|	т.AMS_СтатусРеализации КАК Статус,
	|	т.СуммаДокумента КАК Сумма,
	|	т.Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК т
	|ГДЕ
	|	т.Дата > ДОБАВИТЬКДАТЕ(&ТекДата, КВАРТАЛ, -1)
	|	И НЕ т.ПометкаУдаления
	|	И т.СуммаДокумента <> 0
	|	И т.Партнер = &Партнер
	|	И НЕ т.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	т.МоментВремени";

	Реализации.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуТовары(Данные)
    УстановитьПривилегированныйРежим(Истина);

    СтрПартнер = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Партнер,"Родитель,_АртикулКлиента,_АртикулКлиентаПлюс");
    
    СтрСоглашение = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Данные.Соглашение,"ВидЦен,СрокПоставки");    
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Товары", Данные.Товары);
	Запрос.УстановитьПараметр("Дата", Данные.ДатаДокумента);
	Запрос.УстановитьПараметр("Соглашение", Данные.Соглашение);
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Запрос.УстановитьПараметр("Родитель", ?(ЗначениеЗаполнено(СтрПартнер.Родитель),СтрПартнер.Родитель,Партнер));
	Запрос.УстановитьПараметр("ВидЦены", СтрСоглашение.ВидЦен);
	Запрос.УстановитьПараметр("Склад", Данные.Склад);
	Запрос.УстановитьПараметр("СегментыПродукцияКомпании", AMS_ВызовСервера.СегментыНоменклатурыПродукцияКомпании());
	Запрос.УстановитьПараметр("СрокПоставки", СтрСоглашение.СрокПоставки);
	Запрос.УстановитьПараметр("СортПоЗаказу", (СтрПартнер._АртикулКлиента ИЛИ СтрПартнер._АртикулКлиентаПлюс));
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	т.Номенклатура,
	|	т.Упаковка,
	|	т.Количество,
	|	т.ВидЦены,
	|	т.Сумма
	|ПОМЕСТИТЬ т
	|ИЗ
	|	&Товары КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Номенклатура,
	|	МАКСИМУМ(т.Упаковка) КАК Упаковка,
	|	СУММА(т.Количество) КАК Количество,
	|	СУММА(т.Сумма) КАК Сумма,
	|	МАКСИМУМ(т.ВидЦены) КАК ВидЦены
	|ПОМЕСТИТЬ то
	|ИЗ
	|	т КАК т
	|
	|СГРУППИРОВАТЬ ПО
	|	т.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	то.Номенклатура КАК Номенклатура,
	|	то.Упаковка,
	|	то.Количество,
	|	то.Сумма / ВЫБОР
	|		КОГДА то.Количество = 0
	|			ТОГДА 1
	|		ИНАЧЕ то.Количество
	|	КОНЕЦ КАК Цена,
	|	то.Сумма,
	|	то.ВидЦены,
	|	ВЫБОР
	|		КОГДА то.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА 1
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Упак.Числитель = 0
	|					ТОГДА 1
	|				ИНАЧЕ Упак.Числитель / ВЫБОР
	|						КОГДА Упак.Знаменатель = 0
	|							ТОГДА 1
	|						ИНАЧЕ Упак.Знаменатель
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК Кфц
	|ПОМЕСТИТЬ тов
	|ИЗ
	|	то КАК то
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК Упак
	|		ПО то.Упаковка = Упак.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Номенклатура,
	|	т.ПорядковыйНомер КАК Наименование
	|ПОМЕСТИТЬ сорт
	|ИЗ
	|	РегистрСведений._НоменклатураКлиентов КАК т
	|ГДЕ
	|	т.Партнер = &Родитель
	|	И &СортПоЗаказу
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НомСег.Номенклатура
	|ПОМЕСТИТЬ н
	|ИЗ
	|	РегистрСведений.НоменклатураСегмента КАК НомСег
	|ГДЕ
	|	НомСег.Сегмент = &СегментыПродукцияКомпании
	|	И НомСег.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	тов.Номенклатура
	|ИЗ
	|	тов КАК тов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	н.Номенклатура
	|ПОМЕСТИТЬ но
	|ИЗ
	|	н КАК н
	|
	|СГРУППИРОВАТЬ ПО
	|	н.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	т.Номенклатура
	|ПОМЕСТИТЬ кл
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК д
	|		ПО т.Ссылка = д.Ссылка
	|ГДЕ
	|	д.Партнер = &Партнер
	|	И д.Дата > ДОБАВИТЬКДАТЕ(&Дата, ГОД, -1)
	|	И НЕ &СортПоЗаказу
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	сорт.Номенклатура
	|ИЗ
	|	сорт КАК сорт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	но.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА &СортПоЗаказу
	|			ТОГДА ВЫБОР
	|					КОГДА сорт.Наименование ЕСТЬ NULL
	|						ТОГДА СпрНом.Наименование
	|					ИНАЧЕ сорт.Наименование
	|				КОНЕЦ
	|		ИНАЧЕ СпрНом.Наименование
	|	КОНЕЦ КАК Сортировка,
	|	СпрНом._Упаковка КАК Упаковка,
	|	СпрНом.КоэффициентЕдиницыДляОтчетов КАК Кфц,
	|	СпрНом.ЦеноваяГруппа,
	|	ВЫБОР
	|		КОГДА кл.Номенклатура ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ТоварКлиента
	|ПОМЕСТИТЬ ном
	|ИЗ
	|	но КАК но
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНом
	|		ПО но.Номенклатура = СпрНом.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ кл КАК кл
	|		ПО но.Номенклатура = кл.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ сорт КАК сорт
	|		ПО но.Номенклатура = сорт.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ном.Номенклатура,
	|	СогТов.ВидЦены,
	|	ВЫБОР
	|		КОГДА СогТов.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА СогТов.Цена * ном.Кфц
	|		ИНАЧЕ СогТов.Цена / СогТов.Упаковка.Числитель * ном.Кфц
	|	КОНЕЦ КАК Цена,
	|	СогТов.СрокПоставки
	|ПОМЕСТИТЬ ЦенДоп
	|ИЗ
	|	ном КАК ном
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами.Товары КАК СогТов
	|		ПО ном.Номенклатура = СогТов.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК Упак
	|		ПО (СогТов.Упаковка = Упак.Ссылка)
	|ГДЕ
	|	СогТов.Ссылка = &Соглашение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ном.Номенклатура,
	|	СогЦенГр.ВидЦен КАК ВидЦены,
	|	СогЦенГр.СрокПоставки
	|ПОМЕСТИТЬ ЦенГр
	|ИЗ
	|	ном КАК ном
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами.ЦеновыеГруппы КАК СогЦенГр
	|		ПО ном.ЦеноваяГруппа = СогЦенГр.ЦеноваяГруппа
	|ГДЕ
	|	СогЦенГр.Ссылка = &Соглашение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ном.Номенклатура,
	|	ВЫБОР
	|		КОГДА ЦенДоп.ВидЦены ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ЦенГр.ВидЦены ЕСТЬ NULL
	|						ТОГДА &ВидЦены
	|					ИНАЧЕ ЦенГр.ВидЦены
	|				КОНЕЦ
	|		ИНАЧЕ ЦенДоп.ВидЦены
	|	КОНЕЦ КАК ВидЦены,
	|	ВЫБОР
	|		КОГДА ЦенДоп.СрокПоставки ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ЦенГр.СрокПоставки ЕСТЬ NULL
	|						ТОГДА &СрокПоставки
	|					ИНАЧЕ ЦенГр.СрокПоставки
	|				КОНЕЦ
	|		ИНАЧЕ ЦенДоп.СрокПоставки
	|	КОНЕЦ КАК СрокПоставки,
	|	ЦенДоп.Цена,
	|	ном.Кфц
	|ПОМЕСТИТЬ Цен
	|ИЗ
	|	ном КАК ном
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЦенДоп КАК ЦенДоп
	|		ПО ном.Номенклатура = ЦенДоп.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЦенГр КАК ЦенГр
	|		ПО ном.Номенклатура = ЦенГр.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Цен.Номенклатура КАК Номенклатура,
	|	Цен.ВидЦены,
	|	ВЫБОР
	|		КОГДА Цен.ВидЦены = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|			ТОГДА Цен.Цена
	|		ИНАЧЕ ВЫБОР
	|				КОГДА СрезПоследних.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|					ТОГДА СрезПоследних.Цена * Цен.Кфц
	|				ИНАЧЕ СрезПоследних.Цена / СрезПоследних.Упаковка.Числитель * Цен.Кфц
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена,
	|	Цен.СрокПоставки
	|ПОМЕСТИТЬ цены
	|ИЗ
	|	Цен КАК Цен
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Дата, ) КАК СрезПоследних
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК Упак
	|			ПО СрезПоследних.Упаковка = Упак.Ссылка
	|		ПО Цен.Номенклатура = СрезПоследних.Номенклатура
	|			И Цен.ВидЦены = СрезПоследних.ВидЦены
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ном.Номенклатура,
	|	ном.Упаковка КАК Упаковка,
	|	ВЫБОР
	|		КОГДА тов.Количество ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ тов.Количество / тов.Кфц
	|	КОНЕЦ КАК КоличествоУпаковок,
	|	ВЫБОР
	|		КОГДА тов.ВидЦены ЕСТЬ NULL
	|			ТОГДА цены.ВидЦены
	|		ИНАЧЕ тов.ВидЦены
	|	КОНЕЦ КАК ВидЦены,
	|	цены.Цена КАК Цена,
	|	ВЫБОР
	|		КОГДА тов.Сумма ЕСТЬ NULL
	|			ТОГДА цены.Цена * тов.Количество / тов.Кфц
	|		ИНАЧЕ тов.Сумма
	|	КОНЕЦ КАК Сумма,
	|	цены.СрокПоставки,
	|	&Склад,
	|	ном.ТоварКлиента,
	|	ном.Сортировка КАК Сортировка
	|ИЗ
	|	ном КАК ном
	|		ЛЕВОЕ СОЕДИНЕНИЕ тов КАК тов
	|		ПО ном.Номенклатура = тов.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ цены КАК цены
	|		ПО ном.Номенклатура = цены.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сортировка";

	Табл = Запрос.Выполнить().Выгрузить();
		
	Для каждого Стр Из Табл Цикл
		Сортировка = Стр.Сортировка; 
		Если ТипЗнч(Сортировка) = Тип("Число") Тогда 
			Сортировка = Строка(Сортировка);	
			
			Если СтрДлина(Сортировка) = 1 Тогда 
			    Стр.Сортировка = "0" + Сортировка;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Товары.Загрузить(Табл);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПодбор()
	Подбор.Очистить();
	Для каждого Стр Из Товары Цикл
		Если Стр.КоличествоУпаковок > 0 Тогда 
			СтрПодбор = Подбор.Добавить();
			ЗаполнитьЗначенияСвойств(СтрПодбор,Стр);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиТоварыВДокумент()
	Модифицированность = Ложь; // Снятие модифицированности, т.к. перед закрытием признак проверяется.
	УдалитьДокументыПослеОбъединения();
	Закрыть(ПолучитьМассивСтрок());
КонецПроцедуры

&НаСервере
Процедура УдалитьДокументыПослеОбъединения()
	Если УдалитьДокументы Тогда
		Для каждого Стр Из Реализации Цикл
			Док = Стр.Ссылка;
			Данные = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Док,"Проведен,AMS_СтатусРеализации");
			
			Если Стр.Флаг И НЕ Данные.Проведен И Данные.AMS_СтатусРеализации = Перечисления.AMS_СтатусыРеализаций.Заказ Тогда
				мср.УстановитьПометкуУдаленияДокументу(Док,Истина);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивСтрок()
	МассивСтрок = Новый Массив;
	
	Табл = Подбор.Выгрузить(,"Номенклатура, Упаковка, ВидЦены, Цена, КоличествоУпаковок");
	
	Для каждого Стр Из Табл Цикл
		МассивСтрок.Добавить(ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Стр));
	КонецЦикла;
	
	Возврат МассивСтрок;
КонецФункции

&НаСервере
Процедура ПоказатьДанныеВыбора(Ссылка,Флаг)
	Табл = ПолучитьТоварыВыбора(Ссылка);
	
	ТабТовары =	РеквизитФормыВЗначение("Товары");
	
	Для каждого Стр Из Табл Цикл
		ТекСтр = ТабТовары.Найти(Стр.Номенклатура,"Номенклатура");
		Если ТекСтр <> Неопределено Тогда
			Если Флаг Тогда
				ТекСтр.КоличествоУпаковок = ТекСтр.КоличествоУпаковок + Окр(Стр.КоличествоУпаковок,0);  
			Иначе
				ТекСтр.КоличествоУпаковок = ТекСтр.КоличествоУпаковок - Окр(Стр.КоличествоУпаковок,0);  
			КонецЕсли;
			
			ТекСтр.Сумма = ТекСтр.Цена * ТекСтр.КоличествоУпаковок;
		КонецЕсли;
	КонецЦикла;
	
	Табл = ПолучитьТоварыПодбора(ТабТовары);
	
	ЗначениеВРеквизитФормы(ТабТовары,"Товары");

	ТабПодбор = РеквизитФормыВЗначение("Подбор");
	ТабПодбор.Очистить();
	
	Для каждого Стр Из Табл Цикл
		НовСтр = ТабПодбор.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,Стр);
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ТабПодбор,"Подбор");
КонецПроцедуры

&НаСервере
Функция ПолучитьТоварыВыбора(Ссылка)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	т.Номенклатура,
	|	СУММА(т.Количество / СпрНом.КоэффициентЕдиницыДляОтчетов) КАК КоличествоУпаковок
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНом
	|		ПО т.Номенклатура = СпрНом.Ссылка
	|ГДЕ
	|	т.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	т.Номенклатура";

	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

&НаСервере
Функция ПолучитьТоварыПодбора(Товары)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Товары",Товары);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	т.Номенклатура,
	|	т.Упаковка,
	|	т.КоличествоУпаковок,
	|	т.ВидЦены,
	|	т.Цена,
	|	т.Сумма,
	|	т.ТоварКлиента,
	|	т.Сортировка
	|ПОМЕСТИТЬ вт1
	|ИЗ
	|	&Товары КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт1.Номенклатура,
	|	вт1.Упаковка,
	|	вт1.КоличествоУпаковок,
	|	вт1.ВидЦены,
	|	вт1.Цена,
	|	вт1.Сумма,
	|	вт1.ТоварКлиента,
	|	вт1.Сортировка КАК Сортировка
	|ИЗ
	|	вт1 КАК вт1
	|ГДЕ
	|	вт1.КоличествоУпаковок > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сортировка";

	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

#КонецОбласти