
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьДанные();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаМеткиПриИзменении(Элемент)
	Для каждого Стр Из Объект.ЗаказыКлиента Цикл
		Стр.Метка = Стр.ДатаОтгрузки <= КонецДня(ДатаМетки);
	КонецЦикла;
	
	Если Не Элементы.ЗаказыКлиента.ТекущиеДанные = Неопределено Тогда
		ЗаполнитьТаблицуТовары();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОтрицательныеОстаткиПриИзменении(Элемент)
	Элементы.ПоказатьОстаткиЦех3.Доступность = Объект.ПоказатьОтрицательныеОстатки;
	
	ЗаполнитьТаблицуТовары();
	ПоказатьКоличествоУпаковокНоменклатурыВЗаказах();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОстаткиЦех3ПриИзменении(Элемент)
	ЗаполнитьТаблицуТовары();
	ПоказатьКоличествоУпаковокНоменклатурыВЗаказах();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗаказыКлиента

&НаКлиенте
Процедура ЗаказыКлиентаПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("ЗаказыПриАктивизацииСтрокиОбработчикОжидания",0.1,Истина)
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыКлиентаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПоказатьЗначение(, Элемент.ТекущиеДанные.ЗаказКлиента);
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыКлиентаМеткаПриИзменении(Элемент)
	ЗаполнитьТаблицуТовары();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("ТоварыПриАктивизацииСтрокиОбработчикОжидания",0.1,Истина)
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьДанные();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьДанные()
	ЗаполнитьТаблицуЗаказыКлиента();
	ЗаполнитьТаблицуТовары();
	ПоказатьКоличествоУпаковокНоменклатурыВЗаказах();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуЗаказыКлиента()
	Коннектор = РеквизитФормыВЗначение("Объект");
	Коннектор.ЗаполнитьТаблицуЗаказыКлиента();
	ЗначениеВДанныеФормы(Коннектор, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыПриАктивизацииСтрокиОбработчикОжидания()
	Стр = Элементы.ЗаказыКлиента.ТекущиеДанные;
	
	Если Стр = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаказКлиента = Стр.ЗаказКлиента;
	
	Если Объект.ЗаказКлиента <> ЗаказКлиента Тогда
		Объект.ЗаказКлиента = ЗаказКлиента;
		ЗаполнитьТаблицуТовары();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуТовары()
	Коннектор = РеквизитФормыВЗначение("Объект");
	Коннектор.ЗаполнитьТаблицуТовары();
	ЗначениеВДанныеФормы(Коннектор, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриАктивизацииСтрокиОбработчикОжидания()
	Стр = Элементы.Товары.ТекущиеДанные;
	
	Если Стр = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Номенклатура = Стр.Номенклатура;
	
	Если Объект.Номенклатура <> Номенклатура Тогда
		Объект.Номенклатура = Номенклатура;
		ПоказатьКоличествоУпаковокНоменклатурыВЗаказах();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПоказатьКоличествоУпаковокНоменклатурыВЗаказах()
	Коннектор = РеквизитФормыВЗначение("Объект");
	Коннектор.ПоказатьКоличествоУпаковокНоменклатурыВЗаказах();
	ЗначениеВДанныеФормы(Коннектор, Объект);
	
	Элементы.ЗаказыКлиентаКоличествоУпаковок.Заголовок = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "Артикул");
КонецПроцедуры

#КонецОбласти