#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьСоставОсновнойСпецификации(Номенклатура) Экспорт 
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.Количество КАК КоличествоМатериал,
	|	д.Количество КАК КоличествоФабрикат
	|ИЗ
	|	Справочник._ВариантыСпецификацийНоменклатуры.Товары КАК т
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры КАК д
	|		ПО т.Ссылка = д.Ссылка
	|ГДЕ
	|	д.Владелец = &Номенклатура
	|	И д.Основной
	|
	|УПОРЯДОЧИТЬ ПО
	|	т.Номенклатура.Наименование";

	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

#КонецОбласти	

#КонецЕсли
				
