#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ДанныеЗаполнения = Неопределено Или ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("Владелец", Владелец) И ЗначениеЗаполнено(Владелец) Тогда
		Основной = Не ЗначениеЗаполнено(AMS_ВызовСервера.ПолучитьОсновнуюСпецификацию(Владелец));
	КонецЕсли;
	
	Стр = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Владелец, "Наименование, _Упаковка, КоэффициентЕдиницыДляОтчетов");
	
	Наименование = Стр.Наименование;
	Статус       = ПредопределенноеЗначение("Перечисление._СтатусыСпецификаций.НеСогласована");
	
	Если AMS_ВызовСервера.ЭтоПродукцияAMS(Владелец) Тогда
		Упаковка           = Стр._Упаковка;
		КоличествоУпаковок = 1;
		Количество         = КоличествоУпаковок * Стр.КоэффициентЕдиницыДляОтчетов;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Основной = Не ЗначениеЗаполнено(AMS_ВызовСервера.ПолучитьОсновнуюСпецификацию(Владелец));
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа Или Не Основной  Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		ЗапросТекст = "ВЫБРАТЬ
		|	т.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник._ВариантыСпецификацийНоменклатуры КАК т
		|ГДЕ
		|	т.Владелец = &Владелец
		|	И т.Основной
		|	И т.Ссылка <> &Ссылка"; 
		
	Иначе
		ЗапросТекст = "ВЫБРАТЬ
		|	т.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник._ВариантыСпецификацийНоменклатуры КАК т
		|ГДЕ
		|	т.Владелец = &Владелец
		|	И т.Основной";
	КонецЕсли;

	Запрос.Текст = ЗапросТекст;
	
	Выб = Запрос.Выполнить().Выбрать();
	
	Пока Выб.Следующий() Цикл
		Объект = Выб.Ссылка.ПолучитьОбъект();
		Объект.Основной = Ложь;
		Объект.Записать();
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
