#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;

	АдресВХранилище = Неопределено;
	Если Параметры.Свойство("АдресВХранилище", АдресВХранилище) Тогда
		Данные = ПолучитьИзВременногоХранилища(АдресВХранилище);
	КонецЕсли;

	УстановитьУсловноеОформление();

	ЗаполнитьТаблицуПодбора(Данные);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	Если Модифицированность Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект), НСтр(
			"ru = 'Данные были изменены. Перенести изменения в документ?'"), РежимДиалогаВопрос.ДаНет);

	Иначе
		ПеренестиТоварыВДокумент();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыПередНачаломИзменения(Элемент, Отказ)
	Если Элемент.ТекущиеДанные.Поступило = 0 Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренестиВДокументВыполнить()
	ПеренестиТоварыВДокумент();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	УсловноеОформление.Элементы.Очистить();

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыКоличество.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Товары.Поступило");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветФонаКнопки);
	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность", ЦветаСтиля.ЦветФонаКнопки);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуПодбора(Данные)
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Расход", Данные.Расход);
	Запрос.УстановитьПараметр("Приход", Данные.Приход);
	Запрос.УстановитьПараметр("Дата", Данные.Дата);
	Запрос.УстановитьПараметр("Склад", Данные.Склад);
	Запрос.УстановитьПараметр("Контрагент", Данные.Контрагент);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	тов.Номенклатура КАК Номенклатура,
	|	тов.Количество КАК Количество
	|ПОМЕСТИТЬ вРасход
	|ИЗ
	|	&Расход КАК тов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тов.Номенклатура КАК Номенклатура,
	|	тов.Количество КАК Количество
	|ПОМЕСТИТЬ вПриход
	|ИЗ
	|	&Приход КАК тов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тов.Номенклатура КАК Номенклатура,
	|	СУММА(тов.Количество) КАК Количество
	|ПОМЕСТИТЬ Расход
	|ИЗ
	|	вРасход КАК тов
	|
	|СГРУППИРОВАТЬ ПО
	|	тов.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тов.Номенклатура КАК Номенклатура,
	|	СУММА(тов.Количество) КАК Поступило
	|ПОМЕСТИТЬ Приход
	|ИЗ
	|	вПриход КАК тов
	|
	|СГРУППИРОВАТЬ ПО
	|	тов.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Преформы.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(НаСкладе.ВНаличииОстаток, 0) КАК ОстатокНаСкладе,
	|	ЕСТЬNULL(ВПерераб.КоличествоОстаток, 0) КАК ВПереработке,
	|	ЕСТЬNULL(Приход.Поступило, 0) КАК Поступило,
	|	ЕСТЬNULL(Расход.Количество, 0) КАК Количество,
	|	Преформы.Номенклатура.Наименование КАК Наименование
	|ИЗ
	|	РегистрСведений.AMS_ТоварыВПереработку КАК Преформы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(&Дата, Склад = &Склад) КАК НаСкладе
	|		ПО Преформы.Номенклатура = НаСкладе.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления._ТоварыПереданные.Остатки(&Дата, Контрагент = &Контрагент) КАК ВПерераб
	|		ПО Преформы.Номенклатура = ВПерераб.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Приход КАК Приход
	|		ПО Преформы.Номенклатура = Приход.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Расход КАК Расход
	|		ПО Преформы.Номенклатура = Расход.Номенклатура
	|ГДЕ
	|	Преформы.Контрагент = &Контрагент
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	Результат = Запрос.Выполнить();
	Товары.Загрузить(Результат.Выгрузить());

	Элементы.ТоварыОстатокНаСкладе.Заголовок = "Остаток на " + Данные.Дата;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Модифицированность = Ложь;
		ПеренестиТоварыВДокумент();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиТоварыВДокумент()
	// Снятие модифицированности, т.к. перед закрытием признак проверяется.
	Модифицированность = Ложь;

	Отказ = Ложь;

	Данные = ПолучитьДанныеПодбора(Отказ);

	Если Не Отказ Тогда
		Закрыть(Данные);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеПодбора(Отказ)
	МассивСтрок = Новый Массив;

	Для Каждого Стр Из Товары Цикл
		Если Стр.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;

		Если Стр.Количество > Стр.Поступило Тогда
			ОбщегоНазначения.СообщитьПользователю("Передать номенклатуру """ + Стр.Номенклатура
				+ """ нельзя больше, чем Поступило.", , , , Отказ);
		КонецЕсли;

		Стр = Новый Структура("Номенклатура,Количество,КоличествоУпаковок", Стр.Номенклатура, Стр.Количество,
			Стр.Количество);
		МассивСтрок.Добавить(Стр);
	КонецЦикла;

	Возврат МассивСтрок;
КонецФункции

#КонецОбласти