
#Область СлужебныйПрограммныйИнтерфейс

#Область ПередЗаписьюНаСервере

Процедура ПередЗаписьюНаСервереДоговорыКонтрагентов(Объект, Отказ) Экспорт
	Договор = Объект;

	Если Договор.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;

	Если Договор.ТипДоговора = ОбщегоНазначения.ПредопределенныйЭлемент(
		"Перечисление.ТипыДоговоров.РеализацияЧерезКомиссионера") Тогда
		Возврат;
	КонецЕсли;
	
	//Номер
	Если ПустаяСтрока(Договор.Номер) Тогда
		ТекстОшибки = НСтр("ru='Поле ""Номер"" не заполнено.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , "Объект.Номер", , Отказ);
	КонецЕсли; 
		
	//Дата
	Если Договор.Дата = Дата(1, 1, 1) Тогда
		ТекстОшибки = НСтр("ru='Поле ""Дата"" не заполнено.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , "Объект.Дата", , Отказ);
	КонецЕсли; 
		
	//Наименование и Наименование для печати
	Если ПустаяСтрока(Объект.Наименование) Тогда
		Стр = AMS_ВызовСервера.ПолучитьНаименованиеДоговора(Объект.Номер, Объект.Дата, Объект.Организация, Объект.Партнер,
			Объект.Контрагент, Объект.ТипДоговора, Объект.Наименование);
		Объект.Наименование          = Стр.Наименование;
		Объект.НаименованиеДляПечати = Стр.НаименованиеДляПечати;
	КонецЕсли; 
	
	//Подразделение
	Если Не Договор.Подразделение = AMS_ВызовСервера.ПодразделениеПроизводство() Тогда
		Договор.Подразделение = AMS_ВызовСервера.ПодразделениеПроизводство();
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Договор.Менеджер) Тогда
		ТекстОшибки = НСтр("ru='Поле ""Менеджер"" не заполнено.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , "Объект.Менеджер", , Отказ);
	КонецЕсли; 
		
	//Банковский счета
	Если Не Договор.Организация = Справочники.Организации.УправленческаяОрганизация Тогда
		//счёт организации
		Счёт = Договор.БанковскийСчет;
		Если ЗначениеЗаполнено(Счёт) Тогда
			Если Счёт.НомерСчета = "40901810100005171489" Или Счёт.НомерСчета = "40702810200000052602"
				Или Счёт.НомерСчета = "40702810700010510483" Тогда
				ТекстОшибки = НСтр("ru='В договоре указан запрещённый к использованию счёт организации.'");
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , "Объект.БанковскийСчет", , Отказ);
			КонецЕсли;
		Иначе
			ТекстОшибки = НСтр("ru='В договоре поле ""Счет организации"" не заполнено.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , "Объект.БанковскийСчет", , Отказ);
		КонецЕсли;
		
		//счёт покупателя
		Счёт = Договор.БанковскийСчетКонтрагента;
		Если ЗначениеЗаполнено(Счёт) Тогда
			ИмяСчёта = Лев(Прав(СокрЛП(Счёт.НомерСчета), 4) + ?(ЗначениеЗаполнено(Счёт.Банк), " в " + Строка(
				Счёт.Банк), "") + " (" + Строка(Счёт.ВалютаДенежныхСредств) + ")", 150);
			Если СтрНайти(Счёт.Наименование, ИмяСчёта) = 0 Тогда
				СчётОбъект = Счёт.ПолучитьОбъект();
				СчётОбъект.Наименование = ИмяСчёта;
				СчётОбъект.Записать();
			КонецЕсли;

		Иначе
			Если Не (Договор.Контрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо
				Или Договор.Контрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицоНеРезидент) Тогда
				ТекстОшибки = НСтр("ru='В договоре поле ""Счет покупателя"" не заполнено.'");
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , "Объект.БанковскийСчетКонтрагента", , Отказ);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли; 
	
	//Проверка соответствия контрагента покупателю
	ПартнерДоговора                        = Договор.Партнер;
	ГоловноеПредприятиеПартнераДоговора    = ПартнерДоговора.Родитель;

	КонтрагентДоговора                     = Договор.Контрагент;
	ПартнерКонтрагента                     = КонтрагентДоговора.Партнер;
	ГоловноеПредприятиеПартнераКонтрагента = ПартнерКонтрагента.Родитель;

	Если Не (ПартнерДоговора = ПартнерКонтрагента Или ПартнерКонтрагента = ГоловноеПредприятиеПартнераДоговора
		Или ПартнерДоговора = ГоловноеПредприятиеПартнераКонтрагента) Тогда
		Если Договор.ТипДоговора = Перечисления.ТипыДоговоров.СПокупателем Тогда
			Клиент = "Покупатель";
		ИначеЕсли Договор.ТипДоговора = Перечисления.ТипыДоговоров.СПоставщиком Тогда
			Клиент = "Поставщик";
		КонецЕсли;

		ТекстОшибки = НСтр(
			"ru='В договоре в поле ""%Клиент%"" должен быть указан партнёр контрагента ""%ПартнерКонтрагента%"".'");
		ТекстОшибки =  СтрЗаменить(ТекстОшибки, "%Клиент%", Клиент);
		ТекстОшибки =  СтрЗаменить(ТекстОшибки, "%ПартнерКонтрагента%", ПартнерКонтрагента);

		Если ЗначениеЗаполнено(ГоловноеПредприятиеПартнераКонтрагента) Тогда
			ТекстОшибки = ТекстОшибки + НСтр("ru=' Или головное предприятие партнёра - ""%ГоловноеПредприятие%"".'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ГоловноеПредприятие%", ГоловноеПредприятиеПартнераКонтрагента);
		КонецЕсли;

		ТекстОшибки = ТекстОшибки + НСтр("ru=' Или неправильно выбран контрагент (не имеет отношений с партнёром).'");

		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , "Объект.Контрагент", , Отказ);
	КонецЕсли;
	
	//Детализация расчетов
	Если Не Договор.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоНакладным Тогда
		Договор.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоНакладным;
	КонецЕсли;
	
	//Статья ДДС
	ТипДоговора = Договор.ТипДоговора;
	Если Не ЗначениеЗаполнено(Договор.СтатьяДвиженияДенежныхСредств) Тогда
		Если ТипДоговора = Перечисления.ТипыДоговоров.СПокупателем Тогда
			Договор.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.ПоступлениеОплатыОтКлиента;

		ИначеЕсли ТипДоговора = Перечисления.ТипыДоговоров.СПоставщиком Тогда
			Договор.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.ОплатаПоставщику;
		КонецЕсли;
	КонецЕсли;
	
	//Ставка НДС для платежей
	Если Не ЗначениеЗаполнено(Договор.СтавкаНДС) Тогда
		Договор.СтавкаНДС = Перечисления.СтавкиНДС.НДС20;
	КонецЕсли;
КонецПроцедуры
Процедура ПередЗаписьюНаСервереНоменклатура(Объект, Отказ) Экспорт
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;

	Номенклатура = Объект;

	Если AMS_ВызовСервера.ЭтоПродукцияAMS(Номенклатура) Тогда
		Если Не ЗначениеЗаполнено(Номенклатура.Производитель) Тогда
			ОбщегоНазначения.СообщитьПользователю("Не заполнено поле ""Производитель (бренд)"".", ,
				"Объект.Производитель", , Отказ);
		КонецЕсли;

		Если Не ЗначениеЗаполнено(Номенклатура.ЦеноваяГруппа) Тогда
			ОбщегоНазначения.СообщитьПользователю("Не заполнено поле ""Ценовая группа"".", , "Объект.ЦеноваяГруппа", ,
				Отказ);
		КонецЕсли;

		Если Не Номенклатура.ВидНоменклатуры = AMS_ВызовСервера.ВидНоменклатурыПродукцияНаборы()
			И Не ЗначениеЗаполнено(Номенклатура._Упаковка) И Не AMS_ВызовСервера.ЭтоKhors() Тогда
			ОбщегоНазначения.СообщитьПользователю("Не заполнено поле ""Упаковка"".", , "Объект._Упаковка", , Отказ);
		КонецЕсли;

		Если Номенклатура._ИспользуетФабрикат Тогда
			Если Не ЗначениеЗаполнено(Номенклатура._Фабрикат) Тогда
				ОбщегоНазначения.СообщитьПользователю("Не заполнено поле ""Фабрикат"".", , "Объект._Фабрикат", , Отказ);
			КонецЕсли;

			Если Не Номенклатура._КоличествоФабрикатаВУпаковке > 0 Тогда
				ОбщегоНазначения.СообщитьПользователю("Не заполнено поле ""Количество в упаковке"".", ,
					"Объект._КоличествоФабрикатаВУпаковке", , Отказ);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
Процедура ПередЗаписьюНаСервереСоглашенияСКлиентами(Объект, Отказ) Экспорт
	Соглашение = Объект;

	Если Соглашение.Типовое Тогда
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Соглашение.Организация) Тогда
		ТекстОшибки = НСтр("ru='Не заполнено поле ""Организация"".'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , "Объект.Организация", , Отказ);
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Соглашение.ГрафикОплаты) Тогда
		ТекстОшибки = НСтр("ru='В условиях продажи не заполнено поле ""График оплаты"".'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , "Объект.ГрафикОплаты", , Отказ);
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Соглашение.ВидЦен) Тогда
		ТекстОшибки = НСтр("ru='В условиях продажи не заполнено поле ""Вид цен"".'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , "Объект.ВидЦен", , Отказ);
	КонецЕсли;

	Наименование = СокрЛП(Соглашение.Партнер.Наименование) + " с " + СокрЛП(Соглашение.Организация.Наименование);
	Если СтрНайти(Соглашение.Наименование, Наименование) = 0 Тогда
		Соглашение.Наименование = Наименование;
	КонецЕсли;

	Если Не Пользователи.РолиДоступны("_Бухгалтер") И Не Соглашение.Склад = AMS_ВызовСервера.СкладПродукции() Тогда
		Соглашение.Склад = AMS_ВызовСервера.СкладПродукции();
	КонецЕсли;

	Если Не Соглашение.СтатьяДвиженияДенежныхСредств
		= Справочники.СтатьиДвиженияДенежныхСредств.ПоступлениеОплатыОтКлиента Тогда
		Соглашение.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.ПоступлениеОплатыОтКлиента;
	КонецЕсли; 
		
	//Проверка соответствия контрагента клиенту
	Если ЗначениеЗаполнено(Соглашение.Партнер) И ЗначениеЗаполнено(Соглашение.Контрагент) Тогда
		ПартнерДоговора                        = Соглашение.Партнер;
		ГоловноеПредприятиеПартнераДоговора    = ПартнерДоговора.Родитель;

		КонтрагентДоговора                     = Соглашение.Контрагент;
		ПартнерКонтрагента                     = КонтрагентДоговора.Партнер;
		ГоловноеПредприятиеПартнераКонтрагента = ПартнерКонтрагента.Родитель;

		Если Не (ПартнерДоговора = ПартнерКонтрагента Или ПартнерКонтрагента = ГоловноеПредприятиеПартнераДоговора
			Или ПартнерДоговора = ГоловноеПредприятиеПартнераКонтрагента) Тогда

			ТекстОшибки = НСтр(
				"ru='В договоре поле ""Клиент"" должен быть указан партнёр контрагента ""%ПартнерКонтрагента%"".'");
			ТекстОшибки =  СтрЗаменить(ТекстОшибки, "%ПартнерКонтрагента%", ПартнерКонтрагента);

			Если ЗначениеЗаполнено(ГоловноеПредприятиеПартнераКонтрагента) Тогда
				ТекстОшибки = ТекстОшибки + НСтр("ru=' или головное предприятие партнёра - ""%ГоловноеПредприятие%"".'");
				ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ГоловноеПредприятие%", ГоловноеПредприятиеПартнераКонтрагента);
			КонецЕсли;

			ТекстОшибки = ТекстОшибки + НСтр(
				"ru=' или неправильно выбран контрагент (не имеет отношений с партнёром).'");

			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , , , Отказ);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписьюНаСервереЗаявкаНаВозвратТоваровОтКлиента(Отказ, ТекущийОбъект, ПараметрыЗаписи) Экспорт
	РазрешеноПроведение = Пользователи.РолиДоступны("_Директор,_СтаршийМенеджер,_СтаршийМенеджерМЕГА")
		Или AMS_ВызовСервера.ЭтоKhors();

	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение И Не ТекущийОбъект.Проведен
		И Не РазрешеноПроведение Тогда

		ТекстСообщения = НСтр("ru = 'Проведение документа разрешено старшему менеджеру продаж.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
	КонецЕсли;
КонецПроцедуры
//Процедура ПередЗаписьюНаСервереПеремещениеТоваров(Отказ, ТекущийОбъект, ПараметрыЗаписи) Экспорт
//	УстановитьПривилегированныйРежим(Истина);

//	ТекДата = ТекущаяДатаСеанса();

//	Если ТекущийОбъект.Статус = Перечисления.СтатусыПеремещенийТоваров.Отгружено И ТекущийОбъект._ВремяОтгрузки = Дата(1, 1, 1) Тогда
//		ТекущийОбъект._ВремяОтгрузки =  Дата(1, 1, 1) + (ТекДата - НачалоДня(ТекДата));
//	КонецЕсли;
//	
//	Если ТекущийОбъект.Статус = Перечисления.СтатусыПеремещенийТоваров.Принято И ТекущийОбъект._ВремяПоступления = Дата(1, 1, 1) Тогда
//		ТекущийОбъект._ВремяПоступления =  Дата(1, 1, 1) + (ТекДата - НачалоДня(ТекДата));
//	КонецЕсли;

//	Если ТекущийОбъект.Статус = Перечисления.СтатусыПеремещенийТоваров.Отгружено Тогда
//		Если ЗначениеЗаполнено(ТекущийОбъект.Ссылка) Тогда
//			ДатаОстатков = Новый Граница(ТекущийОбъект.Ссылка.Дата, ВидГраницы.Исключая);
//		Иначе
//			ДатаОстатков = ТекущийОбъект.Дата;
//		КонецЕсли;

//		Запрос = Новый Запрос;
//		Запрос.УстановитьПараметр("Товары", ТекущийОбъект.Товары.Выгрузить( , "Номенклатура,Количество"));
//		Запрос.УстановитьПараметр("Склад", ТекущийОбъект.СкладОтправитель);
//		Запрос.УстановитьПараметр("Дата", ДатаОстатков);

//		Запрос.Текст =
//		"ВЫБРАТЬ
//		|	т.Номенклатура КАК Номенклатура,
//		|	т.Количество КАК Количество
//		|ПОМЕСТИТЬ док
//		|ИЗ
//		|	&Товары КАК т
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	док.Номенклатура КАК Номенклатура,
//		|	СУММА(док.Количество / н.КоэффициентЕдиницыДляОтчетов) КАК Количество,
//		|	н._Упаковка КАК Ед
//		|ПОМЕСТИТЬ тов
//		|ИЗ
//		|	док КАК док
//		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК н
//		|		ПО док.Номенклатура = н.Ссылка
//		|
//		|СГРУППИРОВАТЬ ПО
//		|	док.Номенклатура,
//		|	н._Упаковка
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	Ост.Номенклатура КАК Номенклатура,
//		|	Ост.ВНаличииОстаток / Ном.КоэффициентЕдиницыДляОтчетов КАК Остаток
//		|ПОМЕСТИТЬ цех
//		|ИЗ
//		|	РегистрНакопления.ТоварыНаСкладах.Остатки(
//		|			&Дата,
//		|			Склад = &Склад
//		|				И Номенклатура В
//		|					(ВЫБРАТЬ
//		|						тов.Номенклатура КАК Номенклатура
//		|					ИЗ
//		|						тов КАК тов)) КАК Ост
//		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
//		|		ПО Ост.Номенклатура = Ном.Ссылка
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	тов.Номенклатура КАК Номенклатура,
//		|	ЕСТЬNULL(тов.Количество, 0) - ЕСТЬNULL(цех.Остаток, 0) КАК Количество,
//		|	тов.Ед КАК Ед
//		|ИЗ
//		|	тов КАК тов
//		|		ЛЕВОЕ СОЕДИНЕНИЕ цех КАК цех
//		|		ПО тов.Номенклатура = цех.Номенклатура
//		|ГДЕ
//		|	ЕСТЬNULL(тов.Количество, 0) > ЕСТЬNULL(цех.Остаток, 0)";

//		Результат = Запрос.Выполнить();
//		Выборка   = Результат.Выбрать();

//		Пока Выборка.Следующий() Цикл
//			ТекстСообщения = НСтр("ru = 'Недостаточно %Количество% %Ед% %Номенклатура% на складе %Склад%.'");
//			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Номенклатура%", Выборка.Номенклатура);
//			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Склад%", ТекущийОбъект.СкладОтправитель);
//			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Количество%", Выборка.Количество);
//			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Ед%", Выборка.Ед);

//			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
//		КонецЦикла;
//	КонецЕсли;
//КонецПроцедуры
Процедура ПередЗаписьюНаСервереПоступлениеБезналичныхДенежныхСредств(Отказ, ТекущийОбъект, ПараметрыЗаписи) Экспорт
	Если ТекущийОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПрочееПоступлениеДенежныхСредств Тогда
		Возврат;
	КонецЕсли;
	
	//Если Контрагент платит за несколько Партнеров, то Возврат
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Родитель", ТекущийОбъект.Контрагент.Партнер);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Партнеры.Ссылка
	|ИЗ
	|	Справочник.Партнеры КАК Партнеры
	|ГДЕ
	|	Партнеры.Родитель = &Родитель";
	Если Не Запрос.Выполнить().Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	//Выполнить проверку заполнения Основания платежа
	Табл = ТекущийОбъект.РасшифровкаПлатежа;

	КолСтр = Табл.Количество();

	Если КолСтр = 1 Тогда
		Если ЗначениеЗаполнено(ТекущийОбъект.Договор) Или ЗначениеЗаполнено(Табл[0].ОснованиеПлатежа) Тогда
			//это хорошо - продолжаем запись
		Иначе
			Текст = "Не заполнено ""Основание платежа"" или ""Договор"".";
			ОбщегоНазначения.СообщитьПользователю(Текст, , , , Отказ);
		КонецЕсли;

	Иначе
		Для Каждого Стр Из Табл Цикл
			Если Не ЗначениеЗаполнено(Стр.ОснованиеПлатежа) Тогда
				Текст = "В строке №" + Стр.НомерСтроки + " не заполнено ""Основание платежа"".";
				ОбщегоНазначения.СообщитьПользователю(Текст, , , , Отказ);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ПодпискиНаСобытия

Процедура ОбработкаЗаполненияСправочников(Источник, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	ИмяДок = Источник.Метаданные().Имя;

	Если ИмяДок = "ДоговорыКонтрагентов" Тогда
		Если ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
			ОбработкаЗаполненияДоговорыКонтрагентов(Источник, ДанныеЗаполнения);
		КонецЕсли;

	ИначеЕсли ИмяДок = "СоглашенияСКлиентами" Тогда
		ОбработкаЗаполненияСоглашенияСКлиентами(Источник);

	ИначеЕсли ИмяДок = "СоглашенияСПоставщиками" Тогда
		ОбработкаЗаполненияСоглашенияСПоставщиками(Источник);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура НастройкаФормыПечатьДокументов(Форма, ИмяМакета) Экспорт
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ИмяМакета", Новый ОписаниеТипов("Строка")));

	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);

	Форма.ИмяМакета = ИмяМакета;
КонецПроцедуры

Процедура ПолучитьДанныеНаОснованииСКД(СКД, Таб, Настройки, Парам, Расшифровка = Неопределено,
	МакетКомпоновки = Неопределено, ВнешниеНаборыДанных = Неопределено) Экспорт
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Если ТипЗнч(Таб) = Тип("ТабличныйДокумент") Тогда
		ТипГенератора = Тип("ГенераторМакетаКомпоновкиДанных");
	Иначе
		ТипГенератора = Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений");
	КонецЕсли;

	Если Настройки = Неопределено Тогда
		Настройки = СКД.НастройкиПоУмолчанию;
	КонецЕсли;

	Если Парам <> Неопределено Тогда
		КоллекцияЗначенийПараметров = Настройки.ПараметрыДанных.Элементы;
		Для Каждого Параметр Из Парам Цикл
			НайденноеЗначениеПараметра = КоллекцияЗначенийПараметров.Найти(Параметр.Ключ);
			Если НайденноеЗначениеПараметра <> Неопределено Тогда
				НайденноеЗначениеПараметра.Использование = Истина;
				НайденноеЗначениеПараметра.Значение = Параметр.Значение;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	МакетКомпоновкиСКД = КомпоновщикМакета.Выполнить(СКД, Настройки, Расшифровка, МакетКомпоновки, ТипГенератора);

	ПроцессорКомпановки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпановки.Инициализировать(МакетКомпоновкиСКД, ВнешниеНаборыДанных, Расшифровка);

	Если ТипЗнч(Таб) = Тип("ТабличныйДокумент") Тогда
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
		ПроцессорВывода.УстановитьДокумент(Таб);
	Иначе
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		ПроцессорВывода.УстановитьОбъект(Таб);
	КонецЕсли;

	ПроцессорВывода.ОтображатьПроцентВывода = Истина;
	ПроцессорВывода.Вывести(ПроцессорКомпановки, Истина);
КонецПроцедуры

Процедура ЗаписатьДокумент(Документ, РежимЗаписи, Отказ = Ложь, СообщитьОбОшибке = Истина, СообщитьОВыполнении = Ложь) Экспорт
	Если СтрНайти(Строка(ТипЗнч(Документ)), "Документ объект") = 0 Тогда //это ссылка 
		//@skip-check unknown-method-property
		ДокументОбъект = Документ.ПолучитьОбъект();
	Иначе
		ДокументОбъект = Документ;
	КонецЕсли;

	СинонимДок = ДокументОбъект.Метаданные().Синоним;
	НоменДок   = ДокументОбъект.Номер;
	СтрокаДок  = СинонимДок + " № " + ?(ПустаяСтрока(НоменДок), " ... ", НоменДок) + " от " + Формат(
		ДокументОбъект.Дата, "ДФ=dd.MM.yyyy") + " г.";

	Попытка
		ДокументОбъект.Записать(РежимЗаписи);

		Если СообщитьОВыполнении Тогда
			Если РежимЗаписи = РежимЗаписиДокумента.Запись Тогда
				Вариант = "Документа " + СтрокаДок + " записан!";
			ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
				Вариант = "Документ " + СтрокаДок + " проведен!";
			ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
				Вариант = "У документа " + СтрокаДок + " отменено проведение!";
			КонецЕсли;
			ОбщегоНазначения.СообщитьПользователю(Вариант, ДокументОбъект);
		КонецЕсли;

	Исключение
		Отказ = Истина;

		Если СообщитьОбОшибке Тогда
			Если РежимЗаписи = РежимЗаписиДокумента.Запись Тогда
				Вариант = "Документа " + СтрокаДок + " не удалось записать!";
			ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
				Вариант = "Документ " + СтрокаДок + " не проведен!";
			ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
				Вариант = "У документа " + СтрокаДок + " не удалось отменить проведение!";
			КонецЕсли;

			ОбщегоНазначения.СообщитьПользователю(Вариант + " Ошибка: " + ОписаниеОшибки(), ДокументОбъект);
		КонецЕсли;
	КонецПопытки;
КонецПроцедуры

Процедура УстановитьПометкуУдаленияДокументу(Документ, Пометка, Отказ = Ложь, СообщитьОбОшибке = Истина,
	СообщитьОВыполении = Ложь) Экспорт
	Если СтрНайти(Строка(ТипЗнч(Документ)), "Документ объект") = 0 Тогда //это ссылка 
		ДокументОбъект = Документ.ПолучитьОбъект();
	Иначе
		ДокументОбъект = Документ;
	КонецЕсли;

	СинонимДок = ДокументОбъект.Метаданные().Синоним;
	НоменДок   = ДокументОбъект.Номер;
	СтрокаДок  = "«" + СинонимДок + " № " + ?(ПустаяСтрока(НоменДок), " ... ", НоменДок) + " от " + Формат(
		ДокументОбъект.Дата, "ДФ=dd.MM.yyyy") + " г.»";

	Попытка
		Если ДокументОбъект.Модифицированность() Тогда
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;

		ДокументОбъект.УстановитьПометкуУдаления(Пометка);

		Если СообщитьОВыполении Тогда
			Если Пометка = Истина Тогда
				Вариант = "Документ " + СтрокаДок + " помечен на удаление!";
			Иначе
				Вариант = "У документа " + СтрокаДок + " снята пометка на удаление!";
			КонецЕсли;
			ОбщегоНазначения.СообщитьПользователю(Вариант);
		КонецЕсли;

	Исключение
		Если СообщитьОбОшибке Тогда
			Если Пометка = Истина Тогда
				Вариант = "У документ " + СтрокаДок + " не удалось установить пометку на удаление!";
			Иначе
				Вариант = "У документа " + СтрокаДок + " не удалось снять пометку на удаление!";
			КонецЕсли;
			ОбщегоНазначения.СообщитьПользователю(Вариант + " Ошибка: " + ОписаниеОшибки(), , , , Отказ);
		КонецЕсли;
	КонецПопытки;
КонецПроцедуры

#Область ПроцедурыОбработкиЗаполненияСправочников

Процедура ОбработкаЗаполненияДоговорыКонтрагентов(Источник, ДанныеЗаполнения)
	УстановитьПривилегированныйРежим(Истина);

	ЗаполнитьЗначенияСвойств(Источник, ДанныеЗаполнения);

	Источник.Статус                = Перечисления.СтатусыДоговоровКонтрагентов.НеСогласован;
	Источник.Организация           = AMS_ВызовСервера.ПолучитьОсновнуюОрганизацию();
	Стр = AMS_ВызовСервера.ПолучитьНаименованиеДоговора(Источник.Номер, Источник.Дата, Источник.Организация,
		Источник.Партнер, Источник.Контрагент, Источник.ТипДоговора, Источник.Наименование);
	Источник.Наименование          = Стр.Наименование;
	Источник.НаименованиеДляПечати = Стр.НаименованиеДляПечати;
	Источник.Подразделение         = AMS_ВызовСервера.ПодразделениеПроизводство();
	Источник.ПорядокРасчетов       = Перечисления.ПорядокРасчетов.ПоНакладным;
	Источник.СтавкаНДС             = Перечисления.СтавкиНДС.НДС20;

	Если Источник.ТипДоговора = Перечисления.ТипыДоговоров.СПокупателем Тогда
		Источник.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.ПоступлениеОплатыОтКлиента;
	ИначеЕсли Источник.ТипДоговора = Перечисления.ТипыДоговоров.СПоставщиком Тогда
		Источник.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.ОплатаПоставщику;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполненияСоглашенияСКлиентами(Источник)
	Если Источник.Типовое Тогда
		Возврат;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);

	Партнер = Источник.Партнер;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(т.Ссылка) КАК Количество
	|ИЗ
	|	Справочник.СоглашенияСКлиентами КАК т
	|ГДЕ
	|	т.Партнер = &Партнер
	|	И НЕ т.Типовое";
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Номер = "1";
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Номер = Строка(Выборка.Количество + 1);
	КонецЕсли;

	Дата = ТекущаяДатаСеанса();

	ПартнерНаименование     = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Партнер, "Наименование");
	ОрганизацияНаименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Организация, "Наименование");
	
	Источник.Статус = ПредопределенноеЗначение("Перечисление.СтатусыСоглашенийСКлиентами.НеСогласовано");
	
	Источник.Организация                      = AMS_ВызовСервера.ПолучитьОсновнуюОрганизацию();
	Источник.Наименование                     = СокрЛП(ПартнерНаименование) + " с " + СокрЛП(ОрганизацияНаименование);
	Источник.Номер                            = Номер;
	Источник.Дата                             = Дата;
	Источник.ДатаНачалаДействия               = Дата;
	Источник.ИспользуютсяДоговорыКонтрагентов = Истина;
	Источник.СтатьяДвиженияДенежныхСредств    = Справочники.СтатьиДвиженияДенежныхСредств.ПоступлениеОплатыОтКлиента;
КонецПроцедуры

Процедура ОбработкаЗаполненияСоглашенияСПоставщиками(Источник)
	УстановитьПривилегированныйРежим(Истина);

	Партнер = Источник.Партнер;

	Если Не ЗначениеЗаполнено(Партнер) Тогда
		Возврат;
	КонецЕсли;

	Валюта                  = Константы.ВалютаРегламентированногоУчета.Получить();
	ПартнерНаименование     = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Партнер, "Наименование");
	ОрганизацияНаименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Организация, "Наименование");

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(СоглашенияСПоставщиками.Ссылка) КАК Количество
	|ИЗ
	|	Справочник.СоглашенияСПоставщиками КАК СоглашенияСПоставщиками
	|ГДЕ
	|	СоглашенияСПоставщиками.Партнер = &Партнер";
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Источник.Номер = "1";
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Источник.Номер = Строка(Выборка.Количество + 1);
	КонецЕсли;

	Источник.Дата                             = ТекущаяДатаСеанса();
	Источник.Наименование                     = СокрЛП(ПартнерНаименование) + " с " + СокрЛП(ОрганизацияНаименование);
	Источник.ДатаНачалаДействия               = ТекущаяДатаСеанса();
	Источник.Валюта                           = Валюта;
	Источник.ЦенаВключаетНДС                  = Истина;
	Источник.ФормаОплаты                      = Перечисления.ФормыОплаты.Безналичная;
	Источник.РегистрироватьЦеныПоставщика     = Истина;
	Источник.ИспользуютсяДоговорыКонтрагентов = Истина;
	Источник.ПорядокРасчетов                  = Перечисления.ПорядокРасчетов.ПоНакладным;
	Источник.СтатьяДвиженияДенежныхСредств    = Справочники.СтатьиДвиженияДенежныхСредств.ОплатаПоставщику;
	
	//ВидЦеныПоставщика
	ВидЦеныПоставщикаНаименование = ПартнерНаименование;
	ВидЦеныПоставщика = Справочники.ВидыЦенПоставщиков.НайтиПоНаименованию(ВидЦеныПоставщикаНаименование, Истина);
	Если ЗначениеЗаполнено(ВидЦеныПоставщика) Тогда
		Источник.ВидЦеныПоставщика = ВидЦеныПоставщика;

	Иначе
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Владелец", Партнер);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВидыЦенПоставщиков.Ссылка КАК ВидЦеныПоставщика
		|ИЗ
		|	Справочник.ВидыЦенПоставщиков КАК ВидыЦенПоставщиков
		|ГДЕ
		|	ВидыЦенПоставщиков.Владелец = &Владелец";

		ТаблВидовЦен = Запрос.Выполнить().Выгрузить();

		Если ТаблВидовЦен.Количество() = 0 Тогда
			ВидЦеныПоставщика = Справочники.ВидыЦенПоставщиков.СоздатьЭлемент();
		Иначе
			ВидЦеныПоставщика = ТаблВидовЦен[0].ВидЦеныПоставщика.ПолучитьОбъект();
		КонецЕсли;

		ВидЦеныПоставщика.Наименование       = ВидЦеныПоставщикаНаименование;
		ВидЦеныПоставщика.Владелец           = Партнер;
		ВидЦеныПоставщика.Валюта             = Валюта;
		ВидЦеныПоставщика.ДоступноДляЗакупки = Истина;
		ВидЦеныПоставщика.ЦенаВключаетНДС    = Истина;
		ВидЦеныПоставщика.Записать();

		Источник.ВидЦеныПоставщика = ВидЦеныПоставщика.Ссылка;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработкиЗаполненияДокументов

#КонецОбласти

#Область Соответствия

Функция СоответствиеСегментНоменклатурыОтЦеха() Экспорт
	Соответствие = Новый Соответствие;
	Соответствие.Вставить(AMS_ВызовСервера.Цех1(), AMS_ВызовСервера.СегментыНоменклатурыПродукцияЦеха1());
	Соответствие.Вставить(AMS_ВызовСервера.Цех2(), AMS_ВызовСервера.СегментыНоменклатурыПродукцияЦеха2());
	Соответствие.Вставить(AMS_ВызовСервера.Цех3(), AMS_ВызовСервера.СегментыНоменклатурыПродукцияЦеха3());
	Возврат Соответствие;
КонецФункции

Функция СоответствиеВидНоменклатурыЦех() Экспорт
	Соответствие = Новый Соответствие;
	Соответствие.Вставить(AMS_ВызовСервера.ВидНоменклатурыПродукцияЦеха1(), AMS_ВызовСервера.Цех1());
	Соответствие.Вставить(AMS_ВызовСервера.ВидНоменклатурыПродукцияЦеха2(), AMS_ВызовСервера.Цех2());
	Соответствие.Вставить(AMS_ВызовСервера.ВидНоменклатурыПродукцияЦеха3(), AMS_ВызовСервера.Цех3());

	Возврат Соответствие;
КонецФункции

Функция СоответствиеЦехВидНоменклатуры() Экспорт
	Соответствие = Новый Соответствие;
	Соответствие.Вставить(AMS_ВызовСервера.Цех1(), AMS_ВызовСервера.ВидыНоменклатурыЦеха1());
	Соответствие.Вставить(AMS_ВызовСервера.Цех2(), AMS_ВызовСервера.ВидыНоменклатурыЦеха2());
	Соответствие.Вставить(AMS_ВызовСервера.Цех3(), AMS_ВызовСервера.ВидыНоменклатурыЦеха3());

	Возврат Соответствие;
КонецФункции

Функция СоответствиеЦехПодразделение() Экспорт
	Соответствие = Новый Соответствие;

	Соответствие.Вставить(AMS_ВызовСервера.Цех1(), Справочники.СтруктураПредприятия.НайтиПоКоду("01-000002"));
	Соответствие.Вставить(AMS_ВызовСервера.Цех2(), Справочники.СтруктураПредприятия.НайтиПоКоду("01-000003"));
	Соответствие.Вставить(AMS_ВызовСервера.Цех3(), Справочники.СтруктураПредприятия.НайтиПоКоду("01-000004"));
	Соответствие.Вставить(AMS_ВызовСервера.Цех4(), Справочники.СтруктураПредприятия.НайтиПоКоду("01-000008"));

	Возврат Соответствие;
КонецФункции

Функция ПолучитьЦехНоменклатуры(Номенклатура) Экспорт //Сделать соответствие
	//@skip-check bsl-legacy-check-string-literal
	ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "ВидНоменклатуры");

	Если ВидНоменклатуры = AMS_ВызовСервера.ВидНоменклатурыПродукцияЦеха1() Тогда
		Возврат AMS_ВызовСервера.Цех1();
		
	ИначеЕсли ВидНоменклатуры = AMS_ВызовСервера.ВидНоменклатурыПродукцияЦеха2() Тогда
		Возврат AMS_ВызовСервера.Цех2();
		
	ИначеЕсли ВидНоменклатуры = AMS_ВызовСервера.ВидНоменклатурыПродукцияЦеха3() Тогда
		Возврат AMS_ВызовСервера.Цех3();
	КонецЕсли;
КонецФункции

#КонецОбласти

Функция ПолучитьОтветственноеЛицо(Организация) Экспорт
	Лицо = Неопределено;

	Имя = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;

	Если Организация = AMS_ВызовСервера.ОрганизацияТД() Тогда
		Если Имя = "Матрешкина" Тогда
			Лицо = "Пензова Л. С. (Приказ №1 от 19.05.2023 г.)";

		ИначеЕсли Имя = "Халимулина" Тогда

		ИначеЕсли Имя = "Пензова" Тогда
			Лицо = "Пензова Л. С. (Приказ №1 от 19.05.2023 г.)";

		ИначеЕсли Имя = "Логинова" Тогда
			Лицо = "Логинова Е. В. (Приказ №3 от 20.11.2024 г.)";

		ИначеЕсли Имя = "Иванова" Тогда
			Лицо = "Иванова С. Н. (Приказ №3 от 8.05.2020 г.)";
		КонецЕсли;

	ИначеЕсли Организация = AMS_ВызовСервера.ОрганизацияКемикал() Тогда
		Если Имя = "Матрешкина" Тогда
			Лицо = "Матрешкина Н. А. (Приказ №11 от 24.11.2021 г.)";

		ИначеЕсли Имя = "Халимулина" Тогда
			Лицо = "Халимулина Л. Ф. (Приказ №11 от 24.11.2021 г.)";

		ИначеЕсли Имя = "Пензова" Тогда
			Лицо = "Пензова Л. С. (Приказ №1 от 19.05.2023 г.)";

		ИначеЕсли Имя = "Логинова" Тогда
			Лицо = "Логинова Е. В. (Приказ №19 от 20.11.2024 г.)";

		ИначеЕсли Имя = "Иванова" Тогда
			Лицо = "Иванова С. Н. (Приказ №4 от 21.04.2020 г.)";
		КонецЕсли;

	ИначеЕсли Организация = AMS_ВызовСервера.ОрганизацияТрейд() Тогда
		Если Имя = "Матрешкина" Тогда
			Лицо = "Пензова Л. С. (Приказ №1 от 19.05.2023 г.)";

		ИначеЕсли Имя = "Халимулина" Тогда

		ИначеЕсли Имя = "Пензова" Тогда
			Лицо = "Пензова Л. С. (Приказ №1 от 19.05.2023 г.)";


		ИначеЕсли Имя = "Логинова" Тогда
			Лицо = "Логинова Е. В. (Приказ №1 от 20.11.2024 г.)";

		ИначеЕсли Имя = "Иванова" Тогда
		КонецЕсли;
	
	ИначеЕсли Организация = AMS_ВызовСервера.ОрганизацияАМСНовая() Тогда

		Если Имя = "Матрешкина" Тогда
			Лицо = "Пензова Л. С. (Приказ №1 от 19.05.2023 г.)";

		ИначеЕсли Имя = "Халимулина" Тогда

		ИначеЕсли Имя = "Пензова" Тогда
			Лицо = "Пензова Л. С. (Приказ №1 от 19.05.2023 г.)";

		ИначеЕсли Имя = "Логинова" Тогда
			Лицо = "Логинова Е. В. (Приказ №1 от 20.11.2024 г.)";

		ИначеЕсли Имя = "Иванова" Тогда
			Лицо = "Иванова С. Н. (Приказ №4 от 8.05.2020 г.)";
		КонецЕсли;
	КонецЕсли;

	Возврат Лицо;
КонецФункции

Функция ПолучитьРабочийДень(ПорядковыйНомер, ДатаНачала = Неопределено) Экспорт
	УстановитьПривилегированныйРежим(Истина);

	Если ДатаНачала = Неопределено Тогда
		ДатаНачала = НачалоДня(ТекущаяДатаСеанса());
	КонецЕсли;

	ПроизводственныйКалендарь = Справочники.Календари.НайтиПоНаименованию("Производственный календарь", Истина);

	Если ПорядковыйНомер = 0 Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Календарь", ПроизводственныйКалендарь);
		Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);

		Запрос.Текст =
		"ВЫБРАТЬ
		|	таб.ДатаГрафика КАК Дата
		|ИЗ
		|	РегистрСведений.КалендарныеГрафики КАК таб
		|ГДЕ
		|	таб.Календарь = &Календарь
		|	И таб.ДеньВключенВГрафик
		|	И таб.ДатаГрафика = &ДатаНачала";

		Результат = Запрос.Выполнить();

		Если Результат.Пустой() Тогда
			Возврат Неопределено;  //Это выходной день
		Иначе
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			Возврат Выборка.Дата;
		КонецЕсли;

	ИначеЕсли ПорядковыйНомер > 0 Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Календарь", ПроизводственныйКалендарь);
		Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);

		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ " + Строка(ПорядковыйНомер) +
		"
		|   таб.ДатаГрафика КАК Дата
		|ПОМЕСТИТЬ втРабДни
		|ИЗ
		|   РегистрСведений.КалендарныеГрафики КАК таб
		|ГДЕ
		|   таб.Календарь = &Календарь
		|   И таб.ДеньВключенВГрафик
		|   И таб.ДатаГрафика > &ДатаНачала
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|   МАКСИМУМ(Табл.Дата) КАК Дата
		|ИЗ
		|   втРабДни КАК Табл";

		Результат = Запрос.Выполнить();

		Если Результат.Пустой() Тогда
			Возврат Неопределено;
		Иначе
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			Возврат Выборка.Дата;
		КонецЕсли;

	ИначеЕсли ПорядковыйНомер < 0 Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Календарь", ПроизводственныйКалендарь);
		Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);

		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ " + Строка(-ПорядковыйНомер) +
		"
		|   таб.ДатаГрафика КАК Дата
		|ИЗ
		|   РегистрСведений.КалендарныеГрафики КАК таб
		|ГДЕ
		|   таб.Календарь = &Календарь
		|   И таб.ДеньВключенВГрафик
		|   И таб.ДатаГрафика < &ДатаНачала
		|
		|УПОРЯДОЧИТЬ ПО
		|   Дата УБЫВ";

		Результат = Запрос.Выполнить();

		Если Результат.Пустой() Тогда
			Возврат Неопределено;
		Иначе
			МассивДат = Результат.Выгрузить().ВыгрузитьКолонку("Дата");
			Возврат МассивДат[МассивДат.Количество() - 1];
		КонецЕсли;
	КонецЕсли;
КонецФункции

Функция ПолучитьСкладМатериаловВПроизводстве(Склад) Экспорт
	Если Склад = AMS_ВызовСервера.Цех1() Тогда
		Возврат AMS_ВызовСервера.Цех1_МатериалыВПроизводстве();
		
	ИначеЕсли Склад = AMS_ВызовСервера.Цех2() Тогда
		Возврат AMS_ВызовСервера.Цех2_МатериалыВПроизводстве();
		
	ИначеЕсли Склад = AMS_ВызовСервера.Цех3() Тогда
		Возврат AMS_ВызовСервера.Цех3_МатериалыВПроизводстве();
		
	ИначеЕсли Склад = AMS_ВызовСервера.Цех4() Тогда
		Возврат AMS_ВызовСервера.Цех4_МатериалыВПроизводстве();
	КонецЕсли;
КонецФункции
Функция ПолучитьМассивПартнеровДавальческих() Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сегмент", Справочники.СегментыПартнеров.ПолучитьСсылку(
		Новый УникальныйИдентификатор("fc6333b9-4ce3-11e1-81f8-001e67078c9d")));

	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПартнерыСегмента.Партнер
	|ИЗ
	|	РегистрСведений.ПартнерыСегмента КАК ПартнерыСегмента
	|ГДЕ
	|	ПартнерыСегмента.Сегмент = &Сегмент
	|	И НЕ ПартнерыСегмента.Партнер.ПометкаУдаления";

	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Партнер");
КонецФункции
Функция ПолучитьМатериалыВПереработку() Экспорт
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("СегментыНоменклатурыПреформы",
		Справочники.СегментыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("ee7f1b87-82db-4f6a-8521-e6c8b4d3c80f")));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НомСегмента.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрСведений.НоменклатураСегмента КАК НомСегмента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|		ПО НомСегмента.Номенклатура = Ном.Ссылка
	|ГДЕ
	|	НомСегмента.Сегмент = &СегментыНоменклатурыПреформы
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ном.Наименование";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура");
КонецФункции
Функция ПолучитьПродукциюПереработки() Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПродукцияПереработки", AMS_ВызовСервера.СегментыНоменклатурыПродукцияПереработки());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НомСегмента.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрСведений.НоменклатураСегмента КАК НомСегмента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|		ПО НомСегмента.Номенклатура = Ном.Ссылка
	|ГДЕ
	|	НомСегмента.Сегмент = &ПродукцияПереработки
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ном.Наименование";
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура");
КонецФункции

Функция ЭтоПервыйЛогистическийЛист(Дата, Ссылка) Экспорт
	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("Дата", Дата);

	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	т.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.AMS_ЛогистическийЛист КАК т
	|ГДЕ
	|	т.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	|
	|УПОРЯДОЧИТЬ ПО
	|	т.МоментВремени";

	Рез = Запрос.Выполнить();

	Если Рез.Пустой() Тогда
		Возврат Истина;
	Иначе
		Выб = Рез.Выбрать();
		Выб.Следующий();
		ПерваяСсылка = Выб.Ссылка;

		Если ПерваяСсылка = Ссылка Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
КонецФункции

#Область РеализацияТоваровУслуг

Процедура УстановитьСкладПолученияТовара(Объект) Экспорт
	УстановитьПривилегированныйРежим(Истина);

	Если ЗначениеЗаполнено(Объект.Партнер) Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Партнер", Объект.Партнер);
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Закупки.Склад
		|ИЗ
		|	РегистрНакопления.Закупки КАК Закупки
		|ГДЕ
		|	Закупки.Партнер = &Партнер";
		Результат = Запрос.Выполнить();

		Если Результат.Пустой() Тогда
			Объект.Склад = Справочники.Склады.ПустаяСсылка();

		Иначе
			Выборка = Результат.Выбрать();

			Если Выборка.Количество() = 1 Тогда
				Выборка.Следующий();
				Объект.Склад = Выборка.Склад;
			Иначе
				Объект.Склад = Справочники.Склады.ПолучитьСсылку(
					Новый УникальныйИдентификатор("1fe241fb-1785-11e2-8e90-001e67078c9d")); //Цеха
			КонецЕсли;
		КонецЕсли;

	Иначе
		Объект.Склад = Справочники.Склады.ПустаяСсылка();
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьДанныеИзБланкаЗаказа(Объект, Данные) Экспорт
	УстановитьПривилегированныйРежим(Истина);

	КодыИзExcel = Новый ТаблицаЗначений;
	КодыИзExcel.Колонки.Добавить("КодТовара", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(11)));
	КодыИзExcel.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));

	Для Каждого Стр Из Данные Цикл
		НовСтр = КодыИзExcel.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Стр);
	КонецЦикла;

	Партнер = Объект.Партнер;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Запрос.УстановитьПараметр("ТоварыИзДок", Объект.Товары.Выгрузить( , "Номенклатура,КоличествоУпаковок"));
	Запрос.УстановитьПараметр("КодыИзExcel", КодыИзExcel);
	Запрос.УстановитьПараметр("ВидЦен", Объект.Соглашение.ВидЦен);
	Запрос.УстановитьПараметр("Партнер", ?(ЗначениеЗаполнено(Партнер.Родитель), Партнер.Родитель, Партнер));
	Запрос.УстановитьПараметр("Соглашение", Объект.Соглашение);
	Запрос.УстановитьПараметр("ПорядокКлиента", Партнер._ПорядокКлиента);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.КоличествоУпаковок КАК Количество
	|ПОМЕСТИТЬ ТоварыИзДок
	|ИЗ
	|	&ТоварыИзДок КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.КодТовара КАК КодТовара,
	|	т.Количество КАК Количество
	|ПОМЕСТИТЬ коды
	|ИЗ
	|	&КодыИзExcel КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ном.Ссылка КАК Номенклатура,
	|	коды.Количество КАК Количество
	|ПОМЕСТИТЬ ТоварыИзExcel
	|ИЗ
	|	коды КАК коды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК ном
	|		ПО коды.КодТовара = ном.Код
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.Количество КАК Количество
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	ТоварыИзДок КАК т
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	т.Номенклатура,
	|	т.Количество
	|ИЗ
	|	ТоварыИзExcel КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	СУММА(т.Количество) КАК Количество
	|ПОМЕСТИТЬ тов
	|ИЗ
	|	вт КАК т
	|
	|СГРУППИРОВАТЬ ПО
	|	т.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тов.Номенклатура КАК Номенклатура,
	|	СпрНом._Упаковка КАК Упаковка,
	|	СпрНом.ЦеноваяГруппа КАК ЦеноваяГруппа,
	|	тов.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА &ПорядокКлиента
	|			ТОГДА НомКлиентов.ПорядковыйНомер
	|		ИНАЧЕ СпрНом.Наименование
	|	КОНЕЦ КАК Порядок,
	|	СпрНом.КоэффициентЕдиницыДляОтчетов КАК Кфц
	|ПОМЕСТИТЬ ном
	|ИЗ
	|	тов КАК тов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНом
	|		ПО тов.Номенклатура = СпрНом.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений._НоменклатураКлиентов КАК НомКлиентов
	|		ПО тов.Номенклатура = НомКлиентов.Номенклатура
	|			И (НомКлиентов.Партнер = &Партнер)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ном.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА СогТов.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА СогТов.Цена
	|		ИНАЧЕ СогТов.Цена / СогТов.Упаковка.Числитель
	|	КОНЕЦ КАК Цена,
	|	СогТов.ВидЦены КАК ВидЦены
	|ПОМЕСТИТЬ ЦенДоп
	|ИЗ
	|	ном КАК ном
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами.Товары КАК СогТов
	|		ПО ном.Номенклатура = СогТов.Номенклатура
	|ГДЕ
	|	СогТов.Ссылка = &Соглашение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ном.Номенклатура КАК Номенклатура,
	|	СогЦенГр.ВидЦен КАК ВидЦены
	|ПОМЕСТИТЬ ЦенГр
	|ИЗ
	|	ном КАК ном
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами.ЦеновыеГруппы КАК СогЦенГр
	|		ПО ном.ЦеноваяГруппа = СогЦенГр.ЦеноваяГруппа
	|ГДЕ
	|	СогЦенГр.Ссылка = &Соглашение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ном.Номенклатура КАК Номенклатура,
	|	ЦенДоп.Цена КАК Цена,
	|	ВЫБОР
	|		КОГДА ЦенДоп.ВидЦены ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ЦенГр.ВидЦены ЕСТЬ NULL
	|						ТОГДА &ВидЦен
	|					ИНАЧЕ ЦенГр.ВидЦены
	|				КОНЕЦ
	|		ИНАЧЕ ЦенДоп.ВидЦены
	|	КОНЕЦ КАК ВидЦены
	|ПОМЕСТИТЬ Цен
	|ИЗ
	|	ном КАК ном
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЦенДоп КАК ЦенДоп
	|		ПО ном.Номенклатура = ЦенДоп.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЦенГр КАК ЦенГр
	|		ПО ном.Номенклатура = ЦенГр.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Цен.Номенклатура КАК Номенклатура,
	|	Цен.ВидЦены КАК ВидЦены,
	|	ВЫБОР
	|		КОГДА Цен.ВидЦены = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|			ТОГДА Цен.Цена
	|		ИНАЧЕ ВЫБОР
	|				КОГДА СрезПоследних.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|					ТОГДА СрезПоследних.Цена
	|				ИНАЧЕ СрезПоследних.Цена / СрезПоследних.Упаковка.Числитель
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ цены
	|ИЗ
	|	Цен КАК Цен
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Дата, ) КАК СрезПоследних
	|		ПО Цен.Номенклатура = СрезПоследних.Номенклатура
	|			И Цен.ВидЦены = СрезПоследних.ВидЦены
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ном.Номенклатура КАК Номенклатура,
	|	ном.Упаковка КАК Упаковка,
	|	цены.ВидЦены КАК ВидЦены,
	|	цены.Цена * ном.Кфц КАК Цена,
	|	ном.Количество КАК КоличествоУпаковок,
	|	ном.Порядок КАК Порядок
	|ИЗ
	|	ном КАК ном
	|		ЛЕВОЕ СОЕДИНЕНИЕ цены КАК цены
	|		ПО ном.Номенклатура = цены.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок";

	Рез = Запрос.Выполнить();

	Если Рез.Пустой() Тогда
		Возврат Неопределено;

	Иначе
		Массив = Новый Массив;

		Табл = Рез.Выгрузить();
		Для Каждого Стр Из Табл Цикл
			Массив.Добавить(ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Стр));
		КонецЦикла;

		Возврат Массив;
	КонецЕсли;
КонецФункции

Функция ПолучитьРеализацияТовары(Док) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Номенклатура,
	|	СУММА(т.Количество) КАК Количество
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК т
	|ГДЕ
	|	т.Ссылка = &Док
	|СГРУППИРОВАТЬ ПО
	|	т.Номенклатура";
	Запрос.УстановитьПараметр("Док", Док);

	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

#КонецОбласти

#Область РегламентныеЗадания

#Область ВыгрузкаПродаж

Процедура ВыгрузкаПродаж() Экспорт
	ДанныеБазы = AMS_ВызовСервера.ПолучитьИмяБазы();
	
	Если Не (ДанныеБазы.ИмяБазы = "Trade_work" Или ДанныеБазы.ИмяБазы = "ams" Или ДанныеБазы.ИмяБазы = "ams1") Тогда 
		Возврат;
	КонецЕсли;

	ИмяКаталога = "H:\disk_z\unloading";
	Каталог = Новый Файл(ИмяКаталога);
	Если Не Каталог.Существует() Тогда
		ИмяКаталога = "H:\work";
		Каталог = Новый Файл(ИмяКаталога);
	КонецЕсли;
	
	ДатаВыгрузки = НачалоДня(ТекущаяДатаСеанса());
	
	ИмяФайла = ИмяКаталога + "\Выгрузка.xlsx";
	
	Макет = Обработки.AMS_Продажи.ПолучитьМакет("ВыгрузкаДанныхПродаж");

	Результат = ПолучитьРезультатВыгрузкиПродаж(Макет, ДатаВыгрузки);
	
	Поток = ФайловыеПотоки.ОткрытьДляЗаписи(ИмяФайла);
	Результат.Записать(Поток, ТипФайлаТабличногоДокумента.XLSX);
	Поток.Закрыть();
КонецПроцедуры

Функция ПолучитьРезультатВыгрузкиПродаж(Макет, ДатаОкончания)
	Результат = Новый ТабличныйДокумент;
	
	Пакет = ПолучитьПакетДанныхВыгрузкаПродаж(ДатаОкончания);
	
	ОблШапка   = Макет.ПолучитьОбласть("Шапка");
	ОблСтрока  = Макет.ПолучитьОбласть("Строка");
	ОблОстатки = Макет.ПолучитьОбласть("Остатки");
	ОблПланы   = Макет.ПолучитьОбласть("Планы");
	ОблОплата  = Макет.ПолучитьОбласть("Оплата");
	
	Результат.Вывести(ОблШапка); 
	
	Выб = Пакет.ПродажиЗаПериод.Выбрать();
	Пока Выб.Следующий() Цикл
		ОблСтрока.Параметры.Заполнить(Выб);
		Результат.Вывести(ОблСтрока); 
	КонецЦикла;
	
	Выб = Пакет.ИтогиПоМесяцам.Выбрать();
	Пока Выб.Следующий() Цикл
		ОблОстатки.Параметры.Заполнить(Выб);
		Результат.Вывести(ОблОстатки); 
	КонецЦикла;
	
	Выб = Пакет.ПланыПродаж.Выбрать();
	Пока Выб.Следующий() Цикл
		ОблПланы.Параметры.Заполнить(Выб);
		Результат.Вывести(ОблПланы); 
	КонецЦикла; 
	
	Рез = РезультатЗапросаВыгрузкаОплат();
	Выб = Рез.Выбрать();
	Пока Выб.Следующий() Цикл
		ОблОплата.Параметры.Заполнить(Выб);
		Результат.Вывести(ОблОплата); 
	КонецЦикла; 

	Возврат Результат;
КонецФункции

Функция ПолучитьПакетДанныхВыгрузкаПродаж(ДатаОкончания)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала", Дата(2024,1,1));
	Запрос.УстановитьПараметр("ДатаОкончания", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ВидыНоменклатурыПродукции", AMS_ВызовСервера.ВидыНоменклатурыПродукции());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(РегВыручка.Период, ДЕНЬ) КАК ДатаРеализации,
	|	РегВыручка.Регистратор КАК Регистратор,
	|	РегВыручка.АналитикаУчетаПоПартнерам.Партнер КАК Партнер,
	|	РегВыручка.АналитикаУчетаПоПартнерам.Контрагент КАК Контрагент,
	|	СпрНом.Ссылка КАК Номенклатура,
	|	РегВыручка.Склад КАК Склад,
	|	РегВыручка.Соглашение.ГрафикОплаты КАК ГрафикОплаты,
	|	РегВыручка.КоличествоОборот КАК Количество,
	|	РегВыручка.СуммаВыручкиОборот КАК Сумма,
	|	РегВыручка.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ВЫБОР
	|		КОГДА РегВыручка.Регистратор ССЫЛКА Документ.ОтчетКомиссионера
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Маркетплейс
	|ПОМЕСТИТЬ Рег
	|ИЗ
	|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(
	|			&ДатаНачала,
	|			,
	|			Регистратор,
	|			НЕ ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию)
	|				И ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)) КАК РегВыручка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНом
	|		ПО РегВыручка.АналитикаУчетаНоменклатуры.Номенклатура = СпрНом.Ссылка
	|ГДЕ
	|	СпрНом.ВидНоменклатуры В(&ВидыНоменклатурыПродукции)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ГрафикОплаты,
	|	Партнер,
	|	Контрагент,
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА Партн.Родитель = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|			ТОГДА Партн.Ссылка
	|		ИНАЧЕ Партн.Родитель
	|	КОНЕЦ КАК ГоловнойПартнер,
	|	ВЫБОР
	|		КОГДА Партн.Родитель = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|			ТОГДА Партн.Наименование
	|		ИНАЧЕ Партн.Родитель.Наименование
	|	КОНЕЦ КАК НаименованиеГП,
	|	Партн.Ссылка КАК Партнер,
	|	Партн.ГруппаДоступа КАК ГруппаДоступа,
	|	Партн.Наименование КАК НаименованиеП,
	|	Партн.AMS_СегментРынка КАК СегментРынка,
	|	Партн.ОсновнойМенеджер КАК ОсновнойМенеджер,
	|	МАКСИМУМ(Этапы.Сдвиг) КАК Отсрочка,
	|	Контр.Ссылка КАК Контрагент,
	|	Контр.ИНН КАК ИНН,
	|	Контр.Наименование КАК НаименованиеК
	|ПОМЕСТИТЬ Клиент
	|ИЗ
	|	Рег КАК Рег
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГрафикиОплаты.Этапы КАК Этапы
	|		ПО Рег.ГрафикОплаты = Этапы.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры КАК Партн
	|		ПО Рег.Партнер = Партн.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контр
	|		ПО Рег.Контрагент = Контр.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Партн.Ссылка,
	|	ВЫБОР
	|		КОГДА Партн.Родитель = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|			ТОГДА Партн.Ссылка
	|		ИНАЧЕ Партн.Родитель
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Партн.Родитель = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|			ТОГДА Партн.Наименование
	|		ИНАЧЕ Партн.Родитель.Наименование
	|	КОНЕЦ,
	|	Партн.Наименование,
	|	Партн.ОсновнойМенеджер,
	|	Контр.Ссылка,
	|	Контр.ИНН,
	|	Контр.Наименование,
	|	Партн.ГруппаДоступа,
	|	Партн.AMS_СегментРынка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НомДоп.Вид КАК ВидПродукции,
	|	НомДоп.Тип КАК ТипПродукции,
	|	НомДоп.Категория КАК Категория,
	|	Ном.Артикул КАК Артикул,
	|	НомДоп.Назначение КАК Назначение,
	|	Ном.Марка КАК Бренд,
	|	ВЫБОР
	|		КОГДА Штрих.Штрихкод ЕСТЬ NULL
	|			ТОГДА ШтрихКан.Штрихкод
	|		ИНАЧЕ Штрих.Штрихкод
	|	КОНЕЦ КАК Штрихкод,
	|	НомДоп.Статус КАК СтатусТовара,
	|	Рег.Номенклатура КАК Номенклатура,
	|	Ном.СрокГодности КАК СрокГодности,
	|	Ном.Наименование КАК Наименование
	|ПОМЕСТИТЬ Тов
	|ИЗ
	|	Рег КАК Рег
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|		ПО Рег.Номенклатура = Ном.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.AMS_РеквизитыНоменклатуры КАК НомДоп
	|		ПО Рег.Номенклатура = НомДоп.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК Штрих
	|		ПО Рег.Номенклатура = Штрих.Номенклатура
	|			И (Штрих.Упаковка.Числитель = 1)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений._ШтрихкодыКанистр КАК ШтрихКан
	|		ПО Рег.Номенклатура = ШтрихКан.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Рег.ДатаРеализации КАК ДатаРеализации,
	|	Рег.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(Приход.Ссылка) КАК ПриходИзЦеха,
	|	МАКСИМУМ(Приход.Ссылка.Дата) КАК Период
	|ПОМЕСТИТЬ ПриходДень
	|ИЗ
	|	Рег КАК Рег
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПрочееОприходованиеТоваров.Товары КАК Приход
	|		ПО Рег.Номенклатура = Приход.Номенклатура
	|			И (Приход.Ссылка.Дата <= Рег.ДатаРеализации)
	|ГДЕ
	|	Приход.Ссылка._ЭтапПроизводства = 2
	|
	|СГРУППИРОВАТЬ ПО
	|	Рег.ДатаРеализации,
	|	Рег.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриходДень.ДатаРеализации КАК ДатаРеализации,
	|	ПриходДень.ПриходИзЦеха КАК ПриходИзЦеха,
	|	ПриходДень.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(Приход.Цена / ПриходДень.Номенклатура.КоэффициентЕдиницыДляОтчетов) КАК Стоимость
	|ПОМЕСТИТЬ Цен
	|ИЗ
	|	ПриходДень КАК ПриходДень
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПрочееОприходованиеТоваров.Товары КАК Приход
	|		ПО ПриходДень.Номенклатура = Приход.Номенклатура
	|			И ПриходДень.Период = Приход.Ссылка.Дата
	|ГДЕ
	|	Приход.Ссылка._ЭтапПроизводства = 2
	|
	|СГРУППИРОВАТЬ ПО
	|	ПриходДень.ДатаРеализации,
	|	ПриходДень.Номенклатура,
	|	ПриходДень.ПриходИзЦеха
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Клиент.ГоловнойПартнер КАК ГоловнойПартнер,
	|	Клиент.Партнер КАК Партнер,
	|	Клиент.Контрагент КАК Контрагент,
	|	Клиент.ГруппаДоступа КАК ГруппаДоступа,
	|	Клиент.СегментРынка КАК СегментРынка,
	|	Клиент.ОсновнойМенеджер КАК ОсновнойМенеджер,
	|	Клиент.Отсрочка КАК Отсрочка,
	|	Клиент.ИНН КАК ИНН,
	|	Тов.ВидПродукции КАК ВидПродукции,
	|	Тов.ТипПродукции КАК ТипПродукции,
	|	Тов.Категория КАК Категория,
	|	Тов.Назначение КАК Назначение,
	|	Тов.Бренд КАК Бренд,
	|	Тов.СтатусТовара КАК СтатусТовара,
	|	Тов.Штрихкод КАК Штрихкод,
	|	Тов.Артикул КАК Артикул,
	|	Рег.Номенклатура КАК Номенклатура,
	|	Рег.ДатаРеализации КАК ДатаРеализации,
	|	Тов.СрокГодности КАК СрокГодности,
	|	СУММА(Рег.Количество) КАК ПроданоШт,
	|	СУММА(Рег.Сумма) КАК ПроданоРуб,
	|	МАКСИМУМ(Цен.Стоимость) КАК Стоимость,
	|	Рег.Склад КАК Склад,
	|	Рег.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Рег.Маркетплейс КАК Маркетплейс,
	|	Клиент.НаименованиеГП КАК НаименованиеГП,
	|	Клиент.НаименованиеП КАК НаименованиеП,
	|	Клиент.НаименованиеК КАК НаименованиеК,
	|	Тов.Наименование КАК Наименование
	|ПОМЕСТИТЬ Товар
	|ИЗ
	|	Рег КАК Рег
	|		ЛЕВОЕ СОЕДИНЕНИЕ Клиент КАК Клиент
	|		ПО Рег.Партнер = Клиент.Партнер
	|			И Рег.Контрагент = Клиент.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ Цен КАК Цен
	|		ПО Рег.Номенклатура = Цен.Номенклатура
	|			И Рег.ДатаРеализации = Цен.ДатаРеализации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Тов КАК Тов
	|		ПО Рег.Номенклатура = Тов.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	Клиент.ИНН,
	|	Клиент.ОсновнойМенеджер,
	|	Клиент.Партнер,
	|	Клиент.НаименованиеП,
	|	Рег.ДатаРеализации,
	|	Рег.Номенклатура,
	|	Клиент.ГоловнойПартнер,
	|	Клиент.Контрагент,
	|	Клиент.СегментРынка,
	|	Клиент.НаименованиеК,
	|	Клиент.НаименованиеГП,
	|	Клиент.Отсрочка,
	|	Тов.Наименование,
	|	Тов.ВидПродукции,
	|	Тов.ТипПродукции,
	|	Тов.Категория,
	|	Тов.Назначение,
	|	Тов.Бренд,
	|	Тов.СтатусТовара,
	|	Тов.Штрихкод,
	|	Тов.Артикул,
	|	Рег.Склад,
	|	Рег.АналитикаУчетаНоменклатуры,
	|	Рег.Маркетплейс,
	|	Клиент.ГруппаДоступа,
	|	Тов.СрокГодности
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товар.ГоловнойПартнер КАК ГоловнойПартнер,
	|	Товар.Партнер КАК Партнер,
	|	Товар.Контрагент КАК Контрагент,
	|	Товар.ГруппаДоступа КАК ГруппаДоступа,
	|	Товар.СегментРынка КАК СегментРынка,
	|	Товар.ОсновнойМенеджер КАК ОсновнойМенеджер,
	|	Товар.Отсрочка КАК Отсрочка,
	|	Товар.ИНН КАК ИНН,
	|	Товар.ВидПродукции КАК ВидПродукции,
	|	Товар.ТипПродукции КАК ТипПродукции,
	|	Товар.Категория КАК Категория,
	|	Товар.Назначение КАК Назначение,
	|	Товар.Бренд КАК Бренд,
	|	Товар.СтатусТовара КАК СтатусТовара,
	|	Товар.Штрихкод КАК Штрихкод,
	|	Товар.Артикул КАК Артикул,
	|	Товар.Номенклатура КАК Номенклатура,
	|	Товар.ДатаРеализации КАК ДатаРеализации,
	|	Товар.ПроданоШт КАК ПроданоШт,
	|	Товар.ПроданоРуб КАК ПроданоРуб,
	|	ВЫРАЗИТЬ(Товар.Стоимость * Товар.ПроданоШт КАК ЧИСЛО(10, 2)) КАК Стоимость,
	|	Товар.Склад КАК Склад,
	|	Товар.НаименованиеГП КАК НаименованиеГП,
	|	Товар.НаименованиеП КАК НаименованиеП,
	|	Товар.НаименованиеК КАК НаименованиеК,
	|	Товар.Наименование КАК Наименование
	|ИЗ
	|	Товар КАК Товар
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаРеализации,
	|	НаименованиеГП,
	|	НаименованиеП,
	|	НаименованиеК,
	|	Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Товар.ВидПродукции КАК ВидПродукции,
	|	Товар.ТипПродукции КАК ТипПродукции,
	|	Товар.Категория КАК Категория,
	|	Товар.Назначение КАК Назначение,
	|	Товар.Бренд КАК Бренд,
	|	Товар.СтатусТовара КАК СтатусТовара,
	|	Товар.Штрихкод КАК Штрихкод,
	|	Товар.Артикул КАК Артикул,
	|	Товар.Номенклатура КАК Номенклатура,
	|	Товар.СрокГодности КАК СрокГодности,
	|	Товар.Склад КАК Склад,
	|	Товар.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Товар.Наименование КАК Наименование
	|ПОМЕСТИТЬ НомТ
	|ИЗ
	|	Товар КАК Товар
	|ГДЕ
	|	НЕ Товар.Маркетплейс
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НомТ.ВидПродукции КАК ВидПродукции,
	|	НомТ.ТипПродукции КАК ТипПродукции,
	|	НомТ.Категория КАК Категория,
	|	НомТ.Назначение КАК Назначение,
	|	НомТ.Бренд КАК Бренд,
	|	НомТ.СтатусТовара КАК СтатусТовара,
	|	НомТ.Штрихкод КАК Штрихкод,
	|	НомТ.Артикул КАК Артикул,
	|	НомТ.Номенклатура КАК Номенклатура,
	|	ДОБАВИТЬКДАТЕ(РегТов.Серия.ГоденДо, МЕСЯЦ, -НомТ.СрокГодности) КАК ДатаПроизводства,
	|	РегТов.Серия.ГоденДо КАК Серия,
	|	КОНЕЦПЕРИОДА(РегТов.Период, МЕСЯЦ) КАК КонецМесяца,
	|	ЕСТЬNULL(РегТов.ВНаличииКонечныйОстаток, 0) КАК ОстатокШт,
	|	РегТов.Склад КАК Склад,
	|	НомТ.Наименование КАК Наименование
	|ПОМЕСТИТЬ ОстТ
	|ИЗ
	|	НомТ КАК НомТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.ОстаткиИОбороты(
	|				&ДатаНачала,
	|				&ДатаОкончания,
	|				Месяц,
	|				,
	|				Номенклатура В
	|					(ВЫБРАТЬ
	|						т.Номенклатура КАК Номенклатура
	|					ИЗ
	|						НомТ КАК т)) КАК РегТов
	|		ПО НомТ.Номенклатура = РегТов.Номенклатура
	|			И НомТ.Склад = РегТов.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Товар.ВидПродукции КАК ВидПродукции,
	|	Товар.ТипПродукции КАК ТипПродукции,
	|	Товар.Категория КАК Категория,
	|	Товар.Назначение КАК Назначение,
	|	Товар.Бренд КАК Бренд,
	|	Товар.СтатусТовара КАК СтатусТовара,
	|	Товар.Штрихкод КАК Штрихкод,
	|	Товар.Артикул КАК Артикул,
	|	Товар.Номенклатура КАК Номенклатура,
	|	Товар.Склад КАК Склад,
	|	Товар.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Товар.Наименование КАК Наименование
	|ПОМЕСТИТЬ НомМ
	|ИЗ
	|	Товар КАК Товар
	|ГДЕ
	|	Товар.Маркетплейс
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	АналитикаУчетаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НомМ.ВидПродукции КАК ВидПродукции,
	|	НомМ.ТипПродукции КАК ТипПродукции,
	|	НомМ.Категория КАК Категория,
	|	НомМ.Назначение КАК Назначение,
	|	НомМ.Бренд КАК Бренд,
	|	НомМ.СтатусТовара КАК СтатусТовара,
	|	НомМ.Штрихкод КАК Штрихкод,
	|	НомМ.Артикул КАК Артикул,
	|	НомМ.Номенклатура КАК Номенклатура,
	|	КОНЕЦПЕРИОДА(РегТовОрг.Период, МЕСЯЦ) КАК КонецМесяца,
	|	ЕСТЬNULL(РегТовОрг.КоличествоКонечныйОстаток, 0) КАК ОстатокШт,
	|	НомМ.Склад КАК Склад,
	|	НомМ.Наименование КАК Наименование
	|ПОМЕСТИТЬ ОстМ
	|ИЗ
	|	НомМ КАК НомМ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыОрганизаций.ОстаткиИОбороты(
	|				&ДатаНачала,
	|				&ДатаОкончания,
	|				Месяц,
	|				,
	|				АналитикаУчетаНоменклатуры В
	|					(ВЫБРАТЬ
	|						НомМ.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры
	|					ИЗ
	|						НомМ КАК НомМ)) КАК РегТовОрг
	|		ПО НомМ.АналитикаУчетаНоменклатуры = РегТовОрг.АналитикаУчетаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстТ.ВидПродукции КАК ВидПродукции,
	|	ОстТ.ТипПродукции КАК ТипПродукции,
	|	ОстТ.Категория КАК Категория,
	|	ОстТ.Назначение КАК Назначение,
	|	ОстТ.Бренд КАК Бренд,
	|	ОстТ.СтатусТовара КАК СтатусТовара,
	|	ОстТ.Штрихкод КАК Штрихкод,
	|	ОстТ.Артикул КАК Артикул,
	|	ОстТ.Номенклатура КАК Номенклатура,
	|	ОстТ.КонецМесяца КАК КонецМесяца,
	|	ОстТ.ОстатокШт КАК ОстатокШт,
	|	ОстТ.Склад КАК Склад,
	|	ОстТ.ДатаПроизводства КАК ДатаПроизводства,
	|	ОстТ.Серия КАК Серия,
	|	ОстТ.Склад.Наименование КАК СкладНаименование,
	|	ОстТ.Наименование КАК Наименование
	|ПОМЕСТИТЬ Ост
	|ИЗ
	|	ОстТ КАК ОстТ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстМ.ВидПродукции,
	|	ОстМ.ТипПродукции,
	|	ОстМ.Категория,
	|	ОстМ.Назначение,
	|	ОстМ.Бренд,
	|	ОстМ.СтатусТовара,
	|	ОстМ.Штрихкод,
	|	ОстМ.Артикул,
	|	ОстМ.Номенклатура,
	|	ОстМ.КонецМесяца,
	|	ОстМ.ОстатокШт,
	|	ОстМ.Склад,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ОстМ.Склад.Наименование,
	|	ОстМ.Наименование
	|ИЗ
	|	ОстМ КАК ОстМ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ост.КонецМесяца КАК КонецМесяца,
	|	Ост.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(Приход.Ссылка.Дата) КАК Период,
	|	МАКСИМУМ(Приход.Ссылка) КАК ПриходИзЦеха
	|ПОМЕСТИТЬ ПриходМесяц
	|ИЗ
	|	Ост КАК Ост
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПрочееОприходованиеТоваров.Товары КАК Приход
	|		ПО Ост.Номенклатура = Приход.Номенклатура
	|			И (Приход.Ссылка.Дата <= Ост.КонецМесяца)
	|ГДЕ
	|	Приход.Ссылка._ЭтапПроизводства = 2
	|
	|СГРУППИРОВАТЬ ПО
	|	Ост.КонецМесяца,
	|	Ост.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриходМесяц.КонецМесяца КАК КонецМесяца,
	|	ПриходМесяц.ПриходИзЦеха КАК ПриходИзЦеха,
	|	ПриходМесяц.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(Приход.Цена / ПриходМесяц.Номенклатура.КоэффициентЕдиницыДляОтчетов) КАК Стоимость
	|ПОМЕСТИТЬ ЦенМ
	|ИЗ
	|	ПриходМесяц КАК ПриходМесяц
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПрочееОприходованиеТоваров.Товары КАК Приход
	|		ПО ПриходМесяц.Номенклатура = Приход.Номенклатура
	|			И ПриходМесяц.Период = Приход.Ссылка.Дата
	|ГДЕ
	|	Приход.Ссылка._ЭтапПроизводства = 2
	|
	|СГРУППИРОВАТЬ ПО
	|	ПриходМесяц.КонецМесяца,
	|	ПриходМесяц.Номенклатура,
	|	ПриходМесяц.ПриходИзЦеха
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ост.ВидПродукции КАК ВидПродукции,
	|	Ост.ТипПродукции КАК ТипПродукции,
	|	Ост.Категория КАК Категория,
	|	Ост.Назначение КАК Назначение,
	|	Ост.Бренд КАК Бренд,
	|	Ост.СтатусТовара КАК СтатусТовара,
	|	Ост.Штрихкод КАК Штрихкод,
	|	Ост.Артикул КАК Артикул,
	|	Ост.Номенклатура КАК Номенклатура,
	|	Ост.КонецМесяца КАК КонецМесяца,
	|	ВЫРАЗИТЬ(ЦенМ.Стоимость КАК ЧИСЛО(10, 2)) КАК Стоимость,
	|	Ост.ОстатокШт КАК ОстатокШт,
	|	ВЫБОР
	|		КОГДА ЦенМ.Стоимость = 0
	|				ИЛИ Ост.ОстатокШт = 0
	|			ТОГДА 0
	|		ИНАЧЕ ЦенМ.Стоимость * Ост.ОстатокШт
	|	КОНЕЦ КАК ОстатокРуб,
	|	Ост.Склад КАК Склад,
	|	Ост.ДатаПроизводства КАК ДатаПроизводства,
	|	Ост.Серия КАК Серия,
	|	Ост.СкладНаименование КАК СкладНаименование,
	|	Ост.Наименование КАК Наименование
	|ПОМЕСТИТЬ ТоварМ
	|ИЗ
	|	Ост КАК Ост
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЦенМ КАК ЦенМ
	|		ПО Ост.Номенклатура = ЦенМ.Номенклатура
	|			И Ост.КонецМесяца = ЦенМ.КонецМесяца
	|ГДЕ
	|	Ост.ОстатокШт > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварМ.ВидПродукции КАК ВидПродукции,
	|	ТоварМ.ТипПродукции КАК ТипПродукции,
	|	ТоварМ.Категория КАК Категория,
	|	ТоварМ.Назначение КАК Назначение,
	|	ТоварМ.Бренд КАК Бренд,
	|	ТоварМ.СтатусТовара КАК СтатусТовара,
	|	ТоварМ.Штрихкод КАК Штрихкод,
	|	ТоварМ.Артикул КАК Артикул,
	|	ТоварМ.Номенклатура КАК Номенклатура,
	|	ТоварМ.КонецМесяца КАК КонецМесяца,
	|	ТоварМ.Стоимость КАК Стоимость,
	|	ТоварМ.ОстатокШт КАК ОстатокШт,
	|	ТоварМ.ОстатокРуб КАК ОстатокРуб,
	|	ТоварМ.Склад КАК Склад,
	|	ТоварМ.ДатаПроизводства КАК ДатаПроизводства,
	|	ТоварМ.Серия КАК Серия,
	|	ТоварМ.СкладНаименование КАК СкладНаименование,
	|	ТоварМ.Наименование КАК Наименование
	|ИЗ
	|	ТоварМ КАК ТоварМ
	|
	|УПОРЯДОЧИТЬ ПО
	|	СкладНаименование,
	|	Наименование,
	|	КонецМесяца
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Партнер КАК ГоловнойПартнер,
	|	т.СегментРынка КАК СегментРынка,
	|	т.ГруппаДоступа КАК ГруппаДоступа,
	|	т.Менеджер КАК ОсновнойМенеджер,
	|	т.Дата КАК ДатаРеализации,
	|	т.Сумма КАК ПланПродажРуб
	|ИЗ
	|	РегистрСведений.AMS_ПланыПродаж КАК т
	|ГДЕ
	|	т.Дата МЕЖДУ &ДатаНачала И КОНЕЦПЕРИОДА(&ДатаОкончания, МЕСЯЦ)
	|
	|УПОРЯДОЧИТЬ ПО
	|	т.Менеджер.Наименование,
	|	ДатаРеализации,
	|	т.Партнер.Наименование";
	
	Пакет = Запрос.ВыполнитьПакет();
	
	Возврат Новый Структура("ПродажиЗаПериод, ИтогиПоМесяцам, ПланыПродаж", Пакет[6], Пакет[15], Пакет[16]); 
КонецФункции

Функция РезультатЗапросаВыгрузкаОплат()
	СКД = Обработки.AMS_Продажи.ПолучитьМакет("скдВыгрузкаОплат");

	Табл = Новый ТаблицаЗначений();

	Организации = Новый Массив();
	Организации.Добавить(AMS_ВызовСервера.ОрганизацияКемикал());
	Организации.Добавить(AMS_ВызовСервера.ОрганизацияТрейд());
	Организации.Добавить(AMS_ВызовСервера.ОрганизацияТД());

	Парам = Новый Структура;
	Парам.Вставить("Организации", Организации);

	Данные = Новый Структура;
	Данные.Вставить("СКД", СКД);
	Данные.Вставить("Результат", Табл);
	Данные.Вставить("Параметры", Парам);

	AMS_ВызовСервера.ВыполнитьСКД(Данные);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Табл", Табл);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Табл.Дата КАК Дата,
		|	Табл.Заказ КАК Заказ,
		|	Табл.ГоловнойПартнер КАК ГоловнойПартнер,
		|	Табл.ДолгУвеличение КАК ДолгУвеличение,
		|	Табл.ДолгУменьшение КАК ДолгУменьшение,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(Табл.Заказ) В (ТИП(Документ.РеализацияТоваровУслуг), ТИП(Документ.ОтчетКомиссионера),
		|			ТИП(Документ.АктВыполненныхРабот))
		|			ТОГДА 1
		|		ИНАЧЕ 2
		|	КОНЕЦ КАК ТипДок
		|ПОМЕСТИТЬ Таб
		|ИЗ
		|	&Табл КАК Табл
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(Табл.Заказ) В (ТИП(Документ.РеализацияТоваровУслуг), ТИП(Документ.ОтчетКомиссионера),
		|		ТИП(Документ.АктВыполненныхРабот), ТИП(Документ.ПоступлениеБезналичныхДенежныхСредств),
		|		ТИП(Документ.ПриходныйКассовыйОрдер))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Таб.Заказ КАК Заказ,
		|	МАКСИМУМ(ЕСТЬNULL(ЭтапыРеал.ДатаПлатежа, ЕСТЬNULL(ЭтапыОтчет.ДатаПлатежа, ЭтапыАкт.ДатаПлатежа))) КАК ДатаПлатежа
		|ПОМЕСТИТЬ Оплаты
		|ИЗ
		|	Таб КАК Таб
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АктВыполненныхРабот.ЭтапыГрафикаОплаты КАК ЭтапыАкт
		|		ПО Таб.Заказ = ЭтапыАкт.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионера.ЭтапыГрафикаОплаты КАК ЭтапыОтчет
		|		ПО Таб.Заказ = ЭтапыОтчет.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.ЭтапыГрафикаОплаты КАК ЭтапыРеал
		|		ПО Таб.Заказ = ЭтапыРеал.Ссылка
		|ГДЕ
		|	Таб.Заказ В
		|		(ВЫБРАТЬ
		|			т.Заказ КАК Заказ
		|		ИЗ
		|			Таб КАК т
		|		ГДЕ
		|			т.ТипДок = 1)
		|СГРУППИРОВАТЬ ПО
		|	Таб.Заказ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Таб.Дата КАК Дата,
		|	Таб.Заказ КАК Заказ,
		|	Таб.ГоловнойПартнер КАК ГоловнойПартнер,
		|	Партнеры.ОсновнойМенеджер КАК ОсновнойМенеджер,
		|	ВЫБОР
		|		КОГДА Оплаты.ДатаПлатежа ЕСТЬ NULL
		|		ИЛИ Оплаты.ДатаПлатежа = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА Таб.Дата
		|		ИНАЧЕ Оплаты.ДатаПлатежа
		|	КОНЕЦ КАК ДатаПлатежа,
		|	ВЫБОР
		|		КОГДА Таб.ТипДок = 1
		|			ТОГДА Таб.ДолгУвеличение
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Всего,
		|	ВЫБОР
		|		КОГДА Таб.ТипДок = 1
		|			ТОГДА Таб.ДолгУменьшение
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Оплачено,
		|	ВЫБОР
		|		КОГДА Таб.ТипДок = 2
		|			ТОГДА Таб.ДолгУменьшение
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ПриходДС,
		|	Партнеры.Наименование КАК Наименование,
		|	Таб.ТипДок КАК ТипДок,
		|	Партнеры.ГруппаДоступа КАК ГруппаДоступа,
		|	Партнеры.AMS_СегментРынка КАК СегментРынка
		|ИЗ
		|	Таб КАК Таб
		|		ЛЕВОЕ СОЕДИНЕНИЕ Оплаты КАК Оплаты
		|		ПО Таб.Заказ = Оплаты.Заказ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры КАК Партнеры
		|		ПО Таб.ГоловнойПартнер = Партнеры.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТипДок,
		|	Наименование,
		|	Дата";
	
	Возврат Запрос.Выполнить(); 
КонецФункции

#КонецОбласти

#Область ЗакрытиеСтарыхПартнеров

Процедура ЗакрытьСтарыхПартнеров() Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	т.Ссылка КАК Партнер,
		|	т.Клиент КАК Клиент,
		|	т.Поставщик КАК Поставщик,
		|	т.ПрочиеОтношения КАК ПрочиеОтношения,
		|	т.Перевозчик КАК Перевозчик,
		|	т._Закрыт КАК Закрыт,
		|	т.ДатаРегистрации КАК ДатаРегистрации
		|ПОМЕСТИТЬ ВсеПарт
		|ИЗ
		|	Справочник.Партнеры КАК т
		|ГДЕ
		|	НЕ т.Предопределенный
		|	И т.ДатаРегистрации < ДОБАВИТЬКДАТЕ(&Дата, ГОД, -1)
		|	И НЕ т._Закрыт
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	т.Партнер КАК Партнер,
		|	МАКСИМУМ(т.ДатаДокументаИБ) КАК ДатаПоследнегоДокумента
		|ПОМЕСТИТЬ ДокПарт
		|ИЗ
		|	РегистрСведений.РеестрДокументов КАК т
		|ГДЕ
		|	т.ДатаДокументаИБ > ДОБАВИТЬКДАТЕ(&Дата, ГОД, -1)
		|	И т.Партнер В
		|		(ВЫБРАТЬ
		|			т.Партнер КАК Партнер
		|		ИЗ
		|			ВсеПарт КАК т)
		|СГРУППИРОВАТЬ ПО
		|	т.Партнер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВсеПарт.Партнер КАК Партнер,
		|	ВсеПарт.Клиент КАК Клиент,
		|	ВсеПарт.Поставщик КАК Поставщик,
		|	ВсеПарт.ПрочиеОтношения КАК ПрочиеОтношения,
		|	ВсеПарт.Перевозчик КАК Перевозчик,
		|	ВсеПарт.Закрыт КАК Закрыт,
		|	ВсеПарт.ДатаРегистрации КАК ДатаРегистрации
		|ИЗ
		|	ВсеПарт КАК ВсеПарт
		|ГДЕ
		|	НЕ ВсеПарт.Партнер В
		|		(ВЫБРАТЬ
		|			ДокПарт.Партнер КАК Партнер
		|		ИЗ
		|			ДокПарт КАК ДокПарт)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаРегистрации";
	
	Рез = Запрос.Выполнить();
	Выб = Рез.Выбрать();
	
	Пока Выб.Следующий() Цикл
		Партнер = Выб.Партнер.ПолучитьОбъект();
		Партнер._Закрыт = Истина;
		Партнер.Записать();
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область Печать

Процедура ДобавитьКомандыПечати(КомандыПечати, ИмяМакета) Экспорт
	Если ИмяМакета = "СличительнаяВедомость" Тогда
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати = "Обработка.AMS_Продажи";
		КомандаПечати.Идентификатор = ИмяМакета;
		КомандаПечати.Представление = НСтр("ru = 'Сличительная ведомость (АМС)'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункцииПереопределяемый

//@skip-check method-too-many-params
//@skip-check doc-comment-parameter-section
Процедура AMSУстановитьДействиеФормы(Форма, ИмяСобытия = "", ИмяЭлементаФормы = "", ЛиИсключительное = Ложь, ПсевдонимЭлементаФормы = "") Экспорт
    
    Если ИмяЭлементаФормы <> "" Тогда
        МассивФрагментов = AMSПолучитьМассивИзСтрокиСРазделителем(ИмяЭлементаФормы);
        ИмяЭлементаФормы = МассивФрагментов[0];
        Объект = Форма.ЭлементыФормы[ИмяЭлементаФормы];
        
        Если МассивФрагментов.Количество() > 1 Тогда 
            ИмяЭлементаФормы = ИмяЭлементаФормы + МассивФрагментов[1];
            
            Если ТипЗнч(Объект) = Тип("ТабличноеПоле") Тогда 
                //@skip-check bsl-legacy-check-dynamic-feature-access
                Объект = Объект.Колонки[МассивФрагментов[1]].ЭлементУправления;
            ИначеЕсли ТипЗнч(Объект) = Тип("КоманднаяПанель") Тогда 
                //@skip-check bsl-legacy-check-dynamic-feature-access
                Объект = Объект.Кнопки[МассивФрагментов[1]];                
            КонецЕсли;
        КонецЕсли;
    Иначе
        Объект = Форма;
        ИмяЭлементаФормы = "";
    КонецЕсли;
    
    ТекстМаркера = "рСтарыеОбработчики";
    Если Форма.ЭлементыФормы.Найти(ТекстМаркера) = Неопределено Тогда
        Форма.ЭлементыФормы.Добавить(Тип("ПолеВвода"), ТекстМаркера, Ложь);
    КонецЕсли;
    
    Если ПсевдонимЭлементаФормы <> "" Тогда 
        ПолноеИмяСобытия = ПсевдонимЭлементаФормы + ИмяСобытия;
    Иначе
        ПолноеИмяСобытия = ИмяЭлементаФормы       + ИмяСобытия;
    КонецЕсли;
    
    Если ТипЗнч(Объект) = Тип("КнопкаКоманднойПанели") Тогда
        //@skip-check bsl-legacy-check-dynamic-feature-access
        СтароеДействие = Объект.Действие;
    Иначе
        СтароеДействие = Объект.ПолучитьДействие(ИмяСобытия);
    КонецЕсли;
    
    Если ЛиИсключительное и СтароеДействие <> Неопределено Тогда 
        //@skip-check use-non-recommended-method
        Сообщить("Конфликт обработчиков события """ + ИмяСобытия + """ объекта """ + Строка(Объект) + """",
                 СтатусСообщения.Важное);
    КонецЕсли;
	
	НовоеДействие = "AMS" + ПолноеИмяСобытия;
	
	 //Для отладки здесь следует отключать попытку. Она используется для назначения унифицированных обработчиков,
	 //наличие которых не является обязательным.
	Попытка
	    Если ТипЗнч(Объект) = Тип("КнопкаКоманднойПанели") Тогда
	        Объект.Действие = НовоеДействие;
	    Иначе
	        Объект.УстановитьДействие(ИмяСобытия, НовоеДействие);
	    КонецЕсли;
	Исключение
	    Возврат;
	КонецПопытки;
    
    СписокСоответствияОбработчиков = Форма.ЭлементыФормы.рСтарыеОбработчики.СписокВыбора;
    СписокСоответствияОбработчиков.Добавить(ИмяЭлементаФормы + "." + ИмяСобытия, СтароеДействие);
КонецПроцедуры

Функция AMSПолучитьАргументыДействияФормы(Объект, ИмяСобытия = "")

    Аргументы = "";
    Если ТипЗнч(Объект) = Тип("КнопкаКоманднойПанели") Тогда
        // Это действие кнопки командной панели формы
        Аргументы = "(Кнопка)";        
    
    ИначеЕсли ТипЗнч(Объект) = Тип("Форма") Тогда
        // Это событие формы
        Попытка
            ОбъектОсновнойРеквизитФормы = Объект.ЭтотОбъект;
        Исключение
            ОбъектОсновнойРеквизитФормы = Неопределено;
        КонецПопытки;
        
        Если Аргументы = "" Тогда 
            Если      ИмяСобытия = "ВнешнееСобытие" Тогда 
                Аргументы = "(Источник, Событие, Данные)";
            ИначеЕсли ИмяСобытия = "ОбработкаАктивизацииОбъекта" Тогда 
                Аргументы = "(АктивныйОбъект, Источник)";
            ИначеЕсли ИмяСобытия = "ОбработкаВыбора" Тогда 
                Аргументы = "(ЗначениеВыбора, Источник)";
            ИначеЕсли ИмяСобытия = "ОбработкаЗаписиНовогоОбъекта" Тогда 
                Аргументы = "(Объект, Источник)";
            ИначеЕсли ИмяСобытия = "ОбработкаОповещения" Тогда 
                Аргументы = "(ИмяСобытия, Параметр, Источник)";
            ИначеЕсли ИмяСобытия = "ПередЗакрытием" Тогда 
                Аргументы = "(Отказ, СтандартнаяОбработка)";
            ИначеЕсли ИмяСобытия = "ПередЗаписью" Тогда 
                Если AMSПолучитьКорневойТипКонфигурации(ОбъектОсновнойРеквизитФормы) = "Документ" Тогда
                    Аргументы = "(Отказ, РежимЗаписи, РежимПроведения)";
                Иначе
                    Аргументы = "(Отказ)";
                КонецЕсли;
            ИначеЕсли ИмяСобытия = "ПередОткрытием" Тогда 
                Аргументы = "(Отказ, СтандартнаяОбработка)";
            ИначеЕсли ИмяСобытия = "ПриЗаписи" Тогда 
                Аргументы = "(Отказ)";
            ИначеЕсли ИмяСобытия = "ПриПовторномОткрытии" Тогда 
                Аргументы = "(СтандартнаяОбработка)";
            Иначе
                Аргументы = "()";
            КонецЕсли;
        КонецЕсли;        
    

    Иначе
        // Это событие элемента формы
        Если ТипЗнч(Объект) = Тип("ТабличноеПоле") Тогда
            Если      ИмяСобытия = "Выбор" Тогда 
                Аргументы = "(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)";
            ИначеЕсли ИмяСобытия = "Перетаскивание" Тогда 
                Аргументы = "(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Колонка)";
            ИначеЕсли ИмяСобытия = "ПроверкаПеретаскивания" Тогда 
                Аргументы = "(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Колонка)";
            КонецЕсли;
        
        ИначеЕсли ТипЗнч(Объект) = Тип("ТабличныйДокумент") Тогда
            Если      ИмяСобытия = "Выбор" Тогда 
                Аргументы = "(Элемент, Область, СтандартнаяОбработка)";
            ИначеЕсли ИмяСобытия = "Перетаскивание" Тогда 
                Аргументы = "(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Область)";
            ИначеЕсли ИмяСобытия = "ПроверкаПеретаскивания" Тогда 
                Аргументы = "(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Область)";
            КонецЕсли;
        КонецЕсли;
        Если Аргументы = "" Тогда 
            Если      ИмяСобытия = "АвтоПодборТекста" Тогда 
                Аргументы = "(Элемент, Текст, ТекстАвтоПодбора, СтандартнаяОбработка)";
            ИначеЕсли ИмяСобытия = "НачалоВыбора" Тогда 
                Аргументы = "(Элемент, СтандартнаяОбработка)";
            ИначеЕсли ИмяСобытия = "НачалоПеретаскивания" Тогда 
                Аргументы = "(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)";
            ИначеЕсли ИмяСобытия = "ОбработкаВыбора" Тогда 
                Аргументы = "(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)";
            ИначеЕсли ИмяСобытия = "ОбработкаЗаписиНовогоОбъекта" Тогда 
                Аргументы = "(Элемент, Объект, СтандартнаяОбработка)";
            ИначеЕсли ИмяСобытия = "ОбработкаРасшифровки" Тогда 
                Аргументы = "(Элемент, Расшифровка, СтандартнаяОбработка)";
            ИначеЕсли ИмяСобытия = "ОкончаниеВводаТекста" Тогда 
                Аргументы = "(Элемент, Текст, Значение, СтандартнаяОбработка)";
            ИначеЕсли ИмяСобытия = "ОкончаниеПеретаскивания" Тогда 
                Аргументы = "(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)";
            ИначеЕсли ИмяСобытия = "Открытие" Тогда 
                Аргументы = "(Элемент, СтандартнаяОбработка)";
            ИначеЕсли ИмяСобытия = "Очистка" Тогда 
                Аргументы = "(Элемент, СтандартнаяОбработка)";
            ИначеЕсли ИмяСобытия = "ПередНачаломДобавления" Тогда 
                Аргументы = "(Элемент, Отказ, Копирование)";
            ИначеЕсли ИмяСобытия = "ПередНачаломИзменения" Тогда 
                Аргументы = "(Элемент, Отказ)";
            ИначеЕсли ИмяСобытия = "ПередОкончаниемРедактирования" Тогда 
                Аргументы = "(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)";
            ИначеЕсли ИмяСобытия = "ПередУдалением" Тогда 
                Аргументы = "(Элемент, Отказ)";
            ИначеЕсли ИмяСобытия = "ПриВыводеСтроки" Тогда 
                Аргументы = "(Элемент, ОформлениеСтроки, ДанныеСтроки)";
            ИначеЕсли ИмяСобытия = "ПриИзмененииСодержимогоОбласти" Тогда 
                Аргументы = "(Элемент, Область)";
            ИначеЕсли ИмяСобытия = "ПриНачалеРедактирования" Тогда 
                Аргументы = "(Элемент, НоваяСтрока, Копирование)";
            ИначеЕсли ИмяСобытия = "ПриОкончанииРедактирования" Тогда 
                Аргументы = "(Элемент, НоваяСтрока, ОтменаРедактирования)";
            ИначеЕсли ИмяСобытия = "ПриОкончанииРедактированияИнтервала" Тогда 
                Аргументы = "(Элемент, Интервал, Отмена)";
            ИначеЕсли ИмяСобытия = "ПриПолученииДанных" Тогда 
                Аргументы = "(Элемент, ОформленияСтрок)";
            ИначеЕсли ИмяСобытия = "ПриСменеСтраницы" Тогда 
                Аргументы = "(Элемент, ТекущаяСтраница)";
            ИначеЕсли ИмяСобытия = "Регулирование" Тогда 
                Аргументы = "(Элемент, Направление, СтандартнаяОбработка)";
            Иначе
                Аргументы = "(Элемент)";
            КонецЕсли;
        КонецЕсли;
    КонецЕсли;
	
	Возврат Аргументы + ";";
КонецФункции

Функция AMSПолучитьСтароеДействиеФормы(Форма, ИмяСобытия = "", ИмяЭлементаФормы = "") Экспорт
    Если ИмяЭлементаФормы <> "" Тогда 
        МассивФрагментов = AMSПолучитьМассивИзСтрокиСРазделителем(ИмяЭлементаФормы);
        ИмяЭлементаФормы = МассивФрагментов[0];
        Объект = Форма.ЭлементыФормы[ИмяЭлементаФормы];
        
        Если МассивФрагментов.Количество() > 1 Тогда 
            ИмяЭлементаФормы = ИмяЭлементаФормы + МассивФрагментов[1];
            Если ТипЗнч(Объект) = Тип("ТабличноеПоле") Тогда 
                //@skip-check bsl-legacy-check-dynamic-feature-access
                Объект = Объект.Колонки[МассивФрагментов[1]].ЭлементУправления;
            ИначеЕсли ТипЗнч(Объект) = Тип("КоманднаяПанель") Тогда 
                //@skip-check bsl-legacy-check-dynamic-feature-access
                Объект = Объект.Кнопки[МассивФрагментов[1]];                
            КонецЕсли;
        КонецЕсли;
    Иначе
        ИмяЭлементаФормы = "";
        Объект = Форма;
    КонецЕсли;
    
    СтарыйОбработчик = "";
    СписокСоответствияОбработчиков = Форма.ЭлементыФормы.рСтарыеОбработчики.СписокВыбора;
    ЭлементСписка = СписокСоответствияОбработчиков.НайтиПоЗначению(ИмяЭлементаФормы + "." + ИмяСобытия);
    
	Если ЭлементСписка <> Неопределено Тогда 
        СтарыйОбработчик = ЭлементСписка.Представление;
	КонецЕсли;
	
    Если СтарыйОбработчик <> "" Тогда 
        СтарыйОбработчик = СтарыйОбработчик + AMSПолучитьАргументыДействияФормы(Объект, ИмяСобытия);
    КонецЕсли;
    
    Возврат СтарыйОбработчик;
КонецФункции

Функция AMSПолучитьДействиеФормы(Форма, ИмяСобытия = "", ИмяЭлементаФормы = "") Экспорт

    Если ИмяЭлементаФормы <> "" Тогда 
        МассивФрагментов = AMSПолучитьМассивИзСтрокиСРазделителем(ИмяЭлементаФормы);
        Объект = Форма.ЭлементыФормы[МассивФрагментов[0]];
        
        Если МассивФрагментов.Количество() > 1 Тогда
            ИмяСубэлемента = МассивФрагментов[1];
            ИмяЭлементаФормы = ИмяЭлементаФормы + ИмяСубэлемента;
            
            Если ТипЗнч(Объект) = Тип("ТабличноеПоле") Тогда 
                //@skip-check bsl-legacy-check-dynamic-feature-access
                Объект = Объект.Колонки[ИмяСубэлемента].ЭлементУправления;
                УстановкаПараметров = "Элемент = ЭлементыФормы." + ИмяЭлементаФормы + "Колонки[" 
                           + ИмяСубэлемента + "].ЭлементУправления;" + Символы.ПС;
            ИначеЕсли ТипЗнч(Объект) = Тип("КоманднаяПанель") Тогда 
                //@skip-check bsl-legacy-check-dynamic-feature-access
                Объект = Объект.Кнопки[ИмяСубэлемента];                
                УстановкаПараметров = "Кнопка = ЭлементыФормы." + ИмяЭлементаФормы + "Кнопки[" 
                           + ИмяСубэлемента + "];" + Символы.ПС;
            Иначе
                //@skip-check use-non-recommended-method
                Сообщить("Неизвестный тип элемента """ + ТипЗнч(Объект) + """ с  субэлементом """ 
                       + ИмяСубэлемента + """ при получении действия формы");
            КонецЕсли;
        Иначе
            УстановкаПараметров = "Элемент = ЭлементыФормы." + ИмяЭлементаФормы + ";" + Символы.ПС;
        КонецЕсли;
    Иначе
        Объект = Форма;
    КонецЕсли;
    
    Обработчик = Строка(Объект.ПолучитьДействие(ИмяСобытия));
    Если Обработчик <> "" Тогда 
        Обработчик = УстановкаПараметров + Обработчик + AMSПолучитьАргументыДействияФормы(Объект,                   ИмяСобытия)
                   + Символы.ПС;
    КонецЕсли;
    Возврат Обработчик;

КонецФункции // AMSПолучитьДействиеФормы()

Функция AMSПолучитьМассивИзСтрокиСРазделителем(Строка, Разделитель = ".") Экспорт
    Массив = Новый Массив;
   	
   	Строка = СтрЗаменить(Строка, Разделитель, Символы.ПС);
    
    Для Счетчик = 1 По СтрЧислоСтрок(Строка) Цикл 
        Массив.Добавить(СтрПолучитьСтроку(Строка, Счетчик));
    КонецЦикла;
   
    Возврат Массив;
КонецФункции

Функция AMSПолучитьКорневойТипКонфигурации(Значение) Экспорт
    ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(Значение));
    
    Если ОбъектМетаданных <> Неопределено Тогда 
        МассивФрагментов = AMSПолучитьМассивИзСтрокиСРазделителем(ОбъектМетаданных.ПолноеИмя());
        Если МассивФрагментов.Количество() = 2 Тогда 
            Возврат МассивФрагментов[0];
        Иначе
            // Ссылка на субобъект
        КонецЕсли;
    КонецЕсли;
    
    Возврат Неопределено;
КонецФункции

//&НаСервере
//Функция ПодключитьВнешнююОбработку(АдресХранилища)
//    Возврат ВнешниеОбработки.Подключить(АдресХранилища);
//КонецФункции 

#КонецОбласти

#КонецОбласти